Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Tutorials/Beginner-CLI-Tools/Understanding-ROS2-Nodes/Understanding-ROS2-Nodes.po
Languages: fr

source: Understanding nodes
fr: Comprendre les nœuds

source: **Goal:** Learn about the function of nodes in ROS 2, and the tools to interact with them.
fr: **Objectif :** En savoir plus sur la fonction des nœuds dans ROS 2 et sur les outils permettant d'interagir avec eux.

source: **Tutorial level:** Beginner
fr: **Niveau du tutoriel :** Débutant

source: **Time:** 10 minutes
fr: **Durée :** 10 minutes

source: Contents
fr: Contenu

source: Background
fr: Arrière-plan

source: 1 The ROS 2 graph
fr: 1 Le graphe ROS 2

source: Over the next few tutorials, you will learn about a series of core ROS 2 concepts that make up what is referred to as the “ROS (2) graph”.
fr: Au cours des prochains didacticiels, vous découvrirez une série de concepts de base de ROS 2 qui constituent ce que l'on appelle le «graphe ROS (2)».

source: The ROS graph is a network of ROS 2 elements processing data together at one time. It encompasses all executables and the connections between them if you were to map them all out and visualize them.
fr: Le graphe ROS est un réseau d'éléments ROS 2 traitant des données ensemble en même temps. Il englobe tous les exécutables et les connexions entre eux si vous deviez tous les cartographier et les visualiser.

source: 2 Nodes in ROS 2
fr: 2 nœuds dans ROS 2

source: Each node in ROS should be responsible for a single, module purpose (e.g. one node for controlling wheel motors, one node for controlling a laser range-finder, etc). Each node can send and receive data to other nodes via topics, services, actions, or parameters.
fr: Chaque nœud dans ROS doit être responsable d'un seul objectif de module (par exemple, un nœud pour contrôler les moteurs de roue, un nœud pour contrôler un télémètre laser, etc.). Chaque nœud peut envoyer et recevoir des données à d'autres nœuds via des sujets, des services, des actions ou des paramètres.

source: A full robotic system is comprised of many nodes working in concert. In ROS 2, a single executable (C++ program, Python program, etc.) can contain one or more nodes.
fr: Un système robotique complet est composé de nombreux nœuds travaillant de concert. Dans ROS 2, un seul exécutable (programme C++, programme Python, etc.) peut contenir un ou plusieurs nœuds.

source: Prerequisites
fr: Conditions préalables

source: The :doc:`previous tutorial <../Introducing-Turtlesim/Introducing-Turtlesim>` shows you how to install the ``turtlesim`` package used here.
fr: Le :doc:`tutoriel précédent <../Introducing-Turtlesim/Introducing-Turtlesim>` vous montre comment installer le paquet ``turtlesim`` utilisé ici.

source: As always, don’t forget to source ROS 2 in :doc:`every new terminal you open <../Configuring-ROS2-Environment>`.
fr: Comme toujours, n'oubliez pas de sourcer ROS 2 dans :doc:`chaque nouveau terminal que vous ouvrez <../Configuring-ROS2-Environment>`.

source: Tasks
fr: Tâches

source: 1 ros2 run
fr: 1 course ros2

source: The command ``ros2 run`` launches an executable from a package.
fr: La commande ``ros2 run`` lance un exécutable à partir d'un package.

source: To run turtlesim, open a new terminal, and enter the following command:
fr: Pour exécuter turtlesim, ouvrez un nouveau terminal et saisissez la commande suivante :

source: The turtlesim window will open, as you saw in the :doc:`previous tutorial <../Introducing-Turtlesim/Introducing-Turtlesim>`.
fr: La fenêtre de turtlesim s'ouvrira, comme vous l'avez vu dans le :doc:`tutoriel précédent <../Introducing-Turtlesim/Introducing-Turtlesim>`.

source: Here, the package name is ``turtlesim`` and the executable name is ``turtlesim_node``.
fr: Ici, le nom du package est ``turtlesim`` et le nom de l'exécutable est ``turtlesim_node``.

source: We still don’t know the node name, however. You can find node names by using ``ros2 node list``
fr: Cependant, nous ne connaissons toujours pas le nom du nœud. Vous pouvez trouver des noms de nœuds en utilisant ``ros2 node list``

source: 2 ros2 node list
fr: 2 liste de nœuds ros2

source: ``ros2 node list`` will show you the names of all running nodes. This is especially useful when you want to interact with a node, or when you have a system running many nodes and need to keep track of them.
fr: ``ros2 node list`` vous montrera les noms de tous les nœuds en cours d'exécution. Ceci est particulièrement utile lorsque vous souhaitez interagir avec un nœud ou lorsque vous avez un système exécutant de nombreux nœuds et que vous devez en garder une trace.

source: Open a new terminal while turtlesim is still running in the other one, and enter the following command:
fr: Ouvrez un nouveau terminal pendant que turtlesim est toujours en cours d'exécution dans l'autre, et entrez la commande suivante :

source: The terminal will return the node name:
fr: Le terminal renverra le nom du nœud :

source: Open another new terminal and start the teleop node with the command:
fr: Ouvrez un autre nouveau terminal et démarrez le nœud teleop avec la commande :

source: Here, we are searching the ``turtlesim`` package again, this time for the executable named ``turtle_teleop_key``.
fr: Ici, nous recherchons à nouveau le package ``turtlesim``, cette fois pour l'exécutable nommé ``turtle_teleop_key``.

source: Return to the terminal where you ran ``ros2 node list`` and run it again. You will now see the names of two active nodes:
fr: Retournez au terminal où vous avez exécuté ``ros2 node list`` et exécutez-le à nouveau. Vous verrez maintenant les noms de deux nœuds actifs :

source: 2.1 Remapping
fr: 2.1 Remappage

source: `Remapping <https://design.ros2.org/articles/ros_command_line_arguments.html#name-remapping-rules>`__ allows you to reassign default node properties, like node name, topic names, service names, etc., to custom values. In the last tutorial, you used remapping on ``turtle_teleop_key`` to change the default turtle being controlled.
fr: `Remapping <https://design.ros2.org/articles/ros_command_line_arguments.html#name-remapping-rules>`__ vous permet de réaffecter les propriétés de nœud par défaut, telles que le nom du nœud, les noms de sujet, les noms de service, etc. valeurs. Dans le dernier tutoriel, vous avez utilisé le remappage sur ``turtle_teleop_key`` pour changer la tortue par défaut contrôlée.

source: Now, lets reassign the name of our ``/turtlesim`` node. In a new terminal, run the following command:
fr: Maintenant, réassignons le nom de notre nœud ``/turtlesim``. Dans un nouveau terminal, exécutez la commande suivante :

source: Since you’re calling ``ros2 run`` on turtlesim again, another turtlesim window will open. However, now if you return to the terminal where you ran ``ros2 node list``, and run it again, you will see three node names:
fr: Puisque vous appelez à nouveau ``ros2 run`` sur turtlesim, une autre fenêtre turtlesim s'ouvrira. Cependant, maintenant, si vous revenez au terminal où vous avez exécuté ``ros2 node list``, et que vous l'exécutez à nouveau, vous verrez trois noms de nœud :

source: 3 ros2 node info
fr: 3 infos nœud ros2

source: Now that you know the names of your nodes, you can access more information about them with:
fr: Maintenant que vous connaissez les noms de vos nœuds, vous pouvez accéder à plus d'informations à leur sujet avec :

source: To examine your latest node, ``my_turtle``, run the following command:
fr: Pour examiner votre dernier nœud, ``my_turtle``, exécutez la commande suivante :

source: ``ros2 node info`` returns a list of subscribers, publishers, services, and actions (the ROS graph connections) that interact with that node. The output should look like this:
fr: ``ros2 node info`` renvoie une liste d'abonnés, d'éditeurs, de services et d'actions (les connexions du graphe ROS) qui interagissent avec ce nœud. La sortie devrait ressembler à ceci :

source: Now try running the same command on the ``/teleop_turtle`` node, and see how its connections differ from ``my_turtle``.
fr: Essayez maintenant d'exécuter la même commande sur le nœud ``/teleop_turtle``, et voyez comment ses connexions diffèrent de ``my_turtle``.

source: You will learn more about the ROS graph connection concepts including the message types in the upcoming tutorials.
fr: Vous en apprendrez plus sur les concepts de connexion de graphe ROS, y compris les types de message, dans les prochains didacticiels.

source: Summary
fr: Résumé

source: A node is a fundamental ROS 2 element that serves a single, modular purpose in a robotics system.
fr: Un nœud est un élément ROS 2 fondamental qui sert un objectif unique et modulaire dans un système robotique.

source: In this tutorial, you utilized nodes created from the ``turtlesim`` package by running the executables ``turtlesim_node`` and ``turtle_teleop_key``.
fr: Dans ce didacticiel, vous avez utilisé des nœuds créés à partir du package ``turtlesim`` en exécutant les exécutables ``turtlesim_node`` et ``turtle_teleop_key``.

source: You learned how to use ``ros2 node list`` to discover active node names and ``ros2 node info`` to introspect on a single node. These tools are vital to understanding the flow of data in a complex, real-world robot system.
fr: Vous avez appris à utiliser ``ros2 node list`` pour découvrir les noms de nœuds actifs et ``ros2 node info`` pour effectuer une introspection sur un seul nœud. Ces outils sont essentiels pour comprendre le flux de données dans un système robotique complexe et réel.

source: Next steps
fr: Prochaines étapes

source: Now that you understand nodes in ROS 2, you can move on to the :doc:`topics tutorial <../Understanding-ROS2-Topics/Understanding-ROS2-Topics>`. Topics are one of the communication types that connects nodes.
fr: Maintenant que vous comprenez les nœuds dans ROS 2, vous pouvez passer au tutoriel :doc:`topics <../Understanding-ROS2-Topics/Understanding-ROS2-Topics>`. Les sujets sont l'un des types de communication qui relie les nœuds.

source: Related content
fr: Contenu connexe

source: The :doc:`../../../Concepts` page adds some more detail to the concept of nodes.
fr: La page :doc:`../../../Concepts` ajoute plus de détails sur le concept de nœuds.
