Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Tutorials/Miscellaneous/Building-Realtime-rt_preempt-kernel-for-ROS-2.po
Languages: fr

source: Building a real-time Linux kernel [community-contributed]
fr: Construire un noyau Linux en temps réel [contribution de la communauté]

source: This tutorial begins with a clean Ubuntu 20.04.1 install on Intel x86_64. Actual kernel is 5.4.0-54-generic, but we will install the Latest Stable RT_PREEMPT Version. To build the kernel you need at least 30GB free disk space.
fr: Ce didacticiel commence par une installation propre d'Ubuntu 20.04.1 sur Intel x86_64. Le noyau actuel est le 5.4.0-54-générique, mais nous installerons la dernière version stable de RT_PREEMPT. Pour construire le noyau, vous avez besoin d'au moins 30 Go d'espace disque libre.

source: Check https://wiki.linuxfoundation.org/realtime/start for the latest stable version, at the time of writing this is "Latest Stable Version 5.4-rt". If we click on the `link <http://cdn.kernel.org/pub/linux/kernel/projects/rt/5.4/>`_, we get the exact version. Currently it is patch-5.4.78-rt44.patch.gz.
fr: Vérifiez https://wiki.linuxfoundation.org/realtime/start pour la dernière version stable, au moment de la rédaction, il s'agit de "Latest Stable Version 5.4-rt". Si nous cliquons sur le `lien <http://cdn.kernel.org/pub/linux/kernel/projects/rt/5.4/>`_, nous obtenons la version exacte. Actuellement, il s'agit du patch-5.4.78-rt44.patch.gz.

source: We create a directory in our home dir with
fr: Nous créons un répertoire dans notre répertoire personnel avec

source: and switch into it with
fr: et basculez-y avec

source: We can go with a browser to https://mirrors.edge.kernel.org/pub/linux/kernel/v5.x/ and see if the version is there. You can download it from the site and move it manually from /Downloads to the /kernel folder, or download it using wget by right clicking the link using "copy link location". Example:
fr: Nous pouvons aller avec un navigateur sur https://mirrors.edge.kernel.org/pub/linux/kernel/v5.x/ et voir si la version est là. Vous pouvez le télécharger depuis le site et le déplacer manuellement de /Downloads vers le dossier /kernel, ou le télécharger à l'aide de wget en cliquant avec le bouton droit sur le lien en utilisant "copier l'emplacement du lien". Exemple:

source: unpack it with
fr: le déballer avec

source: download rt_preempt patch matching the Kernel version we just downloaded over at http://cdn.kernel.org/pub/linux/kernel/projects/rt/5.4/
fr: téléchargez le patch rt_preempt correspondant à la version du noyau que nous venons de télécharger sur http://cdn.kernel.org/pub/linux/kernel/projects/rt/5.4/

source: Then switch into the linux directory with
fr: Basculez ensuite dans le répertoire linux avec

source: and patch the kernel with the realtime patch
fr: et patchez le noyau avec le patch en temps réel

source: We simply want to use the config of our Ubuntu installation, so we get the Ubuntu config with
fr: Nous voulons simplement utiliser la configuration de notre installation Ubuntu, nous obtenons donc la configuration Ubuntu avec

source: Open Software & Updates. in the Ubuntu Software menu tick the 'Source code' box
fr: Ouvrez Logiciels et mises à jour. dans le menu Ubuntu Software cochez la case 'Source code'

source: We need some tools to build kernel, install them with
fr: Nous avons besoin d'outils pour construire le noyau, installez-les avec

source: To enable all Ubuntu configurations, we simply use
fr: Pour activer toutes les configurations Ubuntu, nous utilisons simplement

source: Then we need to enable rt_preempt in the kernel. We call
fr: Ensuite, nous devons activer rt_preempt dans le noyau. Nous appelons

source: and set the following
fr: et définissez ce qui suit

source: Save and exit menuconfig. Now we're going to build the kernel which will take quite some time. (10-30min on a modern cpu)
fr: Enregistrez et quittez menuconfig. Nous allons maintenant construire le noyau, ce qui prendra un certain temps. (10-30min sur un processeur moderne)

source: After the build is finished check the debian packages
fr: Une fois la construction terminée, vérifiez les packages debian

source: Then we install all kernel debian packages
fr: Ensuite, nous installons tous les packages debian du noyau

source: Now the real time kernel should be installed. Reboot the system and check the new kernel version
fr: Maintenant, le noyau temps réel doit être installé. Redémarrez le système et vérifiez la nouvelle version du noyau
