Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Tutorials/Miscellaneous/Deploying-ROS-2-on-IBM-Cloud.po
Languages: fr

source: You should replace the tags shown between *"<" ">"* as described `here <https://cloud.ibm.com/docs/containers?topic=containers-images#namespace>`__. The file in my case would look something like this:
fr: Vous devez remplacer les balises affichées entre *"<" ">"* comme décrit `ici <https://cloud.ibm.com/docs/containers?topic=containers-images#namespace>`__. Le fichier dans mon cas ressemblerait à ceci:

source: Deploy the file using the following command
fr: Déployez le fichier à l'aide de la commande suivante

source: Now your docker image is fully deployed on your cluster!
fr: Votre image docker est maintenant entièrement déployée sur votre cluster !

source: Step 5: Using CLI for your Docker Image
fr: Étape 5 : Utilisation de la CLI pour votre image Docker

source: Navigate to your cluster through the IBM Cloud console Kubernetes.
fr: Accédez à votre cluster via la console IBM Cloud Kubernetes.

source: Click on *Kubernetes dashboard* on the top right corner of the page.
fr: Cliquez sur *tableau de bord Kubernetes* dans le coin supérieur droit de la page.

source: You should now be able to see a full list of all the different parameters of your cluster as well as its CPU and Memory Usage.
fr: Vous devriez maintenant pouvoir voir une liste complète de tous les différents paramètres de votre cluster ainsi que son utilisation du processeur et de la mémoire.

source: Navigate to *Pods* and click on your deployment.
fr: Accédez à *Pods* et cliquez sur votre déploiement.

source: On the top right corner, click on *Exec into pod*
fr: Dans le coin supérieur droit, cliquez sur *Exec into pod*

source: Now you are inside your docker image! You can source your workspace (if needed) and run ROS2! For example:
fr: Vous êtes maintenant à l'intérieur de votre image docker ! Vous pouvez sourcer votre espace de travail (si nécessaire) et exécuter ROS2 ! Par exemple:

source: Final Remarks
fr: Remarques finales

source: At this point, you are capable of creating your own docker image using ROS2 packages on github. It is also possible, with little changes to utilize local ROS2 packages as well. This could be the topic of another article. However, you are encouraged to check out the following `Dockerfile <https://github.com/mm-nasr/ros2_ibmcloud/tree/main/dockers/local_pkgs_docker>`__ which uses a local copy of the demos repository. Similarly, you can use your own local package.
fr: À ce stade, vous êtes capable de créer votre propre image docker à l'aide des packages ROS2 sur github. Il est également possible, avec peu de modifications, d'utiliser également les packages ROS2 locaux. Cela pourrait faire l'objet d'un autre article. Cependant, nous vous encourageons à consulter le `Dockerfile suivant <https://github.com/mm-nasr/ros2_ibmcloud/tree/main/dockers/local_pkgs_docker>`__ qui utilise une copie locale du référentiel de démonstrations. De même, vous pouvez utiliser votre propre package local.
