Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Tutorials/Miscellaneous/Eclipse-Oxygen-with-ROS-2-and-rviz2.po
Languages: fr

source: Using Eclipse Oxygen with ``rviz2`` [community-contributed]
fr: Utiliser Eclipse Oxygen avec ``rviz2`` [community-contributed]

source: Table of Contents
fr: Table des matières

source: Setup
fr: Installation

source: This tutorial assumes Eclipse Oxygen, git, and Egit (http://www.eclipse.org/egit/download/) are already installed.
fr: Ce didacticiel suppose qu'Eclipse Oxygen, git et Egit (http://www.eclipse.org/egit/download/) sont déjà installés.

source: Throughout the tutorial we name the eclipse workspace the same name as the ros2 package, but this is not required.
fr: Tout au long du didacticiel, nous nommons l'espace de travail eclipse du même nom que le package ros2, mais ce n'est pas obligatoire.

source: HINT: We use nested projects and one Eclipse Workspace for each ROS-2 package.
fr: CONSEIL : Nous utilisons des projets imbriqués et un espace de travail Eclipse pour chaque package ROS-2.

source: Create a C++ Project.
fr: Créez un projet C++.

source: Choose the ROS 2 package name as the Project Name. Choose a Makefile Project and Other Toolchain.
fr: Choisissez le nom du package ROS 2 comme nom du projet. Choisissez un projet Makefile et une autre chaîne d'outils.

source: Click on Finish
fr: Cliquez sur Terminer

source: Our project should be shown in the "Project Explorer".
fr: Notre projet devrait être affiché dans "l'explorateur de projets".

source: Inside our Project create a folder called "src".
fr: Dans notre projet, créez un dossier appelé "src".

source: Import a git repository.
fr: Importez un référentiel git.

source: Put in the repository URL.
fr: Mettez dans l'URL du référentiel.

source: IMPORTANT: Use the source folder of the project we created before as the destination folder.
fr: IMPORTANT : Utilisez le dossier source du projet que nous avons créé auparavant comme dossier de destination.

source: HINT: If you ran into problems choosing the destination folder path, the Eclipse Dialog needs a name in the name field.
fr: CONSEIL : Si vous rencontrez des problèmes pour choisir le chemin du dossier de destination, la boîte de dialogue Eclipse a besoin d'un nom dans le champ de nom.

source: Import using the new project wizard.
fr: Importez à l'aide de l'assistant de nouveau projet.

source: Create a General->Project.
fr: Créez un Général->Projet.

source: Use the git repository name as the project name. IMPORTANT: Use the folder we cloned the git repository in as the "Location".
fr: Utilisez le nom du référentiel git comme nom de projet. IMPORTANT : Utilisez le dossier dans lequel nous avons cloné le référentiel git comme "Emplacement".

source: The git project and the new project should be visible in the Project Explorer view. The same files are listed multiple times, but only one project is linked with Egit.
fr: Le projet git et le nouveau projet doivent être visibles dans la vue Explorateur de projets. Les mêmes fichiers sont répertoriés plusieurs fois, mais un seul projet est lié à Egit.

source: Repeat this procedure again. Import git repository pluginlib.
fr: Répétez cette procédure à nouveau. Importez le pluginlib du référentiel git.

source: IMPORTANT: Use a folder inside the source folder as "Destination->Directory".
fr: IMPORTANT : Utilisez un dossier à l'intérieur du dossier source en tant que "Destination->Répertoire".

source: IMPORTANT: Use the folder we cloned the git repository in as the location for the new project.
fr: IMPORTANT : utilisez le dossier dans lequel nous avons cloné le référentiel git comme emplacement pour le nouveau projet.

source: Run the same procedure with the tinyxml2_vendor git repository.
fr: Exécutez la même procédure avec le référentiel git tinyxml2_vendor.

source: IMPORTANT: Again use a folder inside the source folder.
fr: IMPORTANT : Utilisez à nouveau un dossier à l'intérieur du dossier source.

source: IMPORTANT: Use the location of the folder we cloned as the new project folder.
fr: IMPORTANT : Utilisez l'emplacement du dossier que nous avons cloné comme nouveau dossier de projet.

source: Now all four Projects should be visible in the Project Explorer view.
fr: Maintenant, les quatre projets doivent être visibles dans la vue Explorateur de projets.

source: Clicking in the top right cornder for the Project Explorer view allows us to change the Project Presentation to Hierarchical view. Now it looks like a ROS-2 project as it is on the hard drive. But this view loses the linkage to Egit, so use the Flat Project Presentation. The Egit linkage is good if you want to see e.g. which author wrote which code-line, etc.
fr: Cliquer dans le coin supérieur droit pour la vue Explorateur de projet nous permet de changer la présentation du projet en vue hiérarchique. Maintenant, cela ressemble à un projet ROS-2 tel qu'il se trouve sur le disque dur. Mais cette vue perd le lien avec Egit, utilisez donc la présentation de projet plate. La liaison Egit est bonne si vous voulez voir par ex. quel auteur a écrit quelle ligne de code, etc.

source: Go to "C/C++ build"-section and put "ament" into "Build command".
fr: Allez dans la section "C/C++ build" et mettez "ament" dans "Build command".

source: Go to "Behavior" tab and unselect "clean" and put "build" into Build textbox.
fr: Allez dans l'onglet "Comportement" et désélectionnez "nettoyer" et mettez "construire" dans la zone de texte Construire.

source: Before "Build project" will work, we need to close Eclipse. Open a shell and source the ROS-2 setup.bash file, then cd into the directory of the eclipse project (here: /home/ubu/rviz2_ws/rviz2_ws) and start Eclipse from inside this directory.
fr: Avant que "Build project" ne fonctionne, nous devons fermer Eclipse. Ouvrez un shell et sourcez le fichier setup.bash ROS-2, puis cd dans le répertoire du projet eclipse (ici : /home/ubu/rviz2_ws/rviz2_ws) et démarrez Eclipse depuis ce répertoire.

source: Now code completion, egit annotations, eclipse C/C++ Tools, etc. should all work.
fr: Maintenant, la complétion de code, les annotations egit, les outils eclipse C/C++, etc. devraient tous fonctionner.

source: Opening the main.cpp of rviz2 may show a lot of "unresolved inclusion" warnings. To fix this, go to Project->Properties->C++ General->Path and Symbols. Click on the "References" tab and select "ros2_ws".
fr: L'ouverture du fichier main.cpp de rviz2 peut afficher de nombreux avertissements "d'inclusion non résolue". Pour résoudre ce problème, accédez à Projet-> Propriétés-> Général C++-> Chemin et symboles. Cliquez sur l'onglet "Références" et sélectionnez "ros2_ws".

source: Go to C/C++-General->Path-and-Symbols, click on the "Source locations" tab and click on "Link folder". Choose the location of qt5 includes.
fr: Allez dans C/C++-General->Path-and-Symbols, cliquez sur l'onglet "Source locations" et cliquez sur "Link folder". Choisissez l'emplacement de qt5 inclus.

source: The next image should be shown. It is a good idea to add excludes to the source locations, so that some directories (like "Build" and "Install") don't get indexed.
fr: L'image suivante devrait s'afficher. C'est une bonne idée d'ajouter des exclusions aux emplacements source, afin que certains répertoires (comme "Build" et "Install") ne soient pas indexés.

source: Go to C++General->Preprocessor includes, select "CDT GCC Built in compiler settings [Shared]" and enter in the "command to get compiler specs" text box the following:
fr: Allez dans C++General->Preprocessor includes, sélectionnez "CDT GCC Built in compiler settings [Shared]" et entrez dans la zone de texte "command to get compiler specs" ce qui suit :

source: Go to "C/C++-General->Indexer" and select the following in the image. E.g "index unused headers as c files" to resolve e.g. QApplication, because the QApplication headers content is only "#include "qapplication.h".
fr: Allez dans "C/C++-General->Indexer" et sélectionnez ce qui suit dans l'image. Par exemple, "indexez les en-têtes inutilisés en tant que fichiers c" pour résoudre par ex. QApplication, car le contenu des en-têtes QApplication est uniquement "#include "qapplication.h".

source: After running the indexer (which happens later, so you will see this also later), you can see what it added
fr: Après avoir exécuté l'indexeur (ce qui se produit plus tard, vous le verrez également plus tard), vous pouvez voir ce qu'il a ajouté

source: After that right-click on the rviz2 project and select "Indexer->Rebuild", which will start rebuilding the index (there is an icon in the lower right showing progress). Once the index is finished rebuilding, it should be able to resolve all includes.
fr: Après cela, cliquez avec le bouton droit sur le projet rviz2 et sélectionnez "Indexeur-> Reconstruire", ce qui lancera la reconstruction de l'index (il y a une icône en bas à droite indiquant la progression). Une fois la reconstruction de l'index terminée, il devrait être en mesure de résoudre toutes les inclusions.

source: Debugging with eclipse
fr: Débogage avec eclipse

source: Go to "C/C++-Build" and add to the build command:
fr: Allez dans "C/C++-Build" et ajoutez à la commande build :

source: Then in eclipse go to "Run->Debug Configurations" and add the following and click on "Debug".
fr: Ensuite, dans Eclipse, allez dans "Exécuter-> Configurations de débogage" et ajoutez ce qui suit et cliquez sur "Déboguer".
