Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Tutorials/Intermediate/Writing-an-Action-Server-Client/Cpp.po
Languages: fr

source: Writing an action server and client (C++)
fr: Ecriture d'un serveur d'action et d'un client (C++)

source: **Goal:** Implement an action server and client in C++.
fr: **Objectif :** Implémenter un serveur d'action et un client en C++.

source: **Tutorial level:** Intermediate
fr: **Niveau du didacticiel :** Intermédiaire

source: **Time:** 15 minutes
fr: **Durée :** 15 minutes

source: Contents
fr: Contenu

source: Background
fr: Arrière-plan

source: Actions are a form of asynchronous communication in ROS. *Action clients* send goal requests to *action servers*. *Action servers* send goal feedback and results to *action clients*.
fr: Les actions sont une forme de communication asynchrone dans ROS. Les *clients d'action* envoient des demandes d'objectif aux *serveurs d'action*. Les *serveurs d'action* envoient des commentaires sur les objectifs et les résultats aux *clients d'action*.

source: Prerequisites
fr: Conditions préalables

source: You will need the ``action_tutorials_interfaces`` package and the ``Fibonacci.action`` interface defined in the previous tutorial, :doc:`../Creating-an-Action`.
fr: Vous aurez besoin du package ``action_tutorials_interfaces`` et de l'interface ``Fibonacci.action`` définie dans le tutoriel précédent, :doc:`../Creating-an-Action`.

source: Tasks
fr: Tâches

source: 1 Creating the action_tutorials_cpp package
fr: 1 Création du package action_tutorials_cpp

source: As we saw in the :doc:`../../Beginner-Client-Libraries/Creating-Your-First-ROS2-Package` tutorial, we need to create a new package to hold our C++ and supporting code.
fr: Comme nous l'avons vu dans le tutoriel :doc:`../../Beginner-Client-Libraries/Creating-Your-First-ROS2-Package`, nous devons créer un nouveau package pour contenir notre C++ et le code de support.

source: 1.1 Creating the action_tutorials_cpp package
fr: 1.1 Création du package action_tutorials_cpp

source: Go into the action workspace you created in the :doc:`previous tutorial <../Creating-an-Action>` (remember to source the workspace), and create a new package for the C++ action server:
fr: Allez dans l'espace de travail d'action que vous avez créé dans le :doc:`tutoriel précédent <../Creating-an-Action>` (n'oubliez pas de sourcer l'espace de travail), et créez un nouveau package pour le serveur d'action C++ :

source: Windows
fr: les fenêtres

source: 1.2 Adding in visibility control
fr: 1.2 Ajout du contrôle de la visibilité

source: In order to make the package compile and work on Windows, we need to add in some "visibility control". For more details, see :ref:`Windows Symbol Visibility in the Windows Tips and Tricks document <Windows_Symbol_Visibility>`.
fr: Afin que le package soit compilé et fonctionne sous Windows, nous devons ajouter un "contrôle de visibilité". Pour plus de détails, voir :ref:`Visibilité des symboles Windows dans le document Trucs et astuces Windows <Windows_Symbol_Visibility>`.

source: Open up ``action_tutorials_cpp/include/action_tutorials_cpp/visibility_control.h``, and put the following code in:
fr: Ouvrez ``action_tutorials_cpp/include/action_tutorials_cpp/visibility_control.h`` et insérez le code suivant :

source: 2 Writing an action server
fr: 2 Ecrire un serveur d'action

source: Let's focus on writing an action server that computes the Fibonacci sequence using the action we created in the :doc:`../Creating-an-Action` tutorial.
fr: Concentrons-nous sur l'écriture d'un serveur d'action qui calcule la séquence de Fibonacci en utilisant l'action que nous avons créée dans le tutoriel :doc:`../Creating-an-Action`.

source: 2.1 Writing the action server code
fr: 2.1 Ecriture du code du serveur d'action

source: Open up ``action_tutorials_cpp/src/fibonacci_action_server.cpp``, and put the following code in:
fr: Ouvrez ``action_tutorials_cpp/src/fibonacci_action_server.cpp`` et insérez le code suivant :

source: The first few lines include all of the headers we need to compile.
fr: Les premières lignes incluent tous les en-têtes que nous devons compiler.

source: Next we create a class that is a derived class of ``rclcpp::Node``:
fr: Ensuite, nous créons une classe qui est une classe dérivée de ``rclcpp::Node`` :

source: The constructor for the ``FibonacciActionServer`` class initializes the node name as ``fibonacci_action_server``:
fr: Le constructeur de la classe ``FibonacciActionServer`` initialise le nom du nœud en tant que ``fibonacci_action_server`` :

source: The constructor also instantiates a new action server:
fr: Le constructeur instancie également un nouveau serveur d'action :

source: An action server requires 6 things:
fr: Un serveur d'action nécessite 6 choses :

source: The templated action type name: ``Fibonacci``.
fr: Le nom du type d'action basé sur un modèle : ``Fibonacci``.

source: A ROS 2 node to add the action to: ``this``.
fr: Un nœud ROS 2 auquel ajouter l'action : ``this``.

source: The action name: ``'fibonacci'``.
fr: Le nom de l'action : ``'fibonacci'``.

source: A callback function for handling goals: ``handle_goal``
fr: Une fonction de rappel pour gérer les objectifs : ``handle_goal``

source: A callback function for handling cancellation: ``handle_cancel``.
fr: Une fonction de rappel pour gérer l'annulation : ``handle_cancel``.

source: A callback function for handling goal accept: ``handle_accept``.
fr: Une fonction de rappel pour gérer l'acceptation des objectifs : ``handle_accept``.

source: The implementation of the various callbacks is next in the file. Note that all of the callbacks need to return quickly, otherwise we risk starving the executor.
fr: La mise en œuvre des différents rappels est ensuite dans le fichier. Notez que tous les rappels doivent revenir rapidement, sinon nous risquons d'affamer l'exécuteur.

source: We start with the callback for handling new goals:
fr: Nous commençons par le rappel pour gérer les nouveaux objectifs :

source: This implementation just accepts all goals.
fr: Cette implémentation accepte simplement tous les objectifs.

source: Next up is the callback for dealing with cancellation:
fr: La prochaine étape est le rappel pour traiter l'annulation :

source: This implementation just tells the client that it accepted the cancellation.
fr: Cette implémentation indique simplement au client qu'il a accepté l'annulation.

source: The last of the callbacks accepts a new goal and starts processing it:
fr: Le dernier des rappels accepte un nouvel objectif et commence à le traiter :

source: Since the execution is a long-running operation, we spawn off a thread to do the actual work and return from ``handle_accepted`` quickly.
fr: Étant donné que l'exécution est une opération de longue durée, nous générons un thread pour effectuer le travail réel et revenons rapidement de ``handle_accepted``.

source: All further processing and updates are done in the ``execute`` method in the new thread:
fr: Tous les traitements et mises à jour ultérieurs sont effectués dans la méthode ``execute`` du nouveau thread :

source: This work thread processes one sequence number of the Fibonacci sequence every second, publishing a feedback update for each step. When it has finished processing, it marks the ``goal_handle`` as succeeded, and quits.
fr: Ce fil de travail traite un numéro de séquence de la séquence de Fibonacci chaque seconde, publiant une mise à jour des commentaires pour chaque étape. Une fois le traitement terminé, il marque le ``goal_handle`` comme réussi et quitte.

source: We now have a fully functioning action server. Let's get it built and running.
fr: Nous avons maintenant un serveur d'action entièrement fonctionnel. Construisons-le et faisons-le fonctionner.

source: 2.2 Compiling the action server
fr: 2.2 Compilation du serveur d'action

source: In the previous section we put the action server code into place. To get it to compile and run, we need to do a couple of additional things.
fr: Dans la section précédente, nous avons mis en place le code du serveur d'action. Pour qu'il se compile et s'exécute, nous devons faire quelques choses supplémentaires.

source: First we need to setup the CMakeLists.txt so that the action server is compiled. Open up ``action_tutorials_cpp/CMakeLists.txt``, and add the following right after the ``find_package`` calls:
fr: Nous devons d'abord configurer CMakeLists.txt afin que le serveur d'action soit compilé. Ouvrez ``action_tutorials_cpp/CMakeLists.txt`` et ajoutez ce qui suit juste après les appels ``find_package`` :

source: And now we can compile the package. Go to the top-level of the ``ros2_ws``, and run:
fr: Et maintenant nous pouvons compiler le package. Accédez au niveau supérieur de ``ros2_ws`` et exécutez :

source: This should compile the entire workspace, including the ``fibonacci_action_server`` in the ``action_tutorials_cpp`` package.
fr: Cela devrait compiler tout l'espace de travail, y compris le ``fibonacci_action_server`` dans le paquet ``action_tutorials_cpp``.

source: 2.3 Running the action server
fr: 2.3 Lancer le serveur d'action

source: Now that we have the action server built, we can run it. Source the workspace we just built (``ros2_ws``), and try to run the action server:
fr: Maintenant que nous avons construit le serveur d'action, nous pouvons l'exécuter. Sourcez l'espace de travail que nous venons de créer (``ros2_ws``) et essayez d'exécuter le serveur d'action :

source: 3 Writing an action client
fr: 3 Écrire un client d'action

source: 3.1 Writing the action client code
fr: 3.1 Ecriture du code client de l'action

source: Open up ``action_tutorials_cpp/src/fibonacci_action_client.cpp``, and put the following code in:
fr: Ouvrez ``action_tutorials_cpp/src/fibonacci_action_client.cpp`` et insérez le code suivant :

source: The constructor for the ``FibonacciActionClient`` class initializes the node name as ``fibonacci_action_client``:
fr: Le constructeur de la classe ``FibonacciActionClient`` initialise le nom du nœud en tant que ``fibonacci_action_client`` :

source: The constructor also instantiates a new action client:
fr: Le constructeur instancie également un nouveau client d'action :

source: An action client requires 3 things:
fr: Un client d'action nécessite 3 choses :

source: A ROS 2 node to add the action client to: ``this``.
fr: Un nœud ROS 2 auquel ajouter le client d'action : ``this``.

source: We also instantiate a ROS timer that will kick off the one and only call to ``send_goal``:
fr: Nous instancions également un minuteur ROS qui lancera le seul et unique appel à ``send_goal`` :

source: When the timer expires, it will call ``send_goal``:
fr: Lorsque le minuteur expire, il appellera ``send_goal`` :

source: This function does the following:
fr: Cette fonction effectue les opérations suivantes :

source: Cancels the timer (so it is only called once).
fr: Annule la minuterie (elle n'est donc appelée qu'une seule fois).

source: Waits for the action server to come up.
fr: Attend que le serveur d'action apparaisse.

source: Instantiates a new ``Fibonacci::Goal``.
fr: Instancie un nouveau ``Fibonacci::Goal``.

source: Sets the response, feedback, and result callbacks.
fr: Définit la réponse, les commentaires et les rappels de résultat.

source: Sends the goal to the server.
fr: Envoie l'objectif au serveur.

source: When the server receives and accepts the goal, it will send a response to the client. That response is handled by ``goal_response_callback``:
fr: Lorsque le serveur reçoit et accepte l'objectif, il enverra une réponse au client. Cette réponse est gérée par ``goal_response_callback`` :

source: Assuming the goal was accepted by the server, it will start processing. Any feedback to the client will be handled by the ``feedback_callback``:
fr: En supposant que l'objectif a été accepté par le serveur, il commencera le traitement. Tout retour au client sera géré par le ``feedback_callback`` :

source: When the server is finished processing, it will return a result to the client. The result is handled by the ``result_callback``:
fr: Lorsque le serveur a terminé le traitement, il renverra un résultat au client. Le résultat est géré par le ``result_callback`` :

source: We now have a fully functioning action client. Let's get it built and running.
fr: Nous avons maintenant un client d'action entièrement fonctionnel. Construisons-le et faisons-le fonctionner.

source: 3.2 Compiling the action client
fr: 3.2 Compilation du client d'action

source: In the previous section we put the action client code into place. To get it to compile and run, we need to do a couple of additional things.
fr: Dans la section précédente, nous avons mis en place le code client d'action. Pour qu'il se compile et s'exécute, nous devons faire quelques choses supplémentaires.

source: First we need to setup the CMakeLists.txt so that the action client is compiled. Open up ``action_tutorials_cpp/CMakeLists.txt``, and add the following right after the ``find_package`` calls:
fr: Nous devons d'abord configurer CMakeLists.txt afin que le client d'action soit compilé. Ouvrez ``action_tutorials_cpp/CMakeLists.txt`` et ajoutez ce qui suit juste après les appels ``find_package`` :

source: This should compile the entire workspace, including the ``fibonacci_action_client`` in the ``action_tutorials_cpp`` package.
fr: Cela devrait compiler tout l'espace de travail, y compris le ``fibonacci_action_client`` dans le paquet ``action_tutorials_cpp``.

source: 3.3 Running the action client
fr: 3.3 Exécution du client d'action

source: Now that we have the action client built, we can run it. First make sure that an action server is running in a separate terminal. Now source the workspace we just built (``ros2_ws``), and try to run the action client:
fr: Maintenant que nous avons construit le client d'action, nous pouvons l'exécuter. Assurez-vous d'abord qu'un serveur d'action est en cours d'exécution dans un terminal séparé. Sourcez maintenant l'espace de travail que nous venons de créer (``ros2_ws``) et essayez d'exécuter le client d'action :

source: You should see logged messages for the goal being accepted, feedback being printed, and the final result.
fr: Vous devriez voir les messages enregistrés pour l'objectif en cours d'acceptation, les commentaires en cours d'impression et le résultat final.

source: Summary
fr: Résumé

source: In this tutorial, you put together a C++ action server and action client line by line, and configured them to exchange goals, feedback, and results.
fr: Dans ce didacticiel, vous avez assemblé ligne par ligne un serveur d'action C++ et un client d'action, et les avez configurés pour échanger des objectifs, des commentaires et des résultats.

source: Related content
fr: Contenu connexe

source: There are several ways you could write an action server and client in C++; check out the ``minimal_action_server`` and ``minimal_action_client`` packages in the `ros2/examples <https://github.com/ros2/examples/tree/rolling/rclcpp>`_ repo.
fr: Il existe plusieurs manières d'écrire un serveur et un client d'action en C++ ; consultez les packages ``minimal_action_server`` et ``minimal_action_client`` dans le `ros2/examples <https://github.com/ros2/examples/tree/rolling/rclcpp>`_ repo.

source: For more detailed information about ROS actions, please refer to the `design article <http://design.ros2.org/articles/actions.html>`__.
fr: Pour des informations plus détaillées sur les actions ROS, veuillez vous référer à l'`article de conception <http://design.ros2.org/articles/actions.html>`__.
