Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Tutorials/Beginner-CLI-Tools/Launching-Multiple-Nodes/Launching-Multiple-Nodes.po
Languages: fr

source: Launching nodes
fr: Nœuds de lancement

source: **Goal:** Use a command line tool to launch multiple nodes at once.
fr: **Objectif :** utiliser un outil de ligne de commande pour lancer plusieurs nœuds à la fois.

source: **Tutorial Level:** Beginner
fr: **Niveau du didacticiel :** Débutant

source: **Time:** 5 minutes
fr: **Durée :** 5 minutes

source: Contents
fr: Contenu

source: Background
fr: Arrière-plan

source: In most of the introductory tutorials, you have been opening new terminals for every new node you run. As you create more complex systems with more and more nodes running simultaneously, opening terminals and reentering configuration details becomes tedious.
fr: Dans la plupart des didacticiels d'introduction, vous avez ouvert de nouveaux terminaux pour chaque nouveau nœud que vous exécutez. Au fur et à mesure que vous créez des systèmes plus complexes avec de plus en plus de nœuds fonctionnant simultanément, l'ouverture de terminaux et la ressaisie des détails de configuration deviennent fastidieuses.

source: Launch files allow you to start up and configure a number of executables containing ROS 2 nodes simultaneously.
fr: Les fichiers de lancement vous permettent de démarrer et de configurer simultanément plusieurs exécutables contenant des nœuds ROS 2.

source: Running a single launch file with the ``ros2 launch`` command will start up your entire system - all nodes and their configurations - at once.
fr: L'exécution d'un seul fichier de lancement avec la commande ``ros2 launch`` démarrera tout votre système - tous les nœuds et leurs configurations - en une seule fois.

source: Prerequisites
fr: Conditions préalables

source: Before starting these tutorials, install ROS 2 by following the instructions on the ROS 2 :doc:`../../../Installation/` page.
fr: Avant de commencer ces didacticiels, installez ROS 2 en suivant les instructions de la page ROS 2 :doc:`../../../Installation/`.

source: The commands used in this tutorial assume you followed the binary packages installation guide for your operating system (Debian packages for Linux). You can still follow along if you built from source, but the path to your setup files will likely be different. You also won't be able to use the ``sudo apt install ros-<distro>-<package>`` command (used frequently in the beginner level tutorials) if you install from source.
fr: Les commandes utilisées dans ce didacticiel supposent que vous avez suivi le guide d'installation des packages binaires pour votre système d'exploitation (packages Debian pour Linux). Vous pouvez toujours suivre si vous avez construit à partir de la source, mais le chemin d'accès à vos fichiers d'installation sera probablement différent. Vous ne pourrez pas non plus utiliser la commande ``sudo apt install ros-<distro>-<package>`` (utilisée fréquemment dans les didacticiels de niveau débutant) si vous installez à partir des sources.

source: If you are using Linux and are not already familiar with the shell, `this tutorial <http://www.ee.surrey.ac.uk/Teaching/Unix/>`__ will help.
fr: Si vous utilisez Linux et que vous n'êtes pas déjà familiarisé avec le shell, `ce tutoriel <http://www.ee.surrey.ac.uk/Teaching/Unix/>`__ vous aidera.

source: Tasks
fr: Tâches

source: Running a Launch File
fr: Exécution d'un fichier de lancement

source: Open a new terminal and run:
fr: Ouvrez un nouveau terminal et exécutez :

source: This command will run the following launch file:
fr: Cette commande exécutera le fichier de lancement suivant :

source: The launch file above is written in Python, but you can also use XML and YAML to create launch files. You can see a comparison of these different ROS 2 launch formats in :doc:`../../../How-To-Guides/Launch-file-different-formats`.
fr: Le fichier de lancement ci-dessus est écrit en Python, mais vous pouvez également utiliser XML et YAML pour créer des fichiers de lancement. Vous pouvez voir une comparaison de ces différents formats de lancement de ROS 2 dans :doc:`../../../How-To-Guides/Launch-file-different-formats`.

source: This will run two turtlesim nodes:
fr: Cela exécutera deux nœuds turtlesim :

source: For now, don't worry about the contents of this launch file. You can find more information on ROS 2 launch in the :doc:`ROS 2 launch tutorials <../../Intermediate/Launch/Launch-Main>`.
fr: Pour l'instant, ne vous inquiétez pas du contenu de ce fichier de lancement. Vous pouvez trouver plus d'informations sur le lancement de ROS 2 dans les :doc:`Tutoriels de lancement de ROS 2 <../../Intermediate/Launch/Launch-Main>`.

source: (Optional) Control the Turtlesim Nodes
fr: (Facultatif) Contrôlez les nœuds Turtlesim

source: Now that these nodes are running, you can control them like any other ROS 2 nodes. For example, you can make the turtles drive in opposite directions by opening up two additional terminals and running the following commands:
fr: Maintenant que ces nœuds fonctionnent, vous pouvez les contrôler comme n'importe quel autre nœud ROS 2. Par exemple, vous pouvez faire rouler les tortues dans des directions opposées en ouvrant deux terminaux supplémentaires et en exécutant les commandes suivantes :

source: In the second terminal:
fr: Dans la seconde borne :

source: In the third terminal:
fr: Dans le troisième terminal :

source: After running these commands, you should see something like the following:
fr: Après avoir exécuté ces commandes, vous devriez voir quelque chose comme ceci :

source: Summary
fr: Résumé

source: The significance of what you've done so far is that you've run two turtlesim nodes with one command. Once you learn to write your own launch files, you'll be able to run multiple nodes - and setup their configuration - in a similar way, with the ``ros2 launch`` command.
fr: L'importance de ce que vous avez fait jusqu'à présent est que vous avez exécuté deux nœuds turtlesim avec une seule commande. Une fois que vous aurez appris à écrire vos propres fichiers de lancement, vous pourrez exécuter plusieurs nœuds - et configurer leur configuration - de la même manière, avec la commande ``ros2 launch``.

source: For more tutorials on ROS 2 launch files, see the :doc:`main launch file tutorial page<../../Intermediate/Launch/Launch-Main>`.
fr: Pour plus de didacticiels sur les fichiers de lancement de ROS 2, consultez la :doc:`page principale du didacticiel sur le fichier de lancement<../../Intermediate/Launch/Launch-Main>`.

source: Next steps
fr: Prochaines étapes

source: In the next tutorial, :doc:`../Recording-And-Playing-Back-Data/Recording-And-Playing-Back-Data`, you'll learn about another helpful tool, ``ros2bag``.
fr: Dans le prochain didacticiel, :doc:`../Recording-And-Playing-Back-Data/Recording-And-Playing-Back-Data`, vous découvrirez un autre outil utile, ``ros2bag``.
