Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Tutorials/Intermediate/Tf2/Adding-A-Frame-Cpp.po
Languages: fr

source: Adding a frame (C++)
fr: Ajouter un cadre (C++)

source: **Goal:** Learn how to to add an extra frame to tf2.
fr: **Objectif :** Apprenez à ajouter une image supplémentaire à tf2.

source: **Tutorial level:** Intermediate
fr: **Niveau du didacticiel :** Intermédiaire

source: **Time:** 15 minutes
fr: **Durée :** 15 minutes

source: Contents
fr: Contenu

source: Background
fr: Arrière-plan

source: In previous tutorials, we recreated the turtle demo by writing a :doc:`tf2 broadcaster <./Writing-A-Tf2-Broadcaster-Cpp>` and a :doc:`tf2 listener <Writing-A-Tf2-Listener-Cpp>`. This tutorial will teach you how to add extra fixed and dynamic frames to the transformation tree. In fact, adding a frame in tf2 is very similar to creating the tf2 broadcaster, but this example will show you some additional features of tf2.
fr: Dans les tutoriels précédents, nous avons recréé la démo de la tortue en écrivant un :doc:`tf2 broadcaster <./Writing-A-Tf2-Broadcaster-Cpp>` et un :doc:`tf2 listener <Writing-A-Tf2-Listener-Cpp >`. Ce didacticiel vous apprendra comment ajouter des cadres fixes et dynamiques supplémentaires à l'arbre de transformation. En fait, l'ajout d'un cadre dans tf2 est très similaire à la création du diffuseur tf2, mais cet exemple vous montrera quelques fonctionnalités supplémentaires de tf2.

source: For many tasks related to transformations, it is easier to think inside a local frame. For example, it is easiest to reason about laser scan measurements in a frame at the center of the laser scanner. tf2 allows you to define a local frame for each sensor, link, or joint in your system. When transforming from one frame to another, tf2 will take care of all the hidden intermediate frame transformations that are introduced.
fr: Pour de nombreuses tâches liées aux transformations, il est plus facile de penser à l'intérieur d'un cadre local. Par exemple, il est plus facile de raisonner sur les mesures de balayage laser dans un cadre au centre du scanner laser. tf2 vous permet de définir une trame locale pour chaque capteur, lien ou joint de votre système. Lors de la transformation d'une image à une autre, tf2 s'occupera de toutes les transformations d'images intermédiaires cachées qui sont introduites.

source: tf2 tree
fr: arbre tf2

source: tf2 builds up a tree structure of frames and, thus, does not allow a closed loop in the frame structure. This means that a frame only has one single parent, but it can have multiple children. Currently, our tf2 tree contains three frames: ``world``, ``turtle1`` and ``turtle2``. The two turtle frames are children of the ``world`` frame. If we want to add a new frame to tf2, one of the three existing frames needs to be the parent frame, and the new one will become its child frame.
fr: tf2 construit une structure arborescente de trames et, par conséquent, ne permet pas une boucle fermée dans la structure de trame. Cela signifie qu'un cadre n'a qu'un seul parent, mais qu'il peut avoir plusieurs enfants. Actuellement, notre arborescence tf2 contient trois cadres : ``world``, ``turtle1`` et ``turtle2``. Les deux cadres tortues sont des enfants du cadre ``monde``. Si nous voulons ajouter un nouveau cadre à tf2, l'un des trois cadres existants doit être le cadre parent, et le nouveau deviendra son cadre enfant.

source: Tasks
fr: Tâches

source: 1 Write the fixed frame broadcaster
fr: 1 Écrivez le diffuseur à cadre fixe

source: In our turtle example, we'll add a new frame ``carrot1``, which will be the child of the ``turtle1``. This frame will serve as the goal for the second turtle.
fr: Dans notre exemple de tortue, nous allons ajouter un nouveau cadre ``carrot1``, qui sera l'enfant de ``turtle1``. Ce cadre servira de but pour la deuxième tortue.

source: Let's first create the source files. Go to the ``learning_tf2_cpp`` package we created in the previous tutorials. Download the fixed frame broadcaster code by entering the following command:
fr: Commençons par créer les fichiers source. Accédez au package ``learning_tf2_cpp`` que nous avons créé dans les tutoriels précédents. Téléchargez le code du diffuseur à cadre fixe en saisissant la commande suivante :

source: Windows
fr: les fenêtres

source: In a Windows command line prompt:
fr: Dans une invite de ligne de commande Windows :

source: Or in powershell:
fr: Ou en powershell :

source: Now open the file called ``fixed_frame_tf2_broadcaster.cpp``.
fr: Ouvrez maintenant le fichier appelé ``fixed_frame_tf2_broadcaster.cpp``.

source: The code is very similar to the tf2 broadcaster tutorial example and the only difference is that the transform here does not change over time.
fr: Le code est très similaire à l'exemple du didacticiel du diffuseur tf2 et la seule différence est que la transformation ici ne change pas avec le temps.

source: 1.1 Examine the code
fr: 1.1 Examiner le code

source: Let's take a look at the key lines in this piece of code. Here we create a new transform, from the parent ``turtle1`` to the new child ``carrot1``. The ``carrot1`` frame is 2 meters offset in y axis in terms of the ``turtle1`` frame.
fr: Examinons les lignes clés de ce morceau de code. Ici, nous créons une nouvelle transformation, du parent ``turtle1`` au nouvel enfant ``carrot1``. Le cadre ``carrot1`` est décalé de 2 mètres sur l'axe y par rapport au cadre ``turtle1``.

source: Navigate one level back to the ``learning_tf2_cpp`` directory, where the ``CMakeLists.txt`` and ``package.xml`` files are located.
fr: Naviguez d'un niveau vers le répertoire ``learning_tf2_cpp``, où se trouvent les fichiers ``CMakeLists.txt`` et ``package.xml``.

source: Now open the ``CMakeLists.txt`` add the executable and name it ``fixed_frame_tf2_broadcaster``.
fr: Ouvrez maintenant le ``CMakeLists.txt`` ajoutez l'exécutable et nommez-le ``fixed_frame_tf2_broadcaster``.

source: Finally, add the ``install(TARGETS…)`` section so ``ros2 run`` can find your executable:
fr: Enfin, ajoutez la section ``install(TARGETS…)`` pour que ``ros2 run`` puisse trouver votre exécutable :

source: 1.3 Write the launch file
fr: 1.3 Écrire le fichier de lancement

source: Now let's create a launch file for this example. With your text editor, create a new file called ``turtle_tf2_fixed_frame_demo.launch.py``, and add the following lines:
fr: Créons maintenant un fichier de lancement pour cet exemple. Avec votre éditeur de texte, créez un nouveau fichier appelé ``turtle_tf2_fixed_frame_demo.launch.py``, et ajoutez les lignes suivantes :

source: This launch file imports the required packages and then creates a ``demo_nodes`` variable that will store nodes that we created in the previous tutorial's launch file.
fr: Ce fichier de lancement importe les packages requis, puis crée une variable ``demo_nodes`` qui stockera les nœuds que nous avons créés dans le fichier de lancement du didacticiel précédent.

source: The last part of the code will add our fixed ``carrot1`` frame to the turtlesim world using our ``fixed_frame_tf2_broadcaster`` node.
fr: La dernière partie du code ajoutera notre cadre fixe ``carrot1`` au monde turtlesim en utilisant notre nœud ``fixed_frame_tf2_broadcaster``.

source: 1.4 Build
fr: 1.4 Construire

source: Run ``rosdep`` in the root of your workspace to check for missing dependencies.
fr: Exécutez ``rosdep`` à la racine de votre espace de travail pour vérifier les dépendances manquantes.

source: rosdep only runs on Linux, so you will need to install ``geometry_msgs`` and ``turtlesim`` dependencies yourself
fr: rosdep ne fonctionne que sous Linux, vous devrez donc installer vous-même les dépendances ``geometry_msgs`` et ``turtlesim``

source: From the root of your workspace, build your updated package:
fr: À partir de la racine de votre espace de travail, créez votre package mis à jour :

source: Open a new terminal, navigate to the root of your workspace, and source the setup files:
fr: Ouvrez un nouveau terminal, accédez à la racine de votre espace de travail et sourcez les fichiers de configuration :

source: 1.5 Run
fr: 1.5 Exécuter

source: Now you can start the turtle broadcaster demo:
fr: Vous pouvez maintenant démarrer la démo du diffuseur de tortue :

source: You should notice that the new ``carrot1`` frame appeared in the transformation tree.
fr: Vous devriez remarquer que le nouveau cadre ``carrot1`` est apparu dans l'arbre de transformation.

source: If you drive the first turtle around, you should notice that the behavior didn't change from the previous tutorial, even though we added a new frame. That's because adding an extra frame does not affect the other frames and our listener is still using the previously defined frames.
fr: Si vous conduisez la première tortue, vous devriez remarquer que le comportement n'a pas changé par rapport au didacticiel précédent, même si nous avons ajouté une nouvelle image. En effet, l'ajout d'une image supplémentaire n'affecte pas les autres images et notre écouteur utilise toujours les images définies précédemment.

source: Therefore if we want our second turtle to follow the carrot instead of the first turtle, we need to change value of the ``target_frame``. This can be done two ways. One way is to pass the ``target_frame`` argument to the launch file directly from the console:
fr: Par conséquent, si nous voulons que notre deuxième tortue suive la carotte au lieu de la première tortue, nous devons changer la valeur de ``target_frame``. Cela peut être fait de deux façons. Une façon consiste à passer l'argument ``target_frame`` au fichier de lancement directement depuis la console :

source: The second way is to update the launch file. To do so, open the ``turtle_tf2_fixed_frame_demo.launch.py`` file, and add the ``'target_frame': 'carrot1'`` parameter via ``launch_arguments`` argument.
fr: La deuxième méthode consiste à mettre à jour le fichier de lancement. Pour ce faire, ouvrez le fichier ``turtle_tf2_fixed_frame_demo.launch.py`` et ajoutez le paramètre ``'target_frame': 'carrot1'`` via l'argument ``launch_arguments``.

source: Now rebuild the package, restart the ``turtle_tf2_fixed_frame_demo.launch.py``, and you'll see the second turtle following the carrot instead of the first turtle!
fr: Maintenant, reconstruisez le paquet, redémarrez ``turtle_tf2_fixed_frame_demo.launch.py``, et vous verrez la deuxième tortue suivre la carotte au lieu de la première tortue !

source: 2 Write the dynamic frame broadcaster
fr: 2 Écrire le diffuseur de trame dynamique

source: The extra frame we published in this tutorial is a fixed frame that doesn't change over time in relation to the parent frame. However, if you want to publish a moving frame you can code the broadcaster to change the frame over time. Let's change our ``carrot1`` frame so that it changes relative to ``turtle1`` frame over time. Now download the dynamic frame broadcaster code by entering the following command:
fr: Le cadre supplémentaire que nous avons publié dans ce didacticiel est un cadre fixe qui ne change pas dans le temps par rapport au cadre parent. Cependant, si vous souhaitez publier une image mobile, vous pouvez coder le diffuseur pour modifier l'image au fil du temps. Modifions notre cadre ``carrot1`` pour qu'il change par rapport au cadre ``turtle1`` au fil du temps. Téléchargez maintenant le code du diffuseur de trames dynamiques en saisissant la commande suivante :

source: Now open the file called ``dynamic_frame_tf2_broadcaster.cpp``:
fr: Ouvrez maintenant le fichier appelé ``dynamic_frame_tf2_broadcaster.cpp`` :

source: 2.1 Examine the code
fr: 2.1 Examiner le code

source: Instead of a fixed definition of our x and y offsets, we are using the ``sin()`` and ``cos()`` functions on the current time so that the offset of ``carrot1`` is constantly changing.
fr: Au lieu d'une définition fixe de nos décalages x et y, nous utilisons les fonctions ``sin()`` et ``cos()`` sur l'heure actuelle afin que le décalage de ``carrot1`` change constamment.

source: Now open the ``CMakeLists.txt`` add the executable and name it ``dynamic_frame_tf2_broadcaster``.
fr: Ouvrez maintenant le ``CMakeLists.txt`` ajoutez l'exécutable et nommez-le ``dynamic_frame_tf2_broadcaster``.

source: 2.3 Write the launch file
fr: 2.3 Écrire le fichier de lancement

source: To test this code, create a new launch file ``turtle_tf2_dynamic_frame_demo.launch.py`` and paste the following code:
fr: Pour tester ce code, créez un nouveau fichier de lancement ``turtle_tf2_dynamic_frame_demo.launch.py`` et collez le code suivant :

source: 2.4 Build
fr: 2.4 Construire

source: 2.5 Run
fr: 2.5 Exécuter

source: Now you can start the dynamic frame demo:
fr: Vous pouvez maintenant démarrer la démonstration du cadre dynamique :

source: You should see that the second turtle is following the carrot's position that is constantly changing.
fr: Vous devriez voir que la deuxième tortue suit la position de la carotte qui change constamment.

source: Summary
fr: Résumé

source: In this tutorial, you learned about the tf2 transformation tree, its structure, and its features. You also learned that it is easiest to think inside a local frame, and learned to add extra fixed and dynamic frames for that local frame.
fr: Dans ce didacticiel, vous avez découvert l'arbre de transformation tf2, sa structure et ses fonctionnalités. Vous avez également appris qu'il est plus facile de penser à l'intérieur d'un cadre local et appris à ajouter des cadres fixes et dynamiques supplémentaires pour ce cadre local.
