Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Tutorials/Intermediate/Tf2/Debugging-Tf2-Problems.po
Languages: fr

source: Debugging
fr: Débogage

source: **Goal:** Learn how to use a systematic approach for debugging tf2 related problems.
fr: **Objectif :** Apprendre à utiliser une approche systématique pour déboguer les problèmes liés à tf2.

source: **Tutorial level:** Intermediate
fr: **Niveau du didacticiel :** Intermédiaire

source: **Time:** 10 minutes
fr: **Durée :** 10 minutes

source: Contents
fr: Contenu

source: Background
fr: Arrière-plan

source: This tutorial walks you through the steps to debug a typical tf2 problem. It will also use many of the tf2 debugging tools, such as ``tf2_echo``, ``tf2_monitor``, and ``view_frames``. This tutorial assumes you have completed the :doc:`learning tf2 <./Tf2-Main>` tutorials.
fr: Ce didacticiel vous guide à travers les étapes de débogage d'un problème typique de tf2. Il utilisera également de nombreux outils de débogage tf2, tels que ``tf2_echo``, ``tf2_monitor`` et ``view_frames``. Ce didacticiel suppose que vous avez terminé les didacticiels :doc:`learning tf2 <./Tf2-Main>`.

source: Debugging example
fr: Exemple de débogage

source: 1 Setting and starting the example
fr: 1 Réglage et démarrage de l'exemple

source: For this tutorial we will set up a demo application that has a number of problems. The goal of this tutorial is to apply a systematic approach to find and tackle these problems. First, let's create the source file.
fr: Pour ce didacticiel, nous allons configurer une application de démonstration qui présente un certain nombre de problèmes. L'objectif de ce didacticiel est d'appliquer une approche systématique pour trouver et résoudre ces problèmes. Commençons par créer le fichier source.

source: Go to the ``learning_tf2_cpp`` package we created in :doc:`tf2 tutorials <./Tf2-Main>`. Inside the ``src`` directory make a copy of the source file ``turtle_tf2_listener.cpp`` and rename it to ``turtle_tf2_listener_debug.cpp``.
fr: Accédez au package ``learning_tf2_cpp`` que nous avons créé dans :doc:`tf2 tutorials <./Tf2-Main>`. Dans le répertoire ``src``, faites une copie du fichier source ``turtle_tf2_listener.cpp`` et renommez-le en ``turtle_tf2_listener_debug.cpp``.

source: Open the file using your preferred text editor, and change line 67 from
fr: Ouvrez le fichier à l'aide de votre éditeur de texte préféré et modifiez la ligne 67 de

source: to
fr: pour

source: and change ``lookupTransform()`` call in lines 75-79 from
fr: et changez l'appel ``lookupTransform()`` dans les lignes 75-79 de

source: And save changes to the file. In order to run this demo, we need to create a launch file ``start_tf2_debug_demo.launch.py`` in the ``launch`` subdirectory of package ``learning_tf2_cpp``:
fr: Et enregistrez les modifications apportées au fichier. Pour exécuter cette démo, nous devons créer un fichier de lancement ``start_tf2_debug_demo.launch.py`` dans le sous-répertoire ``launch`` du package ``learning_tf2_cpp`` :

source: Don't forget to add the ``turtle_tf2_listener_debug`` executable to the ``CMakeLists.txt`` and build the package.
fr: N'oubliez pas d'ajouter l'exécutable ``turtle_tf2_listener_debug`` au ``CMakeLists.txt`` et de compiler le paquet.

source: Now let's run it to see what happens:
fr: Maintenant, exécutons-le pour voir ce qui se passe :

source: You will now see that the turtlesim came up. At the same time, if you run the ``turtle_teleop_key`` in another terminal window, you can use the arrow keys to drive the ``turtle1`` around.
fr: Vous verrez maintenant que la simulation de tortue est apparue. En même temps, si vous lancez la ``turtle_teleop_key`` dans une autre fenêtre de terminal, vous pouvez utiliser les touches fléchées pour conduire la ``turtle1``.

source: You will also notice that there is a second turtle in the lower, left corner. If the demo would be working correctly, this second turtle should be following the turtle you can command with the arrow keys. However, it is not the case because we have to solve some problems first. You should notice the following message:
fr: Vous remarquerez également qu'il y a une deuxième tortue dans le coin inférieur gauche. Si la démo fonctionne correctement, cette deuxième tortue devrait suivre la tortue que vous pouvez commander avec les touches fléchées. Cependant, ce n'est pas le cas car nous devons d'abord résoudre certains problèmes. Vous devriez remarquer le message suivant :

source: 2 Finding the tf2 request
fr: 2 Trouver la requête TF2

source: Firstly, we need to find out what exactly we are asking tf2 to do. Therefore, we go into the part of the code that is using tf2. Open the ``src/turtle_tf2_listener_debug.cpp`` file, and take a look at line 67:
fr: Tout d'abord, nous devons savoir exactement ce que nous demandons à TF2 de faire. Par conséquent, nous entrons dans la partie du code qui utilise tf2. Ouvrez le fichier ``src/turtle_tf2_listener_debug.cpp`` et regardez la ligne 67 :

source: and lines 75-79:
fr: et lignes 75-79 :

source: Here we do the actual request to tf2. The three arguments tell us directly what we are asking tf2: transform from frame ``turtle3`` to frame ``turtle1`` at time ``now``.
fr: Ici, nous faisons la demande réelle à TF2. Les trois arguments nous disent directement ce que nous demandons à tf2 : transformer du cadre ``turtle3`` au cadre ``turtle1`` au temps ``now``.

source: Now, let's take a look at why this request to tf2 is failing.
fr: Voyons maintenant pourquoi cette requête à tf2 échoue.

source: 3 Checking the frames
fr: 3 Vérification des cadres

source: Firstly, to find out if tf2 knows about our transform between ``turtle3`` and ``turtle1``, we will use ``tf2_echo`` tool.
fr: Tout d'abord, pour savoir si tf2 connaît notre transformation entre ``turtle3`` et ``turtle1``, nous allons utiliser l'outil ``tf2_echo``.

source: The output tells us that frame ``turtle3`` does not exist:
fr: La sortie nous indique que le cadre ``turtle3`` n'existe pas :

source: Then what frames do exist? If you like to get a graphical representation of this, use ``view_frames`` tool.
fr: Alors quels cadres existent ? Si vous souhaitez obtenir une représentation graphique de cela, utilisez l'outil ``view_frames``.

source: Open the generated ``frames.pdf`` file to see the following output:
fr: Ouvrez le fichier ``frames.pdf`` généré pour voir la sortie suivante :

source: So obviously the problem is that we are requesting transform from frame ``turtle3``, which does not exist. To fix this bug, just replace ``turtle3`` with ``turtle2`` in line 67.
fr: Donc, évidemment, le problème est que nous demandons une transformation à partir du cadre ``turtle3``, qui n'existe pas. Pour corriger ce bogue, remplacez simplement ``turtle3`` par ``turtle2`` à la ligne 67.

source: And now stop the running demo, build it, and run it again:
fr: Et maintenant, arrêtez la démo en cours d'exécution, créez-la et exécutez-la à nouveau :

source: And right away we run into the next problem:
fr: Et tout de suite nous rencontrons le problème suivant :

source: 4 Checking the timestamp
fr: 4 Vérification de l'horodatage

source: Now that we solved the frame name problem, it is time to look at the timestamps. Remember, we are trying to get the transform between ``turtle2`` and ``turtle1`` at the current time (i.e., ``now``). To get statistics on the timing, call ``tf2_monitor`` with corresponding frames.
fr: Maintenant que nous avons résolu le problème du nom de trame, il est temps de regarder les horodatages. Rappelez-vous, nous essayons d'obtenir la transformation entre ``turtle2`` et ``turtle1`` à l'heure actuelle (c'est-à-dire, ``now``). Pour obtenir des statistiques sur le timing, appelez ``tf2_monitor`` avec les images correspondantes.

source: The result should look something like this:
fr: Le résultat devrait ressembler à ceci :

source: The key part here is the delay for the chain from ``turtle2`` to ``turtle1``. The output shows there is an average delay of about 3 milliseconds. This means that tf2 can only transform between the turtles after 3 milliseconds are passed. So, if we would be asking tf2 for the transformation between the turtles 3 milliseconds ago instead of ``now``, tf2 would be able to give us an answer sometimes. Let's test this quickly by changing lines 75-79 to:
fr: La partie clé ici est le délai pour la chaîne de ``turtle2`` à ``turtle1``. La sortie montre qu'il y a un retard moyen d'environ 3 millisecondes. Cela signifie que tf2 ne peut se transformer entre les tortues qu'après 3 millisecondes. Donc, si nous demandions à tf2 la transformation entre les tortues il y a 3 millisecondes au lieu de ``maintenant``, tf2 pourrait parfois nous donner une réponse. Testons cela rapidement en changeant les lignes 75-79 en :

source: In the new code we are asking for the transform between the turtles 100 milliseconds ago. It is usual to use a longer periods, just to make sure that the transform will arrive. Stop the demo, build and run:
fr: Dans le nouveau code, nous demandons la transformation entre les tortues il y a 100 millisecondes. Il est habituel d'utiliser des périodes plus longues, juste pour s'assurer que la transformation arrivera. Arrêtez la démo, compilez et exécutez :

source: And you should finally see the turtle move!
fr: Et vous devriez enfin voir la tortue bouger !

source: That last fix we made is not really what you want to do, it was just to make sure that was our problem. The real fix would look like this:
fr: Ce dernier correctif que nous avons apporté n'est pas vraiment ce que vous voulez faire, c'était juste pour nous assurer que c'était notre problème. Le vrai correctif ressemblerait à ceci:

source: Or like this:
fr: Ou comme ceci :

source: You can learn more about timeouts in the :doc:`Using time <./Learning-About-Tf2-And-Time-Cpp>` tutorial, and use them as below:
fr: Vous pouvez en savoir plus sur les délais d'attente dans le didacticiel :doc:`Using time <./Learning-About-Tf2-And-Time-Cpp>` et les utiliser comme ci-dessous :

source: Summary
fr: Résumé

source: In this tutorial you learned how to use a systematic approach for debugging tf2 related problems. You also learned how to use tf2 debugging tools, such as ``tf2_echo``, ``tf2_monitor``, and ``view_frames`` to help you debug those tf2 problems.
fr: Dans ce didacticiel, vous avez appris à utiliser une approche systématique pour déboguer les problèmes liés à tf2. Vous avez également appris à utiliser les outils de débogage tf2, tels que ``tf2_echo``, ``tf2_monitor`` et ``view_frames`` pour vous aider à déboguer ces problèmes tf2.
