Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Tutorials/Intermediate/Tf2/Introduction-To-Tf2.po
Languages: fr

source: Introducing ``tf2``
fr: Présentation de ``tf2``

source: **Goal:** Run a turtlesim demo and see some of the power of tf2 in a multi-robot example using turtlesim.
fr: **Objectif :** Exécutez une démo turtlesim et découvrez la puissance de tf2 dans un exemple multi-robot utilisant turtlesim.

source: **Tutorial level:** Intermediate
fr: **Niveau du didacticiel :** Intermédiaire

source: **Time:** 10 minutes
fr: **Durée :** 10 minutes

source: Contents
fr: Contenu

source: Installing the demo
fr: Installation de la démo

source: Let's start by installing the demo package and its dependencies.
fr: Commençons par installer le package de démonstration et ses dépendances.

source: Linux Binaries
fr: Binaires Linux

source: From Source
fr: De la source

source: Running the demo
fr: Lancer la démo

source: Now that we've installed the ``turtle_tf2_py`` tutorial package let's run the demo. First, open a new terminal and :doc:`source your ROS 2 installation <../../Beginner-CLI-Tools/Configuring-ROS2-Environment>` so that ``ros2`` commands will work. Then run the following command:
fr: Maintenant que nous avons installé le package de tutoriel ``turtle_tf2_py``, lançons la démo. Tout d'abord, ouvrez un nouveau terminal et :doc:`sourcez votre installation ROS 2 <../../Beginner-CLI-Tools/Configuring-ROS2-Environment>` pour que les commandes ``ros2`` fonctionnent. Exécutez ensuite la commande suivante :

source: You will see the turtlesim start with two turtles.
fr: Vous verrez le turtlesim commencer avec deux tortues.

source: In the second terminal window type the following command:
fr: Dans la deuxième fenêtre du terminal, tapez la commande suivante :

source: Once the turtlesim is started you can drive the central turtle around in the turtlesim using the keyboard arrow keys, select the second terminal window so that your keystrokes will be captured to drive the turtle.
fr: Une fois que la simulation de tortue est démarrée, vous pouvez conduire la tortue centrale dans la simulation de tortue à l'aide des touches fléchées du clavier, sélectionnez la deuxième fenêtre de terminal afin que vos frappes soient capturées pour conduire la tortue.

source: You can see that one turtle continuously moves to follow the turtle you are driving around.
fr: Vous pouvez voir qu'une tortue se déplace continuellement pour suivre la tortue que vous conduisez.

source: What is happening?
fr: Ce qui se passe?

source: This demo is using the tf2 library to create three coordinate frames: a ``world`` frame, a ``turtle1`` frame, and a ``turtle2`` frame. This tutorial uses a tf2 broadcaster to publish the turtle coordinate frames and a tf2 listener to compute the difference in the turtle frames and move one turtle to follow the other.
fr: Cette démo utilise la bibliothèque tf2 pour créer trois cadres de coordonnées : un cadre ``world``, un cadre ``turtle1`` et un cadre ``turtle2``. Ce didacticiel utilise un diffuseur tf2 pour publier les images de coordonnées de la tortue et un écouteur tf2 pour calculer la différence entre les images de la tortue et déplacer une tortue pour qu'elle suive l'autre.

source: tf2 tools
fr: outils tf2

source: Now let's look at how tf2 is being used to create this demo. We can use ``tf2_tools`` to look at what tf2 is doing behind the scenes.
fr: Voyons maintenant comment tf2 est utilisé pour créer cette démo. Nous pouvons utiliser ``tf2_tools`` pour voir ce que fait tf2 dans les coulisses.

source: 1 Using view_frames
fr: 1 Utilisation de view_frames

source: ``view_frames`` creates a diagram of the frames being broadcasted by tf2 over ROS.
fr: ``view_frames`` crée un diagramme des trames diffusées par tf2 sur ROS.

source: You will see:
fr: Tu verras:

source: Here a tf2 listener is listening to the frames that are being broadcasted over ROS and drawing a tree of how the frames are connected. To view the tree, open the resulting ``frames.pdf`` with your favorite PDF viewer.
fr: Ici, un auditeur tf2 écoute les trames qui sont diffusées sur ROS et dessine un arbre de la façon dont les trames sont connectées. Pour afficher l'arborescence, ouvrez le ``frames.pdf`` résultant avec votre visionneuse PDF préférée.

source: Here we can see three frames that are broadcasted by tf2: ``world``, ``turtle1``, and ``turtle2``. The ``world`` here is the parent of the ``turtle1`` and ``turtle2`` frames. ``view_frames`` also report some diagnostic information about when the oldest and most recent frame transforms were received and how fast the tf2 frame is published to tf2 for debugging purposes.
fr: Ici, nous pouvons voir trois images diffusées par tf2 : ``world``, ``turtle1`` et ``turtle2``. Le ``world`` ici est le parent des cadres ``turtle1`` et ``turtle2``. ``view_frames`` rapporte également des informations de diagnostic sur le moment où les transformations de trame les plus anciennes et les plus récentes ont été reçues et à quelle vitesse la trame tf2 est publiée sur tf2 à des fins de débogage.

source: 2 Using tf2_echo
fr: 2 Utilisation de tf2_echo

source: ``tf2_echo`` reports the transform between any two frames broadcasted over ROS.
fr: ``tf2_echo`` signale la transformation entre deux trames diffusées sur ROS.

source: Let's look at the transform of the ``turtle2`` frame with respect to ``turtle1`` frame which is equivalent to:
fr: Regardons la transformation du cadre ``turtle2`` par rapport au cadre ``turtle1`` qui équivaut à :

source: You will see the transform displayed as the ``tf2_echo`` listener receives the frames broadcasted over ROS2.
fr: Vous verrez la transformation affichée lorsque l'écouteur ``tf2_echo`` reçoit les trames diffusées sur ROS2.

source: As you drive your turtle around you will see the transform change as the two turtles move relative to each other.
fr: Au fur et à mesure que vous conduisez votre tortue, vous verrez la transformation changer à mesure que les deux tortues se déplacent l'une par rapport à l'autre.

source: rviz and tf2
fr: rviz et tf2

source: ``rviz`` is a visualization tool that is useful for examining tf2 frames. Let's look at our turtle frames using rviz. Let's start rviz with the ``turtle_rviz.rviz`` configuration file using the ``-d`` option:
fr: ``rviz`` est un outil de visualisation utile pour examiner les trames tf2. Regardons nos cadres de tortues en utilisant rviz. Commençons rviz avec le fichier de configuration ``turtle_rviz.rviz`` en utilisant l'option ``-d`` :

source: In the side bar you will see the frames broadcasted by tf2. As you drive the turtle around you will see the frames move in rviz.
fr: Dans la barre latérale vous verrez les trames diffusées par tf2. Au fur et à mesure que vous conduisez la tortue, vous verrez les images se déplacer dans rviz.
