Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Tutorials/Intermediate/Tf2/Learning-About-Tf2-And-Time-Py.po
Languages: fr

source: Using time (Python)
fr: Utiliser le temps (Python)

source: **Goal:** Learn to use the ``timeout`` in ``lookup_transform`` function to wait for a transform to be available on the tf2 tree.
fr: **Objectif :** Apprendre à utiliser le ``timeout`` dans la fonction ``lookup_transform`` pour attendre qu'une transformation soit disponible sur l'arborescence tf2.

source: **Tutorial level:** Intermediate
fr: **Niveau du didacticiel :** Intermédiaire

source: **Time:** 10 minutes
fr: **Durée :** 10 minutes

source: Contents
fr: Contenu

source: Background
fr: Arrière-plan

source: In previous tutorials, we recreated the turtle demo by writing a :doc:`tf2 broadcaster <./Writing-A-Tf2-Broadcaster-Py>` and a :doc:`tf2 listener <./Writing-A-Tf2-Listener-Py>`. We also learned how to :doc:`add a new frame to the transformation tree <./Adding-A-Frame-Py>`. Now we will learn more about the ``timeout`` argument which makes the ``lookup_transform`` wait for the specified transform for up to the specified duration before throwing an exception. This tool can be useful to listen for transforms that are published at varying rates or those incoming source with unreliable networking and non negligible latency. This tutorial will teach you how use the timeout in ``lookup_transform`` function to wait for a transform to be available on the tf2 tree.
fr: Dans les tutoriels précédents, nous avons recréé la démo de la tortue en écrivant un :doc:`tf2 broadcaster <./Writing-A-Tf2-Broadcaster-Py>` et un :doc:`tf2 listener <./Writing-A-Tf2-Listener -Py>`. Nous avons également appris à :doc:`ajouter un nouveau cadre à l'arbre de transformation <./Adding-A-Frame-Py>`. Nous allons maintenant en apprendre plus sur l'argument ``timeout`` qui fait que le ``lookup_transform`` attend la transformation spécifiée jusqu'à la durée spécifiée avant de lancer une exception. Cet outil peut être utile pour écouter les transformations publiées à des rythmes variables ou les sources entrantes avec une mise en réseau peu fiable et une latence non négligeable. Ce tutoriel vous apprendra comment utiliser le timeout dans la fonction ``lookup_transform`` pour attendre qu'une transformation soit disponible sur l'arborescence tf2.

source: Tasks
fr: Tâches

source: 1 Update the listener node
fr: 1 Mettre à jour le nœud d'écoute

source: Edit ``turtle_tf2_listener.py`` and remove the ``timeout=Duration(seconds=1.0)`` parameter that is passed to the ``lookup_transform()`` call on line 76. It should look like shown below:
fr: Modifiez ``turtle_tf2_listener.py`` et supprimez le paramètre ``timeout=Duration(seconds=1.0)`` qui est passé à l'appel ``lookup_transform()`` à la ligne 76. Il devrait ressembler à celui illustré ci-dessous :

source: Moreover, import additional exceptions that we will handle in the beginning of the file:
fr: De plus, importez des exceptions supplémentaires que nous traiterons en début de fichier :

source: Edit the exception handling on line 81 by adding newly imported exceptions and ``raise`` statement to see the exception:
fr: Modifiez la gestion des exceptions à la ligne 81 en ajoutant les exceptions nouvellement importées et l'instruction ``raise`` pour voir l'exception :

source: If you now try to run the launch file, you will notice that it is failing:
fr: Si vous essayez maintenant d'exécuter le fichier de lancement, vous remarquerez qu'il échoue :

source: 2 Fix the listener node
fr: 2 Corrigez le nœud d'écoute

source: You now should notice that ``lookup_transform()`` is failing. It tells you that the frame does not exist or that the data is in the future. To fix this, edit your code on line 76 as shown below (return the ``timeout`` parameter):
fr: Vous devriez maintenant remarquer que ``lookup_transform()`` échoue. Il vous indique que la trame n'existe pas ou que les données sont dans le futur. Pour résoudre ce problème, éditez votre code à la ligne 76 comme indiqué ci-dessous (renvoyez le paramètre ``timeout``) :

source: The ``lookup_transform`` can take four arguments, where the last one is an optional timeout. It will block for up to that duration waiting for it to timeout.
fr: Le ``lookup_transform`` peut prendre quatre arguments, le dernier étant un délai d'attente facultatif. Il bloquera jusqu'à cette durée en attendant qu'il expire.

source: Once this change is made, remove the ``raise`` line from the ``except()`` block that we added above or the code will continue to fail.
fr: Une fois cette modification effectuée, supprimez la ligne ``raise`` du bloc ``except()`` que nous avons ajouté ci-dessus ou le code continuera d'échouer.

source: You can now run the launch file.
fr: Vous pouvez maintenant exécuter le fichier de lancement.

source: You should notice that ``lookup_transform()`` will actually block until the transform between the two turtles becomes available (this will usually take a few milli-seconds). Once the timeout has been reached (one second in this case), an exception will be raised only if the transform is still not available.
fr: Vous devriez remarquer que ``lookup_transform()`` se bloquera jusqu'à ce que la transformation entre les deux tortues soit disponible (cela prendra généralement quelques millisecondes). Une fois le délai d'attente atteint (une seconde dans ce cas), une exception sera levée uniquement si la transformation n'est toujours pas disponible.

source: Summary
fr: Résumé

source: In this tutorial you learned more about the ``lookup_transform`` function and its timeout features. You also learned how to catch and handle additional exceptions that can be thrown by tf2.
fr: Dans ce didacticiel, vous en avez appris davantage sur la fonction ``lookup_transform`` et ses fonctionnalités de délai d'attente. Vous avez également appris à intercepter et à gérer les exceptions supplémentaires qui peuvent être levées par tf2.
