Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Tutorials/Intermediate/Tf2/Quaternion-Fundamentals.po
Languages: fr

source: Quaternion fundamentals
fr: Fondamentaux du quaternion

source: **Goal:** Learn the basics of quaternion usage in ROS 2.
fr: **Objectif :** Apprendre les bases de l'utilisation des quaternions dans ROS 2.

source: **Tutorial level:** Intermediate
fr: **Niveau du didacticiel :** Intermédiaire

source: **Time:** 10 minutes
fr: **Durée :** 10 minutes

source: Contents
fr: Contenu

source: Background
fr: Arrière-plan

source: A quaternion is a 4-tuple representation of orientation, which is more concise than a rotation matrix. Quaternions are very efficient for analyzing situations where rotations in three dimensions are involved. Quaternions are used widely in robotics, quantum mechanics, computer vision, and 3D animation.
fr: Un quaternion est une représentation à 4 tuples de l'orientation, qui est plus concise qu'une matrice de rotation. Les quaternions sont très efficaces pour analyser des situations où des rotations en trois dimensions sont impliquées. Les quaternions sont largement utilisés dans la robotique, la mécanique quantique, la vision par ordinateur et l'animation 3D.

source: You can learn more about the underlying mathematical concept on `Wikipedia <https://en.wikipedia.org/wiki/Quaternion>`_. You can also take a look at an explorable video series `Visualizing quaternions <https://eater.net/quaternions>`_ made by `3blue1brown <https://www.youtube.com/3blue1brown>`_.
fr: Vous pouvez en savoir plus sur le concept mathématique sous-jacent sur `Wikipedia <https://en.wikipedia.org/wiki/Quaternion>`_. Vous pouvez également jeter un œil à une série de vidéos explorables `Visualizing quaternions <https://eater.net/quaternions>`_ réalisées par `3blue1brown <https://www.youtube.com/3blue1brown>`_.

source: In this tutorial, you will learn how quaternions and conversion methods work in ROS 2.
fr: Dans ce didacticiel, vous apprendrez comment les quaternions et les méthodes de conversion fonctionnent dans ROS 2.

source: Prerequisites
fr: Conditions préalables

source: However, this is not a hard requirement and you can stick to any other geometric transfromation library that suit you best. You can take a look at libraries like `transforms3d <https://github.com/matthew-brett/transforms3d>`_, `scipy.spatial.transform <https://github.com/scipy/scipy/tree/master/scipy/spatial/transform>`_, `pytransform3d <https://github.com/rock-learning/pytransform3d>`_, `numpy-quaternion <https://github.com/moble/quaternion>`_ or `blender.mathutils <https://docs.blender.org/api/master/mathutils.html>`_.
fr: Cependant, ce n'est pas une exigence stricte et vous pouvez vous en tenir à toute autre bibliothèque de transformation géométrique qui vous convient le mieux. Vous pouvez jeter un œil à des bibliothèques comme `transforms3d <https://github.com/matthew-brett/transforms3d>`_, `scipy.spatial.transform <https://github.com/scipy/scipy/tree/master /scipy/spatial/transform>`_, `pytransform3d <https://github.com/rock-learning/pytransform3d>`_, `numpy-quaternion <https://github.com/moble/quaternion>`_ ou `blender.mathutils <https://docs.blender.org/api/master/mathutils.html>`_.

source: Components of a quaternion
fr: Composants d'un quaternion

source: ROS 2 uses quaternions to track and apply rotations. A quaternion has 4 components ``(x, y, z, w)``. In ROS 2, ``w`` is last, but in some libraries like Eigen, ``w`` can be placed at the first position. The commonly-used unit quaternion that yields no rotation about the x/y/z axes is ``(0, 0, 0, 1)``, and can be created in a following way:
fr: ROS 2 utilise des quaternions pour suivre et appliquer des rotations. Un quaternion a 4 composantes ``(x, y, z, w)``. Dans ROS 2, ``w`` est en dernier, mais dans certaines bibliothèques comme Eigen, ``w`` peut être placé en première position. Le quaternion unitaire couramment utilisé qui ne produit aucune rotation autour des axes x/y/z est ``(0, 0, 0, 1)``, et peut être créé de la manière suivante :

source: The magnitude of a quaternion should always be one. If numerical errors cause a quaternion magnitude other than one, ROS 2 will print warnings. To avoid these warnings, normalize the quaternion:
fr: La magnitude d'un quaternion doit toujours être un. Si des erreurs numériques provoquent une magnitude de quaternion autre que un, ROS 2 imprimera des avertissements. Pour éviter ces avertissements, normalisez le quaternion :

source: Quaternion types in ROS 2
fr: Types de quaternions dans ROS 2

source: ROS 2 uses two quaternion datatypes: ``tf2::Quaternion`` and its equivalent ``geometry_msgs::msg::Quaternion``. To convert between them in C++, use the methods of ``tf2_geometry_msgs``.
fr: ROS 2 utilise deux types de données quaternions : ``tf2::Quaternion`` et son équivalent ``geometry_msgs::msg::Quaternion``. Pour convertir entre eux en C++, utilisez les méthodes de ``tf2_geometry_msgs``.

source: Quaternion operations
fr: Opérations de quaternions

source: 1 Think in RPY then convert to quaternion
fr: 1 Pensez en RPY puis convertissez en quaternion

source: It's easy for us to think of rotations about axes, but hard to think in terms of quaternions. A suggestion is to calculate target rotations in terms of roll (about an X-axis), pitch (about the Y-axis), and yaw (about the Z-axis), and then convert to a quaternion.
fr: Il est facile pour nous de penser à des rotations autour d'axes, mais difficile de penser en termes de quaternions. Une suggestion est de calculer les rotations cibles en termes de roulis (autour d'un axe X), de tangage (autour de l'axe Y) et de lacet (autour de l'axe Z), puis de les convertir en un quaternion.

source: 2 Applying a quaternion rotation
fr: 2 Appliquer une rotation de quaternion

source: To apply the rotation of one quaternion to a pose, simply multiply the previous quaternion of the pose by the quaternion representing the desired rotation. The order of this multiplication matters.
fr: Pour appliquer la rotation d'un quaternion à une pose, il suffit de multiplier le quaternion précédent de la pose par le quaternion représentant la rotation souhaitée. L'ordre de cette multiplication est important.

source: 3 Inverting a quaternion
fr: 3 Inversion d'un quaternion

source: An easy way to invert a quaternion is to negate the w-component:
fr: Un moyen simple d'inverser un quaternion est de nier la composante w :

source: 4 Relative rotations
fr: 4 Rotations relatives

source: Say you have two quaternions from the same frame, ``q_1`` and ``q_2``. You want to find the relative rotation, ``q_r``, that converts ``q_1`` to ``q_2`` in a following manner:
fr: Supposons que vous ayez deux quaternions du même cadre, ``q_1`` et ``q_2``. Vous voulez trouver la rotation relative, ``q_r``, qui convertit ``q_1`` en ``q_2`` de la manière suivante :

source: You can solve for ``q_r`` similarly to solving a matrix equation. Invert ``q_1`` and right-multiply both sides. Again, the order of multiplication is important:
fr: Vous pouvez résoudre pour ``q r`` similaire à la résolution d'une équation matricielle. Inverse ``q_ 1`` et multiplie à droite les deux côtés. Là encore, l'ordre de multiplication est important :

source: Here's an example to get the relative rotation from the previous robot pose to the current robot pose in python:
fr: Voici un exemple pour obtenir la rotation relative de la pose précédente du robot à la pose actuelle du robot en python :

source: Summary
fr: Résumé

source: In this tutorial, you learned about the fundamental concepts of a quaternion and its related mathematical operations, like inversion and rotation. You also learned about its usage examples in ROS 2 and conversion methods between two separate Quaternion classes.
fr: Dans ce didacticiel, vous avez découvert les concepts fondamentaux d'un quaternion et ses opérations mathématiques associées, telles que l'inversion et la rotation. Vous avez également découvert ses exemples d'utilisation dans ROS 2 et les méthodes de conversion entre deux classes Quaternion distinctes.
