Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Tutorials/Intermediate/Tf2/Tf2-Main.po
Languages: fr

source: ``tf2``
fr: tracé

source: Many of the tf2 tutorials are available for both C++ and Python. The tutorials are streamlined to complete either the C++ track or the Python track. If you want to learn both C++ and Python, you should go through the tutorials once for C++ and once for Python.
fr: De nombreux didacticiels tf2 sont disponibles à la fois pour C++ et Python. Les didacticiels sont simplifiés pour compléter soit la piste C++, soit la piste Python. Si vous souhaitez apprendre à la fois C++ et Python, vous devez parcourir les didacticiels une fois pour C++ et une fois pour Python.

source: Contents
fr: Contenu

source: Workspace setup
fr: Configuration de l'espace de travail

source: If you have not yet created a workspace in which to complete the tutorials, :doc:`follow this tutorial <../../Beginner-Client-Libraries/Creating-A-Workspace/Creating-A-Workspace>`.
fr: Si vous n'avez pas encore créé d'espace de travail dans lequel effectuer les didacticiels, :doc:`suivez ce didacticiel <../../Beginner-Client-Libraries/Creating-A-Workspace/Creating-A-Workspace>`.

source: Learning tf2
fr: Apprendre TF2

source: :doc:`Introduction to tf2 <./Introduction-To-Tf2>`.
fr: :doc:`Introduction à tf2 <./Introduction-To-Tf2>`.

source: This tutorial will give you a good idea of what tf2 can do for you. It shows off some of the tf2 power in a multi-robot example using turtlesim. This also introduces using ``tf2_echo``, ``view_frames``, and ``rviz``.
fr: Ce tutoriel vous donnera une bonne idée de ce que tf2 peut faire pour vous. Il montre une partie de la puissance de tf2 dans un exemple multi-robot utilisant turtlesim. Cela introduit également l'utilisation de ``tf2_echo``, ``view_frames`` et ``rviz``.

source: Writing a static broadcaster :doc:`(Python) <./Writing-A-Tf2-Static-Broadcaster-Py>` :doc:`(C++) <./Writing-A-Tf2-Static-Broadcaster-Cpp>`.
fr: Écrire un diffuseur statique :doc:`(Python) <./Writing-A-Tf2-Static-Broadcaster-Py>` :doc:`(C++) <./Writing-A-Tf2-Static-Broadcaster-Cpp>` .

source: This tutorial teaches you how to broadcast static coordinate frames to tf2.
fr: Ce tutoriel vous apprend à diffuser des trames de coordonnées statiques vers tf2.

source: Writing a broadcaster :doc:`(Python) <./Writing-A-Tf2-Broadcaster-Py>` :doc:`(C++) <Writing-A-Tf2-Broadcaster-Cpp>`.
fr: Écrire un diffuseur :doc:`(Python) <./Writing-A-Tf2-Broadcaster-Py>` :doc:`(C++) <Writing-A-Tf2-Broadcaster-Cpp>`.

source: This tutorial teaches you how to broadcast the state of a robot to tf2.
fr: Ce tutoriel vous apprend à diffuser l'état d'un robot sur tf2.

source: Writing a listener :doc:`(Python) <./Writing-A-Tf2-Listener-Py>` :doc:`(C++) <./Writing-A-Tf2-Listener-Cpp>`.
fr: Écrire un écouteur :doc:`(Python) <./Writing-A-Tf2-Listener-Py>` :doc:`(C++) <./Writing-A-Tf2-Listener-Cpp>`.

source: This tutorial teaches you how to use tf2 to get access to frame transformations.
fr: Ce didacticiel vous apprend à utiliser tf2 pour accéder aux transformations de trame.

source: Adding a frame :doc:`(Python) <./Adding-A-Frame-Py>` :doc:`(C++) <Adding-A-Frame-Cpp>`.
fr: Ajout d'un cadre :doc:`(Python) <./Adding-A-Frame-Py>` :doc:`(C++) <Adding-A-Frame-Cpp>`.

source: This tutorial teaches you how to add an extra fixed frame to tf2.
fr: Ce tutoriel vous apprend à ajouter un cadre fixe supplémentaire à tf2.

source: Using time :doc:`(Python) <Learning-About-Tf2-And-Time-Py>` :doc:`(C++) <Learning-About-Tf2-And-Time-Cpp>`.
fr: Utilisation du temps :doc:`(Python) <Learning-About-Tf2-And-Time-Py>` :doc:`(C++) <Learning-About-Tf2-And-Time-Cpp>`.

source: This tutorial teaches you to use the timeout in ``lookup_transform`` function to wait for a transform to be available on the tf2 tree.
fr: Ce tutoriel vous apprend à utiliser le délai d'attente dans la fonction ``lookup_transform`` pour attendre qu'une transformation soit disponible sur l'arborescence tf2.

source: Traveling in time :doc:`(Python) <./Time-Travel-With-Tf2-Py>` :doc:`(C++) <./Time-Travel-With-Tf2-Cpp>`.
fr: Voyager dans le temps :doc:`(Python) <./Time-Travel-With-Tf2-Py>` :doc:`(C++) <./Time-Travel-With-Tf2-Cpp>`.

source: This tutorial teaches you about advanced time travel features of tf2.
fr: Ce didacticiel vous présente les fonctionnalités avancées de voyage dans le temps de tf2.

source: Debugging tf2
fr: Débogage de TF2

source: :doc:`Quaternion fundamentals <./Quaternion-Fundamentals>`.
fr: :doc:`Fondamentaux des quaternions <./Quaternion-Fundamentals>`.

source: This tutorial teaches you basics of quaternion usage in ROS 2.
fr: Ce didacticiel vous apprend les bases de l'utilisation des quaternions dans ROS 2.

source: :doc:`Debugging tf2 problems <./Debugging-Tf2-Problems>`.
fr: :doc:`Débogage des problèmes de tf2 <./Debugging-Tf2-Problems>`.

source: This tutorial teaches you about a systematic approach for debugging tf2 related problems.
fr: Ce didacticiel vous explique une approche systématique pour déboguer les problèmes liés à tf2.

source: Using sensor messages with tf2
fr: Utilisation des messages de capteur avec tf2

source: :doc:`Using stamped datatypes with tf2_ros::MessageFilter <./Using-Stamped-Datatypes-With-Tf2-Ros-MessageFilter>`.
fr: :doc:`Utilisation des types de données estampillés avec tf2_ros::MessageFilter <./Using-Stamped-Datatypes-With-Tf2-Ros-MessageFilter>`.

source: This tutorial teaches you how to use ``tf2_ros::MessageFilter`` to process stamped datatypes.
fr: Ce tutoriel vous apprend à utiliser ``tf2_ros::MessageFilter`` pour traiter les types de données tamponnés.
