Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Tutorials/Intermediate/Tf2/Time-Travel-With-Tf2-Cpp.po
Languages: fr

source: Traveling in time (C++)
fr: Voyager dans le temps (C++)

source: **Goal:** Learn about advanced time travel features of tf2.
fr: **Objectif :** En savoir plus sur les fonctionnalités avancées de voyage dans le temps de tf2.

source: **Tutorial level:** Intermediate
fr: **Niveau du didacticiel :** Intermédiaire

source: **Time:** 10 minutes
fr: **Durée :** 10 minutes

source: Contents
fr: Contenu

source: Background
fr: Arrière-plan

source: In the previous tutorial, we discussed the :doc:`basics of tf2 and time <./Learning-About-Tf2-And-Time-Cpp>`. This tutorial will take us one step further and expose a powerful tf2 trick: the time travel. In short, one of the key features of tf2 library is that it is able to transform data in time as well as in space.
fr: Dans le didacticiel précédent, nous avons abordé les :doc:`bases de tf2 et du temps <./Learning-About-Tf2-And-Time-Cpp>`. Ce tutoriel nous emmènera un peu plus loin et exposera une astuce puissante de tf2 : le voyage dans le temps. En bref, l'une des principales caractéristiques de la bibliothèque tf2 est qu'elle est capable de transformer des données dans le temps ainsi que dans l'espace.

source: This tf2 time travel feature can be useful for various tasks, like monitoring the pose of the robot for a long period of time or building a follower robot that will follow the "steps" of the leader. We will use that time travel feature to look up transforms back in time and program ``turtle2`` to follow 5 seconds behind ``carrot1``.
fr: Cette fonctionnalité de voyage dans le temps tf2 peut être utile pour diverses tâches, comme surveiller la pose du robot pendant une longue période ou construire un robot suiveur qui suivra les "pas" du leader. Nous allons utiliser cette fonctionnalité de voyage dans le temps pour rechercher des transformations dans le temps et programmer ``turtle2`` pour suivre 5 secondes derrière ``carrot1``.

source: Time travel
fr: Voyage dans le temps

source: First, let's go back to where we ended in the previous tutorial :doc:`Using time <./Learning-About-Tf2-And-Time-Cpp>`. Go to your ``learning_tf2_cpp`` package.
fr: Tout d'abord, revenons à l'endroit où nous nous sommes arrêtés dans le didacticiel précédent :doc:`Utiliser le temps <./Learning-About-Tf2-And-Time-Cpp>`. Accédez à votre package ``learning_tf2_cpp``.

source: Now, instead of making the second turtle go to where the carrot is now, we will make the second turtle go to where the first carrot was 5 seconds ago. Edit the ``lookupTransform()`` call in ``turtle_tf2_listener.cpp`` file to
fr: Maintenant, au lieu de faire aller la deuxième tortue là où se trouve la carotte, nous allons faire aller la deuxième tortue là où se trouvait la première carotte il y a 5 secondes. Modifiez l'appel ``lookupTransform()`` dans le fichier ``turtle_tf2_listener.cpp`` pour

source: Now if you run this, during the first 5 seconds, the second turtle would not know where to go because we do not yet have a 5-second history of poses of the carrot. But what happens after these 5 seconds? Let's just give it a try:
fr: Maintenant, si vous exécutez ceci, pendant les 5 premières secondes, la deuxième tortue ne saurait pas où aller car nous n'avons pas encore d'historique de 5 secondes des poses de la carotte. Mais que se passe-t-il après ces 5 secondes ? Essayons simplement :

source: You should now notice that your turtle is driving around uncontrollably like in this screenshot. Let's try to understand reason behind that behavior.
fr: Vous devriez maintenant remarquer que votre tortue se déplace de manière incontrôlable comme dans cette capture d'écran. Essayons de comprendre la raison derrière ce comportement.

source: In our code we asked tf2 the following question: "What was the pose of ``carrot1`` 5 seconds ago, relative to ``turtle2`` 5 seconds ago?". This means we are controlling the second turtle based on where it was 5 seconds ago as well as where the first carrot was 5 seconds ago.
fr: Dans notre code, nous avons posé la question suivante à tf2 : "Quelle était la pose de ``carrot1`` il y a 5 secondes, par rapport à ``turtle2`` il y a 5 secondes ?". Cela signifie que nous contrôlons la deuxième tortue en fonction de l'endroit où elle se trouvait il y a 5 secondes ainsi que de l'endroit où se trouvait la première carotte il y a 5 secondes.

source: However, what we really want to ask is: "What was the pose of ``carrot1`` 5 seconds ago, relative to the current position of the ``turtle2``?".
fr: Cependant, ce que nous voulons vraiment demander est : "Quelle était la pose de ``carotte1`` il y a 5 secondes, par rapport à la position actuelle de la ``tortue2`` ?".

source: Advanced API for lookupTransform()
fr: API avancée pour lookupTransform()

source: To ask the tf2 that particular question, we will use an advanced API that gives us the power to say explicitly when to acquire the specified transformations. This is done by calling the ``lookupTransform()`` method with additional parameters. Your code now would look like this:
fr: Pour poser au tf2 cette question particulière, nous utiliserons une API avancée qui nous donne le pouvoir de dire explicitement quand acquérir les transformations spécifiées. Cela se fait en appelant la méthode ``lookupTransform()`` avec des paramètres supplémentaires. Votre code ressemblerait maintenant à ceci :

source: The advanced API for ``lookupTransform()`` takes six arguments:
fr: L'API avancée pour ``lookupTransform()`` prend six arguments :

source: Target frame
fr: Cadre cible

source: The time to transform to
fr: Le temps de se transformer en

source: Source frame
fr: Cadre source

source: The time at which source frame will be evaluated
fr: L'heure à laquelle la trame source sera évaluée

source: Frame that does not change over time, in this case the ``world`` frame
fr: Cadre qui ne change pas dans le temps, dans ce cas le cadre ``monde``

source: Time to wait for the target frame to become available
fr: Temps d'attente pour que le cadre cible soit disponible

source: To sum up, tf2 does the following in the background. In the past, it computes the transform from the ``carrot1`` to the ``world``. In the ``world`` frame, tf2 time travels from the past to now. And at the current time, tf2 computes the transform from the ``world`` to the ``turtle2``.
fr: Pour résumer, tf2 fait ce qui suit en arrière-plan. Dans le passé, il calculait la transformation de la ``carotte1`` au ``monde``. Dans le cadre du ``monde``, le temps tf2 voyage du passé au présent. Et à l'heure actuelle, tf2 calcule la transformation du ``world`` à la ``turtle2``.

source: Checking the results
fr: Vérification des résultats

source: Let's run the simulation again, this time with the advanced time-travel API:
fr: Recommençons la simulation, cette fois avec l'API avancée de voyage dans le temps :

source: And yes, the second turtle is directed to where the first carrot was 5 seconds ago!
fr: Et oui, la deuxième tortue est dirigée là où se trouvait la première carotte il y a 5 secondes !

source: Summary
fr: Résumé

source: In this tutorial, you have seen one of the advanced features of tf2. You learned that tf2 can transform data in time and learned how to do that with turtlesim example. tf2 allowed you to go back in time and make frame transformations between old and current poses of turtles by using the advanced ``lookupTransform()`` API.
fr: Dans ce tutoriel, vous avez vu l'une des fonctionnalités avancées de tf2. Vous avez appris que tf2 peut transformer des données dans le temps et appris comment le faire avec l'exemple turtlesim. tf2 vous a permis de remonter dans le temps et de faire des transformations de trame entre les poses anciennes et actuelles des tortues en utilisant l'API avancée ``lookupTransform()``.
