Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Tutorials/Intermediate/Tf2/Using-Stamped-Datatypes-With-Tf2-Ros-MessageFilter.po
Languages: fr

source: Using stamped datatypes with ``tf2_ros::MessageFilter``
fr: Utiliser des types de données tamponnés avec ``tf2_ros::MessageFilter``

source: **Goal:** Learn how to use ``tf2_ros::MessageFilter`` to process stamped datatypes.
fr: **Objectif :** Apprendre à utiliser ``tf2_ros::MessageFilter`` pour traiter les types de données tamponnés.

source: **Tutorial level:** Intermediate
fr: **Niveau du didacticiel :** Intermédiaire

source: **Time:** 10 minutes
fr: **Durée :** 10 minutes

source: Contents
fr: Contenu

source: Background
fr: Arrière-plan

source: This tutorial explains how to use sensor data with tf2. Some real-world examples of sensor data are:
fr: Ce tutoriel explique comment utiliser les données du capteur avec tf2. Voici quelques exemples concrets de données de capteurs :

source: cameras, both mono and stereo
fr: caméras, mono et stéréo

source: laser scans
fr: balayages laser

source: Suppose that a new turtle named ``turtle3`` is created and it doesn't have good odometry, but there is an overhead camera tracking its position and publishing it as a ``PointStamped`` message in relation to the ``world`` frame.
fr: Supposons qu'une nouvelle tortue nommée ``turtle3`` est créée et qu'elle n'a pas une bonne odométrie, mais qu'il y a une caméra aérienne qui suit sa position et la publie comme un message ``PointStamped`` en relation avec le ``monde` `cadre.

source: ``turtle1`` wants to know where ``turtle3`` is compared to itself.
fr: ``turtle1`` veut savoir où ``turtle3`` est comparé à lui-même.

source: To do this ``turtle1`` must listen to the topic where ``turtle3``'s pose is being published, wait until transforms into the desired frame are ready, and then do its operations. To make this easier the ``tf2_ros::MessageFilter`` is very useful. The ``tf2_ros::MessageFilter`` will take a subscription to any ROS 2 message with a header and cache it until it is possible to transform it into the target frame.
fr: Pour ce faire, ``turtle1`` doit écouter le sujet où la pose de ``turtle3`` est publiée, attendre que les transformations dans le cadre souhaité soient prêtes, puis effectuer ses opérations. Pour rendre cela plus facile, le ``tf2_ros::MessageFilter`` est très utile. Le ``tf2_ros::MessageFilter`` prendra un abonnement à n'importe quel message ROS 2 avec un en-tête et le mettra en cache jusqu'à ce qu'il soit possible de le transformer en trame cible.

source: Tasks
fr: Tâches

source: 1 Write the broadcaster node of PointStamped messages
fr: 1 Écrire le nœud diffuseur des messages PointStamped

source: For this tutorial we will set up a demo application which has a node (in Python) to broadcast the ``PointStamped`` position messages of ``turtle3``.
fr: Pour ce tutoriel, nous allons configurer une application de démonstration qui a un nœud (en Python) pour diffuser les messages de position ``PointStamped`` de ``turtle3``.

source: First, let's create the source file.
fr: Commençons par créer le fichier source.

source: Go to the ``learning_tf2_py`` :doc:`package <./Writing-A-Tf2-Static-Broadcaster-Py>` we created in the previous tutorial. Inside the ``src/learning_tf2_py/learning_tf2_py`` directory download the example sensor message broadcaster code by entering the following command:
fr: Accédez au ``learning_tf2_py`` :doc:`package <./Writing-A-Tf2-Static-Broadcaster-Py>` que nous avons créé dans le tutoriel précédent. Dans le répertoire ``src/learning_tf2_py/learning_tf2_py``, téléchargez l'exemple de code de diffuseur de message de capteur en entrant la commande suivante :

source: Windows
fr: les fenêtres

source: In a Windows command line prompt:
fr: Dans une invite de ligne de commande Windows :

source: Or in powershell:
fr: Ou en powershell :

source: Open the file using your preferred text editor.
fr: Ouvrez le fichier à l'aide de votre éditeur de texte préféré.

source: 1.1 Examine the code
fr: 1.1 Examiner le code

source: Now let's take a look at the code. First, in the ``on_timer`` callback function, we spawn the ``turtle3`` by asynchronously calling the ``Spawn`` service of ``turtlesim``, and initialize its position at (4, 2, 0), when the turtle spawning service is ready.
fr: Voyons maintenant le code. Tout d'abord, dans la fonction de rappel ``on_timer``, nous générons la ``turtle3`` en appelant de manière asynchrone le service ``Spawn`` de ``turtlesim``, et initialisons sa position à (4, 2, 0), lorsque le service de ponte des tortues est prêt.

source: Afterward, the node publishes the topic ``turtle3/cmd_vel``, topic ``turtle3/turtle_point_stamped``, and subscribes to topic ``turtle3/pose`` and runs callback function ``handle_turtle_pose`` on every incoming message.
fr: Ensuite, le nœud publie le sujet ``turtle3/cmd_vel``, le sujet ``turtle3/turtle_point_stamped``, et s'abonne au sujet ``turtle3/pose`` et exécute la fonction de rappel ``handle_turtle_pose`` sur chaque message entrant.

source: Finally, in the callback function ``handle_turtle_pose``, we initialize the ``Twist`` messages of ``turtle3`` and publish them, which will make the ``turtle3`` move along a circle. Then we fill up the ``PointStamped`` messages of ``turtle3`` with incoming ``Pose`` messages and publish them.
fr: Enfin, dans la fonction de rappel ``handle_turtle_pose``, nous initialisons les messages ``Twist`` de ``turtle3`` et les publions, ce qui fera déplacer la ``turtle3`` le long d'un cercle. Ensuite, nous remplissons les messages ``PointStamped`` de ``turtle3`` avec des messages ``Pose`` entrants et les publions.

source: 1.2 Write the launch file
fr: 1.2 Écrire le fichier de lancement

source: In order to run this demo, we need to create a launch file ``turtle_tf2_sensor_message.launch.py`` in the ``launch`` subdirectory of package ``learning_tf2_py``:
fr: Afin d'exécuter cette démo, nous devons créer un fichier de lancement ``turtle_tf2_sensor_message.launch.py`` dans le sous-répertoire ``launch`` du package ``learning_tf2_py`` :

source: 1.3 Add an entry point
fr: 1.3 Ajouter un point d'entrée

source: To allow the ``ros2 run`` command to run your node, you must add the entry point to ``setup.py`` (located in the ``src/learning_tf2_py`` directory).
fr: Pour permettre à la commande ``ros2 run`` d'exécuter votre nœud, vous devez ajouter le point d'entrée à ``setup.py`` (situé dans le répertoire ``src/learning_tf2_py``).

source: Add the following line between the ``'console_scripts':`` brackets:
fr: Ajoutez la ligne suivante entre les crochets ``'console_scripts':`` :

source: 1.4 Build
fr: 1.4 Construire

source: Run ``rosdep`` in the root of your workspace to check for missing dependencies.
fr: Exécutez ``rosdep`` à la racine de votre espace de travail pour vérifier les dépendances manquantes.

source: rosdep only runs on Linux, so you will need to install ``geometry_msgs`` and ``turtlesim`` dependencies yourself
fr: rosdep ne fonctionne que sous Linux, vous devrez donc installer vous-même les dépendances ``geometry_msgs`` et ``turtlesim``

source: And then we can build the package:
fr: Et puis nous pouvons construire le package :

source: 2 Writing the message filter/listener node
fr: 2 Ecriture du nœud filtre/écouteur de messages

source: Now, to get the streaming ``PointStamped`` data of ``turtle3`` in the frame of ``turtle1`` reliably, we will create the source file of the message filter/listener node.
fr: Maintenant, pour obtenir les données de flux ``PointStamped`` de ``turtle3`` dans le cadre de ``turtle1`` de manière fiable, nous allons créer le fichier source du nœud filtre/écouteur de messages.

source: Go to the ``learning_tf2_cpp`` :doc:`package <./Writing-A-Tf2-Static-Broadcaster-Cpp>` we created in the previous tutorial. Inside the ``src/learning_tf2_cpp/src`` directory download file ``turtle_tf2_message_filter.cpp`` by entering the following command:
fr: Accédez au ``learning_tf2_cpp`` :doc:`package <./Writing-A-Tf2-Static-Broadcaster-Cpp>` que nous avons créé dans le tutoriel précédent. Dans le répertoire ``src/learning_tf2_cpp/src``, téléchargez le fichier ``turtle_tf2_message_filter.cpp`` en saisissant la commande suivante :

source: 2.1 Examine the code
fr: 2.1 Examiner le code

source: First, you must include the ``tf2_ros::MessageFilter`` headers from the ``tf2_ros`` package, as well as the previously used ``tf2`` and ``ros2`` related headers.
fr: Tout d'abord, vous devez inclure les en-têtes ``tf2_ros::MessageFilter`` du paquet ``tf2_ros``, ainsi que les en-têtes associés ``tf2`` et ``ros2`` précédemment utilisés.

source: Second, there needs to be persistent instances of ``tf2_ros::Buffer``, ``tf2_ros::TransformListener`` and ``tf2_ros::MessageFilter``.
fr: Deuxièmement, il doit y avoir des instances persistantes de ``tf2_ros::Buffer``, ``tf2_ros::TransformListener`` et ``tf2_ros::MessageFilter``.

source: Third, the ROS 2 ``message_filters::Subscriber`` must be initialized with the topic. And the ``tf2_ros::MessageFilter`` must be initialized with that ``Subscriber`` object. The other arguments of note in the ``MessageFilter`` constructor are the ``target_frame`` and the callback function. The target frame is the frame into which it will make sure ``canTransform`` will succeed. And the callback function is the function that will be called when the data is ready.
fr: Troisièmement, le ``message_filters::Subscriber`` de ROS 2 doit être initialisé avec le sujet. Et le ``tf2_ros::MessageFilter`` doit être initialisé avec cet objet ``Subscriber``. Les autres arguments à noter dans le constructeur ``MessageFilter`` sont le ``target_frame`` et la fonction de rappel. Le cadre cible est le cadre dans lequel il s'assurera que ``canTransform`` réussira. Et la fonction de rappel est la fonction qui sera appelée lorsque les données seront prêtes.

source: And last, the callback method will call ``tf2_buffer_->transform`` when the data is ready and print output to the console.
fr: Et enfin, la méthode de rappel appellera ``tf2_buffer_->transform`` lorsque les données seront prêtes et imprimeront la sortie sur la console.

source: 2.2 Add dependencies
fr: 2.2 Ajouter des dépendances

source: Before building the package ``learning_tf2_cpp``, please add two another dependencies in the ``package.xml`` file of this package:
fr: Avant de construire le package ``learning_tf2_cpp``, veuillez ajouter deux autres dépendances dans le fichier ``package.xml`` de ce package :

source: And in the ``CMakeLists.txt`` file, add two lines below the existing dependencies:
fr: Et dans le fichier ``CMakeLists.txt``, ajoutez deux lignes sous les dépendances existantes :

source: The lines below will deal with differences between ROS distributions:
fr: Les lignes ci-dessous traiteront des différences entre les distributions ROS :

source: After that, add the executable and name it ``turtle_tf2_message_filter``, which you'll use later with ``ros2 run``.
fr: Après cela, ajoutez l'exécutable et nommez-le ``turtle_tf2_message_filter``, que vous utiliserez plus tard avec ``ros2 run``.

source: Finally, add the ``install(TARGETS…)`` section (below other existing nodes) so ``ros2 run`` can find your executable:
fr: Enfin, ajoutez la section ``install(TARGETS…)`` (sous les autres nœuds existants) afin que ``ros2 run`` puisse trouver votre exécutable :

source: 2.4 Build
fr: 2.4 Construire

source: Now open a new terminal, navigate to the root of your workspace, and rebuild the package with command:
fr: Ouvrez maintenant un nouveau terminal, accédez à la racine de votre espace de travail et reconstruisez le package avec la commande :

source: Open a new terminal, navigate to the root of your workspace, and source the setup files:
fr: Ouvrez un nouveau terminal, accédez à la racine de votre espace de travail et sourcez les fichiers de configuration :

source: 3 Run
fr: 3 Courir

source: First we need to run several nodes (including the broadcaster node of PointStamped messages) by launching the launch file ``turtle_tf2_sensor_message.launch.py``:
fr: Nous devons d'abord exécuter plusieurs nœuds (dont le nœud diffuseur des messages PointStamped) en lançant le fichier de lancement ``turtle_tf2_sensor_message.launch.py`` :

source: This will bring up the ``turtlesim`` window with two turtles, where ``turtle3`` is moving along a circle, while ``turtle1`` isn't moving at first. But you can run the ``turtle_teleop_key`` node in another terminal to drive ``turtle1`` to move:
fr: Cela fera apparaître la fenêtre ``turtlesim`` avec deux tortues, où ``turtle3`` se déplace le long d'un cercle, tandis que ``turtle1`` ne bouge pas au début. Mais vous pouvez exécuter le nœud ``turtle_teleop_key`` dans un autre terminal pour amener ``turtle1`` à se déplacer :

source: Now if you echo the topic ``turtle3/turtle_point_stamped``:
fr: Maintenant, si vous faites écho au sujet ``turtle3/turtle_point_stamped`` :

source: Then there will be output like this:
fr: Ensuite, il y aura une sortie comme celle-ci :

source: When the demo is running, open another terminal and run the message filter/listener node:
fr: Lorsque la démo est en cours d'exécution, ouvrez un autre terminal et exécutez le nœud de filtre/écouteur de messages :

source: If it's running correctly you should see streaming data like this:
fr: S'il fonctionne correctement, vous devriez voir des flux de données comme celui-ci :

source: Summary
fr: Résumé

source: In this tutorial you learned how to use sensor data/messages in tf2. Specifically speaking, you learned how to publish ``PointStamped`` messages on a topic, and how to listen to the topic and transform the frame of ``PointStamped`` messages with ``tf2_ros::MessageFilter``.
fr: Dans ce didacticiel, vous avez appris à utiliser les données/messages des capteurs dans tf2. Plus précisément, vous avez appris à publier des messages ``PointStamped`` sur un sujet, et à écouter le sujet et à transformer le cadre des messages ``PointStamped`` avec ``tf2_ros::MessageFilter``.
