Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Tutorials/Intermediate/Tf2/Writing-A-Tf2-Broadcaster-Cpp.po
Languages: fr

source: Writing a broadcaster (C++)
fr: Ecrire un diffuseur (C++)

source: **Goal:** Learn how to broadcast the state of a robot to tf2.
fr: **Objectif :** Apprendre à diffuser l'état d'un robot sur TF2.

source: **Tutorial level:** Intermediate
fr: **Niveau du didacticiel :** Intermédiaire

source: **Time:** 15 minutes
fr: **Durée :** 15 minutes

source: Contents
fr: Contenu

source: Background
fr: Arrière-plan

source: In the next two tutorials we will write the code to reproduce the demo from the :doc:`Introduction to tf2 <./Introduction-To-Tf2>` tutorial. After that, following tutorials focus on extending the demo with more advanced tf2 features, including the usage of timeouts in transformation lookups and time travel.
fr: Dans les deux prochains tutoriels, nous écrirons le code pour reproduire la démo du tutoriel :doc:`Introduction to tf2 <./Introduction-To-Tf2>`. Après cela, les didacticiels suivants se concentrent sur l'extension de la démo avec des fonctionnalités tf2 plus avancées, y compris l'utilisation de délais d'attente dans les recherches de transformation et le voyage dans le temps.

source: Prerequisites
fr: Conditions préalables

source: This tutorial assumes you have a working knowledge of ROS 2 and you have completed the :doc:`Introduction to tf2 tutorial <./Introduction-To-Tf2>` and :doc:`tf2 static broadcaster tutorial (C++) <./Writing-A-Tf2-Static-Broadcaster-Cpp>`. In previous tutorials, you learned how to :doc:`create a workspace <../../Beginner-Client-Libraries/Creating-A-Workspace/Creating-A-Workspace>` and :doc:`create a package <../../Beginner-Client-Libraries/Creating-Your-First-ROS2-Package>`. You also have created the ``learning_tf2_cpp`` :doc:`package <./Writing-A-Tf2-Static-Broadcaster-Cpp>`, which is where we will continue working from.
fr: Ce didacticiel suppose que vous avez une connaissance pratique de ROS 2 et que vous avez terminé le didacticiel :doc:`Introduction to tf2 tutorial <./Introduction-To-Tf2>` et :doc:`tf2 static broadcaster tutorial (C++) <./Writing -A-Tf2-Static-Broadcaster-Cpp>`. Dans les tutoriels précédents, vous avez appris à :doc:`créer un espace de travail <../../Beginner-Client-Libraries/Creating-A-Workspace/Creating-A-Workspace>` et :doc:`créer un package < ../../Beginner-Client-Libraries/Creating-Your-First-ROS2-Package>`. Vous avez également créé le ``learning_tf2_cpp`` :doc:`package <./Writing-A-Tf2-Static-Broadcaster-Cpp>`, à partir duquel nous continuerons à travailler.

source: Tasks
fr: Tâches

source: 1 Write the broadcaster node
fr: 1 Écrivez le nœud diffuseur

source: Let's first create the source files. Go to the ``learning_tf2_cpp`` package we created in the previous tutorial. Inside the ``src`` directory download the example broadcaster code by entering the following command:
fr: Commençons par créer les fichiers source. Accédez au package ``learning_tf2_cpp`` que nous avons créé dans le tutoriel précédent. Dans le répertoire ``src``, téléchargez l'exemple de code de diffusion en saisissant la commande suivante :

source: Windows
fr: les fenêtres

source: In a Windows command line prompt:
fr: Dans une invite de ligne de commande Windows :

source: Or in powershell:
fr: Ou en powershell :

source: Open the file using your preferred text editor.
fr: Ouvrez le fichier à l'aide de votre éditeur de texte préféré.

source: 1.1 Examine the code
fr: 1.1 Examiner le code

source: Now, let's take a look at the code that is relevant to publishing the turtle pose to tf2. Firstly, we define and acquire a single parameter ``turtlename``, which specifies a turtle name, e.g. ``turtle1`` or ``turtle2``.
fr: Maintenant, regardons le code qui est pertinent pour publier la pose de la tortue sur tf2. Tout d'abord, nous définissons et acquérons un seul paramètre ``turtlename``, qui spécifie un nom de tortue, par ex. ``tortue1`` ou ``tortue2``.

source: Afterward, the node subscribes to topic ``turtleX/pose`` and runs function ``handle_turtle_pose`` on every incoming message.
fr: Ensuite, le nœud s'abonne au sujet ``turtleX/pose`` et exécute la fonction ``handle_turtle_pose`` sur chaque message entrant.

source: Now, we create a ``TransformStamped`` object and give it the appropriate metadata.
fr: Maintenant, nous créons un objet ``TransformStamped`` et lui donnons les métadonnées appropriées.

source: We need to give the transform being published a timestamp, and we'll just stamp it with the current time by calling ``this->get_clock()->now()``. This will return the current time used by the ``Node``.
fr: Nous devons donner à la transformation en cours de publication un horodatage, et nous l'estampillerons simplement avec l'heure actuelle en appelant ``this->get_clock()->now()``. Cela renverra l'heure actuelle utilisée par le ``Node``.

source: Then we need to set the name of the parent frame of the link we're creating, in this case ``world``.
fr: Ensuite, nous devons définir le nom du cadre parent du lien que nous créons, dans ce cas ``world``.

source: Finally, we need to set the name of the child node of the link we're creating, in this case this is the name of the turtle itself.
fr: Enfin, nous devons définir le nom du nœud enfant du lien que nous créons, dans ce cas, il s'agit du nom de la tortue elle-même.

source: The handler function for the turtle pose message broadcasts this turtle's translation and rotation, and publishes it as a transform from frame ``world`` to frame ``turtleX``.
fr: La fonction de gestion du message de pose de tortue diffuse la translation et la rotation de cette tortue et la publie sous forme de transformation du cadre ``world`` au cadre ``turtleX``.

source: Here we copy the information from the 3D turtle pose into the 3D transform.
fr: Ici, nous copions les informations de la pose de la tortue 3D dans la transformation 3D.

source: Finally we take the transform that we constructed and pass it to the ``sendTransform`` method of the ``TransformBroadcaster`` that will take care of broadcasting.
fr: Enfin, nous prenons la transformation que nous avons construite et la passons à la méthode ``sendTransform`` du ``TransformBroadcaster`` qui s'occupera de la diffusion.

source: Navigate one level back to the ``learning_tf2_cpp`` directory, where the ``CMakeLists.txt`` and ``package.xml`` files are located.
fr: Naviguez d'un niveau vers le répertoire ``learning_tf2_cpp``, où se trouvent les fichiers ``CMakeLists.txt`` et ``package.xml``.

source: Now open the ``CMakeLists.txt`` add the executable and name it ``turtle_tf2_broadcaster``, which you'll use later with ``ros2 run``.
fr: Ouvrez maintenant le ``CMakeLists.txt`` ajoutez l'exécutable et nommez-le ``turtle_tf2_broadcaster``, que vous utiliserez plus tard avec ``ros2 run``.

source: Finally, add the ``install(TARGETS…)`` section so ``ros2 run`` can find your executable:
fr: Enfin, ajoutez la section ``install(TARGETS…)`` pour que ``ros2 run`` puisse trouver votre exécutable :

source: 2 Write the launch file
fr: 2 Écrivez le fichier de lancement

source: Now create a launch file for this demo. With your text editor, create a new file called ``turtle_tf2_demo.launch.py`` in the ``launch`` folder, and add the following lines:
fr: Créez maintenant un fichier de lancement pour cette démo. Avec votre éditeur de texte, créez un nouveau fichier appelé ``turtle_tf2_demo.launch.py`` dans le dossier ``launch``, et ajoutez les lignes suivantes :

source: 2.1 Examine the code
fr: 2.1 Examiner le code

source: First we import required modules from the ``launch`` and ``launch_ros`` packages. It should be noted that ``launch`` is a generic launching framework (not ROS 2 specific) and ``launch_ros`` has ROS 2 specific things, like nodes that we import here.
fr: Nous importons d'abord les modules requis depuis les packages ``launch`` et ``launch_ros``. Il convient de noter que ``launch`` est un cadre de lancement générique (non spécifique à ROS 2) et ``launch_ros`` a des éléments spécifiques à ROS 2, comme les nœuds que nous importons ici.

source: Now we run our nodes that start the turtlesim simulation and broadcast ``turtle1`` state to the tf2 using our ``turtle_tf2_broadcaster`` node.
fr: Maintenant, nous exécutons nos nœuds qui démarrent la simulation turtlesim et diffusent l'état ``turtle1`` au tf2 en utilisant notre nœud ``turtle_tf2_broadcaster``.

source: 2.2 Add dependencies
fr: 2.2 Ajouter des dépendances

source: Open ``package.xml`` with your text editor. Add the following dependencies corresponding to your launch file's import statements:
fr: Ouvrez ``package.xml`` avec votre éditeur de texte. Ajoutez les dépendances suivantes correspondant aux instructions d'importation de votre fichier de lancement :

source: This declares the additional required ``launch`` and ``launch_ros`` dependencies when its code is executed.
fr: Cela déclare les dépendances supplémentaires requises ``launch`` et ``launch_ros`` lorsque son code est exécuté.

source: Make sure to save the file.
fr: Assurez-vous de sauvegarder le fichier.

source: Reopen ``CMakeLists.txt`` and add the line so that the launch files from the ``launch/`` folder would be installed.
fr: Rouvrez ``CMakeLists.txt`` et ajoutez la ligne pour que les fichiers de lancement du dossier ``launch/`` soient installés.

source: You can learn more about creating launch files in :doc:`this tutorial <../Launch/Creating-Launch-Files>`.
fr: Vous pouvez en savoir plus sur la création de fichiers de lancement dans :doc:`ce tutoriel <../Launch/Creating-Launch-Files>`.

source: 3 Build
fr: 3 Construire

source: Run ``rosdep`` in the root of your workspace to check for missing dependencies.
fr: Exécutez ``rosdep`` à la racine de votre espace de travail pour vérifier les dépendances manquantes.

source: rosdep only runs on Linux, so you will need to install ``geometry_msgs`` and ``turtlesim`` dependencies yourself
fr: rosdep ne fonctionne que sous Linux, vous devrez donc installer vous-même les dépendances ``geometry_msgs`` et ``turtlesim``

source: From the root of your workspace, build your updated package:
fr: À partir de la racine de votre espace de travail, créez votre package mis à jour :

source: Open a new terminal, navigate to the root of your workspace, and source the setup files:
fr: Ouvrez un nouveau terminal, accédez à la racine de votre espace de travail et sourcez les fichiers de configuration :

source: 4 Run
fr: 4 Courir

source: Now run the launch file that will start the turtlesim simulation node and ``turtle_tf2_broadcaster`` node:
fr: Exécutez maintenant le fichier de lancement qui lancera le nœud de simulation turtlesim et le nœud ``turtle_tf2_broadcaster`` :

source: In the second terminal window type the following command:
fr: Dans la deuxième fenêtre du terminal, tapez la commande suivante :

source: You will now see that the turtlesim simulation have started with one turtle that you can control.
fr: Vous verrez maintenant que la simulation turtlesim a commencé avec une tortue que vous pouvez contrôler.

source: Now, use the ``tf2_echo`` tool to check if the turtle pose is actually getting broadcast to tf2:
fr: Maintenant, utilisez l'outil ``tf2_echo`` pour vérifier si la pose de la tortue est réellement diffusée sur tf2 :

source: This should show you the pose of the first turtle. Drive around the turtle using the arrow keys (make sure your ``turtle_teleop_key`` terminal window is active, not your simulator window). In your console output you will see something similar to this:
fr: Cela devrait vous montrer la pose de la première tortue. Conduisez autour de la tortue en utilisant les touches fléchées (assurez-vous que votre fenêtre de terminal ``turtle_teleop_key`` est active, pas la fenêtre de votre simulateur). Dans la sortie de votre console, vous verrez quelque chose de similaire à ceci :

source: If you run ``tf2_echo`` for the transform between the ``world`` and ``turtle2``, you should not see a transform, because the second turtle is not there yet. However, as soon as we add the second turtle in the next tutorial, the pose of ``turtle2`` will be broadcast to tf2.
fr: Si vous exécutez ``tf2_echo`` pour la transformation entre ``world`` et ``turtle2``, vous ne devriez pas voir de transformation, car la deuxième tortue n'est pas encore là. Cependant, dès que nous ajouterons la deuxième tortue dans le prochain tutoriel, la pose de ``turtle2`` sera diffusée sur tf2.

source: Summary
fr: Résumé

source: In this tutorial you learned how to broadcast the pose of the robot (position and orientation of the turtle) to tf2 and how to use the ``tf2_echo`` tool. To actually use the transforms broadcasted to tf2, you should move on to the next tutorial about creating a :doc:`tf2 listener <./Writing-A-Tf2-Listener-Cpp>`.
fr: Dans ce tutoriel, vous avez appris à diffuser la pose du robot (position et orientation de la tortue) à tf2 et à utiliser l'outil ``tf2_echo``. Pour utiliser réellement les transformations diffusées sur tf2, vous devez passer au tutoriel suivant sur la création d'un :doc:`tf2 listener <./Writing-A-Tf2-Listener-Cpp>`.
