Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Tutorials/Intermediate/Tf2/Writing-A-Tf2-Listener-Cpp.po
Languages: fr

source: Writing a listener (C++)
fr: Écrire un écouteur (C++)

source: **Goal:** Learn how to use tf2 to get access to frame transformations.
fr: **Objectif :** Apprendre à utiliser tf2 pour accéder aux transformations d'images.

source: **Tutorial level:** Intermediate
fr: **Niveau du didacticiel :** Intermédiaire

source: **Time:** 10 minutes
fr: **Durée :** 10 minutes

source: Contents
fr: Contenu

source: Background
fr: Arrière-plan

source: In previous tutorials we created a tf2 broadcaster to publish the pose of a turtle to tf2.
fr: Dans les tutoriels précédents, nous avons créé un diffuseur tf2 pour publier la pose d'une tortue sur tf2.

source: In this tutorial we'll create a tf2 listener to start using tf2.
fr: Dans ce didacticiel, nous allons créer un écouteur tf2 pour commencer à utiliser tf2.

source: Prerequisites
fr: Conditions préalables

source: This tutorial assumes you have completed the :doc:`tf2 static broadcaster tutorial (C++) <./Writing-A-Tf2-Static-Broadcaster-Cpp>` and the :doc:`tf2 broadcaster tutorial (C++) <./Writing-A-Tf2-Broadcaster-Cpp>`. In the previous tutorial, we created a ``learning_tf2_cpp`` package, which is where we will continue working from.
fr: Ce didacticiel suppose que vous avez terminé le :doc:`tf2 static broadcaster tutorial (C++) <./Writing-A-Tf2-Static-Broadcaster-Cpp>` et le :doc:`tf2 broadcaster tutorial (C++) <./Writing -A-Tf2-Diffuseur-Cpp>`. Dans le tutoriel précédent, nous avons créé un package ``learning_tf2_cpp``, à partir duquel nous continuerons à travailler.

source: Tasks
fr: Tâches

source: 1 Write the listener node
fr: 1 Écrivez le nœud d'écoute

source: Let's first create the source files. Go to the ``learning_tf2_cpp`` package we created in the previous tutorial. Inside the ``src`` directory download the example listener code by entering the following command:
fr: Commençons par créer les fichiers source. Accédez au package ``learning_tf2_cpp`` que nous avons créé dans le tutoriel précédent. Dans le répertoire ``src``, téléchargez l'exemple de code d'écouteur en saisissant la commande suivante :

source: Windows
fr: les fenêtres

source: In a Windows command line prompt:
fr: Dans une invite de ligne de commande Windows :

source: Or in powershell:
fr: Ou en powershell :

source: Open the file using your preferred text editor.
fr: Ouvrez le fichier à l'aide de votre éditeur de texte préféré.

source: 1.1 Examine the code
fr: 1.1 Examiner le code

source: To understand how the service behind spawning turtle works, please refer to :doc:`writing a simple service and client (C++) <../../Beginner-Client-Libraries/Writing-A-Simple-Cpp-Service-And-Client>` tutorial.
fr: Pour comprendre comment fonctionne le service derrière la reproduction de la tortue, veuillez vous référer à :doc:`écrire un service simple et un client (C++) <../../Beginner-Client-Libraries/Writing-A-Simple-Cpp-Service-And -Client>` tutoriel.

source: Now, let's take a look at the code that is relevant to get access to frame transformations. The ``tf2_ros`` contains a ``TransformListener`` header file implementation that makes the task of receiving transforms easier.
fr: Voyons maintenant le code pertinent pour accéder aux transformations de trame. Le ``tf2_ros`` contient une implémentation de fichier d'en-tête ``TransformListener`` qui facilite la tâche de réception des transformations.

source: Here, we create a ``TransformListener`` object. Once the listener is created, it starts receiving tf2 transformations over the wire, and buffers them for up to 10 seconds.
fr: Ici, nous créons un objet ``TransformListener``. Une fois l'écouteur créé, il commence à recevoir les transformations tf2 sur le réseau et les met en mémoire tampon pendant 10 secondes maximum.

source: Finally, we query the listener for a specific transformation. We call ``lookup_transform`` method with following arguments:
fr: Enfin, nous interrogeons l'écouteur pour une transformation spécifique. Nous appelons la méthode ``lookup_transform`` avec les arguments suivants :

source: Target frame
fr: Cadre cible

source: Source frame
fr: Cadre source

source: The time at which we want to transform
fr: Le moment où nous voulons transformer

source: Providing ``tf2::TimePointZero()`` will just get us the latest available transform. All this is wrapped in a try-catch block to handle possible exceptions.
fr: Fournir ``tf2::TimePointZero()`` nous donnera simplement la dernière transformation disponible. Tout cela est enveloppé dans un bloc try-catch pour gérer les éventuelles exceptions.

source: Navigate one level back to the ``learning_tf2_cpp`` directory, where the ``CMakeLists.txt`` and ``package.xml`` files are located.
fr: Naviguez d'un niveau vers le répertoire ``learning_tf2_cpp``, où se trouvent les fichiers ``CMakeLists.txt`` et ``package.xml``.

source: Now open the ``CMakeLists.txt`` add the executable and name it ``turtle_tf2_listener``, which you'll use later with ``ros2 run``.
fr: Ouvrez maintenant le ``CMakeLists.txt`` ajoutez l'exécutable et nommez-le ``turtle_tf2_listener``, que vous utiliserez plus tard avec ``ros2 run``.

source: Finally, add the ``install(TARGETS…)`` section so ``ros2 run`` can find your executable:
fr: Enfin, ajoutez la section ``install(TARGETS…)`` pour que ``ros2 run`` puisse trouver votre exécutable :

source: 2 Update the launch file
fr: 2 Mettre à jour le fichier de lancement

source: Open the launch file called ``turtle_tf2_demo.launch.py`` with your text editor, add two new nodes to the launch description, add a launch argument, and add the imports. The resulting file should look like:
fr: Ouvrez le fichier de lancement appelé ``turtle_tf2_demo.launch.py`` avec votre éditeur de texte, ajoutez deux nouveaux nœuds à la description de lancement, ajoutez un argument de lancement et ajoutez les importations. Le fichier résultant devrait ressembler à :

source: This will declare a ``target_frame`` launch argument, start a broadcaster for second turtle that we will spawn and listener that will subscribe to those transformations.
fr: Cela déclarera un argument de lancement ``target_frame``, démarrera un diffuseur pour la deuxième tortue que nous allons générer et un écouteur qui s'abonnera à ces transformations.

source: 3 Build
fr: 3 Construire

source: Run ``rosdep`` in the root of your workspace to check for missing dependencies.
fr: Exécutez ``rosdep`` à la racine de votre espace de travail pour vérifier les dépendances manquantes.

source: rosdep only runs on Linux, so you will need to install ``geometry_msgs`` and ``turtlesim`` dependencies yourself
fr: rosdep ne fonctionne que sous Linux, vous devrez donc installer vous-même les dépendances ``geometry_msgs`` et ``turtlesim``

source: From the root of your workspace, build your updated package:
fr: À partir de la racine de votre espace de travail, créez votre package mis à jour :

source: Open a new terminal, navigate to the root of your workspace, and source the setup files:
fr: Ouvrez un nouveau terminal, accédez à la racine de votre espace de travail et sourcez les fichiers de configuration :

source: 4 Run
fr: 4 Courir

source: Now you're ready to start your full turtle demo:
fr: Vous êtes maintenant prêt à commencer votre démo complète de tortue :

source: You should see the turtle sim with two turtles. In the second terminal window type the following command:
fr: Vous devriez voir la simulation de tortue avec deux tortues. Dans la deuxième fenêtre du terminal, tapez la commande suivante :

source: To see if things work, simply drive around the first turtle using the arrow keys (make sure your terminal window is active, not your simulator window), and you'll see the second turtle following the first one!
fr: Pour voir si les choses fonctionnent, faites simplement le tour de la première tortue à l'aide des touches fléchées (assurez-vous que la fenêtre de votre terminal est active, pas la fenêtre de votre simulateur), et vous verrez la deuxième tortue suivre la première !

source: Summary
fr: Résumé

source: In this tutorial you learned how to use tf2 to get access to frame transformations. You also have finished writing your own turtlesim demo that you first tried in :doc:`Introduction to tf2 <./Introduction-To-Tf2>` tutorial.
fr: Dans ce didacticiel, vous avez appris à utiliser tf2 pour accéder aux transformations de trame. Vous avez également fini d'écrire votre propre démo turtlesim que vous avez d'abord essayée dans :doc:`Introduction to tf2 <./Introduction-To-Tf2>` tutorial.
