Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Tutorials/Intermediate/Tf2/Writing-A-Tf2-Static-Broadcaster-Cpp.po
Languages: fr

source: Writing a static broadcaster (C++)
fr: Écrire un diffuseur statique (C++)

source: **Goal:** Learn how to broadcast static coordinate frames to tf2.
fr: **Objectif :** Apprendre à diffuser des trames de coordonnées statiques vers tf2.

source: **Tutorial level:** Intermediate
fr: **Niveau du didacticiel :** Intermédiaire

source: **Time:** 15 minutes
fr: **Durée :** 15 minutes

source: Contents
fr: Contenu

source: Background
fr: Arrière-plan

source: Publishing static transforms is useful to define the relationship between a robot base and its sensors or non-moving parts. For example, it is easiest to reason about laser scan measurements in a frame at the center of the laser scanner.
fr: La publication de transformations statiques est utile pour définir la relation entre la base d'un robot et ses capteurs ou pièces fixes. Par exemple, il est plus facile de raisonner sur les mesures de balayage laser dans un cadre au centre du scanner laser.

source: This is a standalone tutorial covering the basics of static transforms, which consists of two parts. In the first part we will write code to publish static transforms to tf2. In the second part we will explain how to use the commandline ``static_transform_publisher`` executable tool in ``tf2_ros``.
fr: Il s'agit d'un didacticiel autonome couvrant les bases des transformations statiques, qui se compose de deux parties. Dans la première partie, nous allons écrire du code pour publier des transformations statiques sur tf2. Dans la deuxième partie, nous expliquerons comment utiliser l'outil exécutable en ligne de commande ``static_transform_publisher`` dans ``tf2_ros``.

source: In the next two tutorials we will write the code to reproduce the demo from the :doc:`Introduction to tf2 <./Introduction-To-Tf2>` tutorial. After that, the following tutorials focus on extending the demo with more advanced tf2 features.
fr: Dans les deux prochains tutoriels, nous écrirons le code pour reproduire la démo du tutoriel :doc:`Introduction to tf2 <./Introduction-To-Tf2>`. Après cela, les didacticiels suivants se concentrent sur l'extension de la démo avec des fonctionnalités tf2 plus avancées.

source: Prerequisites
fr: Conditions préalables

source: In previous tutorials, you learned how to :doc:`create a workspace <../../Beginner-Client-Libraries/Creating-A-Workspace/Creating-A-Workspace>` and :doc:`create a package <../../Beginner-Client-Libraries/Creating-Your-First-ROS2-Package>`.
fr: Dans les tutoriels précédents, vous avez appris à :doc:`créer un espace de travail <../../Beginner-Client-Libraries/Creating-A-Workspace/Creating-A-Workspace>` et :doc:`créer un package < ../../Beginner-Client-Libraries/Creating-Your-First-ROS2-Package>`.

source: Tasks
fr: Tâches

source: 1 Create a package
fr: 1 Créer un package

source: First we will create a package that will be used for this tutorial and the following ones. The package called ``learning_tf2_cpp`` will depend on ``geometry_msgs``, ``rclcpp``, ``tf2``, ``tf2_ros``, and ``turtlesim``. Code for this tutorial is stored `here <https://raw.githubusercontent.com/ros/geometry_tutorials/ros2/turtle_tf2_cpp/src/static_turtle_tf2_broadcaster.cpp>`_.
fr: Nous allons d'abord créer un package qui sera utilisé pour ce tutoriel et les suivants. Le paquet appelé ``learning_tf2_cpp`` dépendra de ``geometry_msgs``, ``rclcpp``, ``tf2``, ``tf2_ros`` et ``turtlesim``. Le code de ce didacticiel est stocké `ici <https://raw.githubusercontent.com/ros/geometry_tutorials/ros2/turtle_tf2_cpp/src/static_turtle_tf2_broadcaster.cpp>`_.

source: Open a new terminal and :doc:`source your ROS 2 installation <../../Beginner-CLI-Tools/Configuring-ROS2-Environment>` so that ``ros2`` commands will work. Navigate to workspace's ``src`` folder and create a new package:
fr: Ouvrez un nouveau terminal et :doc:`sourcez votre installation ROS 2 <../../Beginner-CLI-Tools/Configuring-ROS2-Environment>` pour que les commandes ``ros2`` fonctionnent. Accédez au dossier ``src`` de l'espace de travail et créez un nouveau package :

source: Your terminal will return a message verifying the creation of your package ``learning_tf2_cpp`` and all its necessary files and folders.
fr: Votre terminal renverra un message vérifiant la création de votre package ``learning_tf2_cpp`` et tous ses fichiers et dossiers nécessaires.

source: 2 Write the static broadcaster node
fr: 2 Écrivez le nœud diffuseur statique

source: Let's first create the source files. Inside the ``src/learning_tf2_cpp/src`` directory download the example static broadcaster code by entering the following command:
fr: Commençons par créer les fichiers source. Dans le répertoire ``src/learning_tf2_cpp/src``, téléchargez l'exemple de code de diffusion statique en saisissant la commande suivante :

source: Windows
fr: les fenêtres

source: In a Windows command line prompt:
fr: Dans une invite de ligne de commande Windows :

source: Or in powershell:
fr: Ou en powershell :

source: Open the file using your preferred text editor.
fr: Ouvrez le fichier à l'aide de votre éditeur de texte préféré.

source: 2.1 Examine the code
fr: 2.1 Examiner le code

source: Now let's look at the code that is relevant to publishing the static turtle pose to tf2. The first lines include the required header files. First we include ``geometry_msgs/msg/transform_stamped.hpp`` to access the ``TransformStamped`` message type, which we will publish to the transformation tree.
fr: Examinons maintenant le code pertinent pour publier la pose de tortue statique sur tf2. Les premières lignes incluent les fichiers d'en-tête requis. Nous incluons d'abord ``geometry_msgs/msg/transform_stamped.hpp`` pour accéder au type de message ``TransformStamped``, que nous publierons dans l'arbre de transformation.

source: Afterward, ``rclcpp`` is included so its ``rclcpp::Node`` class can be used.
fr: Ensuite, ``rclcpp`` est inclus afin que sa classe ``rclcpp::Node`` puisse être utilisée.

source: ``tf2::Quaternion`` is a class for a quaternion that provides convenient functions for converting Euler angles to quaternions and vice versa. We also include ``tf2_ros/static_transform_broadcaster.h`` to use the ``StaticTransformBroadcaster`` to make the publishing of static transforms easy.
fr: ``tf2::Quaternion`` est une classe pour un quaternion qui fournit des fonctions pratiques pour convertir les angles d'Euler en quaternions et vice versa. Nous incluons également ``tf2_ros/static_transform_broadcaster.h`` pour utiliser le ``StaticTransformBroadcaster`` afin de faciliter la publication des transformations statiques.

source: The ``StaticFramePublisher`` class constructor initializes the node with the name ``static_turtle_tf2_broadcaster``. Then, ``StaticTransformBroadcaster`` is created, which will send one static transformation upon the startup.
fr: Le constructeur de classe ``StaticFramePublisher`` initialise le nœud avec le nom ``static_turtle_tf2_broadcaster``. Ensuite, ``StaticTransformBroadcaster`` est créé, qui enverra une transformation statique au démarrage.

source: Here we create a ``TransformStamped`` object, which will be the message we will send over once populated. Before passing the actual transform values we need to give it the appropriate metadata.
fr: Ici, nous créons un objet ``TransformStamped``, qui sera le message que nous enverrons une fois rempli. Avant de transmettre les valeurs de transformation réelles, nous devons lui donner les métadonnées appropriées.

source: We need to give the transform being published a timestamp and we'll just stamp it with the current time, ``this->get_clock()->now()``
fr: Nous devons donner à la transformation en cours de publication un horodatage et nous l'estampillerons simplement avec l'heure actuelle, ``this->get_clock()->now()``

source: Then we need to set the name of the parent frame of the link we're creating, in this case ``world``
fr: Ensuite, nous devons définir le nom du cadre parent du lien que nous créons, dans ce cas ``world``

source: Finally, we need to set the name of the child frame of the link we're creating
fr: Enfin, nous devons définir le nom du cadre enfant du lien que nous créons

source: Here we populate the 6D pose (translation and rotation) of the turtle.
fr: Ici, nous remplissons la pose 6D (translation et rotation) de la tortue.

source: Finally, we broadcast static transform using the ``sendTransform()`` function.
fr: Enfin, nous diffusons une transformation statique à l'aide de la fonction ``sendTransform()``.

source: 2.2 Add dependencies
fr: 2.2 Ajouter des dépendances

source: Navigate one level back to the ``src/learning_tf2_cpp`` directory, where the ``CMakeLists.txt`` and ``package.xml`` files have been created for you.
fr: Naviguez d'un niveau vers le répertoire ``src/learning_tf2_cpp``, où les fichiers ``CMakeLists.txt`` et ``package.xml`` ont été créés pour vous.

source: Open ``package.xml`` with your text editor.
fr: Ouvrez ``package.xml`` avec votre éditeur de texte.

source: As mentioned in the :doc:`Create a package <../../Beginner-Client-Libraries/Creating-Your-First-ROS2-Package>` tutorial, make sure to fill in the ``<description>``, ``<maintainer>`` and ``<license>`` tags:
fr: Comme mentionné dans le tutoriel :doc:`Create a package <../../Beginner-Client-Libraries/Creating-Your-First-ROS2-Package>`, assurez-vous de remplir le ``<description>`` , ``<responsable>`` et ``<licence>`` :

source: Make sure to save the file.
fr: Assurez-vous de sauvegarder le fichier.

source: Add the executable to the CMakeLists.txt and name it ``static_turtle_tf2_broadcaster``, which you'll use later with ``ros2 run``.
fr: Ajoutez l'exécutable au CMakeLists.txt et nommez-le ``static_turtle_tf2_broadcaster``, que vous utiliserez plus tard avec ``ros2 run``.

source: Finally, add the ``install(TARGETS…)`` section so ``ros2 run`` can find your executable:
fr: Enfin, ajoutez la section ``install(TARGETS…)`` pour que ``ros2 run`` puisse trouver votre exécutable :

source: 3 Build
fr: 3 Construire

source: It's good practice to run ``rosdep`` in the root of your workspace to check for missing dependencies before building:
fr: Il est recommandé d'exécuter ``rosdep`` à la racine de votre espace de travail pour vérifier les dépendances manquantes avant de compiler :

source: rosdep only runs on Linux, so you will need to install ``geometry_msgs`` and ``turtlesim`` dependencies yourself
fr: rosdep ne fonctionne que sous Linux, vous devrez donc installer vous-même les dépendances ``geometry_msgs`` et ``turtlesim``

source: Still in the root of your workspace, build your new package:
fr: Toujours à la racine de votre espace de travail, construisez votre nouveau package :

source: Open a new terminal, navigate to the root of your workspace, and source the setup files:
fr: Ouvrez un nouveau terminal, accédez à la racine de votre espace de travail et sourcez les fichiers de configuration :

source: 4 Run
fr: 4 Courir

source: Now run the ``static_turtle_tf2_broadcaster`` node:
fr: Exécutez maintenant le nœud ``static_turtle_tf2_broadcaster`` :

source: This sets a turtle pose broadcast for ``mystaticturtle`` to float 1 meter above the ground.
fr: Cela définit une pose de tortue diffusée pour `` mystaticturtle`` pour flotter à 1 mètre au-dessus du sol.

source: We can now check that the static transform has been published by echoing the ``tf_static`` topic
fr: Nous pouvons maintenant vérifier que la transformation statique a été publiée en faisant écho au sujet ``tf_static``

source: If everything went well you should see a single static transform
fr: Si tout s'est bien passé, vous devriez voir une seule transformation statique

source: The proper way to publish static transforms
fr: La bonne façon de publier des transformations statiques

source: This tutorial aimed to show how ``StaticTransformBroadcaster`` can be used to publish static transforms. In your real development process you shouldn't have to write this code yourself and should use the dedicated ``tf2_ros`` tool to do so. ``tf2_ros`` provides an executable named ``static_transform_publisher`` that can be used either as a commandline tool or a node that you can add to your launchfiles.
fr: Ce tutoriel visait à montrer comment ``StaticTransformBroadcaster`` peut être utilisé pour publier des transformations statiques. Dans votre processus de développement réel, vous ne devriez pas avoir à écrire ce code vous-même et vous devriez utiliser l'outil dédié ``tf2_ros`` pour le faire. ``tf2_ros`` fournit un exécutable nommé ``static_transform_publisher`` qui peut être utilisé comme outil de ligne de commande ou comme nœud que vous pouvez ajouter à vos fichiers de lancement.

source: Publish a static coordinate transform to tf2 using an x/y/z offset in meters and roll/pitch/yaw in radians. In our case, roll/pitch/yaw refers to rotation about the x/y/z-axis, respectively.
fr: Publiez une transformation de coordonnées statiques sur tf2 en utilisant un décalage x/y/z en mètres et un roulis/tangage/lacet en radians. Dans notre cas, roulis/tangage/lacet fait référence à la rotation autour de l'axe x/y/z, respectivement.

source: Publish a static coordinate transform to tf2 using an x/y/z offset in meters and quaternion.
fr: Publiez une transformation de coordonnées statiques sur tf2 en utilisant un décalage x/y/z en mètres et en quaternion.

source: ``static_transform_publisher`` is designed both as a command-line tool for manual use, as well as for use within ``launch`` files for setting static transforms. For example:
fr: ``static_transform_publisher`` est conçu à la fois comme un outil de ligne de commande pour une utilisation manuelle, ainsi que pour une utilisation dans les fichiers ``launch`` pour définir des transformations statiques. Par exemple:

source: Note that all arguments except for ``--frame-id`` and ``--child-frame-id`` are optional; if a particular option isn't specified, then the identity will be assumed.
fr: Notez que tous les arguments sauf ``--frame-id`` et ``--child-frame-id`` sont facultatifs ; si une option particulière n'est pas spécifiée, l'identité sera supposée.

source: Summary
fr: Résumé

source: In this tutorial you learned how static transforms are useful to define static relationships between frames, like ``mystaticturtle`` in relation to the ``world`` frame. In addition, you learned how static transforms can be useful for understanding sensor data, such as from laser scanners, by relating the data to a common coordinate frame. Finally, you wrote your own node to publish static transforms to tf2 and learned how to publish required static transformations using ``static_transform_publisher`` executable and launch files.
fr: Dans ce tutoriel, vous avez appris comment les transformations statiques sont utiles pour définir des relations statiques entre les cadres, comme ``mystaticturtle`` par rapport au cadre ``world``. De plus, vous avez appris comment les transformations statiques peuvent être utiles pour comprendre les données des capteurs, comme celles des scanners laser, en reliant les données à un cadre de coordonnées commun. Enfin, vous avez écrit votre propre nœud pour publier des transformations statiques sur tf2 et appris à publier les transformations statiques requises à l'aide de l'exécutable ``static_transform_publisher`` et des fichiers de lancement.
