Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Tutorials/Beginner-CLI-Tools/Understanding-ROS2-Actions/Understanding-ROS2-Actions.po
Languages: fr

source: Understanding actions
fr: Comprendre les actions

source: **Goal:** Introspect actions in ROS 2.
fr: **Objectif :** Introspectez les actions dans ROS 2.

source: **Tutorial level:** Beginner
fr: **Niveau du tutoriel :** Débutant

source: **Time:** 15 minutes
fr: **Durée :** 15 minutes

source: Contents
fr: Contenu

source: Background
fr: Arrière-plan

source: Actions are one of the communication types in ROS 2 and are intended for long running tasks. They consist of three parts: a goal, feedback, and a result.
fr: Les actions sont l'un des types de communication dans ROS 2 et sont destinées aux tâches de longue durée. Ils se composent de trois parties : un objectif, des commentaires et un résultat.

source: Actions are built on topics and services. Their functionality is similar to services, except actions can be canceled. They also provide steady feedback, as opposed to services which return a single response.
fr: Les actions sont construites sur des thèmes et des services. Leur fonctionnalité est similaire à celle des services, sauf que les actions peuvent être annulées. Ils fournissent également une rétroaction constante, contrairement aux services qui renvoient une seule réponse.

source: Actions use a client-server model, similar to the publisher-subscriber model (described in the :doc:`topics tutorial <../Understanding-ROS2-Topics/Understanding-ROS2-Topics>`). An “action client” node sends a goal to an “action server” node that acknowledges the goal and returns a stream of feedback and a result.
fr: Les actions utilisent un modèle client-serveur, similaire au modèle éditeur-abonné (décrit dans le tutoriel :doc:`topics <../Understanding-ROS2-Topics/Understanding-ROS2-Topics>`). Un nœud « client d'action » envoie un objectif à un nœud « serveur d'action » qui reconnaît l'objectif et renvoie un flux de commentaires et un résultat.

source: Prerequisites
fr: Conditions préalables

source: This tutorial builds off concepts, like :doc:`nodes <../Understanding-ROS2-Nodes/Understanding-ROS2-Nodes>` and :doc:`topics <../Understanding-ROS2-Topics/Understanding-ROS2-Topics>`, covered in previous tutorials.
fr: Ce didacticiel s'appuie sur des concepts, tels que :doc:`nodes <../Understanding-ROS2-Nodes/Understanding-ROS2-Nodes>` et :doc:`topics <../Understanding-ROS2-Topics/Understanding-ROS2-Topics >`, couvert dans les tutoriels précédents.

source: This tutorial uses the :doc:`turtlesim package <../Introducing-Turtlesim/Introducing-Turtlesim>`.
fr: Ce didacticiel utilise le package :doc:`turtlesim <../Introducing-Turtlesim/Introducing-Turtlesim>`.

source: As always, don’t forget to source ROS 2 in :doc:`every new terminal you open <../Configuring-ROS2-Environment>`.
fr: Comme toujours, n'oubliez pas de sourcer ROS 2 dans :doc:`chaque nouveau terminal que vous ouvrez <../Configuring-ROS2-Environment>`.

source: Tasks
fr: Tâches

source: 1 Setup
fr: 1 Configuration

source: Start up the two turtlesim nodes, ``/turtlesim`` and ``/teleop_turtle``.
fr: Démarrez les deux nœuds turtlesim, ``/turtlesim`` et ``/teleop_turtle``.

source: Open a new terminal and run:
fr: Ouvrez un nouveau terminal et exécutez :

source: Open another terminal and run:
fr: Ouvrez un autre terminal et exécutez :

source: 2 Use actions
fr: 2 Actions d'utilisation

source: When you launch the ``/teleop_turtle`` node, you will see the following message in your terminal:
fr: Lorsque vous lancerez le nœud ``/teleop_turtle``, vous verrez le message suivant dans votre terminal :

source: Let’s focus on the second line, which corresponds to an action. (The first instruction corresponds to the “cmd_vel” topic, discussed previously in the :doc:`topics tutorial <../Understanding-ROS2-Topics/Understanding-ROS2-Topics>`.)
fr: Concentrons-nous sur la deuxième ligne, qui correspond à une action. (La première instruction correspond à la rubrique "cmd_vel", abordée précédemment dans le tutoriel :doc:`topics <../Understanding-ROS2-Topics/Understanding-ROS2-Topics>`.)

source: Notice that the letter keys ``G|B|V|C|D|E|R|T`` form a “box” around the ``F`` key on a US QWERTY keyboard (if you are not using a QWERTY keyboard, see `this link <https://upload.wikimedia.org/wikipedia/commons/d/da/KB_United_States.svg>`__ to follow along). Each key’s position around ``F`` corresponds to that orientation in turtlesim. For example, the ``E`` will rotate the turtle’s orientation to the upper left corner.
fr: Notez que les touches alphabétiques ``G|B|V|C|D|E|R|T`` forment une "boîte" autour de la touche ``F`` sur un clavier QWERTY américain (si vous n'utilisez pas un clavier QWERTY clavier, voir `ce lien <https://upload.wikimedia.org/wikipedia/commons/d/da/KB_United_States.svg>`__ pour suivre). La position de chaque touche autour de ``F`` correspond à cette orientation dans turtlesim. Par exemple, le ``E`` fera pivoter l'orientation de la tortue vers le coin supérieur gauche.

source: Pay attention to the terminal where the ``/turtlesim`` node is running. Each time you press one of these keys, you are sending a goal to an action server that is part of the ``/turtlesim`` node. The goal is to rotate the turtle to face a particular direction. A message relaying the result of the goal should display once the turtle completes its rotation:
fr: Faites attention au terminal sur lequel le nœud ``/turtlesim`` est exécuté. Chaque fois que vous appuyez sur l'une de ces touches, vous envoyez un objectif à un serveur d'action qui fait partie du nœud ``/turtlesim``. Le but est de faire pivoter la tortue pour faire face à une direction particulière. Un message relayant le résultat de l'objectif devrait s'afficher une fois que la tortue a terminé sa rotation :

source: The ``F`` key will cancel a goal mid-execution.
fr: La touche ``F`` annulera un objectif en cours d'exécution.

source: Try pressing the ``C`` key, and then pressing the ``F`` key before the turtle can complete its rotation. In the terminal where the ``/turtlesim`` node is running, you will see the message:
fr: Essayez d'appuyer sur la touche ``C``, puis appuyez sur la touche ``F`` avant que la tortue puisse terminer sa rotation. Dans le terminal où le nœud ``/turtlesim`` est en cours d'exécution, vous verrez le message :

source: Not only can the client-side (your input in the teleop) stop a goal, but the server-side (the ``/turtlesim`` node) can as well. When the server-side chooses to stop processing a goal, it is said to “abort” the goal.
fr: Non seulement le côté client (votre entrée dans le teleop) peut arrêter un objectif, mais le côté serveur (le nœud ``/turtlesim``) le peut également. Lorsque le côté serveur choisit d'arrêter de traiter un objectif, on dit qu'il "interrompt" l'objectif.

source: Try hitting the ``D`` key, then the ``G`` key before the first rotation can complete. In the terminal where the ``/turtlesim`` node is running, you will see the message:
fr: Essayez d'appuyer sur la touche ``D``, puis sur la touche ``G`` avant que la première rotation puisse se terminer. Dans le terminal où le nœud ``/turtlesim`` est en cours d'exécution, vous verrez le message :

source: This action server chose to abort the first goal because it got a new one. It could have chosen something else, like reject the new goal or execute the second goal after the first one finished. Don't assume every action server will choose to abort the current goal when it gets a new one.
fr: Ce serveur d'action a choisi d'abandonner le premier objectif car il en a obtenu un nouveau. Il aurait pu choisir autre chose, comme rejeter le nouveau but ou exécuter le deuxième but après la fin du premier. Ne présumez pas que chaque serveur d'action choisira d'abandonner l'objectif actuel lorsqu'il en obtiendra un nouveau.

source: 3 ros2 node info
fr: 3 infos nœud ros2

source: To see the ``/turtlesim`` node’s actions, open a new terminal and run the command:
fr: Pour voir les actions du nœud ``/turtlesim``, ouvrez un nouveau terminal et exécutez la commande :

source: Which will return a list of ``/turtlesim``’s subscribers, publishers, services, action servers and action clients:
fr: Ce qui renverra une liste des abonnés, éditeurs, services, serveurs d'action et clients d'action de ``/turtlesim`` :

source: Notice that the ``/turtle1/rotate_absolute`` action for ``/turtlesim`` is under ``Action Servers``. This means ``/turtlesim`` responds to and provides feedback for the ``/turtle1/rotate_absolute`` action.
fr: Notez que l'action ``/turtle1/rotate_absolute`` pour ``/turtlesim`` se trouve sous ``Action Servers``. Cela signifie que ``/turtlesim`` répond et fournit des commentaires pour l'action ``/turtle1/rotate_absolute``.

source: The ``/teleop_turtle`` node has the name ``/turtle1/rotate_absolute`` under ``Action Clients`` meaning that it sends goals for that action name.
fr: Le nœud ``/teleop_turtle`` porte le nom ``/turtle1/rotate_absolute`` sous ``Action Clients``, ce qui signifie qu'il envoie des objectifs pour ce nom d'action.

source: Which will return:
fr: Qui reviendra :

source: 4 ros2 action list
fr: 4 liste d'actions ros2

source: To identify all the actions in the ROS graph, run the command:
fr: Pour identifier toutes les actions dans le graphe ROS, exécutez la commande :

source: This is the only action in the ROS graph right now. It controls the turtle’s rotation, as you saw earlier. You also already know that there is one action client (part of ``/teleop_turtle``) and one action server (part of ``/turtlesim``) for this action from using the ``ros2 node info <node_name>`` command.
fr: C'est la seule action dans le graphique ROS en ce moment. Il contrôle la rotation de la tortue, comme vous l'avez vu précédemment. Vous savez également déjà qu'il existe un client d'action (partie de ``/teleop_turtle``) et un serveur d'action (partie de ``/turtlesim``) pour cette action en utilisant le ``ros2 node info <node_name>`` commande.

source: 4.1 ros2 action list -t
fr: 4.1 liste d'actions ros2 -t

source: Actions have types, similar to topics and services. To find ``/turtle1/rotate_absolute``'s type, run the command:
fr: Les actions ont des types, similaires aux rubriques et aux services. Pour trouver le type de ``/turtle1/rotate_absolute``, exécutez la commande :

source: In brackets to the right of each action name (in this case only ``/turtle1/rotate_absolute``) is the action type, ``turtlesim/action/RotateAbsolute``. You will need this when you want to execute an action from the command line or from code.
fr: Entre parenthèses à droite de chaque nom d'action (dans ce cas uniquement ``/turtle1/rotate_absolute``) se trouve le type d'action, ``turtlesim/action/RotateAbsolute``. Vous en aurez besoin lorsque vous souhaitez exécuter une action à partir de la ligne de commande ou du code.

source: 5 ros2 action info
fr: 5 informations d'action ros2

source: You can further introspect the ``/turtle1/rotate_absolute`` action with the command:
fr: Vous pouvez examiner plus en détail l'action ``/turtle1/rotate_absolute`` avec la commande :

source: Which will return
fr: Qui reviendra

source: This tells us what we learned earlier from running ``ros2 node info`` on each node: The ``/teleop_turtle`` node has an action client and the ``/turtlesim`` node has an action server for the ``/turtle1/rotate_absolute`` action.
fr: Cela nous indique ce que nous avons appris plus tôt en exécutant ``ros2 node info`` sur chaque nœud : le nœud ``/teleop_turtle`` a un client d'action et le nœud ``/turtlesim`` a un serveur d'action pour le ``/ action tortue1/rotate_absolute``.

source: 6 ros2 interface show
fr: 6 spectacle d'interface ros2

source: One more piece of information you will need before sending or executing an action goal yourself is the structure of the action type.
fr: Une autre information dont vous aurez besoin avant d'envoyer ou d'exécuter vous-même un objectif d'action est la structure du type d'action.

source: Recall that you identified ``/turtle1/rotate_absolute``’s type when running the command ``ros2 action list -t``. Enter the following command with the action type in your terminal:
fr: Rappelez-vous que vous avez identifié le type de ``/turtle1/rotate_absolute`` lors de l'exécution de la commande ``ros2 action list -t``. Entrez la commande suivante avec le type d'action dans votre terminal :

source: The first section of this message, above the ``---``, is the structure (data type and name) of the goal request. The next section is the structure of the result. The last section is the structure of the feedback.
fr: La première section de ce message, au-dessus du ``---``, est la structure (type de données et nom) de la demande d'objectif. La section suivante est la structure du résultat. La dernière section est la structure de la rétroaction.

source: Now let’s send an action goal from the command line with the following syntax:
fr: Envoyons maintenant un objectif d'action depuis la ligne de commande avec la syntaxe suivante :

source: ``<values>`` need to be in YAML format.
fr: ``<values>`` doit être au format YAML.

source: Keep an eye on the turtlesim window, and enter the following command into your terminal:
fr: Gardez un œil sur la fenêtre de turtlesim et saisissez la commande suivante dans votre terminal :

source: You should see the turtle rotating, as well as the following message in your terminal:
fr: Vous devriez voir la tortue tourner, ainsi que le message suivant dans votre terminal :

source: All goals have a unique ID, shown in the return message. You can also see the result, a field with the name ``delta``, which is the displacement to the starting position.
fr: Tous les objectifs ont un identifiant unique, indiqué dans le message de retour. Vous pouvez également voir le résultat, un champ avec le nom ``delta``, qui est le déplacement vers la position de départ.

source: To see the feedback of this goal, add ``--feedback`` to the ``ros2 action send_goal`` command:
fr: Pour voir les commentaires de cet objectif, ajoutez ``--feedback`` à la commande ``ros2 action send_goal`` :

source: Your terminal will return the message:
fr: Votre terminal renverra le message :

source: You will continue to receive feedback, the remaining radians, until the goal is complete.
fr: Vous continuerez à recevoir des commentaires, les radians restants, jusqu'à ce que l'objectif soit atteint.

source: Summary
fr: Résumé

source: Actions are like services that allow you to execute long running tasks, provide regular feedback, and are cancelable.
fr: Les actions sont comme des services qui vous permettent d'exécuter des tâches longues, de fournir des commentaires réguliers et qui peuvent être annulées.

source: A robot system would likely use actions for navigation. An action goal could tell a robot to travel to a position. While the robot navigates to the position, it can send updates along the way (i.e. feedback), and then a final result message once it's reached its destination.
fr: Un système de robot utiliserait probablement des actions pour la navigation. Un objectif d'action pourrait dire à un robot de se déplacer vers une position. Pendant que le robot navigue vers la position, il peut envoyer des mises à jour en cours de route (c'est-à-dire des commentaires), puis un message de résultat final une fois qu'il a atteint sa destination.

source: Turtlesim has an action server that action clients can send goals to for rotating turtles. In this tutorial, you introspected that action, ``/turtle1/rotate_absolute``, to get a better idea of what actions are and how they work.
fr: Turtlesim dispose d'un serveur d'action auquel les clients d'action peuvent envoyer des objectifs pour la rotation des tortues. Dans ce didacticiel, vous avez introspecté cette action, ``/turtle1/rotate_absolute``, pour avoir une meilleure idée de ce que sont les actions et de leur fonctionnement.

source: Next steps
fr: Prochaines étapes

source: Now you've covered all of the core ROS 2 concepts. The last few tutorials in the "Users" set will introduce you to some tools and techniques that will make using ROS 2 easier, starting with :doc:`../Using-Rqt-Console/Using-Rqt-Console`.
fr: Vous avez maintenant couvert tous les concepts de base de ROS 2. Les derniers tutoriels de l'ensemble "Utilisateurs" vous présenteront quelques outils et techniques qui faciliteront l'utilisation de ROS 2, en commençant par :doc:`../Using-Rqt-Console/Using-Rqt-Console`.

source: Related content
fr: Contenu connexe

source: You can read more about the design decisions behind actions in ROS 2 `here <https://design.ros2.org/articles/actions.html>`__.
fr: Vous pouvez en savoir plus sur les décisions de conception derrière les actions dans ROS 2 `ici <https://design.ros2.org/articles/actions.html>`__.
