Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Tutorials/Beginner-CLI-Tools/Using-Rqt-Console/Using-Rqt-Console.po
Languages: fr

source: Using ``rqt_console`` to view logs
fr: Utilisation de ``rqt_console`` pour afficher les journaux

source: **Goal:** Get to know ``rqt_console``, a tool for introspecting log messages.
fr: **Objectif :** Apprenez à connaître ``rqt_console``, un outil d'introspection des messages de journal.

source: **Tutorial level:** Beginner
fr: **Niveau du tutoriel :** Débutant

source: **Time:** 5 minutes
fr: **Durée :** 5 minutes

source: Contents
fr: Contenu

source: Background
fr: Arrière-plan

source: ``rqt_console`` is a GUI tool used to introspect log messages in ROS 2. Typically, log messages show up in your terminal. With ``rqt_console``, you can collect those messages over time, view them closely and in a more organized manner, filter them, save them and even reload the saved files to introspect at a different time.
fr: ``rqt_console`` est un outil graphique utilisé pour analyser les messages de journalisation dans ROS 2. Généralement, les messages de journalisation s'affichent dans votre terminal. Avec ``rqt_console``, vous pouvez collecter ces messages au fil du temps, les visualiser de près et de manière plus organisée, les filtrer, les enregistrer et même recharger les fichiers enregistrés pour les introspecter à un moment différent.

source: Nodes use logs to output messages concerning events and status in a variety of ways. Their content is usually informational, for the sake of the user.
fr: Les nœuds utilisent des journaux pour générer des messages concernant les événements et l'état de diverses manières. Leur contenu est généralement informatif, pour le bien de l'utilisateur.

source: Prerequisites
fr: Conditions préalables

source: You will need :doc:`rqt_console and turtlesim <../Introducing-Turtlesim/Introducing-Turtlesim>` installed.
fr: Vous aurez besoin de :doc:`rqt_console et turtlesim <../Introducing-Turtlesim/Introducing-Turtlesim>` installés.

source: As always, don’t forget to source ROS 2 in :doc:`every new terminal you open <../Configuring-ROS2-Environment>`.
fr: Comme toujours, n'oubliez pas de sourcer ROS 2 dans :doc:`chaque nouveau terminal que vous ouvrez <../Configuring-ROS2-Environment>`.

source: Tasks
fr: Tâches

source: 1 Setup
fr: 1 Configuration

source: Start ``rqt_console`` in a new terminal with the following command:
fr: Démarrez ``rqt_console`` dans un nouveau terminal avec la commande suivante :

source: The ``rqt_console`` window will open:
fr: La fenêtre ``rqt_console`` s'ouvrira :

source: The first section of the console is where log messages from your system will display.
fr: La première section de la console est l'endroit où les messages de journal de votre système s'afficheront.

source: In the middle you have the option to filter messages by excluding severity levels. You can also add more exclusion filters using the plus-sign button to the right.
fr: Au milieu, vous avez la possibilité de filtrer les messages en excluant les niveaux de gravité. Vous pouvez également ajouter d'autres filtres d'exclusion à l'aide du bouton plus à droite.

source: The bottom section is for highlighting messages that include a string you input. You can add more filters to this section as well.
fr: La section inférieure sert à mettre en surbrillance les messages qui incluent une chaîne que vous avez saisie. Vous pouvez également ajouter d'autres filtres à cette section.

source: Now start ``turtlesim`` in a new terminal with the following command:
fr: Lancez maintenant ``turtlesim`` dans un nouveau terminal avec la commande suivante :

source: 2 Messages on rqt_console
fr: 2 messages sur rqt_console

source: To produce log messages for ``rqt_console`` to display, let’s have the turtle run into the wall. In a new terminal, enter the ``ros2 topic pub`` command (discussed in detail in the :doc:`topics tutorial <../Understanding-ROS2-Topics/Understanding-ROS2-Topics>`) below:
fr: Pour produire des messages de journal à afficher par ``rqt_console``, faisons courir la tortue contre le mur. Dans un nouveau terminal, entrez la commande ``ros2 topic pub`` (discutée en détail dans le :doc:`topics tutorial <../Understanding-ROS2-Topics/Understanding-ROS2-Topics>`) ci-dessous :

source: Since the above command is publishing the topic at a steady rate, the turtle is continuously running into the wall. In ``rqt_console`` you will see the same message with the ``Warn`` severity level displayed over and over, like so:
fr: Étant donné que la commande ci-dessus publie le sujet à un rythme régulier, la tortue se heurte continuellement au mur. Dans ``rqt_console``, vous verrez le même message avec le niveau de gravité ``Warn`` affiché encore et encore, comme ceci :

source: Press ``Ctrl+C`` in the terminal where you ran the ``ros2 topic pub`` command to stop your turtle from running into the wall.
fr: Appuyez sur ``Ctrl+C`` dans le terminal où vous avez exécuté la commande ``ros2 topic pub`` pour empêcher votre tortue de se heurter au mur.

source: 3 Logger levels
fr: 3 niveaux d'enregistrement

source: ROS 2’s logger levels are ordered by severity:
fr: Les niveaux d'enregistrement de ROS 2 sont classés par gravité :

source: There is no exact standard for what each level indicates, but it’s safe to assume that:
fr: Il n'y a pas de norme exacte pour ce que chaque niveau indique, mais il est prudent de supposer que :

source: ``Fatal`` messages indicate the system is going to terminate to try to protect itself from detriment.
fr: Les messages ``Fatal`` indiquent que le système va s'arrêter pour essayer de se protéger de tout préjudice.

source: ``Error`` messages indicate significant issues that won't necessarily damage the system, but are preventing it from functioning properly.
fr: Les messages d'``erreur`` indiquent des problèmes importants qui n'endommageront pas nécessairement le système, mais qui l'empêchent de fonctionner correctement.

source: ``Warn`` messages indicate unexpected activity or non-ideal results that might represent a deeper issue, but don't harm functionality outright.
fr: Les messages ``Warn`` indiquent une activité inattendue ou des résultats non idéaux qui pourraient représenter un problème plus profond, mais ne nuisent pas purement et simplement à la fonctionnalité.

source: ``Info`` messages indicate event and status updates that serve as a visual verification that the system is running as expected.
fr: Les messages ``Info`` indiquent des mises à jour d'événements et d'états qui servent de vérification visuelle que le système fonctionne comme prévu.

source: ``Debug`` messages detail the entire step-by-step process of the system execution.
fr: Les messages ``Debug`` détaillent l'ensemble du processus étape par étape de l'exécution du système.

source: The default level is ``Info``. You will only see messages of the default severity level and more-severe levels.
fr: Le niveau par défaut est ``Info``. Vous ne verrez que les messages du niveau de gravité par défaut et des niveaux plus graves.

source: Normally, only ``Debug`` messages are hidden because they’re the only level less severe than ``Info``. For example, if you set the default level to ``Warn``, you would only see messages of severity ``Warn``, ``Error``, and ``Fatal``.
fr: Normalement, seuls les messages ``Debug`` sont cachés car ils sont le seul niveau moins sévère que ``Info``. Par exemple, si vous définissez le niveau par défaut sur ``Warn``, vous ne verrez que les messages de gravité ``Warn``, ``Error`` et ``Fatal``.

source: 3.1 Set the default logger level
fr: 3.1 Définir le niveau d'enregistrement par défaut

source: You can set the default logger level when you first run the ``/turtlesim`` node using remapping. Enter the following command in your terminal:
fr: Vous pouvez définir le niveau d'enregistrement par défaut lors de la première exécution du nœud ``/turtlesim`` en utilisant le remappage. Saisissez la commande suivante dans votre terminal :

source: Now you won’t see the initial ``Info`` level warnings that came up in the console last time you started ``turtlesim``. That’s because ``Info`` messages are lower priority than the new default severity, ``Warn``.
fr: Maintenant, vous ne verrez plus les avertissements initiaux de niveau ``Info`` qui sont apparus dans la console la dernière fois que vous avez lancé ``turtlesim``. En effet, les messages ``Info`` ont une priorité inférieure à la nouvelle sévérité par défaut, ``Warn``.

source: Summary
fr: Résumé

source: ``rqt_console`` can be very helpful if you need to closely examine the log messages from your system. You might want to examine log messages for any number of reasons, usually to find out where something went wrong and the series of events leading up to that.
fr: ``rqt_console`` peut être très utile si vous avez besoin d'examiner de près les messages du journal de votre système. Vous voudrez peut-être examiner les messages du journal pour un certain nombre de raisons, généralement pour savoir où quelque chose s'est mal passé et la série d'événements qui ont conduit à cela.

source: Next steps
fr: Prochaines étapes

source: The next tutorial will teach you about starting multiple nodes at once with :doc:`ROS 2 Launch <../Launching-Multiple-Nodes/Launching-Multiple-Nodes>`.
fr: Le prochain didacticiel vous apprendra comment démarrer plusieurs nœuds à la fois avec :doc:`ROS 2 Launch <../Launching-Multiple-Nodes/Launching-Multiple-Nodes>`.
