Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Tutorials/Intermediate/Testing/Python.po
Languages: fr

source: Writing Basic Tests with Python
fr: Écrire des tests de base avec Python

source: Starting point: we'll assume you have a :ref:`basic ament_python package<CreatePkg>` set up already and you want to add some tests to it.
fr: Point de départ : nous supposerons que vous avez déjà configuré un :ref:`basic ament_python package<CreatePkg>` et que vous souhaitez y ajouter des tests.

source: If you are using ament_cmake_python, refer to the the :doc:`ament_cmake_python docs<../../../How-To-Guides/Ament-CMake-Python-Documentation>` for how to make tests dicoverable. The test contents and invocation with ``colcon`` remain the same.
fr: Si vous utilisez ament_cmake_python, reportez-vous à la :doc:`ament_cmake_python docs<../../../How-To-Guides/Ament-CMake-Python-Documentation>` pour savoir comment rendre les tests détectables. Le contenu du test et l'invocation avec ``colcon`` restent les mêmes.

source: Package Setup
fr: Configuration du paquet

source: Your ``setup.py`` must a test dependency on ``pytest`` within the call to ``setup(...)``:
fr: Votre ``setup.py`` doit avoir une dépendance de test sur ``pytest`` dans l'appel à ``setup(...)`` :

source: Test Files and Folders
fr: Fichiers et dossiers de test

source: Your test code needs to go in a folder named ``tests`` in the root of your package.
fr: Votre code de test doit aller dans un dossier nommé ``tests`` à la racine de votre package.

source: Any file that contains tests that you want to run must have the pattern ``test_FOO.py`` where ``FOO`` can be replaced with anything.
fr: Tout fichier contenant des tests que vous souhaitez exécuter doit avoir le modèle ``test_FOO.py`` où ``FOO`` peut être remplacé par n'importe quoi.

source: Example package layout:
fr: Exemple de mise en page du package :

source: Test Contents
fr: Contenu des tests

source: You can now write tests to your heart's content. There are `plenty of resources on pytest <https://docs.pytest.org>`__, but in short, you can write functions with the ``test_`` prefix and include whatever assert statements you'd like.
fr: Vous pouvez maintenant écrire des tests à votre guise. Il y a `beaucoup de ressources sur pytest <https://docs.pytest.org>`__, mais en bref, vous pouvez écrire des fonctions avec le préfixe ``test_`` et inclure les déclarations assert que vous souhaitez.

source: Special Commands
fr: Commandes spéciales

source: Beyond the :doc:`standard colcon testing commands <CLI>` you can also specify arguments to the ``pytest`` framework from the command line with the ``--pytest-args`` flag. For example, you can specify the name of the function to run with
fr: Au-delà des :doc:`commandes standard de test colcon <CLI>`, vous pouvez également spécifier des arguments au framework ``pytest`` à partir de la ligne de commande avec le drapeau ``--pytest-args``. Par exemple, vous pouvez spécifier le nom de la fonction à exécuter avec
