Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Tutorials/Intermediate/Testing/Testing-Main.po
Languages: fr

source: Testing
fr: Essai

source: Why automatic tests?
fr: Pourquoi des tests automatiques ?

source: Here are some of the many good reasons why should we have automated tests:
fr: Voici quelques-unes des nombreuses bonnes raisons pour lesquelles nous devrions avoir des tests automatisés :

source: You can make incremental updates to your code more quickly. ROS has hundreds of packages with many interdependencies, so it can be hard to anticipate the problems a small change might cause. If your change passes the unit tests, you can be more confident that you haven't introduced problems — or at least the problems aren't your fault.
fr: Vous pouvez effectuer des mises à jour incrémentielles de votre code plus rapidement. ROS a des centaines de packages avec de nombreuses interdépendances, il peut donc être difficile d'anticiper les problèmes qu'un petit changement pourrait causer. Si votre modification réussit les tests unitaires, vous pouvez être plus sûr que vous n'avez pas introduit de problèmes - ou du moins que les problèmes ne sont pas de votre faute.

source: You can refactor your code with greater confidence. Passing the unit tests verifies that you haven't introduced any bugs while refactoring. This gives you this wonderful freedom from change fear!
fr: Vous pouvez refactoriser votre code avec plus de confiance. La réussite des tests unitaires vérifie que vous n'avez introduit aucun bogue lors de la refactorisation. Cela vous donne cette merveilleuse liberté de la peur du changement !

source: It leads to better designed code. Unit tests force you to write your code so that it can be more easily tested. This often means keeping your underlying functions and framework separate, which is one of our design goals with ROS code.
fr: Cela conduit à un code mieux conçu. Les tests unitaires vous obligent à écrire votre code afin qu'il puisse être testé plus facilement. Cela signifie souvent que vos fonctions sous-jacentes et votre framework sont séparés, ce qui est l'un de nos objectifs de conception avec le code ROS.

source: They prevent recurring bugs (bug regressions). It's a good practice to write a unit test for every bug you fix. In fact, write the unit test before you fix the bug. This will help you to precisely, or even deterministically, reproduce the bug, and much more precisely understand what the problem is. As a result, you will also create a better patch, which you can then test with your regression test to verify that the bug is fixed. That way the bug won't accidentally get reintroduced if the code gets modified later on. It also means that it will be easier to convince the reviewer of the patch that the problem is solved, and the contribution is of high quality.
fr: Ils évitent les bugs récurrents (régressions de bugs). C'est une bonne pratique d'écrire un test unitaire pour chaque bogue que vous corrigez. En fait, écrivez le test unitaire avant de corriger le bogue. Cela vous aidera à reproduire précisément, voire de manière déterministe, le bug, et à comprendre beaucoup plus précisément quel est le problème. En conséquence, vous créerez également un meilleur correctif, que vous pourrez ensuite tester avec votre test de régression pour vérifier que le bogue est corrigé. De cette façon, le bogue ne sera pas accidentellement réintroduit si le code est modifié ultérieurement. Cela signifie également qu'il sera plus facile de convaincre l'examinateur du correctif que le problème est résolu et que la contribution est de haute qualité.

source: Other people can work on your code more easily (an automatic form of documentation). It can be hard to figure out whether or not you've broken someone else's code when you make a change. The unit tests are a tool for other developers to validate their changes. Automatic tests document your coding decisions, and communicate to other developers automatically about their violation. Thus tests become documentation for your code — a documentation that does not need to be read for the most time, and when it does need to be inspected the test system will precisely indicate what to read (which tests fail). By writing automatic tests you make other contributors faster. This improves the entire ROS project.
fr: D'autres personnes peuvent travailler plus facilement sur votre code (une forme automatique de documentation). Il peut être difficile de déterminer si vous avez ou non cassé le code de quelqu'un d'autre lorsque vous apportez une modification. Les tests unitaires sont un outil permettant aux autres développeurs de valider leurs modifications. Les tests automatiques documentent vos décisions de codage et informent automatiquement les autres développeurs de leur violation. Ainsi, les tests deviennent une documentation pour votre code - une documentation qui n'a pas besoin d'être lue la plupart du temps, et lorsqu'elle doit être inspectée, le système de test indiquera précisément ce qu'il faut lire (quels tests échouent). En écrivant des tests automatiques, vous rendez les autres contributeurs plus rapides. Cela améliore l'ensemble du projet ROS.

source: It is much easier to become a contributor to ROS if we have automated unit tests. It is very difficult for new external developers to contribute to your components. When they make changes to code, they are often doing it in the blind, driven by a lot of guesswork. By providing a harness of automated tests, you help them in the task. They get immediate feedback for their changes. It becomes easier to contribute to a project, and new contributors to join more easily. Also their first contributions are of higher quality, which decreases the workload on maintainers. A win-win!
fr: Il est beaucoup plus facile de devenir contributeur de ROS si nous avons des tests unitaires automatisés. Il est très difficile pour les nouveaux développeurs externes de contribuer à vos composants. Lorsqu'ils apportent des modifications au code, ils le font souvent à l'aveugle, motivés par de nombreuses conjectures. En leur fournissant un harnais de tests automatisés, vous les aidez dans la tâche. Ils reçoivent un retour immédiat sur leurs modifications. Il devient plus facile de contribuer à un projet, et de nouveaux contributeurs de se joindre plus facilement. De plus, leurs premières contributions sont de meilleure qualité, ce qui diminue la charge de travail des mainteneurs. Un gagnant-gagnant!

source: Automatic tests simplify maintainership. Especially for mature packages, which change more slowly, and mostly need to be updated to new dependencies, an automatic test suite helps to very quickly establish whether the package still works. This makes it much easier to decide whether the package is still supported or not.
fr: Les tests automatiques simplifient la maintenance. En particulier pour les packages matures, qui changent plus lentement et doivent principalement être mis à jour avec de nouvelles dépendances, une suite de tests automatiques permet de déterminer très rapidement si le package fonctionne toujours. Il est ainsi beaucoup plus facile de décider si le package est toujours pris en charge ou non.

source: Automatic tests amplify the value of Continuous Integration. Regression tests, along with normal scenario-based requirements tests, contribute to overall body of automated tests for your component. Your component is better tested against evolution of other APIs that it depends on (CI servers will tell you better and more precisely what problems develop in your code).
fr: Les tests automatiques amplifient la valeur de l'intégration continue. Les tests de régression, ainsi que les tests d'exigences basés sur des scénarios normaux, contribuent à l'ensemble des tests automatisés pour votre composant. Votre composant est mieux testé par rapport à l'évolution des autres API dont il dépend (les serveurs CI vous diront mieux et plus précisément quels problèmes se développent dans votre code).

source: Perhaps the most important benefit of writing tests is that tests make you a good citizen. Tests influence quality in the long term. It is a well accepted practice in many open-source projects. By writing regressions tests, you are contributing to long term quality of the ROS ecosystem.
fr: L'avantage le plus important de la rédaction de tests est peut-être que les tests font de vous un bon citoyen. Les tests influencent la qualité à long terme. C'est une pratique bien acceptée dans de nombreux projets open source. En écrivant des tests de régression, vous contribuez à la qualité à long terme de l'écosystème ROS.

source: Is this all coming for free?
fr: Tout cela est-il gratuit ?

source: Of course, there is never free lunch. To get the benefits of testing, some investment is necessary.
fr: Bien sûr, il n'y a jamais de déjeuner gratuit. Pour bénéficier des avantages des tests, certains investissements sont nécessaires.

source: You need to develop a test, which sometimes may be difficult or costly. Sometimes it might also be nontrivial, as the test should be automatic. Things get particularly hairy if your tests should involve special hardware (they should not: try to use simulation, mock the hardware, or narrow down the test to a smaller software problem) or require external environment, for instance human operators.
fr: Vous devez développer un test, ce qui peut parfois être difficile ou coûteux. Parfois, cela peut aussi être non trivial, car le test doit être automatique. Les choses deviennent particulièrement délicates si vos tests doivent impliquer un matériel spécial (ils ne doivent pas : essayer d'utiliser la simulation, se moquer du matériel ou limiter le test à un problème logiciel plus petit) ou nécessiter un environnement externe, par exemple des opérateurs humains.

source: Regression tests and other automatic tests need to be maintained. When the design of the component changes, a lot of tests become invalidated (for instance they no longer compile, or throw runtime exceptions related to the API design). These tests fail not only because the redesign re-introduced bugs but also because they need to be updated to the new design. Occasionally, with bigger redesigns, old regression tests should be dropped.
fr: Les tests de régression et autres tests automatiques doivent être maintenus. Lorsque la conception du composant change, de nombreux tests deviennent invalides (par exemple, ils ne compilent plus ou lèvent des exceptions d'exécution liées à la conception de l'API). Ces tests échouent non seulement parce que la refonte a réintroduit des bogues, mais aussi parce qu'ils doivent être mis à jour avec la nouvelle conception. Occasionnellement, avec des remaniements plus importants, les anciens tests de régression doivent être abandonnés.

source: Large bodies of tests can take a long time to run, which can increase Continuous Integration server costs.
fr: L'exécution de grands ensembles de tests peut prendre beaucoup de temps, ce qui peut augmenter les coûts du serveur d'intégration continue.

source: Available Tutorials:
fr: Tutoriels disponibles :
