Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Installation/DDS-Implementations/Install-Connext-University-Eval.po
Languages: fr

source: RTI Connext DDS
fr: RTI Connect DDS

source: A libraries-only version of RTI Connext DDS 6.0.1 may be installed per the :doc:`installation instructions <../../Installation>` for Debian/Ubuntu Linux (amd64) platforms only, under a `non-commercial license <https://www.rti.com/ncl>`__.
fr: Une version bibliothèques uniquement de RTI Connext DDS 6.0.1 peut être installée selon les :doc:`instructions d'installation <../../Installation>` pour les plates-formes Debian/Ubuntu Linux (amd64) uniquement, sous une licence `non commerciale licence <https://www.rti.com/ncl>`__.

source: A full-suite installation of RTI Connext DDS is available for many additional platforms, for universities, evaluation, or purchase. This installation includes diagnostic tools, layered services, and security. See below for installation details.
fr: Une installation complète de RTI Connext DDS est disponible pour de nombreuses plates-formes supplémentaires, pour les universités, l'évaluation ou l'achat. Cette installation comprend des outils de diagnostic, des services en couches et la sécurité. Voir ci-dessous pour les détails d'installation.

source: RTI University Program
fr: Programme universitaire RTI

source: University researchers and classroom users may be eligible for a free academic license through the `RTI University Program <https://www.rti.com/free-trial/university-program>`__. This includes a one-year (renewable) license to the unabridged version of Connext DDS Secure, which includes diagnostic tools and layered services. The university license application can be found `here <https://www.rti.com/free-trial/university-program>`__.
fr: Les chercheurs universitaires et les utilisateurs de salles de classe peuvent être éligibles à une licence académique gratuite via le `Programme universitaire RTI <https://www.rti.com/free-trial/university-program>`__. Cela inclut une licence d'un an (renouvelable) pour la version intégrale de Connext DDS Secure, qui comprend des outils de diagnostic et des services en couches. La demande de licence universitaire peut être trouvée `ici <https://www.rti.com/free-trial/university-program>`__.

source: RTI Connext DDS Evaluation
fr: Évaluation RTI Connext DDS

source: To install RTI Connext DDS **version 6.0.1** Evalution:
fr: Pour installer RTI Connext DDS **version 6.0.1** Évaluation :

source: Visit the `RTI Free Trial (6.0.1) site <https://www.rti.com/free-trial>`__.
fr: Visitez le site `RTI Free Trial (6.0.1) <https://www.rti.com/free-trial>`__.

source: Download the version(s) to match your environment.
fr: Téléchargez la ou les versions correspondant à votre environnement.

source: Contact license@rti.com for an evaluation license.
fr: Contactez license@rti.com pour une licence d'évaluation.

source: Install RTI Connext 6.0.1 by running the installation program. When finished, it will run the RTI Launcher.
fr: Installez RTI Connext 6.0.1 en exécutant le programme d'installation. Une fois terminé, il exécutera le lanceur RTI.

source: Use the RTI Launcher to install the license file (rti_license.dat) if needed. The launcher may also be used to launch the diagnostic tools and services.
fr: Utilisez le lanceur RTI pour installer le fichier de licence (rti_license.dat) si nécessaire. Le lanceur peut également être utilisé pour lancer les outils et services de diagnostic.
