Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Installation/DDS-Implementations/Install-Connext-Security-Plugins.po
Languages: fr

source: Connext security plugins
fr: Plugins de sécurité Connect

source: The Connext DDS Libraries are included with ROS 2 under a `non-commercial license <https://www.rti.com/ncl>`__ and do not include the security plug-in libraries. These libraries are available in the commercial, university and research license versions of RTI Connext DDS Pro, which is bundled with tools for system debugging, monitoring, record/replay, etc.
fr: Les bibliothèques Connext DDS sont incluses avec ROS 2 sous une `licence non commerciale <https://www.rti.com/ncl>`__ et n'incluent pas les bibliothèques de plug-ins de sécurité. Ces bibliothèques sont disponibles dans les versions de licence commerciale, universitaire et de recherche de RTI Connext DDS Pro, qui est fourni avec des outils de débogage du système, de surveillance, d'enregistrement/relecture, etc.

source: The Connext DDS Evaluation Version (6.0.1) includes the security plugins, and can be downloaded via options available for :doc:`university, purchase or evaluation <Install-Connext-University-Eval>`.
fr: La version d'évaluation Connext DDS (6.0.1) inclut les plugins de sécurité et peut être téléchargée via les options disponibles pour :doc:`university, achat ou évaluation <Install-Connext-University-Eval>`.

source: A video walk-thru of this installation (tools and security plug-ins) is available `here <https://www.rti.com/gettingstarted/installwindows_secure>`__ at the RTI website. The steps are:
fr: Une présentation vidéo de cette installation (outils et plug-ins de sécurité) est disponible `ici <https://www.rti.com/gettingstarted/installwindows_secure>`__ sur le site Web de RTI. Les étapes sont :

source: **Install Connext DDS Pro (Host)** This is a host-specific installer application (for Windows, Linux, MacOS) to install a 'Host' bundle which includes the Launcher, tools, and other software services. At the end of the installation, the RTI 'Launcher' program will be started. The Launcher is used to install target libraries, security plugins, and other layered services.
fr: **Installer Connext DDS Pro (hôte)** Il s'agit d'une application d'installation spécifique à l'hôte (pour Windows, Linux, MacOS) pour installer un ensemble « hôte » qui comprend le lanceur, des outils et d'autres services logiciels. A la fin de l'installation, le programme RTI 'Launcher' sera lancé. Le lanceur est utilisé pour installer des bibliothèques cibles, des plug-ins de sécurité et d'autres services en couches.

source: **Use the Package Installer in Launcher**
fr: **Utilisez le programme d'installation du package dans le lanceur**

source: Launcher Image
fr: Image de lancement

source: The 'RTI Package Installer' is used to install '.rtipkg' files -- target libraries, security plug-ins, etc. Open the Package Installer and select all of the .rtipkg files that were included in the Connext DDS Secure bundle for installation:
fr: Le 'RTI Package Installer' est utilisé pour installer les fichiers '.rtipkg' -- bibliothèques cibles, plug-ins de sécurité, etc. Ouvrez le Package Installer et sélectionnez tous les fichiers .rtipkg qui ont été inclus dans le bundle Connext DDS Secure pour l'installation :

source: Target Libraries - such as: rti\_connext\_dds-[version]-pro-target-[toolchain].rtipkg
fr: Bibliothèques cibles - telles que : rti\_connext\_dds-[version]-pro-target-[toolchain].rtipkg

source: Security Plugin Host - such as: rti\_security\_plugins-[version]-host-[toolchain].rtipkg
fr: Hôte du plug-in de sécurité - tel que : rti\_security\_plugins-[version]-host-[toolchain].rtipkg

source: Security Plugin Target - such as: rti\_security\_plugins-[version]-target-[toolchain].rtipkg
fr: Cible du plug-in de sécurité - par exemple : rti\_security\_plugins-[version]-target-[toolchain].rtipkg

source: OpenSSL Host - such as: openssl-1.0.2x-[version]-host-[toolchain].rtipkg
fr: Hôte OpenSSL - tel que : openssl-1.0.2x-[version]-host-[chaîne d'outils].rtipkg

source: **Extract and Install OpenSSL** This is included as an archive (.zip or otherwise) and can be simply extracted and copied to a convenient location on your host computer. As a suggestion, this could also be installed into the 'rti\_connext\_dds-[version]' directory in your home directory space (this was created during installation of the RTI host tools). Note: this directory location may need to be placed in your PATH environment variable. See the `RTI Security Plugins Getting Started Guide <https://community.rti.com/static/documentation/connext-dds/6.0.1/doc/manuals/connext_dds/dds_security/RTI_SecurityPlugins_GettingStarted.pdf>`__ for more information.
fr: **Extraire et installer OpenSSL** Ceci est inclus sous forme d'archive (.zip ou autre) et peut être simplement extrait et copié vers un emplacement pratique sur votre ordinateur hôte. À titre de suggestion, cela pourrait également être installé dans le répertoire 'rti\_connext\_dds-[version]' dans votre espace de répertoire personnel (ceci a été créé lors de l'installation des outils hôtes RTI). Remarque : cet emplacement de répertoire peut devoir être placé dans votre variable d'environnement PATH. Consultez le `Guide de démarrage des plugins de sécurité RTI <https://community.rti.com/static/documentation/connext-dds/6.0.1/doc/manuals/connext_dds/dds_security/RTI_SecurityPlugins_GettingStarted.pdf>`__ pour plus d'informations.

source: Installation complete.
fr: Installation complète.
