Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Installation/DDS-Implementations/Working-with-eProsima-Fast-DDS.po
Languages: fr

source: eProsima Fast DDS
fr: DDS rapide eProsima

source: eProsima Fast DDS is a complete open-source DDS implementation for real time embedded architectures and operating systems. See also: https://www.eprosima.com/index.php/products-all/eprosima-fast-dds
fr: eProsima Fast DDS est une implémentation DDS open source complète pour les architectures embarquées et les systèmes d'exploitation en temps réel. Voir aussi : https://www.eprosima.com/index.php/products-all/eprosima-fast-dds

source: Prerequisites
fr: Conditions préalables

source: Have `rosdep installed <https://wiki.ros.org/rosdep#Installing_rosdep>`__
fr: Avoir `rosdep installé <https://wiki.ros.org/rosdep#Installing_rosdep>`__

source: Install packages
fr: Installer des packages

source: The easiest way is to install from ROS 2 apt repository.
fr: Le moyen le plus simple consiste à installer à partir du référentiel ROS 2 apt.

source: Build from source code
fr: Construire à partir du code source

source: Building from source code is also another way to install.
fr: Construire à partir du code source est également une autre façon d'installer.

source: First, clone Fast DDS and rmw_fastrtps in the ROS 2 workspace source directory.
fr: Tout d'abord, clonez Fast DDS et rmw_fastrtps dans le répertoire source de l'espace de travail ROS 2.

source: Then, install necessary packages for Fast DDS.
fr: Ensuite, installez les packages nécessaires pour Fast DDS.

source: Finally, run colcon build.
fr: Enfin, lancez colcon build.

source: Switch to rmw_fastrtps
fr: Passer à rmw_fastrtps

source: The eProsima Fast DDS RMW can be selected by specifying the environment variable:
fr: L'eProsima Fast DDS RMW peut être sélectionné en spécifiant la variable d'environnement :

source: See also: :doc:`Working with multiple RMW implementations <../../How-To-Guides/Working-with-multiple-RMW-implementations>`
fr: Voir aussi : :doc:`Travailler avec plusieurs implémentations RMW <../../How-To-Guides/Working-with-multiple-RMW-implementations>`

source: Run the talker and listener
fr: Exécutez le locuteur et l'auditeur

source: Now run ``talker`` and ``listener`` to test Fast DDS.
fr: Lancez maintenant ``talker`` et ``listener`` pour tester Fast DDS.
