Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Installation/DDS-Implementations/Working-with-GurumNetworks-GurumDDS.po
Languages: fr

source: rmw_gurumdds is a implementation of the ROS middleware interface using GurumNetworks GurumDDS. More information about GurumDDS is available on our website: https://gurum.cc/index_eng
fr: rmw_gurumdds est une implémentation de l'interface middleware ROS utilisant GurumNetworks GurumDDS. Plus d'informations sur GurumDDS sont disponibles sur notre site Web : https://gurum.cc/index_eng

source: Prerequisites
fr: Conditions préalables

source: The following description assumes that you have completed the 'Environment setup' process from the :doc:`Installing ROS 2 via Debian Packages <../Ubuntu-Install-Debians>` or from the :doc:`Building ROS 2 on Ubuntu Linux <../Alternatives/Ubuntu-Development-Setup>`.
fr: La description suivante suppose que vous avez terminé le processus de 'Configuration de l'environnement' à partir du :doc:`Installing ROS 2 via Debian Packages <../Ubuntu-Install-Debians>` ou du :doc:`Building ROS 2 on Ubuntu Linux <../Alternatives/Ubuntu-Development-Setup>`.

source: rmw_gurumdds requires version of GurumDDS-2.7.x. Debian packages of GurumDDS is provided in the ROS 2 apt repositories on linux. Windows binary installer of GurumDDS will be supported soon.
fr: rmw_gurumdds nécessite la version de GurumDDS-2.7.x. Les packages Debian de GurumDDS sont fournis dans les dépôts ROS 2 apt sous Linux. Le programme d'installation binaire Windows de GurumDDS sera bientôt pris en charge.

source: GurumDDS requires a license. See the next page: https://gurum.cc/free_trial_eng.html After getting a license, move it to the following location.
fr: GurumDDS nécessite une licence. Voir la page suivante : https://gurum.cc/free_trial_eng.html Après avoir obtenu une licence, déplacez-la à l'emplacement suivant.

source: DDS Version
fr: Version SDD

source: License Location
fr: Emplacement de la licence

source: /etc/flame
fr: /etc/flamme

source: Install packages
fr: Installer des packages

source: The easiest way is to install from ROS 2 apt repository. When ros-rolling-rmw-gurumdds-cpp is installed, gurumdds-2.7 is also installed.
fr: Le moyen le plus simple consiste à installer à partir du référentiel ROS 2 apt. Lorsque ros-rolling-rmw-gurumdds-cpp est installé, gurumdds-2.7 est également installé.

source: Build from source code
fr: Construire à partir du code source

source: Building from source code is also another way to install.
fr: Construire à partir du code source est également une autre façon d'installer.

source: First, clone rosidl_typesupport_gurumdds and rmw_gurumdds in the ROS 2 workspace source directory.
fr: Tout d'abord, clonez rosidl_typesupport_gurumdds et rmw_gurumdds dans le répertoire source de l'espace de travail ROS 2.

source: Then, install necessary packages for GurumDDS.
fr: Ensuite, installez les packages nécessaires pour GurumDDS.

source: Finally, run colcon build.
fr: Enfin, lancez colcon build.

source: Switch to rmw_gurumdds
fr: Passer à rmw_gurumdds

source: Switch from other rmw to rmw_gurumdds by specifying the environment variable.
fr: Passez d'un autre rmw à rmw_gurumdds en spécifiant la variable d'environnement.

source: See also: :doc:`Working with multiple RMW implementations <../../How-To-Guides/Working-with-multiple-RMW-implementations>`
fr: Voir aussi : :doc:`Travailler avec plusieurs implémentations RMW <../../How-To-Guides/Working-with-multiple-RMW-implementations>`

source: Run the talker and listener
fr: Exécutez le locuteur et l'auditeur

source: Now run ``talker`` and ``listener`` to test GurumDDS. Don't forget to set up environment by setup script.
fr: Lancez maintenant ``talker`` et ``listener`` pour tester GurumDDS. N'oubliez pas de configurer l'environnement par le script de configuration.
