Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Tutorials/Advanced/Simulators/Gazebo.po
Languages: fr

source: Setting up a robot simulation (Gazebo)
fr: Mise en place d'une simulation de robot (Gazebo)

source: **Goal:** Launch a Simulation with Gazebo and ROS 2
fr: **Objectif :** Lancer une simulation avec Gazebo et ROS 2

source: **Tutorial level:** Advanced
fr: **Niveau du didacticiel :** Avancé

source: **Time:** 20 minutes
fr: **Durée :** 20 minutes

source: Contents
fr: Contenu

source: Prerequisites
fr: Conditions préalables

source: First of all you should install ROS 2 and Gazebo. You have two options:
fr: Tout d'abord, vous devez installer ROS 2 et Gazebo. Vous avez deux options :

source: Install from deb packages. To check which versions are available from deb packages please check this `table <https://github.com/gazebosim/ros_ign>`__.
fr: Installer à partir des packages deb. Pour vérifier quelles versions sont disponibles à partir des packages deb, veuillez consulter ce `tableau <https://github.com/gazebosim/ros_ign>`__.

source: Compile from sources:
fr: Compiler à partir des sources :

source: :doc:`ROS 2 install instructions <../../../../Installation>`
fr: :doc:`Instructions d'installation de ROS 2 <../../../../Installation>`

source: `Gazebo install instructions <https://gazebosim.org/docs>`__
fr: `Instructions d'installation de Gazebo <https://gazebosim.org/docs>`__

source: Tasks
fr: Tâches

source: 1 Launch the simulation
fr: 1 Lancer la simulation

source: In this demo you are going to simulate a simple diff drive robot in Gazebo. You are going to use one of the worlds defined in the Gazebo examples called `visualize_lidar.sdf <https://github.com/gazebosim/gz-sim/blob/main/examples/worlds/visualize_lidar.sdf>`__. To run this example you should execute the following command in a terminal:
fr: Dans cette démo, vous allez simuler un simple robot à entraînement différentiel dans Gazebo. Vous allez utiliser l'un des mondes définis dans les exemples Gazebo appelé `visualize_lidar.sdf <https://github.com/gazebosim/gz-sim/blob/main/examples/worlds/visualize_lidar.sdf>`__. Pour exécuter cet exemple, vous devez exécuter la commande suivante dans un terminal :

source: When the simulation is running you can check the topics provided by Gazebo with the ``ign`` command line tool:
fr: Lorsque la simulation est en cours d'exécution, vous pouvez vérifier les sujets fournis par Gazebo avec l'outil de ligne de commande ``ign`` :

source: Which should show:
fr: Qui doit afficher :

source: Since you have not launched an ROS 2 nodes yet, the output from ``ros2 topic list`` should be free of any robot topics:
fr: Puisque vous n'avez pas encore lancé de nœuds ROS 2, la sortie de ``ros2 topic list`` devrait être exempte de tout robot topic :

source: 2 Configuring ROS 2
fr: 2 Configuration du ROS 2

source: To be able to communicate our simulation with ROS 2 you need to use a package called ``ros_gz_bridge``. This package provides a network bridge which enables the exchange of messages between ROS 2 and Gazebo Transport. You can install this package by typing:
fr: Pour pouvoir communiquer notre simulation avec ROS 2, vous devez utiliser un package appelé ``ros_gz_bridge``. Ce package fournit un pont réseau qui permet l'échange de messages entre ROS 2 et Gazebo Transport. Vous pouvez installer ce package en tapant :

source: At this point you are ready to launch a bridge from ROS to Gazebo. In particular you are going to create a bridge for the topic ``/model/vehicle_blue/cmd_vel``:
fr: À ce stade, vous êtes prêt à lancer un pont de ROS à Gazebo. En particulier, vous allez créer un pont pour le sujet ``/model/vehicle_blue/cmd_vel`` :

source: For more details about the ``ros_gz_bridge`` please check this `README <https://github.com/gazebosim/ros_gz/tree/ros2/ros_gz_bridge>`__ .
fr: Pour plus de détails sur le ``ros_gz_bridge``, veuillez consulter ce `README <https://github.com/gazebosim/ros_gz/tree/ros2/ros_gz_bridge>`__ .

source: Once the bridge is running the robot is able to follow your motor commands. There are two options:
fr: Une fois que le pont est en marche, le robot est capable de suivre vos commandes motrices. Il y a deux options :

source: Send a command to the topic using ``ros2 topic pub``
fr: Envoyez une commande au sujet en utilisant ``ros2 topic pub``

source: ``teleop_twist_keyboard`` package. This node takes keypresses from the keyboard and publishes them as Twist messages. You can install it typing:
fr: paquet ``teleop_twist_keyboard``. Ce nœud prend les touches du clavier et les publie sous forme de messages Twist. Vous pouvez l'installer en tapant :

source: The default topic where ``teleop_twist_keyboard`` is publishing Twist messages is ``/cmd_vel`` but you can remap this topic to make use of the topic used in the bridge:
fr: Le sujet par défaut où ``teleop_twist_keyboard`` publie les messages Twist est ``/cmd_vel`` mais vous pouvez remapper ce sujet pour utiliser le sujet utilisé dans le pont :

source: Which will show:
fr: Qui affichera :

source: 3 Visualizing lidar data in ROS 2
fr: 3 Visualisation des données lidar dans ROS 2

source: The diff drive robot has a lidar. To send the data generated by Gazebo to ROS 2, you need to launch another bridge. In the case the data from the lidar is provided in the Gazebo Transport topic ``/lidar2``, which you are going to remap in the bridge. This topic will be available under the topic ``/lidar_scan``:
fr: Le robot d'entraînement diff a un lidar. Pour envoyer les données générées par Gazebo vers ROS 2, vous devez lancer un autre pont. Dans le cas où les données du lidar sont fournies dans la rubrique Gazebo Transport ``/lidar2``, que vous allez remapper dans le pont. Ce sujet sera disponible sous le sujet ``/lidar_scan`` :

source: To visualize the data from the lidar in ROS 2 you can use Rviz2:
fr: Pour visualiser les données du lidar dans ROS 2, vous pouvez utiliser Rviz2 :

source: Then you need to configure the ``fixed frame``:
fr: Ensuite, vous devez configurer le ``cadre fixe`` :

source: And then click in the button "Add" to include a display to visualize the lidar:
fr: Et puis cliquez dans le bouton "Ajouter" pour inclure un affichage pour visualiser le lidar :

source: Now you should see the data from the lidar in Rviz2:
fr: Vous devriez maintenant voir les données du lidar dans Rviz2 :

source: Summary
fr: Résumé

source: In this tutorial, you launched a robot simulation with Gazebo, launched bridges with actuators and sensors, visualized data from a sensor, and moved a diff drive robot.
fr: Dans ce didacticiel, vous avez lancé une simulation de robot avec Gazebo, lancé des ponts avec des actionneurs et des capteurs, visualisé les données d'un capteur et déplacé un robot à entraînement différentiel.
