Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Tutorials/Advanced/Simulators/Webots.po
Languages: fr

source: The robot will use a standard ROS node to detect the wall and send motor commands to avoid it. In the ``my_package/my_package/`` folder, create a file named ``obstacle_avoider.py`` with this code:
fr: Le robot utilisera un nœud ROS standard pour détecter le mur et envoyer des commandes de moteur pour l'éviter. Dans le dossier ``my_package/my_package/``, créez un fichier nommé ``obstacle_avoider.py`` avec ce code :

source: This node will create a publisher for the command and subscribe to the sensors topics here:
fr: Ce nœud créera un éditeur pour la commande et s'abonnera aux sujets des capteurs ici :

source: When a measurement is received from the left sensor it will be copied to a member field:
fr: Lorsqu'une mesure est reçue du capteur gauche, elle est copiée dans un champ membre :

source: Finally, a message will be sent to the ``/cmd_vel`` topic when a measurement from the right sensor is received. The ``command_message`` will register at least a forward speed in ``linear.x`` in order to make the robot move when no obstacle is detected. If any of the two sensors detect an obstacle, ``command_message`` will also register a rotational speed in ``angular.z`` in order to make the robot turn right.
fr: Enfin, un message sera envoyé à la rubrique ``/cmd_vel`` lors de la réception d'une mesure du capteur droit. Le ``command_message`` enregistrera au moins une vitesse d'avancement dans ``linear.x`` afin de faire bouger le robot lorsqu'aucun obstacle n'est détecté. Si l'un des deux capteurs détecte un obstacle, ``command_message`` enregistrera également une vitesse de rotation dans ``angular.z`` afin de faire tourner le robot à droite.

source: 10 Updating setup.py and robot_launch.py
fr: 10 Mise à jour de setup.py et robot_launch.py

source: You have to modify these two other files to launch your new node. Edit ``setup.py`` and replace ``'console_scripts'`` with:
fr: Vous devez modifier ces deux autres fichiers pour lancer votre nouveau nœud. Modifiez ``setup.py`` et remplacez ``'console_scripts'`` par :

source: This will add an entry point for the ``obstacle_avoider`` node.
fr: Cela ajoutera un point d'entrée pour le nœud ``obstacle_avoider``.

source: Go to the file ``robot_launch.py`` and replace ``def generate_launch_description():`` with:
fr: Allez dans le fichier ``robot_launch.py`` et remplacez ``def generate_launch_description():`` par :

source: This will create an ``obstacle_avoider`` node that will be included in the ``LaunchDescription``.
fr: Cela créera un nœud ``obstacle_avoider`` qui sera inclus dans la ``LaunchDescription``.

source: 11 Test the obstacle avoidance code
fr: 11 Testez le code d'évitement d'obstacle

source: As in task ``7``, launch the simulation from a terminal in your ROS 2 workspace:
fr: Comme dans la tâche ``7``, lancez la simulation depuis un terminal dans votre espace de travail ROS 2 :

source: In a terminal of the host machine (not in the container), if not done already, specify the Webots installation folder (e.g. ``/Applications/Webots.app``) and start the server using the following commands:
fr: Dans un terminal de la machine hôte (pas dans le conteneur), si ce n'est déjà fait, spécifiez le dossier d'installation de Webots (par exemple ``/Applications/Webots.app``) et démarrez le serveur à l'aide des commandes suivantes :

source: Note that the server keeps running once the ROS 2 nodes are ended. You don't need to restart it every time you want to launch a new simulation. From the terminal of the Docker container, build and launch your custom package with:
fr: Notez que le serveur continue de fonctionner une fois que les nœuds ROS 2 sont terminés. Vous n'avez pas besoin de le redémarrer à chaque fois que vous souhaitez lancer une nouvelle simulation. Depuis le terminal du conteneur Docker, construisez et lancez votre package personnalisé avec :

source: Your robot should go forward and before hitting the wall it should turn clockwise. You can press ``Ctrl+F10`` in Webots or go to the ``View`` menu, ``Optional Rendering`` and ``Show DistanceSensor Rays`` to display the range of the distance sensors of the robot.
fr: Votre robot doit avancer et avant de toucher le mur, il doit tourner dans le sens des aiguilles d'une montre. Vous pouvez appuyer sur ``Ctrl+F10`` dans Webots ou aller dans le menu ``View``, ``Optional Rendering`` et ``Show DistanceSensor Rays`` pour afficher la portée des capteurs de distance du robot.

source: Summary
fr: Résumé

source: In this tutorial, you set-up a realistic robot simulation with Webots, implemented a Python plugin to control the motors of the robot, and implemented a ROS node using the sensors to avoid the obstacles.
fr: Dans ce didacticiel, vous avez configuré une simulation de robot réaliste avec Webots, implémenté un plugin Python pour contrôler les moteurs du robot et implémenté un nœud ROS utilisant les capteurs pour éviter les obstacles.

source: Next steps
fr: Prochaines étapes

source: You might want to improve the plugin or create new nodes to change the behavior of the robot. Taking inspiration from these previous tutorials could be a starting point:
fr: Vous voudrez peut-être améliorer le plugin ou créer de nouveaux nœuds pour modifier le comportement du robot. S'inspirer de ces tutoriels précédents pourrait être un point de départ :

source: :doc:`../../Intermediate/Tf2/Tf2-Main`.
fr: :doc:`../../Intermédiaire/Tf2/Tf2-Main`.
