Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Tutorials/Advanced/Simulators/Webots.po
Languages: fr

source: Setting up a robot simulation (Webots)
fr: Mise en place d'une simulation de robot (Webots)

source: **Goal:** Setup a robot simulation and control it from ROS 2.
fr: **Objectif :** Configurez une simulation de robot et contrôlez-la depuis ROS 2.

source: **Tutorial level:** Advanced
fr: **Niveau du didacticiel :** Avancé

source: **Time:** 20 minutes
fr: **Durée :** 20 minutes

source: Contents
fr: Contenu

source: Background
fr: Arrière-plan

source: Several robot simulators can be used with ROS 2, such as Gazebo, Webots, etc. Unlike turtlesim, they provide fairly realistic results relying on physics-based models for robots, sensors, actuators and objects. Hence, what you observe in simulation is very close to what you will get when transferring your ROS 2 controllers to a real robot. In this tutorial, you are going to use the Webots robot simulator to set-up and run a very simple ROS 2 simulation scenario.
fr: Plusieurs simulateurs de robots peuvent être utilisés avec ROS 2, tels que Gazebo, Webots, etc. Contrairement à turtlesim, ils fournissent des résultats assez réalistes en s'appuyant sur des modèles basés sur la physique pour les robots, les capteurs, les actionneurs et les objets. Par conséquent, ce que vous observez en simulation est très proche de ce que vous obtiendrez lors du transfert de vos contrôleurs ROS 2 vers un vrai robot. Dans ce didacticiel, vous allez utiliser le simulateur de robot Webots pour configurer et exécuter un scénario de simulation ROS 2 très simple.

source: The ``webots_ros2`` package provides an interface between ROS 2 and Webots. It includes several sub-packages, but in this tutorial, you are going to use only the ``webots_ros2_driver`` sub-package to implement a Python plugin controlling a simulated robot. Some other sub-packages contain demos with different robots such as the TurtleBot3. They are documented in the :doc:`../../Demos` page.
fr: Le package ``webots_ros2`` fournit une interface entre ROS 2 et Webots. Il comprend plusieurs sous-packages, mais dans ce tutoriel, vous allez utiliser uniquement le sous-package ``webots_ros2_driver`` pour implémenter un plugin Python contrôlant un robot simulé. Certains autres sous-packages contiennent des démos avec différents robots tels que le TurtleBot3. Ils sont documentés dans la page :doc:`../../Demos`.

source: Prerequisites
fr: Conditions préalables

source: It is recommended to understand basic ROS principles covered in the beginner :doc:`../../../Tutorials`. In particular, :doc:`../../Beginner-CLI-Tools/Introducing-Turtlesim/Introducing-Turtlesim`, :doc:`../../Beginner-CLI-Tools/Understanding-ROS2-Topics/Understanding-ROS2-Topics`, :doc:`../../Beginner-Client-Libraries/Creating-A-Workspace/Creating-A-Workspace`, :doc:`../../Beginner-Client-Libraries/Creating-Your-First-ROS2-Package` and :doc:`../../Intermediate/Launch/Creating-Launch-Files` are useful prerequisites.
fr: Il est recommandé de comprendre les principes de base de ROS abordés dans le débutant :doc:`../../../Tutorials`. En particulier, :doc:`../../Beginner-CLI-Tools/Introducing-Turtlesim/Introducing-Turtlesim`, :doc:`../../Beginner-CLI-Tools/Understanding-ROS2-Topics/ Comprendre-ROS2-Sujets`, :doc:`../../Beginner-Client-Libraries/Creating-A-Workspace/Creating-A-Workspace`, :doc:`../../Beginner-Client- Libraries/Creating-Your-First-ROS2-Package` et :doc:`../../Intermediate/Launch/Creating-Launch-Files` sont des prérequis utiles.

source: The Linux and ROS commands of this tutorial can be run in a standard Linux terminal. See the `Webots ROS 2 Linux installation instructions <https://github.com/cyberbotics/webots_ros2/wiki/Linux-Installation-Guide>`_.
fr: Les commandes Linux et ROS de ce tutoriel peuvent être exécutées dans un terminal Linux standard. Voir les `instructions d'installation Webots ROS 2 Linux <https://github.com/cyberbotics/webots_ros2/wiki/Linux-Installation-Guide>`_.

source: Windows
fr: les fenêtres

source: The Linux and ROS commands of this tutorial must be run in a WSL (Windows Subsystem for Linux) environment. See the `Webots ROS 2 Windows installation instructions <https://github.com/cyberbotics/webots_ros2/wiki/Windows-Installation-Guide>`_.
fr: Les commandes Linux et ROS de ce tutoriel doivent être exécutées dans un environnement WSL (Windows Subsystem for Linux). Voir les `instructions d'installation de Webots ROS 2 Windows <https://github.com/cyberbotics/webots_ros2/wiki/Windows-Installation-Guide>`_.

source: The Linux and ROS commands of this tutorial must be run in a custom Docker container configured with the ``webots_ros2_driver`` package. See the `Webots ROS 2 macOS installation instructions <https://github.com/cyberbotics/webots_ros2/wiki/macOS-Installation-Guide>`_.
fr: Les commandes Linux et ROS de ce tutoriel doivent être exécutées dans un conteneur Docker personnalisé configuré avec le package ``webots_ros2_driver``. Voir les `instructions d'installation de Webots ROS 2 macOS <https://github.com/cyberbotics/webots_ros2/wiki/macOS-Installation-Guide>`_.

source: To install ``webots_ros2_driver`` from a terminal, proceed with the following commands.
fr: Pour installer ``webots_ros2_driver`` depuis un terminal, procédez avec les commandes suivantes.

source: If you want to install the whole ``webots_ros2`` package, follow these `instructions <https://github.com/cyberbotics/webots_ros2/wiki/Getting-Started>`_.
fr: Si vous souhaitez installer l'ensemble du package ``webots_ros2``, suivez ces `instructions <https://github.com/cyberbotics/webots_ros2/wiki/Getting-Started>`_.

source: Tasks
fr: Tâches

source: 1 Create the package structure
fr: 1 Créer la structure du package

source: Let's organize the code in a custom ROS 2 package. Create a new package named ``my_package`` from the ``src`` folder of your ROS 2 workspace. Change the current directory of your terminal to ``ros2_ws/src`` and run:
fr: Organisons le code dans un package ROS 2 personnalisé. Créez un nouveau package nommé ``my_package`` à partir du dossier ``src`` de votre espace de travail ROS 2. Changez le répertoire courant de votre terminal en ``ros2_ws/src`` et exécutez :

source: The ``--node-name my_robot_driver`` option will create a ``my_robot_driver.py`` template Python plugin in the ``my_package`` subfolder that you will modify later. The ``--dependencies rclpy geometry_msgs webots_ros2_driver`` option specifies the packages needed by the ``my_robot_driver.py`` plugin in the ``package.xml`` file. Let's add a ``launch`` and a ``worlds`` folder inside the ``my_package`` folder.
fr: L'option ``--node-name my_robot_driver`` créera un modèle de plug-in Python ``my_robot_driver.py`` dans le sous-dossier ``my_package`` que vous modifierez ultérieurement. L'option ``--dependencies rclpy geometry_msgs webots_ros2_driver`` spécifie les packages nécessaires au plugin ``my_robot_driver.py`` dans le fichier ``package.xml``. Ajoutons un dossier ``launch`` et un dossier ``worlds`` dans le dossier ``my_package``.

source: You should end up with the following folder structure:
fr: Vous devriez vous retrouver avec la structure de dossiers suivante :

source: 2 Setup the simulation world
fr: 2 Configurer le monde de la simulation

source: You will need a world file containing a robot to launch your simulation. :download:`Download this world file <Code/my_world.wbt>` and move it inside ``my_package/worlds/``.
fr: Vous aurez besoin d'un fichier monde contenant un robot pour lancer votre simulation. :download:`Téléchargez ce fichier de monde <Code/my_world.wbt>` et déplacez-le dans ``my_package/worlds/``.

source: This is actually a fairly simple text file you can visualize in a text editor. A simple robot is already included in this ``my_world.wbt`` world file.
fr: Il s'agit en fait d'un fichier texte assez simple que vous pouvez visualiser dans un éditeur de texte. Un robot simple est déjà inclus dans ce fichier mondial ``my_world.wbt``.

source: In case you want to learn how to create your own robot model in Webots, you can check this `tutorial <https://github.com/cyberbotics/webots_ros2/wiki/Tutorial-Create-Webots-Robot>`_.
fr: Si vous souhaitez apprendre à créer votre propre modèle de robot dans Webots, vous pouvez consulter ce `tutoriel <https://github.com/cyberbotics/webots_ros2/wiki/Tutorial-Create-Webots-Robot>`_.

source: 3 Change the my_robot_driver.py file
fr: 3 Modifiez le fichier my_robot_driver.py

source: The ``webots_ros2_driver`` sub-package automatically creates a ROS 2 interface for most sensors. In this task, you will extend this interface by changing the ``my_robot_driver.py`` file.
fr: Le sous-paquet ``webots_ros2_driver`` crée automatiquement une interface ROS 2 pour la plupart des capteurs. Dans cette tâche, vous allez étendre cette interface en modifiant le fichier ``my_robot_driver.py``.

source: The purpose of this tutorial is to show a basic example with a minimum number of dependencies. However, you could avoid the use of this Python plugin by using another ``webots_ros2`` sub-package named ``webots_ros2_control``, introducing a new dependency. This other sub-package creates an interface with the ``ros2_control`` package that facilitates the control of a differential wheeled robot.
fr: Le but de ce tutoriel est de montrer un exemple de base avec un nombre minimum de dépendances. Cependant, vous pouvez éviter l'utilisation de ce plugin Python en utilisant un autre sous-package ``webots_ros2`` nommé ``webots_ros2_control``, introduisant une nouvelle dépendance. Cet autre sous-paquet crée une interface avec le paquet ``ros2_control`` qui facilite le contrôle d'un robot à roues différentielles.

source: Open ``my_package/my_package/my_robot_driver.py`` in your favorite editor and replace its contents with the following:
fr: Ouvrez ``my_package/my_package/my_robot_driver.py`` dans votre éditeur préféré et remplacez son contenu par ce qui suit :

source: As you can see, the ``MyRobotDriver`` class implements three methods.
fr: Comme vous pouvez le voir, la classe ``MyRobotDriver`` implémente trois méthodes.

source: The first method, named ``init(self, ...)``, is actually the ROS node counterpart of the Python ``__init__(self, ...)`` constructor. It first gets the robot instance from the simulation (which can be used to access the `Webots robot API <https://cyberbotics.com/doc/reference/robot?tab-language=python>`_). Then, it gets the two motor instances and initializes them with a target position and a target velocity. Finally a ROS node is created and a callback method is registered for a ROS topic named ``/cmd_vel`` that will handle ``Twist`` messages.
fr: La première méthode, nommée ``init(self, ...)``, est en fait l'homologue ROS du constructeur Python ``__init__(self, ...)``. Il obtient d'abord l'instance du robot à partir de la simulation (qui peut être utilisée pour accéder à l'API du robot Webots <https://cyberbotics.com/doc/reference/robot?tab-language=python>`_). Ensuite, il obtient les deux instances de moteur et les initialise avec une position cible et une vitesse cible. Enfin, un nœud ROS est créé et une méthode de rappel est enregistrée pour un sujet ROS nommé ``/cmd_vel`` qui gérera les messages ``Twist``.

source: Then comes the implementation of the ``__cmd_vel_callback(self, twist)`` callback private method that will be called for each ``Twist`` message received on the ``/cmd_vel`` topic and will save it in the ``self.__target_twist`` member variable.
fr: Vient ensuite l'implémentation de la méthode privée de callback ``__cmd_vel_callback(self, twist)`` qui sera appelée pour chaque message ``Twist`` reçu sur le sujet ``/cmd_vel`` et le sauvegardera dans le dossier ``self .__target_twist`` variable membre.

source: Finally, the ``step(self)`` method is called at every time step of the simulation. The call to ``rclpy.spin_once()`` is needed to keep the ROS node running smoothly. At each time step, the method will retrieve the desired ``forward_speed`` and ``angular_speed`` from ``self.__target_twist``. As the motors are controlled with angular velocities, the method will then convert the ``forward_speed`` and ``angular_speed`` into individual commands for each wheel. This conversion depends on the structure of the robot, more specifically on the radius of the wheel and the distance between them.
fr: Enfin, la méthode ``step(self)`` est appelée à chaque pas de temps de la simulation. L'appel à ``rclpy.spin_once()`` est nécessaire pour assurer le bon fonctionnement du nœud ROS. A chaque pas de temps, la méthode récupérera les ``forward_speed`` et ``angular_speed`` désirés de ``self.__target_twist``. Comme les moteurs sont contrôlés avec des vitesses angulaires, la méthode convertira alors les ``forward_speed`` et ``angular_speed`` en commandes individuelles pour chaque roue. Cette conversion dépend de la structure du robot, plus précisément du rayon de la roue et de la distance entre elles.

source: 4 Create the my_robot.urdf file
fr: 4 Créez le fichier my_robot.urdf

source: You now have to create a URDF file to declare the ``my_robot_driver.py`` Python plugin. This will allow the ``webots_ros2_driver`` ROS node to launch the plugin.
fr: Vous devez maintenant créer un fichier URDF pour déclarer le plugin Python ``my_robot_driver.py``. Cela permettra au nœud ROS ``webots_ros2_driver`` de lancer le plugin.

source: In the ``my_package/resource`` folder create a text file named ``my_robot.urdf`` with this contents:
fr: Dans le dossier ``my_package/resource`` créez un fichier texte nommé ``my_robot.urdf`` avec ce contenu :

source: This simple URDF file doesn't contain any link or joint information about the robot as it is not needed in this tutorial. However, URDF files usually contain much more information as explained in the :doc:`../../Intermediate/URDF/URDF-Main`.
fr: Ce fichier URDF simple ne contient aucun lien ou information conjointe sur le robot car il n'est pas nécessaire dans ce didacticiel. Cependant, les fichiers URDF contiennent généralement beaucoup plus d'informations, comme expliqué dans le :doc:`../../Intermediate/URDF/URDF-Main`.

source: 5 Create the launch file
fr: 5 Créer le fichier de lancement

source: Let's create now the launch file to easily launch the simulation and the ROS controller with a single command. In the ``my_package/launch`` folder create a new text file named ``robot_launch.py`` with this code:
fr: Créons maintenant le fichier de lancement pour lancer facilement la simulation et le contrôleur ROS avec une seule commande. Dans le dossier ``my_package/launch`` créez un nouveau fichier texte nommé ``robot_launch.py`` avec ce code :

source: The ``WebotsLauncher`` object is a custom action that allows you to start a Webots simulation instance. You have to specify in the constructor which world file the simulator will open.
fr: L'objet ``WebotsLauncher`` est une action personnalisée qui vous permet de démarrer une instance de simulation Webots. Vous devez spécifier dans le constructeur quel fichier monde le simulateur ouvrira.

source: A supervisor Robot is always automatically added to the world file by ``WebotsLauncher``. This robot is controlled by the custom node ``Ros2Supervisor``, which must also be started using the ``Ros2SupervisorLauncher``. This node allows to spawn URDF robots directly into the world, and it also publishes useful topics like ``/clock``.
fr: Un Robot superviseur est toujours automatiquement ajouté au fichier monde par ``WebotsLauncher``. Ce robot est contrôlé par le nœud personnalisé ``Ros2Supervisor``, qui doit également être démarré à l'aide de ``Ros2SupervisorLauncher``. Ce nœud permet de générer des robots URDF directement dans le monde, et il publie également des sujets utiles comme ``/clock``.

source: Then, the ROS node interacting with the simulated robot is created. This node, named ``driver``, is located in the ``webots_ros2_driver`` package.
fr: Ensuite, le nœud ROS interagissant avec le robot simulé est créé. Ce nœud, nommé ``driver``, est situé dans le package ``webots_ros2_driver``.

source: The node will be able to communicate with the simulated robot by using a custom protocol based on IPC and shared memory.
fr: Le nœud pourra communiquer avec le robot simulé en utilisant un protocole personnalisé basé sur IPC et la mémoire partagée.

source: The node (in WSL) will be able to communicate with the simulated robot (in Webots on Windows) through a TCP connection.
fr: Le nœud (dans WSL) pourra communiquer avec le robot simulé (dans Webots sous Windows) via une connexion TCP.

source: The node (in the docker container) will be able to communicate with the simulated robot (in Webots on macOS) through a TCP connection.
fr: Le nœud (dans le conteneur docker) pourra communiquer avec le robot simulé (dans Webots sur macOS) via une connexion TCP.

source: In your case, you need to run a single instance of this node, because you have a single robot in the simulation. But if you had more robots in the simulation, you would have to run one instance of this node per robot. ``WEBOTS_CONTROLLER_URL`` is used to define the name of the robot the driver should connect to. The ``controller_url_prefix()`` method is mandatory, as it allows ``webots_ros2_driver`` to add the correct protocol prefix depending on your platform. The ``robot_description`` parameter holds the contents of the URDF file which refers to the ``my_robot_driver.py`` Python plugin.
fr: Dans votre cas, vous devez exécuter une seule instance de ce nœud, car vous avez un seul robot dans la simulation. Mais si vous aviez plus de robots dans la simulation, vous devriez exécuter une instance de ce nœud par robot. ``WEBOTS_CONTROLLER_URL`` est utilisé pour définir le nom du robot auquel le pilote doit se connecter. La méthode ``controller_url_prefix()`` est obligatoire, car elle permet à ``webots_ros2_driver`` d'ajouter le préfixe de protocole correct en fonction de votre plate-forme. Le paramètre ``robot_description`` contient le contenu du fichier URDF qui fait référence au plugin Python ``my_robot_driver.py``.

source: After that, the three nodes are set to be launched in the ``LaunchDescription`` constructor:
fr: Après cela, les trois nœuds sont configurés pour être lancés dans le constructeur ``LaunchDescription`` :

source: Finally, an optional part is added in order to shutdown all the nodes once Webots terminates (e.g., when it gets closed from the graphical user interface).
fr: Enfin, une partie facultative est ajoutée afin d'arrêter tous les nœuds une fois que Webots se termine (par exemple, lorsqu'il est fermé à partir de l'interface utilisateur graphique).

source: 6 Modify the setup.py file
fr: 6 Modifiez le fichier setup.py

source: Finally, before you can start the launch file, you have to modify the ``setup.py`` file to include the extra files you added. Open ``my_package/setup.py`` and replace its contents with:
fr: Enfin, avant de pouvoir démarrer le fichier de lancement, vous devez modifier le fichier ``setup.py`` pour inclure les fichiers supplémentaires que vous avez ajoutés. Ouvrez ``my_package/setup.py`` et remplacez son contenu par :

source: This sets-up the package and adds in the ``data_files`` variable the newly added files: ``my_world.wbt``, ``my_robot.urdf`` and ``robot_launch.py``.
fr: Cela configure le paquet et ajoute dans la variable ``data_files`` les fichiers nouvellement ajoutés : ``my_world.wbt``, ``my_robot.urdf`` et ``robot_launch.py``.

source: 7 Test the code
fr: 7 Testez le code

source: From a terminal in your ROS 2 workspace run:
fr: Depuis un terminal de votre espace de travail ROS 2, exécutez :

source: This will launch the simulation. Webots will be automatically installed on the first run in case it was not already installed.
fr: Cela lancera la simulation. Webots sera automatiquement installé lors de la première exécution au cas où il n'était pas déjà installé.

source: From a terminal in your WSL ROS 2 workspace run:
fr: Depuis un terminal de votre espace de travail WSL ROS 2, exécutez :

source: Be sure to use the ``/mnt`` prefix in front of your path to the Webots installation folder to access the Windows file system from WSL.
fr: Assurez-vous d'utiliser le préfixe ``/mnt`` devant votre chemin d'accès au dossier d'installation Webots pour accéder au système de fichiers Windows à partir de WSL.

source: On macOS, a local server must be started on the host to start Webots from the Docker container. The local server can be downloaded `on the webots-server repository <https://github.com/cyberbotics/webots-server/blob/main/local_simulation_server.py>`_.
fr: Sur macOS, un serveur local doit être démarré sur l'hôte pour démarrer les Webots à partir du conteneur Docker. Le serveur local peut être téléchargé `sur le référentiel webots-server <https://github.com/cyberbotics/webots-server/blob/main/local_simulation_server.py>`_.

source: In a terminal of the host machine (not in the container), specify the Webots installation folder (e.g. ``/Applications/Webots.app``) and start the server using the following commands:
fr: Dans un terminal de la machine hôte (pas dans le conteneur), spécifiez le dossier d'installation de Webots (par exemple ``/Applications/Webots.app``) et démarrez le serveur à l'aide des commandes suivantes :

source: From the terminal of the Docker container, build and launch your custom package with:
fr: Depuis le terminal du conteneur Docker, construisez et lancez votre package personnalisé avec :

source: If you want to install Webots manually, you can download it `here <https://github.com/cyberbotics/webots/releases/latest>`_.
fr: Si vous souhaitez installer Webots manuellement, vous pouvez le télécharger `ici <https://github.com/cyberbotics/webots/releases/latest>`_.

source: Then, open a second terminal and send a command with:
fr: Ensuite, ouvrez un deuxième terminal et envoyez une commande avec :

source: The robot is now moving forward.
fr: Le robot avance maintenant.

source: At this point, the robot is able to blindly follow your motor commands. But it will eventually bump into the wall as you order it to move forwards.
fr: À ce stade, le robot est capable de suivre aveuglément vos commandes motrices. Mais il finira par se cogner contre le mur lorsque vous lui ordonnez d'avancer.

source: To prevent this, let's use the sensors of the robot to detect the obstacles and avoid them. Close the Webots window, this should also shutdown your ROS nodes started from the launcher. Close also the topic command with ``Ctrl+C`` in the second terminal.
fr: Pour éviter cela, utilisons les capteurs du robot pour détecter les obstacles et les éviter. Fermez la fenêtre Webots, cela devrait également arrêter vos nœuds ROS démarrés à partir du lanceur. Fermez également la commande de sujet avec ``Ctrl+C`` dans le second terminal.

source: 8 Updating my_robot.urdf
fr: 8 Mise à jour de mon_robot.urdf

source: You have to modify the URDF file in order to enable the sensors. In ``my_robot.urdf`` replace the whole contents with:
fr: Vous devez modifier le fichier URDF afin d'activer les capteurs. Dans ``my_robot.urdf`` remplacez tout le contenu par :

source: The ROS 2 interface will parse the ``<device>`` tags referring to the **DistanceSensor** nodes and use the standard parameters in the ``<ros>`` tags to enable the sensors and name their topics.
fr: L'interface ROS 2 analysera les balises ``<device>`` faisant référence aux nœuds **DistanceSensor** et utilisera les paramètres standard dans les balises ``<ros>`` pour activer les capteurs et nommer leurs sujets.

source: 9 Creating a ROS node to avoid obstacles
fr: 9 Création d'un nœud ROS pour éviter les obstacles
