Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Concepts.po
Languages: fr

source: Concepts
fr: Notions

source: Conceptual overviews provide relatively high-level, general background information about key aspects of ROS 2.
fr: Les aperçus conceptuels fournissent des informations générales de niveau relativement élevé sur les principaux aspects du ROS 2.

source: The Core Stack Developer Concepts are much more detailed conceptual articles intended for developers who plan modify or contribute to the ROS 2 core:
fr: Les Core Stack Developer Concepts sont des articles conceptuels beaucoup plus détaillés destinés aux développeurs qui envisagent de modifier ou de contribuer au noyau ROS 2 :

source: Quick overview of ROS 2 Concepts
fr: Aperçu rapide des concepts de ROS 2

source: ROS 2 is a middleware based on an anonymous publish/subscribe mechanism that allows for message passing between different ROS processes.
fr: ROS 2 est un middleware basé sur un mécanisme de publication/abonnement anonyme qui permet la transmission de messages entre différents processus ROS.

source: At the heart of any ROS 2 system is the ROS graph. The ROS graph refers to the network of nodes in a ROS system and the connections between them by which they communicate.
fr: Au cœur de tout système ROS 2 se trouve le graphe ROS. Le graphe ROS fait référence au réseau de nœuds dans un système ROS et aux connexions entre eux par lesquelles ils communiquent.

source: Graph Concepts
fr: Concepts graphiques

source: Nodes: A node is an entity that uses ROS to communicate with other nodes.
fr: Nœuds : un nœud est une entité qui utilise ROS pour communiquer avec d'autres nœuds.

source: Messages: ROS data type used when subscribing or publishing to a topic.
fr: Messages : type de données ROS utilisé lors de l'abonnement ou de la publication d'un sujet.

source: Topics: Nodes can publish messages to a topic as well as subscribe to a topic to receive messages.
fr: Sujets : les nœuds peuvent publier des messages dans un sujet et s'abonner à un sujet pour recevoir des messages.

source: Discovery: The automatic process through which nodes determine how to talk to each other.
fr: Découverte : Le processus automatique par lequel les nœuds déterminent comment se parler.

source: Nodes
fr: Nœuds

source: A node is a participant in the ROS graph. ROS nodes use a ROS client library to communicate with other nodes. Nodes can publish or subscribe to Topics. Nodes can also provide or use Services and Actions. There are configurable Parameters associated with a node. Connections between nodes are established through a distributed discovery process. Nodes may be located in the same process, in different processes, or on different machines. These concepts will be described in more detail in the sections that follow.
fr: Un nœud est un participant au graphe ROS. Les nœuds ROS utilisent une bibliothèque cliente ROS pour communiquer avec d'autres nœuds. Les nœuds peuvent publier ou s'abonner à des sujets. Les nœuds peuvent également fournir ou utiliser des services et des actions. Il existe des paramètres configurables associés à un nœud. Les connexions entre les nœuds sont établies via un processus de découverte distribué. Les nœuds peuvent être situés dans le même processus, dans différents processus ou sur différentes machines. Ces concepts seront décrits plus en détail dans les sections qui suivent.

source: Client Libraries
fr: Bibliothèques clientes

source: ROS client libraries allow nodes written in different programming languages to communicate. There is a core ROS client library (RCL) that implements common functionality needed for the ROS APIs of different languages. This makes it so that language-specific client libraries are easier to write and that they have more consistent behavior.
fr: Les bibliothèques clientes ROS permettent aux nœuds écrits dans différents langages de programmation de communiquer. Il existe une bibliothèque cliente ROS principale (RCL) qui implémente les fonctionnalités communes nécessaires pour les API ROS de différentes langues. Cela rend les bibliothèques clientes spécifiques à un langage plus faciles à écrire et leur comportement est plus cohérent.

source: The following client libraries are maintained by the ROS 2 team:
fr: Les bibliothèques clientes suivantes sont gérées par l'équipe ROS 2 :

source: rclcpp = C++ client library
fr: rclcpp = bibliothèque cliente C++

source: rclpy = Python client library
fr: rclpy = bibliothèque cliente Python

source: Additionally, other client libraries have been developed by the ROS community. See the :doc:`ROS 2 Client Libraries <Concepts/About-ROS-2-Client-Libraries>` article for more details.
fr: De plus, d'autres bibliothèques clientes ont été développées par la communauté ROS. Voir l'article :doc:`ROS 2 Client Libraries <Concepts/About-ROS-2-Client-Libraries>` pour plus de détails.

source: Discovery
fr: Découverte

source: Discovery of nodes happens automatically through the underlying middleware of ROS 2. It can be summarized as follows:
fr: La découverte des nœuds se produit automatiquement via le middleware sous-jacent de ROS 2. Elle peut être résumée comme suit :

source: When a node is started, it advertises its presence to other nodes on the network with the same ROS domain (set with the ROS_DOMAIN_ID environment variable). Nodes respond to this advertisement with information about themselves so that the appropriate connections can be made and the nodes can communicate.
fr: Lorsqu'un nœud est démarré, il annonce sa présence aux autres nœuds du réseau avec le même domaine ROS (défini avec la variable d'environnement ROS_DOMAIN_ID). Les nœuds répondent à cette annonce avec des informations sur eux-mêmes afin que les connexions appropriées puissent être établies et que les nœuds puissent communiquer.

source: Nodes periodically advertise their presence so that connections can be made with new-found entities, even after the initial discovery period.
fr: Les nœuds annoncent périodiquement leur présence afin que des connexions puissent être établies avec de nouvelles entités, même après la période de découverte initiale.

source: Nodes advertise to other nodes when they go offline.
fr: Les nœuds s'annoncent auprès d'autres nœuds lorsqu'ils se déconnectent.

source: Nodes will only establish connections with other nodes if they have compatible :doc:`Quality of Service <../Tutorials/Demos/Quality-of-Service>` settings.
fr: Les nœuds n'établiront des connexions avec d'autres nœuds que s'ils ont des paramètres compatibles :doc:`Quality of Service <../Tutorials/Demos/Quality-of-Service>`.

source: Take the :ref:`talker-listener demo <talker-listener>` for example. Running the C++ talker node in one terminal will publish messages on a topic, and the Python listener node running in another terminal will subscribe to messages on the same topic.
fr: Prenez la démo :ref:`talker-listener <talker-listener>` par exemple. L'exécution du nœud locuteur C++ dans un terminal publiera des messages sur un sujet, et le nœud d'écoute Python s'exécutant dans un autre terminal s'abonnera aux messages sur le même sujet.

source: You should see that these nodes discover each other automatically, and begin to exchange messages.
fr: Vous devriez voir que ces nœuds se découvrent automatiquement et commencent à échanger des messages.

source: Security
fr: Sécurité

source: ROS 2 includes the ability to secure communications among nodes within the ROS 2 computational graph. Similar to discovery, security happens through the underlying ROS 2 middleware (provided it has support for the corresponding security plugins). No additional software installation is needed to enable security; however, the middleware requires configuration files for each ROS graph participant. These files enable encryption and authentication, and define policies both for individual nodes and for the overall ROS graph. ROS 2 also adds a master "on/off" switch to control security behavior.
fr: ROS 2 inclut la capacité de sécuriser les communications entre les nœuds dans le graphe de calcul ROS 2. Semblable à la découverte, la sécurité passe par le middleware ROS 2 sous-jacent (à condition qu'il prenne en charge les plugins de sécurité correspondants). Aucune installation de logiciel supplémentaire n'est nécessaire pour activer la sécurité ; cependant, le middleware nécessite des fichiers de configuration pour chaque participant du graphe ROS. Ces fichiers permettent le chiffrement et l'authentification, et définissent des politiques à la fois pour les nœuds individuels et pour le graphe ROS global. ROS 2 ajoute également un interrupteur principal "marche/arrêt" pour contrôler le comportement de sécurité.

source: ROS utilities can create the authoritative `trust anchor <https://en.wikipedia.org/wiki/Trust_anchor>`_ for a ROS application, or an external certificate authority can be used.
fr: Les utilitaires ROS peuvent créer une `ancre de confiance <https://en.wikipedia.org/wiki/Trust_anchor>`_ faisant autorité pour une application ROS, ou une autorité de certification externe peut être utilisée.

source: See the :doc:`ROS 2 Security <Concepts/About-Security>` article for additional details or ROS security features.
fr: Consultez l'article :doc:`ROS 2 Security <Concepts/About-Security>` pour plus de détails ou les fonctionnalités de sécurité ROS.

source: Related Content
fr: Contenu connexe

source: :doc:`See the ROS 2 citations <Citations>` for more explanation of concepts and citable resources.
fr: :doc:`Voir les citations ROS 2 <Citations>` pour plus d'explications sur les concepts et les ressources citables.

source: For a brief video introduction to ROS 2, see this community contributed content:
fr: Pour une brève présentation vidéo de ROS 2, consultez le contenu de cette communauté :

source: `Getting started with ROS Part 1: Nodes, Parameters and Topics <https://youtu.be/46TPAKXBOF8>`_
fr: `Démarrer avec ROS Partie 1 : nœuds, paramètres et sujets <https://youtu.be/46TPAKXBOF8>`_

source: `Getting started with ROS Part 2: Services and Actions <https://youtu.be/keZAJ83eEoM>`_
fr: `Démarrer avec ROS Partie 2 : Services et actions <https://youtu.be/keZAJ83eEoM>`_
