Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Contact.po
Languages: fr

source: Contact
fr: Contacter

source: Support
fr: Soutien

source: Different types of questions or discussions correspond to different avenues of communication; check the descriptions below to ensure you choose the right method.
fr: Différents types de questions ou de discussions correspondent à différentes voies de communication ; Vérifiez les descriptions ci-dessous pour vous assurer de choisir la bonne méthode.

source: Need help troubleshooting your system? First, search `ROS Answers <https://answers.ros.org>`__ to see if others have had similar issues, and if their solution works for you.
fr: Besoin d'aide pour dépanner votre système ? Tout d'abord, recherchez `ROS Answers <https://answers.ros.org>`__ pour voir si d'autres ont eu des problèmes similaires et si leur solution fonctionne pour vous.

source: If not, ask a new question on `ROS Answers <https://answers.ros.org>`__. Make sure to add tags, at the very least the ``ros2`` tag and the distro version you are running, e.g. ``humble``. If your question is related to the documentation here, add a tag like ``docs``, or more specifically, ``tutorials``.
fr: Sinon, posez une nouvelle question sur `ROS Answers <https://answers.ros.org>`__. Assurez-vous d'ajouter des balises, au moins la balise ``ros2`` et la version de distribution que vous utilisez, par ex. ``humble``. Si votre question est liée à la documentation ici, ajoutez une balise comme ``docs``, ou plus précisément, ``tutoriels``.

source: Contributing support
fr: Appui contributif

source: ROS 2 users come from a wide range of technical backgrounds, use a variety of different operating systems, and don’t necessarily have any prior experience with ROS (1 or 2). So, it's important for users with any amount of experience to contribute support.
fr: Les utilisateurs de ROS 2 proviennent d'un large éventail de formations techniques, utilisent une variété de systèmes d'exploitation différents et n'ont pas nécessairement d'expérience préalable avec ROS (1 ou 2). Il est donc important que les utilisateurs, quelle que soit leur expérience, contribuent au support.

source: If you see an issue on `ROS Answers <https://answers.ros.org/questions/tags:ros2/>`__ that is similar to something you’ve run into yourself, please consider providing some pointers to what helped in your situation. Don’t worry if you aren't sure if your response is correct. Simply say so, and other community members will jump in if necessary.
fr: Si vous voyez un problème sur `ROS Answers <https://answers.ros.org/questions/tags:ros2/>`__ qui ressemble à quelque chose que vous avez rencontré vous-même, veuillez envisager de fournir quelques indications sur ce qui vous a aidé à ta situation. Ne vous inquiétez pas si vous n'êtes pas sûr que votre réponse soit correcte. Dites-le simplement et d'autres membres de la communauté interviendront si nécessaire.

source: Issues
fr: Problèmes

source: If you identify bugs, have suggestions for improvements, or a question specific to one package, you can open an issue on GitHub.
fr: Si vous identifiez des bogues, avez des suggestions d'améliorations ou une question spécifique à un package, vous pouvez ouvrir un problème sur GitHub.

source: For example, if you are following the :doc:`tutorials here <Tutorials>` and come across an instruction that doesn't work on your system, you can open an issue in the `ros2_documentation <https://github.com/ros2/ros2_documentation>`__ repo.
fr: Par exemple, si vous suivez les :doc:`tutoriels ici <Tutoriels>` et rencontrez une instruction qui ne fonctionne pas sur votre système, vous pouvez ouvrir un problème dans la `ros2_documentation <https://github.com/ ros2/ros2_documentation>`__ dépôt.

source: You can search for individual ROS 2 repositories on `ROS 2's GitHub <https://github.com/ros2>`__.
fr: Vous pouvez rechercher des référentiels ROS 2 individuels sur le GitHub de `ROS 2 <https://github.com/ros2>`__.

source: Before opening an issue, check if other users have reported similar issues by searching across the ros2 and ament GitHub organizations: `example search query <https://github.com/search?q=user%3Aros2+user%3Aament+turtlesim&type=Issues>`__.
fr: Avant d'ouvrir un problème, vérifiez si d'autres utilisateurs ont signalé des problèmes similaires en effectuant une recherche dans les organisations ros2 et ament GitHub : `example search query <https://github.com/search?q=user%3Aros2+user%3Aament+turtlesim&type= Problèmes>`__.

source: Next, check `ROS Answers <https://answers.ros.org/>`__ to see if someone else has asked your question or reported your issue.
fr: Ensuite, consultez `ROS Answers <https://answers.ros.org/>`__ pour voir si quelqu'un d'autre a posé votre question ou signalé votre problème.

source: If it has not been reported, feel free to open an issue in the appropriate repository tracker. If it's not clear which tracker to use for a particular issue, file it in the `ros2/ros2 repository <https://github.com/ros2/ros2/issues>`__ and we'll have a look at it.
fr: S'il n'a pas été signalé, n'hésitez pas à ouvrir un problème dans le tracker de référentiel approprié. Si vous ne savez pas quel tracker utiliser pour un problème particulier, déposez-le dans le référentiel `ros2/ros2 <https://github.com/ros2/ros2/issues>`__ et nous l'examinerons.

source: When filing an issue, please make sure to:
fr: Lorsque vous signalez un problème, assurez-vous de :

source: Include enough information for another person to understand the issue.
fr: Incluez suffisamment d'informations pour qu'une autre personne comprenne le problème.

source: Describe exactly what you were doing or are trying to do, and exactly what, if anything, went wrong. If following a tutorial or online instructions provide a link to the specific instructions.
fr: Décrivez exactement ce que vous faisiez ou essayez de faire, et ce qui, le cas échéant, n'a pas fonctionné. Si vous suivez un didacticiel ou des instructions en ligne, fournissez un lien vers les instructions spécifiques.

source: Use a descriptive headline or subject line. Bad: "rviz doesn't work". Good: "Rviz crashing looking for missing .so after latest apt update"
fr: Utilisez un titre descriptif ou une ligne d'objet. Mauvais : "rviz ne fonctionne pas". Bon : "Rviz plante à la recherche d'un fichier .so manquant après la dernière mise à jour d'apt"

source: Include information about the exact platform, software, versions, and environment relevant to the problem. This includes how you installed the software (from binaries or from source) and which ROS middleware/DDS vendor you are using (if you know it).
fr: Incluez des informations sur la plate-forme exacte, les logiciels, les versions et l'environnement pertinents pour le problème. Cela inclut la manière dont vous avez installé le logiciel (à partir des fichiers binaires ou de la source) et le fournisseur de middleware/DDS ROS que vous utilisez (si vous le connaissez).

source: Any warnings or errors. Cut and paste them directly from the terminal window to which they were printed. Please do not re-type or include a screenshot.
fr: Tout avertissement ou erreur. Coupez-les et collez-les directement depuis la fenêtre du terminal sur laquelle ils ont été imprimés. Veuillez ne pas retaper ou inclure une capture d'écran.

source: In case of a bug consider providing a `short, self contained, correct (compilable), example <http://sscce.org/>`__.
fr: En cas de bogue, envisagez de fournir un `exemple court, autonome et correct (compilable) <http://sscce.org/>`__.

source: When discussing any compiling/linking/installation issues, also provide the compiler version
fr: Lorsque vous discutez de problèmes de compilation/liaison/installation, fournissez également la version du compilateur

source: As appropriate, also include your:
fr: Le cas échéant, incluez également votre :

source: Relevant config files
fr: Fichiers de configuration pertinents

source: Graphics card model and driver version
fr: Modèle de carte graphique et version du pilote

source: Ogre.log for rviz, if possible (run with rviz -l)
fr: Ogre.log pour rviz, si possible (exécuter avec rviz -l)

source: Bag files and code samples that can reproduce the problem
fr: Fichiers de sac et exemples de code pouvant reproduire le problème

source: Gifs or movies to demonstrate the problem
fr: Gifs ou films pour illustrer le problème

source: Pull requests
fr: Demandes d'extraction

source: When you feel comfortable enough to suggest a specific change directly to the code, you can submit a pull request. Pull requests are welcome for any of `the ros2 repositories <https://github.com/ros2>`__. See the :doc:`Contributing <The-ROS2-Project/Contributing>` page for more details and etiquette on how to contribute.
fr: Lorsque vous vous sentez suffisamment à l'aise pour suggérer une modification spécifique directement au code, vous pouvez soumettre une demande d'extraction. Les demandes d'extraction sont les bienvenues pour tous les `dépôts ros2 <https://github.com/ros2>`__. Voir la page :doc:`Contributing <The-ROS2-Project/Contributing>` pour plus de détails et l'étiquette sur la façon de contribuer.

source: To start a discussion with other ROS 2 community members, visit the official `ROS Discourse <https://discourse.ros.org/>`__. Content on the Discourse should be high-level; it's not a place to get *questions* about code answered, but it would be suitable to start a conversation about best practices or improving standards.
fr: Pour démarrer une discussion avec d'autres membres de la communauté ROS 2, visitez le `discourse ROS officiel <https://discourse.ros.org/>`__. Le contenu du discours doit être de haut niveau ; ce n'est pas un endroit pour obtenir des réponses à des *questions* sur le code, mais il conviendrait d'entamer une conversation sur les meilleures pratiques ou l'amélioration des normes.

source: Discussions about ROS 2 development and plans are happening on the `“Next Generation ROS” Discourse category <https://discourse.ros.org/c/ng-ros>`__. Participating in these discussions is an important way to have a say on how different features of ROS 2 will work and be implemented.
fr: Des discussions sur le développement et les plans de ROS 2 se déroulent dans la catégorie de discours "Next Generation ROS" <https://discourse.ros.org/c/ng-ros>`__. Participer à ces discussions est un moyen important d'avoir son mot à dire sur la façon dont les différentes fonctionnalités de ROS 2 fonctionneront et seront mises en œuvre.

source: The diverse community behind the ROS ecosystem is one of its greatest assets. We encourage all members of the ROS community to participate in these design discussions so that we can leverage the experience of community members, and keep the varied use cases of ROS in mind.
fr: La communauté diversifiée derrière l'écosystème ROS est l'un de ses plus grands atouts. Nous encourageons tous les membres de la communauté ROS à participer à ces discussions de conception afin que nous puissions tirer parti de l'expérience des membres de la communauté et garder à l'esprit les divers cas d'utilisation de ROS.

source: Etiquette
fr: Étiquette

source: Assume 'good faith': It's easy to mis-interpret the meaning or tone of comments on the internet. Assuming good faith gives the benefit of the doubt to those trying to help you, avoiding: insulting well meaning community members, and poisoning the mood. Assuming 'good faith' when responding almost always works better even if the original response was not in fact in good faith.
fr: Présumez de la « bonne foi » : il est facile de mal interpréter le sens ou le ton des commentaires sur Internet. En supposant que la bonne foi donne le bénéfice du doute à ceux qui essaient de vous aider, en évitant : d'insulter des membres bien intentionnés de la communauté et d'empoisonner l'ambiance. Présumer de la «bonne foi» lors de la réponse fonctionne presque toujours mieux même si la réponse initiale n'était en fait pas de bonne foi.

source: Please don't send your question more than once: The question was seen. If you didn't get a response then likely nobody has had time to answer you. Alternatively, it could be that nobody knows the answer. In any case, sending it again is poor form and akin to shouting and is likely to aggravate a large number of people. This also applies to crossposting. Try to pick the forum which you think matches best and ask there. If you are referred to a new forum, provide a link to the old discussion.
fr: Veuillez ne pas envoyer votre question plus d'une fois : la question a été vue. Si vous n'avez pas reçu de réponse, personne n'a probablement eu le temps de vous répondre. Alternativement, il se pourrait que personne ne connaisse la réponse. En tout cas, le renvoyer est une mauvaise forme et s'apparente à des cris et risque d'agacer un grand nombre de personnes. Ceci s'applique également au crossposting. Essayez de choisir le forum qui, selon vous, correspond le mieux et posez-y la question. Si vous êtes redirigé vers un nouveau forum, fournissez un lien vers l'ancienne discussion.

source: On https://answers.ros.org you can edit your question to provide more details. The more details that you include in your question the easier it is for others to help you find your solution which makes it more likely for you to get a response.
fr: Sur https://answers.ros.org, vous pouvez modifier votre question pour fournir plus de détails. Plus vous incluez de détails dans votre question, plus il est facile pour les autres de vous aider à trouver votre solution, ce qui vous donne plus de chances d'obtenir une réponse.

source: It's considered bad form to list your personal deadlines; community members answering questions also have them.
fr: Il est considéré comme une mauvaise forme d'énumérer vos échéances personnelles ; les membres de la communauté qui répondent aux questions les ont également.

source: Do not beg for help. If there is someone willing and able to help with your problem, you usually get a response. Asking for faster answers will mostly have a negative effect.
fr: Ne mendiez pas de l'aide. S'il y a quelqu'un désireux et capable de vous aider à résoudre votre problème, vous obtenez généralement une réponse. Demander des réponses plus rapides aura surtout un effet négatif.

source: Do not add unrelated content to posts. The content of posts should be focused on the topic at hand and not include unrelated content. Content, links, and images unrelated to the topic are considered spam.
fr: N'ajoutez pas de contenu non lié aux publications. Le contenu des messages doit être axé sur le sujet traité et ne pas inclure de contenu sans rapport. Le contenu, les liens et les images sans rapport avec le sujet sont considérés comme du spam.

source: For commercial posts, see also `this discussion <https://discourse.ros.org/t/sponsorship-notation-in-posts-on-ros-org/2078>`_.
fr: Pour les publications commerciales, voir également `cette discussion <https://discourse.ros.org/t/sponsorship-notation-in-posts-on-ros-org/2078>`_.

source: Minimize references to content behind pay walls. The content posted on `ROS Discourse <https://discourse.ros.org/>`__ and `ROS Answers <https://answers.ros.org/>`__ should "generally" be free and open to all users. Links to content behind pay walls such as private journal articles, text books, and paid news websites, while helpful and relevant, may not be accessible to all users. Where possible primary sources should be free and open with paid content playing a supporting role.
fr: Minimisez les références au contenu derrière les murs payants. Le contenu publié sur `ROS Discourse <https://discourse.ros.org/>`__ et `ROS Answers <https://answers.ros.org/>`__ devrait "généralement" être gratuit et ouvert à tous les utilisateurs . Les liens vers du contenu derrière des murs payants tels que des articles de journaux privés, des manuels et des sites Web d'actualités payants, bien qu'utiles et pertinents, peuvent ne pas être accessibles à tous les utilisateurs. Dans la mesure du possible, les sources primaires doivent être gratuites et ouvertes, le contenu payant jouant un rôle de soutien.

source: Single link posts are to be avoided. Generally speaking, posting a single link answer is less helpful and can be easily confused with spam. Moreover, links may degrade over time or be replaced. Paraphrasing a link's content along with some contextual information and attribution is often much more helpful.
fr: Les publications à lien unique sont à éviter. D'une manière générale, la publication d'un seul lien de réponse est moins utile et peut facilement être confondue avec du spam. De plus, les liens peuvent se dégrader avec le temps ou être remplacés. Paraphraser le contenu d'un lien avec certaines informations contextuelles et l'attribution est souvent beaucoup plus utile.

source: Private contact
fr: Contact privé

source: If you'd like to contact us privately (e.g., if your question contains information sensitive to your organization or project, or if it's regarding a security issue), you can email us directly at ``ros@osrfoundation.org``.
fr: Si vous souhaitez nous contacter en privé (par exemple, si votre question contient des informations sensibles pour votre organisation ou votre projet, ou si elle concerne un problème de sécurité), vous pouvez nous envoyer un e-mail directement à ``ros@osrfoundation.org``.
