Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Glossary.po
Languages: fr

source: Glossary
fr: Glossaire

source: Glossary of terms used throughout this documentation:
fr: Glossaire des termes utilisés dans cette documentation :

source: An API, or Application Programming Interface, is an interface that is provided by an "application", which in this case is usually a shared library or other language appropriate shared resource. APIs are made up of files that define a contract between the software using the interface and the software providing the interface. These files typically manifest as header files in C and C++ and as Python files in Python. In either case it is important that APIs are grouped and described in documentation and that they are declared as either public or private. Public interfaces are subject to change rules and changes to the public interfaces prompt a new version number of the software that provides them.
fr: Une API, ou Application Programming Interface, est une interface fournie par une "application", qui dans ce cas est généralement une bibliothèque partagée ou une autre ressource partagée appropriée au langage. Les API sont constituées de fichiers qui définissent un contrat entre le logiciel utilisant l'interface et le logiciel fournissant l'interface. Ces fichiers se manifestent généralement sous forme de fichiers d'en-tête en C et C++ et sous forme de fichiers Python dans Python. Dans les deux cas, il est important que les API soient regroupées et décrites dans la documentation et qu'elles soient déclarées comme publiques ou privées. Les interfaces publiques sont soumises à des règles de modification et les modifications apportées aux interfaces publiques entraînent un nouveau numéro de version du logiciel qui les fournit.

source: A client library is an :term:`API` that provides access to the ROS graph using primitive middleware concepts like Topics, Services, and Actions.
fr: Une bibliothèque cliente est une :term:`API` qui donne accès au graphe ROS à l'aide de concepts middleware primitifs tels que Topics, Services et Actions.

source: package
fr: forfait

source: A single unit of software, including source code, build system files, documentation, tests, and other associated resources.
fr: Une seule unité de logiciel, y compris le code source, les fichiers système de construction, la documentation, les tests et d'autres ressources associées.

source: REP
fr: REPRÉSENTANT

source: ROS Enhancement Proposal. A document that describes an enhancement, standardization, or convention for the ROS community. The associated REP approval process allows the community to iterate on a proposal until some consensus has been made, at which point it can be ratified and implemented, at which point it becomes documentation. All REPs are viewable from the `REP index <http://www.ros.org/reps/rep-0000.html>`_.
fr: Proposition d'amélioration du ROS. Un document qui décrit une amélioration, une normalisation ou une convention pour la communauté ROS. Le processus d'approbation REP associé permet à la communauté d'itérer sur une proposition jusqu'à ce qu'un consensus ait été atteint, auquel cas elle peut être ratifiée et mise en œuvre, auquel cas elle devient une documentation. Tous les REP sont visibles à partir de l'`index REP <http://www.ros.org/reps/rep-0000.html>`_.

source: Version Control System, such as CVS, SVN, git, mercurial, etc...
fr: Système de contrôle de version, tel que CVS, SVN, git, mercurial, etc...

source: rclcpp
fr: RCLCP

source: The C++ specific :term:`Client Library <client_library>` for ROS. This includes any middleware related APIs as well as the related message generation of C++ data structures based on interface definitions like Messages, Services, and Actions.
fr: Le :term:`Client Library <client_library>` spécifique au C++ pour ROS. Cela inclut toutes les API liées au middleware ainsi que la génération de messages associés des structures de données C++ basées sur des définitions d'interface telles que Messages, Services et Actions.

source: repository
fr: dépôt

source: A collection of packages usually managed using a :term:`VCS` like git or mercurial and usually hosted on a site like GitHub or BitBucket. In the context of this document repositories usually contain one or more |packages| of one type or another.
fr: Une collection de packages généralement gérés à l'aide d'un :term:`VCS` comme git ou mercurial et généralement hébergés sur un site comme GitHub ou BitBucket. Dans le contexte de ce document, les référentiels contiennent généralement un ou plusieurs |packages| d'un type ou d'un autre.
