Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Installation.po
Languages: fr

source: Options for installing ROS 2 Rolling Ridley:
fr: Options d'installation de ROS 2 Rolling Ridley :

source: Binary packages
fr: Paquets binaires

source: Binaries are only created for the Tier 1 operating systems listed in `REP-2000 <https://www.ros.org/reps/rep-2000.html#rolling-ridley-june-2020-ongoing>`__. Given the nature of Rolling, this list may be updated at any time. If you are not running any of the following operating systems you may need to build from source or use a :doc:`container solution <How-To-Guides/Run-2-nodes-in-single-or-separate-docker-containers>` to run ROS 2 on your platform.
fr: Les fichiers binaires ne sont créés que pour les systèmes d'exploitation de niveau 1 répertoriés dans `REP-2000 <https://www.ros.org/reps/rep-2000.html#rolling-ridley-june-2020-ongoing>`__. Compte tenu de la nature du Rolling, cette liste peut être mise à jour à tout moment. Si vous n'exécutez aucun des systèmes d'exploitation suivants, vous devrez peut-être créer à partir des sources ou utiliser une :doc:`solution de conteneur <How-To-Guides/Run-2-nodes-in-single-or-separate-docker- containers>` pour exécuter ROS 2 sur votre plateforme.

source: We provide ROS 2 binary packages for the following platforms:
fr: Nous fournissons des packages binaires ROS 2 pour les plates-formes suivantes :

source: :doc:`Debian packages <Installation/Ubuntu-Install-Debians>` (recommended)
fr: :doc:`Packages Debian <Installation/Ubuntu-Install-Debians>` (recommandé)

source: :doc:`"fat" archive <Installation/Alternatives/Ubuntu-Install-Binary>`
fr: :doc:`archive "fat" <Installation/Alternatives/Ubuntu-Install-Binary>`

source: :doc:`RPM packages <Installation/RHEL-Install-RPMs>` (recommended)
fr: :doc:`Packages RPM <Installation/RHEL-Install-RPMs>` (recommandé)

source: :doc:`"fat" archive <Installation/Alternatives/RHEL-Install-Binary>`
fr: :doc:`archive "fat" <Installation/Alternatives/RHEL-Install-Binary>`

source: Building from source
fr: Construire à partir de la source

source: We support building ROS 2 from source on the following platforms:
fr: Nous prenons en charge la création de ROS 2 à partir de la source sur les plates-formes suivantes :

source: Which install should you choose?
fr: Quelle installation choisir ?

source: Installing from binary packages or from source will both result in a fully-functional and usable ROS 2 install. Differences between the options depend on what you plan to do with ROS 2.
fr: L'installation à partir de packages binaires ou à partir de la source se traduira à la fois par une installation ROS 2 entièrement fonctionnelle et utilisable. Les différences entre les options dépendent de ce que vous prévoyez de faire avec ROS 2.

source: **Binary packages** are for general use and provide an already-built install of ROS 2. This is great for people who want to dive in and start using ROS 2 as-is, right away.
fr: **Les packages binaires** sont destinés à un usage général et fournissent une installation déjà intégrée de ROS 2. C'est idéal pour les personnes qui souhaitent plonger et commencer à utiliser ROS 2 tel quel, immédiatement.

source: Linux users have two options for installing binary packages:
fr: Les utilisateurs de Linux ont deux options pour installer les packages binaires :

source: Debian packages
fr: Paquets Debian

source: "fat" archive
fr: archives "grosses"

source: Installing from Debian packages is the recommended method. It's more convenient because it installs its necessary dependencies automatically. It also updates alongside regular system updates.
fr: L'installation à partir de packages Debian est la méthode recommandée. C'est plus pratique car il installe automatiquement les dépendances nécessaires. Il se met également à jour parallèlement aux mises à jour régulières du système.

source: However, you need root access in order to install Debian packages. If you don't have root access, the "fat" archive is the next best choice.
fr: Cependant, vous avez besoin d'un accès root pour installer les packages Debian. Si vous n'avez pas d'accès root, l'archive "fat" est le meilleur choix suivant.

source: macOS and Windows users who choose to install from binary packages only have the "fat" archive option (Debian packages are exclusive to Ubuntu/Debian).
fr: Les utilisateurs macOS et Windows qui choisissent d'installer à partir de packages binaires n'ont que l'option d'archivage "fat" (les packages Debian sont exclusifs à Ubuntu/Debian).

source: **Building from source** is meant for developers looking to alter or explicitly omit parts of ROS 2's base. It is also recommended for platforms that don't support binaries. Building from source also gives you the option to install the absolute latest version of ROS 2.
fr: La **construction à partir des sources** est destinée aux développeurs qui cherchent à modifier ou à omettre explicitement des parties de la base de ROS 2. Il est également recommandé pour les plates-formes qui ne prennent pas en charge les binaires. La construction à partir des sources vous donne également la possibilité d'installer la dernière version absolue de ROS 2.

source: Contributing to ROS 2 core?
fr: Vous contribuez au cœur de ROS 2 ?

source: If you plan to contribute directly to ROS 2 core packages, you can install the :doc:`latest development from source <Installation/Alternatives/Latest-Development-Setup>` which shares installation instructions with the :ref:`Rolling distribution <rolling_distribution>`.
fr: Si vous envisagez de contribuer directement aux packages de base de ROS 2, vous pouvez installer le :doc:`dernier développement à partir de la source <Installation/Alternatives/Latest-Development-Setup>` qui partage les instructions d'installation avec la :ref:`distribution progressive <rolling_distribution >`.
