Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Related-Projects.po
Languages: fr

source: Related Projects
fr: Projets liés

source: Gazebo
fr: Belvédère

source: **Gazebo** `(gazebosim.org) <http://gazebosim.org/>`_ and its predecessor Gazebo Classic are the first open source choice for 3D physics simulation of ROS-based robots.
fr: **Gazebo** `(gazebosim.org) <http://gazebosim.org/>`_ et son prédécesseur Gazebo Classic sont le premier choix open source pour la simulation physique 3D de robots basés sur ROS.

source: Large Community Projects
fr: Grands projets communautaires

source: Large community projects involve multiple developers from all over the globe and are typically backed by a dedicated working group (cf. :doc:`The-ROS2-Project/Governance`).
fr: Les grands projets communautaires impliquent plusieurs développeurs du monde entier et sont généralement soutenus par un groupe de travail dédié (cf. :doc:`The-ROS2-Project/Governance`).

source: **ros2_control** `(control.ros.org) <https://control.ros.org/>`_: Flexible framework for real-time control of robots implemented with ROS 2.
fr: **ros2_control** `(control.ros.org) <https://control.ros.org/>`_ : cadre flexible pour le contrôle en temps réel des robots implémenté avec ROS 2.

source: **Navigation2** `(navigation.ros.org) <https://navigation.ros.org/>`_: Comprehensive and flexible navigation stack for mobile robots using ROS 2.
fr: **Navigation2** `(navigation.ros.org) <https://navigation.ros.org/>`_ : pile de navigation complète et flexible pour les robots mobiles utilisant ROS 2.

source: **MoveIt** `(moveit.ros.org) <https://moveit.ros.org/>`_: A rich platform for building manipulation applications featuring advanced kinematics, motion planning, control, collision checking, and much more.
fr: **MoveIt** `(moveit.ros.org) <https://moveit.ros.org/>`_ : une plate-forme riche pour créer des applications de manipulation comprenant une cinématique avancée, la planification de mouvement, le contrôle, la vérification des collisions et bien plus encore .

source: **micro-ROS** `(micro.ros.org) <https://micro.ros.org/>`_: A platform for putting ROS 2 onto microcontrollers, starting at less than 100 kB of RAM.
fr: **micro-ROS** `(micro.ros.org) <https://micro.ros.org/>`_ : une plate-forme pour mettre ROS 2 sur des microcontrôleurs, à partir de moins de 100 Ko de RAM.

source: Further Community Projects
fr: Autres projets communautaires

source: The global ROS community develops and maintains hundreds of further packages on top of the core ROS 2 stack. Some of them come with their own websites for documentation. Your best entry point to discover these works is the **ROS Index** `(index.ros.org) <https://index.ros.org/packages/>`_.
fr: La communauté ROS mondiale développe et gère des centaines de packages supplémentaires en plus de la pile principale ROS 2. Certains d'entre eux viennent avec leurs propres sites Web pour la documentation. Votre meilleur point d'entrée pour découvrir ces œuvres est le **ROS Index** `(index.ros.org) <https://index.ros.org/packages/>`_.

source: *Hint for developers:* If you maintain a ``README.md`` file in the root of your package folder (which is not necessarily the root of your repository), this file is rendered into the overview page of your package at `index.ros.org <https://index.ros.org/packages/>`_. The file may be used for documenting your package and supersedes the package documentation pages in the ROS Wiki from ROS 1. See the `fmi_adapter package <https://index.ros.org/p/fmi_adapter/github-boschresearch-fmi_adapter/#foxy>`_ as an example.
fr: *Astuce pour les développeurs :* Si vous conservez un fichier ``README.md`` à la racine de votre dossier de package (qui n'est pas nécessairement la racine de votre référentiel), ce fichier est rendu dans la page de présentation de votre package à ` index.ros.org <https://index.ros.org/packages/>`_. Le fichier peut être utilisé pour documenter votre package et remplace les pages de documentation du package dans le Wiki ROS de ROS 1. Voir le package `fmi_adapter <https://index.ros.org/p/fmi_adapter/github-boschresearch-fmi_adapter/# foxy>`_ par exemple.

source: Company-driven Projects
fr: Projets pilotés par l'entreprise
