Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Releases.po
Languages: fr

source: What is a Distribution?
fr: Qu'est-ce qu'une répartition ?

source: A ROS distribution is a versioned set of ROS packages. These are akin to Linux distributions (e.g. Ubuntu). The purpose of the ROS distributions is to let developers work against a relatively stable codebase until they are ready to roll everything forward. Therefore once a distribution is released, we try to limit changes to bug fixes and non-breaking improvements for the core packages (every thing under ros-desktop-full). That generally applies to the whole community, but for "higher" level packages, the rules are less strict, and so it falls to the maintainers of a given package to avoid breaking changes.
fr: Une distribution ROS est un ensemble versionné de packages ROS. Celles-ci s'apparentent aux distributions Linux (par exemple Ubuntu). Le but des distributions ROS est de permettre aux développeurs de travailler sur une base de code relativement stable jusqu'à ce qu'ils soient prêts à tout faire avancer. Par conséquent, une fois qu'une distribution est publiée, nous essayons de limiter les modifications aux corrections de bogues et aux améliorations incassables pour les packages de base (tout sous ros-desktop-full). Cela s'applique généralement à l'ensemble de la communauté, mais pour les paquets de niveau "supérieur", les règles sont moins strictes, et il incombe donc aux mainteneurs d'un paquet donné d'éviter de casser les changements.

source: List of Distributions
fr: Liste des diffusions

source: Below is a list of current and historic ROS 2 distributions. Rows in the table marked in green are the currently supported distributions.
fr: Vous trouverez ci-dessous une liste des distributions ROS 2 actuelles et historiques. Les lignes du tableau marquées en vert correspondent aux distributions actuellement prises en charge.

source: Rolling logo
fr: Logo roulant

source: Galactic logo
fr: Logo galactique

source: Foxy logo
fr: Logo renard

source: Eloquent logo
fr: Logo éloquent

source: Dashing logo
fr: Logo fringant

source: Crystal logo
fr: Logo cristal

source: Bouncy logo
fr: Logo rebondissant

source: Ardent logo
fr: Logo ardent

source: Release date
fr: Date de sortie

source: EOL date
fr: Date de fin de vie

source: May 23rd, 2022
fr: Spectacle de mai 2022

source: May 2027
fr: Mai 2027

source: May 23rd, 2021
fr: Spectacle de mai 2021

source: |galactic|
fr: |galactique|

source: December 9th, 2022
fr: 9 décembre 2022

source: June 5th, 2020
fr: 5 juin 2020

source: |foxy|
fr: |rusé|

source: May 2023
fr: Mai 2023

source: November 22nd, 2019
fr: 22 novembre 2019

source: |eloquent|
fr: |éloquent|

source: November 2020
fr: novembre 2020

source: May 31st, 2019
fr: 31 mai 2019

source: |dashing|
fr: |fringant|

source: May 2021
fr: Mai 2021

source: December 14th, 2018
fr: 14 décembre 2018

source: |crystal|
fr: |cristal|

source: December 2019
fr: Décembre 2019

source: July 2nd, 2018
fr: 2 juillet 2018

source: |bouncy|
fr: |rebondissant|

source: July 2019
fr: juillet 2019

source: December 8th, 2017
fr: 8 décembre 2017

source: December 2018
fr: Décembre 2018

source: :doc:`beta3 <Releases/Beta3-Overview>`
fr: :dos:acheter <release/btaafarfo> un

source: September 13th, 2017
fr: 13 septembre 2017

source: December 2017
fr: Décembre 2017

source: :doc:`beta2 <Releases/Beta2-Overview>`
fr: :doc:`beta2 <Releases/Beta2-Aperçu>`

source: July 5th, 2017
fr: 5 juillet 2017

source: September 2017
fr: Septembre 2017

source: :doc:`beta1 <Releases/Beta1-Overview>`
fr: :doc:`beta1 <Releases/Beta1-Aperçu>`

source: December 19th, 2016
fr: 19 décembre 2016

source: Jul 2017
fr: juil. 2017

source: :doc:`alpha1 - alpha8 <Releases/Alpha-Overview>`
fr: :doc:`alpha 1 - alpha 8 <Released/Alpha-Overview>`

source: August 31th, 2015
fr: 31 août 2015

source: December 2016
fr: Décembre 2016

source: Future Distributions
fr: Distributions futures

source: For details on upcoming features see the :doc:`roadmap <The-ROS2-Project/Roadmap>`.
fr: Pour plus de détails sur les fonctionnalités à venir, consultez la :doc:`roadmap <The-ROS2-Project/Roadmap>`.

source: There is a new ROS 2 distribution released yearly on May 23rd (`World Turtle Day <https://www.worldturtleday.org/>`_).
fr: Une nouvelle distribution ROS 2 est publiée chaque année le 23 mai (`World Turtle Day <https://www.worldturtleday.org/>`_).

source: Supported until
fr: Pris en charge jusqu'à

source: :doc:`Iron Irwini <Releases/Release-Iron-Irwini>`
fr: :doc:`Iron Race <Releases/Release-Iron-Race>`

source: November 2024
fr: novembre 2024

source: The expectation is to release new ROS 2 distributions once per year.
fr: L'objectif est de publier de nouvelles distributions ROS 2 une fois par an.

source: Rolling Distribution
fr: Distribution roulante

source: :doc:`ROS 2 Rolling Ridley <Releases/Release-Rolling-Ridley>` is the rolling development distribution of ROS 2. It is described in `REP 2002 <https://www.ros.org/reps/rep-2002.html>`_ and was first introduced in June 2020.
fr: :doc:`ROS 2 Rolling Ridley <Releases/Release-Rolling-Ridley>` est la distribution de développement continu de ROS 2. Elle est décrite dans `REP 2002 <https://www.ros.org/reps/rep-2002 .html>`_ et a été introduit pour la première fois en juin 2020.

source: The Rolling distribution of ROS 2 serves two purposes:
fr: La distribution Rolling de ROS 2 a deux objectifs :

source: it is a staging area for future stable distributions of ROS 2, and
fr: c'est une zone de transit pour les futures distributions stables de ROS 2, et

source: it is a collection of the most recent development releases.
fr: il s'agit d'une collection des versions de développement les plus récentes.

source: As the name implies, Rolling is continuously updated and **can have in-place updates that include breaking changes**. We recommend that most people use the most recent stable distribution instead (see :ref:`list_of_distributions`).
fr: Comme son nom l'indique, Rolling est continuellement mis à jour et ** peut avoir des mises à jour sur place qui incluent des changements de rupture **. Nous recommandons à la plupart des gens d'utiliser à la place la distribution stable la plus récente (voir :ref:`list_of_distributions`).

source: Packages released into the Rolling distribution will be automatically released into future stable distributions of ROS 2. :doc:`Releasing a ROS 2 package <../How-To-Guides/Releasing/Releasing-a-Package>` into the Rolling distribution follows the same procedures as all other ROS 2 distributions.
fr: Les packages publiés dans la distribution Rolling seront automatiquement publiés dans les futures distributions stables de ROS 2. suit les mêmes procédures que toutes les autres distributions ROS 2.
