Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Installation/Maintaining-a-Source-Checkout.po
Languages: fr

source: Maintain source checkout
fr: Maintenir la vérification de la source

source: If you have installed ROS 2 from source, there may have been changes made to the source code since the time that you checked it out. To keep your source checkout up to date, you will have to periodically update your ``ros2.repos`` file, download the latest sources, and rebuild your workspace.
fr: Si vous avez installé ROS 2 à partir de la source, des modifications ont peut-être été apportées au code source depuis le moment où vous l'avez extrait. Pour garder votre extraction de source à jour, vous devrez périodiquement mettre à jour votre fichier ``ros2.repos``, télécharger les dernières sources et reconstruire votre espace de travail.

source: Update your repository list
fr: Mettre à jour votre liste de référentiels

source: Each ROS 2 release includes a ``ros2.repos`` file that contains the list of repositories and their version for that release.
fr: Chaque version de ROS 2 inclut un fichier ``ros2.repos`` qui contient la liste des référentiels et leur version pour cette version.

source: Latest ROS 2 Rolling branches
fr: Dernières agences ROS 2 Rolling

source: If you wish to checkout the latest code for ROS 2 Rolling, you can get the relevant repository list by running:
fr: Si vous souhaitez vérifier le dernier code pour ROS 2 Rolling, vous pouvez obtenir la liste des référentiels pertinents en exécutant :

source: Windows
fr: les fenêtres

source: Update your repositories
fr: Mettez à jour vos référentiels

source: You will notice that in the `ros2.repos <https://raw.githubusercontent.com/ros2/ros2/rolling/ros2.repos>`__ file, each repository has a ``version`` associated with it that points to a particular commit hash, tag, or branch name. It is possible that these versions refer to new tags/branches that your local copy of the repositories will not recognize as they are out-of-date. Because of this, you should update the repositories that you have already checked out with the following command:
fr: Vous remarquerez que dans le fichier `ros2.repos <https://raw.githubusercontent.com/ros2/ros2/rolling/ros2.repos>`__, chaque référentiel est associé à une ``version`` qui pointe vers un hachage de validation, une balise ou un nom de branche particulier. Il est possible que ces versions fassent référence à de nouvelles balises/branches que votre copie locale des référentiels ne reconnaîtra pas car elles sont obsolètes. Pour cette raison, vous devez mettre à jour les référentiels que vous avez déjà extraits avec la commande suivante :

source: Download the new source code
fr: Télécharger le nouveau code source

source: You should now be able to download the sources associated with the new repository list with:
fr: Vous devriez maintenant pouvoir télécharger les sources associées à la nouvelle liste de dépôts avec :

source: Rebuild your workspace
fr: Reconstruisez votre espace de travail

source: Now that the workspace is up to date with the latest sources, remove your previous install and rebuild your workspace with, for example:
fr: Maintenant que l'espace de travail est à jour avec les dernières sources, supprimez votre installation précédente et reconstruisez votre espace de travail avec, par exemple :

source: Inspect your source checkout
fr: Inspectez votre caisse de source

source: During your development you may have deviated from the original state of your workspace from when you imported the repository list. If you wish to know the versions of the set of repositories in your workspace, you can export the information using the following command:
fr: Au cours de votre développement, vous avez peut-être dévié de l'état d'origine de votre espace de travail au moment où vous avez importé la liste des référentiels. Si vous souhaitez connaître les versions de l'ensemble des dépôts de votre espace de travail, vous pouvez exporter les informations à l'aide de la commande suivante :

source: This ``my_ros2.repos`` file can then be shared with others so that they can reproduce the state of the repositories in your workspace.
fr: Ce fichier ``my_ros2.repos`` peut ensuite être partagé avec d'autres afin qu'ils puissent reproduire l'état des dépôts dans votre espace de travail.
