Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Installation/Testing.po
Languages: fr

source: Testing with pre-release binaries
fr: Tester avec des binaires de pré-version

source: Many ROS packages are provided as pre-built binaries. Usually, you will get the released version of binaries when following :doc:`../Installation`. There are also pre-released versions of binaries that are useful for testing before making an official release. This article describes several options if you would like to try out pre-released versions of ROS binaries.
fr: De nombreux packages ROS sont fournis sous forme de fichiers binaires pré-construits. Habituellement, vous obtiendrez la version publiée des binaires en suivant :doc:`../Installation`. Il existe également des versions pré-publiées de binaires qui sont utiles pour les tests avant de faire une version officielle. Cet article décrit plusieurs options si vous souhaitez essayer des versions pré-publiées des binaires ROS.

source: Debian testing repository
fr: Référentiel de test Debian

source: When packages are released into a ROS distribution (using bloom), the buildfarm builds them into debian packages which are stored temporarily in the **building** apt repository. As dependent packages are rebuilt, an automatic process periodically synchronizes the packages in **building** to a secondary repository called **ros-testing**. **ros-testing** is intended as a soaking area where developers and bleeding-edge users may give the packages extra testing, before they are manually synced into the public ros repository from which users typically install packages.
fr: Lorsque des packages sont publiés dans une distribution ROS (à l'aide de bloom), le buildfarm les construit dans des packages debian qui sont stockés temporairement dans le dépôt **building** apt. Au fur et à mesure que les packages dépendants sont reconstruits, un processus automatique synchronise périodiquement les packages dans **building** avec un référentiel secondaire appelé **ros-testing**. **ros-testing** est conçu comme une zone de trempage où les développeurs et les utilisateurs à la pointe de la technologie peuvent effectuer des tests supplémentaires sur les packages, avant qu'ils ne soient synchronisés manuellement dans le référentiel ros public à partir duquel les utilisateurs installent généralement les packages.

source: Approximately every two weeks, the rosdistro's release manager manually synchronizes the contents of **ros-testing** into the **main** ROS repository.
fr: Environ toutes les deux semaines, le gestionnaire de publication de rosdistro synchronise manuellement le contenu de **ros-testing** dans le référentiel ROS **principal**.

source: For Debian-based operating systems, you can install binary packages from the **ros-testing** repository.
fr: Pour les systèmes d'exploitation basés sur Debian, vous pouvez installer des packages binaires à partir du référentiel **ros-testing**.

source: Make sure you have a working ROS 2 installation from Debian packages (see :doc:`../Installation`).
fr: Assurez-vous d'avoir une installation ROS 2 fonctionnelle à partir des packages Debian (voir :doc:`../Installation`).

source: Edit (with sudo) the file ``/etc/apt/sources.list.d/ros2-latest.list`` and change ``ros2`` with ``ros2-testing``. For example, on Ubuntu Jammy the contents should look like the following:
fr: Modifiez (avec sudo) le fichier ``/etc/apt/sources.list.d/ros2-latest.list`` et remplacez ``ros2`` par ``ros2-testing``. Par exemple, sur Ubuntu Jammy, le contenu devrait ressembler à ceci :

source: Update the ``apt`` index:
fr: Mettez à jour l'index ``apt`` :

source: You can now install individual packages from the testing repository, for example:
fr: Vous pouvez désormais installer des packages individuels à partir du référentiel testing, par exemple :

source: Alternatively, you can move your entire ROS 2 installation to the testing repository:
fr: Vous pouvez également déplacer l'intégralité de votre installation ROS 2 vers le référentiel testing :

source: Once you are finished testing, you can switch back to the normal repository by changing back the contents of ``/etc/apt/sources.list.d/ros2-latest.list``:
fr: Une fois que vous avez terminé les tests, vous pouvez revenir au référentiel normal en modifiant le contenu de ``/etc/apt/sources.list.d/ros2-latest.list`` :

source: and doing an update and upgrade:
fr: et faire une mise à jour et une mise à niveau :

source: Fat binaries
fr: Fichiers binaires gras

source: For core packages, we run nightly packaging jobs for Ubuntu Linux, RHEL, and Windows. These packaging jobs produce archives with pre-built binaries that can be downloaded and extracted to your filesystem.
fr: Pour les packages de base, nous exécutons des tâches d'empaquetage nocturnes pour Ubuntu Linux, RHEL et Windows. Ces travaux d'empaquetage produisent des archives avec des binaires pré-construits qui peuvent être téléchargés et extraits sur votre système de fichiers.

source: Make sure you have all dependencies installed according to the :doc:`latest development setup <Alternatives/Latest-Development-Setup>` for your platform.
fr: Assurez-vous que toutes les dépendances sont installées conformément à la :doc:`dernière configuration de développement <Alternatives/Latest-Development-Setup>` pour votre plate-forme.

source: Go to https://ci.ros2.org/view/packaging/ and select a packaging job from the list corresponding to your platform.
fr: Allez sur https://ci.ros2.org/view/packaging/ et sélectionnez une tâche de packaging dans la liste correspondant à votre plateforme.

source: Under the heading "Last Successful Artifacts" you should see a download link (e.g. for Windows, ``ros2-package-windows-AMD64.zip``).
fr: Sous le titre "Derniers artefacts réussis", vous devriez voir un lien de téléchargement (par exemple, pour Windows, ``ros2-package-windows-AMD64.zip``).

source: Download and extract the archive to your file system.
fr: Téléchargez et extrayez l'archive dans votre système de fichiers.

source: To use the fat binary installation, source the ``setup.*`` file that can be found in the root of the archive.
fr: Pour utiliser l'installation binaire fat, sourcez le fichier ``setup.*`` qui se trouve à la racine de l'archive.

source: Ubuntu Linux and RHEL
fr: Ubuntu Linux et RHEL

source: Windows
fr: les fenêtres

source: For Ubuntu Linux, there is also a nightly Docker image based on the nightly fat archive.
fr: Pour Ubuntu Linux, il existe également une image Docker nocturne basée sur l'archive nocturne Fat.

source: Pull the Docker image:
fr: Extrayez l'image Docker :

source: Start an interactive container:
fr: Démarrez un conteneur interactif :

source: For support on running GUI applications in Docker, take a look at the tutorial `User GUI's with Docker <https://wiki.ros.org/docker/Tutorials/GUI>`_ or the tool `rocker <https://github.com/osrf/rocker>`_.
fr: Pour obtenir de l'aide sur l'exécution d'applications GUI dans Docker, consultez le tutoriel `User GUI's with Docker <https://wiki.ros.org/docker/Tutorials/GUI>`_ ou l'outil `rocker <https://github .com/osrf/rocker>`_.
