Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Tutorials/Beginner-CLI-Tools/Introducing-Turtlesim/Introducing-Turtlesim.po
Languages: fr

source: Using ``turtlesim`` and ``rqt``
fr: Utiliser ``turtlesim`` et ``rqt``

source: **Goal:** Install and use the turtlesim package and rqt tools to prepare for upcoming tutorials.
fr: **Objectif :** Installez et utilisez le package turtlesim et les outils rqt pour vous préparer aux prochains didacticiels.

source: **Tutorial level:** Beginner
fr: **Niveau du tutoriel :** Débutant

source: **Time:** 15 minutes
fr: **Durée :** 15 minutes

source: Contents
fr: Contenu

source: Background
fr: Arrière-plan

source: Turtlesim is a lightweight simulator for learning ROS 2. It illustrates what ROS 2 does at the most basic level, to give you an idea of what you will do with a real robot or robot simulation later on.
fr: Turtlesim est un simulateur léger pour apprendre ROS 2. Il illustre ce que fait ROS 2 au niveau le plus élémentaire, pour vous donner une idée de ce que vous ferez plus tard avec un vrai robot ou une simulation de robot.

source: rqt is a GUI tool for ROS 2. Everything done in rqt can be done on the command line, but it provides an easier, more user-friendly way to manipulate ROS 2 elements.
fr: rqt est un outil graphique pour ROS 2. Tout ce qui est fait dans rqt peut être fait sur la ligne de commande, mais il offre un moyen plus simple et plus convivial de manipuler les éléments ROS 2.

source: This tutorial touches on core ROS 2 concepts, like the separation of nodes, topics, and services. All of these concepts will be elaborated on in later tutorials; for now, you will simply set up the tools and get a feel for them.
fr: Ce didacticiel aborde les concepts de base de ROS 2, comme la séparation des nœuds, des sujets et des services. Tous ces concepts seront développés dans des tutoriels ultérieurs ; pour l'instant, vous allez simplement configurer les outils et vous en faire une idée.

source: Prerequisites
fr: Conditions préalables

source: The previous tutorial, :doc:`../Configuring-ROS2-Environment`, will show you how to set up your environment.
fr: Le didacticiel précédent, :doc:`../Configuring-ROS2-Environment`, vous montrera comment configurer votre environnement.

source: Tasks
fr: Tâches

source: 1 Install turtlesim
fr: 1 Installer tortuesim

source: As always, start by sourcing your setup files in a new terminal, as described in the :doc:`previous tutorial <../Configuring-ROS2-Environment>`.
fr: Comme toujours, commencez par rechercher vos fichiers d'installation dans un nouveau terminal, comme décrit dans le :doc:`tutoriel précédent <../Configuring-ROS2-Environment>`.

source: Install the turtlesim package for your ROS 2 distro:
fr: Installez le package turtlesim pour votre distribution ROS 2 :

source: As long as the archive you installed ROS 2 from contains the ``ros_tutorials`` repository, you should already have turtlesim installed.
fr: Tant que l'archive à partir de laquelle vous avez installé ROS 2 contient le référentiel ``ros_tutorials``, vous devriez déjà avoir installé turtlesim.

source: Windows
fr: les fenêtres

source: Check that the package installed:
fr: Vérifiez que le package installé :

source: The above command should return a list of turtlesim's executables:
fr: La commande ci-dessus devrait renvoyer une liste des exécutables de turtlesim :

source: 2 Start turtlesim
fr: 2 Démarrer tortuesim

source: To start turtlesim, enter the following command in your terminal:
fr: Pour démarrer turtlesim, saisissez la commande suivante dans votre terminal :

source: The simulator window should appear, with a random turtle in the center.
fr: La fenêtre du simulateur devrait apparaître, avec une tortue aléatoire au centre.

source: In the terminal under the command, you will see messages from the node:
fr: Dans le terminal sous la commande, vous verrez les messages du nœud :

source: Here you can see your default turtle’s name is ``turtle1``, and the default coordinates where it spawns.
fr: Ici, vous pouvez voir que le nom de votre tortue par défaut est ``turtle1``, et les coordonnées par défaut où elle apparaît.

source: 3 Use turtlesim
fr: 3 Utiliser tortuesim

source: Open a new terminal and source ROS 2 again.
fr: Ouvrez un nouveau terminal et sourcez à nouveau ROS 2.

source: Now you will run a new node to control the turtle in the first node:
fr: Vous allez maintenant exécuter un nouveau nœud pour contrôler la tortue dans le premier nœud :

source: At this point you should have three windows open: a terminal running ``turtlesim_node``, a terminal running ``turtle_teleop_key`` and the turtlesim window. Arrange these windows so that you can see the turtlesim window, but also have the terminal running ``turtle_teleop_key`` active so that you can control the turtle in turtlesim.
fr: À ce stade, vous devriez avoir trois fenêtres ouvertes : un terminal exécutant ``turtlesim_node``, un terminal exécutant ``turtle_teleop_key`` et la fenêtre turtlesim. Disposez ces fenêtres de manière à voir la fenêtre de turtlesim, mais activez également le terminal exécutant ``turtle_teleop_key`` afin que vous puissiez contrôler la tortue dans turtlesim.

source: Use the arrow keys on your keyboard to control the turtle. It will move around the screen, using its attached "pen" to draw the path it followed so far.
fr: Utilisez les touches fléchées de votre clavier pour contrôler la tortue. Il se déplacera sur l'écran, en utilisant son "stylo" attaché pour tracer le chemin qu'il a suivi jusqu'à présent.

source: Pressing an arrow key will only cause the turtle to move a short distance and then stop. This is because, realistically, you wouldn’t want a robot to continue carrying on an instruction if, for example, the operator lost the connection to the robot.
fr: Si vous appuyez sur une touche fléchée, la tortue ne se déplacera que sur une courte distance, puis s'arrêtera. En effet, de manière réaliste, vous ne voudriez pas qu'un robot continue à exécuter une instruction si, par exemple, l'opérateur perdait la connexion avec le robot.

source: You can see the nodes and their associated services, topics, and actions using the ``list`` command:
fr: Vous pouvez voir les nœuds et leurs services, sujets et actions associés à l'aide de la commande ``list`` :

source: You will learn more about these concepts in the coming tutorials. Since the goal of this tutorial is only to get a general overview of turtlesim, we will use rqt (a graphical user interface for ROS 2) to look at services a little closer.
fr: Vous en apprendrez plus sur ces concepts dans les prochains tutoriels. Étant donné que le but de ce didacticiel est uniquement d'obtenir un aperçu général de turtlesim, nous utiliserons rqt (une interface utilisateur graphique pour ROS 2) pour examiner les services d'un peu plus près.

source: 4 Install rqt
fr: h Installer

source: Open a new terminal to install ``rqt`` and its plugins:
fr: Ouvrez un nouveau terminal pour installer ``rqt`` et ses plugins :

source: Linux (apt 2.0/Ubuntu 20.04 and newer)
fr: Linux (apt 2.0/Ubuntu 20.04 et plus récent)

source: Linux (apt 1.x/Ubuntu 18.04 and older)
fr: Linux (apt 1.x/Ubuntu 18.04 et versions antérieures)

source: The standard archive for installing ROS 2 on macOS contains ``rqt`` and its plugins, so you should already have ``rqt`` installed.
fr: L'archive standard pour l'installation de ROS 2 sur macOS contient ``rqt`` et ses plugins, vous devriez donc déjà avoir installé ``rqt``.

source: The standard archive for installing ROS 2 on Windows contains ``rqt`` and its plugins, so you should already have ``rqt`` installed.
fr: L'archive standard pour l'installation de ROS 2 sur Windows contient ``rqt`` et ses plugins, donc vous devriez déjà avoir ``rqt`` installé.

source: To run rqt:
fr: Il fonctionne :

source: 5 Use rqt
fr: 5 Ils économisent

source: After running rqt the first time, the window will be blank. No worries; just select **Plugins** > **Services** > **Service Caller** from the menu bar at the top.
fr: Après avoir exécuté rqt la première fois, la fenêtre sera vide. Pas de soucis; sélectionnez simplement **Plugins** > **Services** > **Service Caller** dans la barre de menu en haut.

source: It may take some time for rqt to locate all the plugins itself. If you click on **Plugins**, but don’t see **Services** or any other options, you should close rqt, enter the command ``rqt --force-discover`` in your terminal.
fr: Cela peut prendre un certain temps à rqt pour localiser tous les plugins lui-même. Si vous cliquez sur **Plugins**, mais ne voyez pas **Services** ou toute autre option, vous devez fermer rqt, entrez la commande ``rqt --force-discover`` dans votre terminal.

source: Use the refresh button to the left of the **Service** dropdown list to ensure all the services of your turtlesim node are available.
fr: Utilisez le bouton d'actualisation à gauche de la liste déroulante **Service** pour vous assurer que tous les services de votre nœud turtlesim sont disponibles.

source: Click on the **Service** dropdown list to see turtlesim's services, and select the ``/spawn`` service.
fr: Cliquez sur la liste déroulante **Service** pour voir les services de turtlesim, et sélectionnez le service ``/spawn``.

source: 5.1 Try the spawn service
fr: 5.1 Essayez le service de spawn

source: Let’s use rqt to call the ``/spawn`` service. You can guess from its name that ``/spawn`` will create another turtle in the turtlesim window.
fr: Utilisons rqt pour appeler le service ``/spawn``. Vous pouvez deviner d'après son nom que ``/spawn`` créera une autre tortue dans la fenêtre turtlesim.

source: Give the new turtle a unique name, like ``turtle2`` by double-clicking between the empty single quotes in the **Expression** column. You can see that this expression corresponds to the **name** value, and is of type **string**.
fr: Donnez à la nouvelle tortue un nom unique, comme ``turtle2`` en double-cliquant entre les guillemets simples vides dans la colonne **Expression**. Vous pouvez voir que cette expression correspond à la valeur **name** et est de type **string**.

source: Enter new coordinates for the turtle to spawn at, like ``x = 1.0`` and ``y = 1.0``.
fr: Entrez de nouvelles coordonnées pour que la tortue apparaisse, comme ``x = 1.0`` et ``y = 1.0``.

source: If you try to spawn a new turtle with the same name as an existing turtle, like your default ``turtle1``, you will get an error message in the terminal running ``turtlesim_node``:
fr: Si vous essayez de faire apparaître une nouvelle tortue avec le même nom qu'une tortue existante, comme votre ``turtle1`` par défaut, vous obtiendrez un message d'erreur dans le terminal exécutant ``turtlesim_node`` :

source: To spawn turtle2, you have to call the service by clicking the **Call** button on the upper right side of the rqt window.
fr: Pour faire apparaître turtle2, vous devez appeler le service en cliquant sur le bouton **Appeler** en haut à droite de la fenêtre rqt.

source: You will see a new turtle (again with a random design) spawn at the coordinates you input for **x** and **y**.
fr: Vous verrez une nouvelle tortue (encore une fois avec un design aléatoire) apparaître aux coordonnées que vous avez saisies pour **x** et **y**.

source: If you refresh the service list in rqt, you will also see that now there are services related to the new turtle, ``/turtle2/…``, in addition to ``/turtle1/…``.
fr: Si vous actualisez la liste des services dans rqt, vous verrez également qu'il existe désormais des services liés à la nouvelle tortue, ``/turtle2/…``, en plus de ``/turtle1/…``.

source: 5.2 Try the set_pen service
fr: 5.2 Essayez le service set_pen

source: Now let's give turtle1 a unique pen using the ``/set_pen`` service:
fr: Donnons maintenant à turtle1 un stylet unique en utilisant le service ``/set_pen`` :

source: The values for **r**, **g** and **b**, between 0 and 255, will set the color of the pen turtle1 draws with, and **width** sets the thickness of the line.
fr: Les valeurs de **r**, **g** et **b**, entre 0 et 255, définiront la couleur de la plume que la tortue1 dessine, et **width** définit l'épaisseur de la ligne.

source: To have turtle1 draw with a distinct red line, change the value of **r** to 255, and the value of **width** to 5. Don't forget to call the service after updating the values.
fr: Pour que turtle1 dessine avec une ligne rouge distincte, changez la valeur de **r** à 255 et la valeur de **width** à 5. N'oubliez pas d'appeler le service après avoir mis à jour les valeurs.

source: If you return to the terminal where ``turtle_teleop_key`` is running and press the arrow keys, you will see turtle1’s pen has changed.
fr: Si vous revenez au terminal où ``turtle_teleop_key`` est en cours d'exécution et appuyez sur les touches fléchées, vous verrez que le stylo de turtle1 a changé.

source: You've probably noticed that there's no way to move turtle2. You can accomplish this by remapping turtle1's ``cmd_vel`` topic onto turtle2.
fr: Vous avez probablement remarqué qu'il n'y a aucun moyen de déplacer turtle2. Vous pouvez accomplir cela en remappant le sujet ``cmd_vel`` de turtle1 sur turtle2.

source: 6 Remapping
fr: 6 Remappage

source: In a new terminal, source ROS 2, and run:
fr: Dans un nouveau terminal, sourcez ROS 2 et exécutez :

source: Now you can move turtle2 when this terminal is active, and turtle1 when the other terminal running the ``turtle_teleop_key`` is active.
fr: Vous pouvez maintenant déplacer la tortue2 lorsque ce terminal est actif, et la tortue1 lorsque l'autre terminal exécutant la ``turtle_teleop_key`` est actif.

source: 7 Close turtlesim
fr: 7 Fermer tortuesim

source: To stop the simulation, you can enter ``Ctrl + C`` in the ``turtlesim_node`` terminal, and ``q`` in the teleop terminal.
fr: Pour arrêter la simulation, vous pouvez entrer ``Ctrl + C`` dans le terminal ``turtlesim_node``, et ``q`` dans le terminal teleop.

source: Summary
fr: Résumé

source: Using turtlesim and rqt is a great way to learn the core concepts of ROS 2.
fr: Utiliser turtlesim et rqt est un excellent moyen d'apprendre les concepts de base de ROS 2.

source: Next steps
fr: Prochaines étapes

source: Now that you have turtlesim and rqt up and running, and an idea of how they work, let's dive in to the first core ROS 2 concept with the next tutorial, :doc:`../Understanding-ROS2-Nodes/Understanding-ROS2-Nodes`.
fr: Maintenant que turtlesim et rqt sont opérationnels et que vous avez une idée de leur fonctionnement, plongeons-nous dans le premier concept de base de ROS 2 avec le prochain tutoriel, :doc:`../Understanding-ROS2-Nodes/Understanding-ROS2 -Nœuds`.

source: Related content
fr: Contenu connexe

source: The turtlesim package can be found in the `ros_tutorials repo <https://github.com/ros/ros_tutorials/tree/humble/turtlesim>`_. Make sure to adjust the branch to view the version of turtlesim corresponding to your installed ROS 2 distro.
fr: Le package turtlesim se trouve dans le dépôt `ros_tutorials <https://github.com/ros/ros_tutorials/tree/humble/turtlesim>`_. Assurez-vous d'ajuster la branche pour afficher la version de turtlesim correspondant à votre distribution ROS 2 installée.

source: `This community contributed video <https://youtu.be/xwT7XWflMdc>`_ demonstrates many of the items covered in this tutorial.
fr: `Cette communauté a contribué à la vidéo <https://youtu.be/xwT7XWflMdc>`_ montre de nombreux éléments couverts dans ce didacticiel.
