Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Tutorials/Demos/Content-Filtering-Subscription.po
Languages: fr

source: Creating a content filtering subscription
fr: Création d'un abonnement au filtrage de contenu

source: **Goal:** Create a content filtering subscription.
fr: **Objectif :** Créer un abonnement au filtrage de contenu.

source: **Tutorial level:** Advanced
fr: **Niveau du didacticiel :** Avancé

source: **Time:** 15 minutes
fr: **Durée :** 15 minutes

source: Table of Contents
fr: Table des matières

source: Overview
fr: Aperçu

source: ROS 2 applications typically consist of topics to transmit data from publishers to subscriptions. Basically, subscriptions receive all published data from publishers on the topic. But sometimes, a subscription might be interested in only a subset of the data which is being sent by publishers. A content filtering subscription allows to receive only the data of interest for the application.
fr: Les applications ROS 2 consistent généralement en des sujets pour transmettre des données des éditeurs aux abonnements. Fondamentalement, les abonnements reçoivent toutes les données publiées des éditeurs sur le sujet. Mais parfois, un abonnement peut ne s'intéresser qu'à un sous-ensemble des données envoyées par les éditeurs. Un abonnement de filtrage de contenu permet de recevoir uniquement les données d'intérêt pour l'application.

source: In this demo, we'll be highlighting how to create a content filtering subscription and how they work.
fr: Dans cette démo, nous expliquerons comment créer un abonnement de filtrage de contenu et comment ils fonctionnent.

source: RMW Support
fr: Assistance RMW

source: Content filtering subscriptions require RMW implementation support.
fr: Les abonnements au filtrage de contenu nécessitent la prise en charge de la mise en œuvre de RMW.

source: Content-Filtering-Subscription Support Status
fr: Statut de prise en charge du filtrage de contenu et de l'abonnement

source: supported
fr: prise en charge

source: not supported
fr: non supporté

source: Currently all RMW implementations that support content filtering subscriptions are `DDS <https://www.omg.org/omg-dds-portal/>`__ based. That means that the supported filtering expressions and parameters are also dependent on `DDS <https://www.omg.org/omg-dds-portal/>`__, you can refer to `DDS specification <https://www.omg.org/spec/DDS/1.4/PDF>`__ ``Annex B - Syntax for Queries and Filters`` for details.
fr: Actuellement, toutes les implémentations RMW qui prennent en charge les abonnements au filtrage de contenu sont basées sur `DDS <https://www.omg.org/omg-dds-portal/>`__. Cela signifie que les expressions et paramètres de filtrage pris en charge dépendent également de `DDS <https://www.omg.org/omg-dds-portal/>`__, vous pouvez vous référer à la `spécification DDS <https://www. omg.org/spec/DDS/1.4/PDF>`__ ``Annexe B - Syntaxe pour les requêtes et les filtres`` pour plus de détails.

source: Installing the demo
fr: Installation de la démo

source: See the :doc:`installation instructions <../../Installation>` for details on installing ROS 2.
fr: Consultez les :doc:`instructions d'installation <../../Installation>` pour plus de détails sur l'installation de ROS 2.

source: If you've installed ROS 2 from packages, ensure that you have ``ros-rolling-demo-nodes-cpp`` installed. If you downloaded the archive or built ROS 2 from source, it will already be part of the installation.
fr: Si vous avez installé ROS 2 à partir de packages, assurez-vous que ``ros-rolling-demo-nodes-cpp`` est installé. Si vous avez téléchargé l'archive ou construit ROS 2 à partir de la source, cela fera déjà partie de l'installation.

source: Temperature filtering demo
fr: Démo de filtrage de température

source: This demo shows how a content filtering subscription can be used to only receive temperature values that are out of the acceptable temperature range, detecting emergencies. The content filtering subscription filters out the uninteresting temperature data, so that the subscription callback is not issued.
fr: Cette démo montre comment un abonnement de filtrage de contenu peut être utilisé pour ne recevoir que des valeurs de température qui sont hors de la plage de température acceptable, en détectant les urgences. L'abonnement de filtrage de contenu filtre les données de température inintéressantes, de sorte que le rappel d'abonnement n'est pas émis.

source: ContentFilteringPublisher:
fr: Éditeur de filtrage de contenu :

source: The content filter is defined in the subscription side, publishers don't need to be configured in any special way to allow content filtering. The ``ContentFilteringPublisher`` node publishes simulated temperature data starting from -100.0 and ending at 150.0 with a step size of 10.0 every second.
fr: Le filtre de contenu est défini du côté de l'abonnement, les éditeurs n'ont pas besoin d'être configurés de manière particulière pour autoriser le filtrage de contenu. Le nœud ``ContentFilteringPublisher`` publie des données de température simulées à partir de -100,0 et se terminant à 150,0 avec une taille de pas de 10,0 chaque seconde.

source: We can run the demo by running the ``ros2 run demo_nodes_cpp content_filtering_publisher`` executable (don't forget to source the setup file first):
fr: Nous pouvons exécuter la démo en exécutant l'exécutable ``ros2 run demo_nodes_cpp content_filtering_publisher`` (n'oubliez pas de sourcer le fichier d'installation en premier) :

source: ContentFilteringSubscriber:
fr: Abonné FiltrageContenu :

source: To enable content filtering, applications can set the filtering expression and the expression parameters in ``SubscriptionOptions``. The application can also check if content filtering is enabled on the subscription.
fr: Pour activer le filtrage de contenu, les applications peuvent définir l'expression de filtrage et les paramètres d'expression dans ``SubscriptionOptions``. L'application peut également vérifier si le filtrage de contenu est activé sur l'abonnement.

source: In this demo, the ``ContentFilteringSubscriber`` node creates a content filtering subscription that receives a message only if the temperature value is less than -30.0 or greater than 100.0.
fr: Dans cette démo, le nœud ``ContentFilteringSubscriber`` crée un abonnement de filtrage de contenu qui reçoit un message uniquement si la valeur de température est inférieure à -30,0 ou supérieure à 100,0.

source: As commented before, content filtering subscription support depends on the RMW implementation. Applications can use the ``is_cft_enabled`` method to check if content filtering is actually enabled on the subscription.
fr: Comme indiqué précédemment, la prise en charge de l'abonnement au filtrage de contenu dépend de l'implémentation RMW. Les applications peuvent utiliser la méthode ``is_cft_enabled`` pour vérifier si le filtrage de contenu est réellement activé sur l'abonnement.

source: To test content filtering subscription, let's run it:
fr: Pour tester l'abonnement au filtrage de contenu, exécutons-le :

source: You should see a message showing the content filtering options used and logs for each message received only if the temperature value is less than -30.0 or greater than 100.0.
fr: Vous devriez voir un message indiquant les options de filtrage de contenu utilisées et les journaux pour chaque message reçu uniquement si la valeur de température est inférieure à -30,0 ou supérieure à 100,0.

source: If content filtering is not supported by the RMW implementation, the subscription will still be created without content filtering enabled. We can try that by executing ``RMW_IMPLEMENTATION=rmw_cyclonedds_cpp ros2 run demo_nodes_cpp content_filtering_publisher``.
fr: Si le filtrage de contenu n'est pas pris en charge par l'implémentation RMW, l'abonnement sera toujours créé sans le filtrage de contenu activé. Nous pouvons essayer cela en exécutant ``RMW_IMPLEMENTATION=rmw_cyclonedds_cpp ros2 run demo_nodes_cpp content_filtering_publisher``.

source: You can see the message ``Content filter is not enabled`` because underlying RMW implementation does not support the feature, but the demo still successfully creates the normal subscription to receive all temperature data.
fr: Vous pouvez voir le message ``Le filtre de contenu n'est pas activé`` car l'implémentation RMW sous-jacente ne prend pas en charge la fonctionnalité, mais la démo crée toujours avec succès l'abonnement normal pour recevoir toutes les données de température.

source: Related content
fr: Contenu connexe

source: `content filtering examples <https://github.com/ros2/examples/blob/rolling/rclcpp/topics/minimal_subscriber/content_filtering.cpp>`__ that covers all interfaces for content filtering subscription.
fr: `Exemples de filtrage de contenu <https://github.com/ros2/examples/blob/rolling/rclcpp/topics/minimal_subscriber/content_filtering.cpp>`__ qui couvre toutes les interfaces pour l'abonnement au filtrage de contenu.

source: `content filtering design PR <https://github.com/ros2/design/pull/282>`__
fr: `conception de filtrage de contenu PR <https://github.com/ros2/design/pull/282>`__
