Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Tutorials/Demos/dummy-robot-demo.po
Languages: fr

source: Experimenting with a dummy robot
fr: Expérimenter avec un robot factice

source: In this demo, we present a simple demo robot with all components from publishing joint states over publishing fake laser data until visualizing the robot model on a map in RViz.
fr: Dans cette démo, nous présentons un robot de démonstration simple avec tous les composants, de la publication d'états communs à la publication de fausses données laser jusqu'à la visualisation du modèle de robot sur une carte dans RViz.

source: Launching the demo
fr: Lancement de la démo

source: We assume your ROS 2 installation dir as ``~/ros2_ws``. Please change the directories according to your platform.
fr: Nous supposons que votre répertoire d'installation ROS 2 est ``~/ros2_ws``. Veuillez modifier les répertoires en fonction de votre plate-forme.

source: To start the demo, we execute the demo bringup launch file, which we are going to explain in more details in the next section.
fr: Pour démarrer la démo, nous exécutons le fichier de lancement de démo bringup, que nous allons expliquer plus en détail dans la section suivante.

source: You should see some prints inside your terminal along the lines of the following:
fr: Vous devriez voir quelques impressions à l'intérieur de votre terminal dans le sens de ce qui suit :

source: If you now open in a next terminal your RViz, you'll see your robot. 🎉
fr: Si vous ouvrez maintenant dans un prochain terminal votre RViz, vous verrez votre robot. 🎉

source: This opens RViz2. Assuming you have your dummy_robot_bringup still launched, you can now add the TF display plugin and configure your global frame to ``world``. Once you did that, you should see a similar picture:
fr: Cela ouvre RViz2. En supposant que votre dummy_robot_bringup soit toujours lancé, vous pouvez maintenant ajouter le plugin d'affichage TF et configurer votre cadre global sur ``world``. Une fois que vous avez fait cela, vous devriez voir une image similaire :

source: What's happening?
fr: Ce qui se passe?

source: If you have a closer look at the launch file, we start a couple of nodes at the same time.
fr: Si vous regardez de plus près le fichier de lancement, nous démarrons quelques nœuds en même temps.

source: dummy_laser
fr: mannequin_laser

source: The first two packages are relatively simple. The ``dummy_map_server`` constantly publishes an empty map with a periodic update. The ``dummy_laser`` does basically the same; publishing dummy fake laser scans.
fr: Les deux premiers packages sont relativement simples. Le ``dummy_map_server`` publie constamment une carte vide avec une mise à jour périodique. Le ``dummy_laser`` fait fondamentalement la même chose ; publication de faux scans laser factices.

source: The ``dummy_joint_states`` node is publishing fake joint state data. As we are publishing a simple RRbot with only two joints, this node publishes joint states values for these two joints.
fr: Le nœud ``dummy_joint_states`` publie de fausses données d'état commun. Comme nous publions un RRbot simple avec seulement deux articulations, ce nœud publie des valeurs d'états conjoints pour ces deux articulations.

source: The ``robot_state_publisher`` is doing the actual interesting work. It parses the given URDF file, extracts the robot model and listens to the incoming joint states. With this information, it publishes TF values for our robot which we visualize in RViz.
fr: Le ``robot_state_publisher`` fait le vrai travail intéressant. Il analyse le fichier URDF donné, extrait le modèle de robot et écoute les états conjoints entrants. Avec ces informations, il publie les valeurs TF pour notre robot que nous visualisons dans RViz.

source: Hooray!
fr: Hourra !
