Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Tutorials/Demos/Logging-and-logger-configuration.po
Languages: fr

source: Logging
fr: Enregistrement

source: Table of Contents
fr: Table des matières

source: See `the logging page <../../Concepts/About-Logging>` for details on available functionality.
fr: Voir `la page de journalisation <../../Concepts/About-Logging>` pour plus de détails sur les fonctionnalités disponibles.

source: Using log statements in code
fr: Utilisation des instructions de journal dans le code

source: Basic logging
fr: Journalisation de base

source: The following code will output a log message from a ROS 2 node at ``DEBUG`` severity:
fr: Le code suivant affichera un message de journal à partir d'un nœud ROS 2 avec la gravité ``DEBUG`` :

source: Note that in both cases, no trailing newline is added, as the logging infrastructure will automatically add one.
fr: Notez que dans les deux cas, aucune nouvelle ligne de fin n'est ajoutée, car l'infrastructure de journalisation en ajoutera automatiquement une.

source: Logging only the first time
fr: Se connecter uniquement la première fois

source: The following code will output a log message from a ROS 2 node at ``INFO`` severity, but only the first time it is hit:
fr: Le code suivant affichera un message de journal d'un nœud ROS 2 avec la gravité ``INFO``, mais uniquement la première fois qu'il est atteint :

source: Logging all but the first time
fr: Journaliser tout sauf la première fois

source: The following code will output a log message from a ROS 2 node at ``WARN`` severity, but not the very first time it is hit:
fr: Le code suivant affichera un message de journal d'un nœud ROS 2 avec la gravité ``WARN``, mais pas la toute première fois qu'il est atteint :

source: Logging throttled
fr: Journalisation limitée

source: The following code will output a log message from a ROS 2 node at ``ERROR`` severity, but no more than once per second.
fr: Le code suivant affichera un message de journal d'un nœud ROS 2 avec la gravité ``ERROR``, mais pas plus d'une fois par seconde.

source: The interval parameter specifying milliseconds between messages should have an integer data type so it can be converted to a ``rcutils_duration_value_t`` (an ``int64_t``):
fr: Le paramètre d'intervalle spécifiant les millisecondes entre les messages doit avoir un type de données entier afin qu'il puisse être converti en ``rcutils_duration_value_t`` (un ``int64_t``) :

source: Logging throttled all but the first time
fr: La journalisation a été étranglée sauf la première fois

source: The following code will output a log message from a ROS 2 node at ``DEBUG`` severity, no more than once per second, skipping the very first time it is hit:
fr: Le code suivant affichera un message de journal d'un nœud ROS 2 à la gravité ``DEBUG``, pas plus d'une fois par seconde, en ignorant la toute première fois qu'il est atteint :

source: Logging demo
fr: Démo de journalisation

source: In this `demo <https://github.com/ros2/demos/tree/rolling/logging_demo>`_, different types of log calls are shown and the severity level of different loggers is configured locally and externally.
fr: Dans cette `démo <https://github.com/ros2/demos/tree/rolling/logging_demo>`_, différents types d'appels de journal sont affichés et le niveau de gravité des différents enregistreurs est configuré localement et en externe.

source: Start the demo with:
fr: Démarrez la démo avec :

source: Over time you will see output from various log calls with different properties. To start with you will only see output from log calls with severity ``INFO`` and above (``WARN``, ``ERROR``, ``FATAL``). Note that the first message will only be logged once, though the line is reached on each iteration, as that is a property of the log call used for that message.
fr: Au fil du temps, vous verrez la sortie de divers appels de journal avec différentes propriétés. Pour commencer, vous ne verrez que la sortie des appels de journal avec la sévérité ``INFO`` et supérieure (``WARN``, ``ERROR``, ``FATAL``). Notez que le premier message ne sera enregistré qu'une seule fois, bien que la ligne soit atteinte à chaque itération, car il s'agit d'une propriété de l'appel de journal utilisé pour ce message.

source: Logging directory configuration
fr: Configuration du répertoire de journalisation

source: The logging directory can be configured through two environment variables: ``ROS_LOG_DIR`` and ``ROS_HOME``. The logic is as follows:
fr: Le répertoire de journalisation peut être configuré via deux variables d'environnement : ``ROS_LOG_DIR`` et ``ROS_HOME``. La logique est la suivante:

source: Use ``$ROS_LOG_DIR`` if ``ROS_LOG_DIR`` is set and not empty.
fr: Utilisez ``$ROS_LOG_DIR`` si ``ROS_LOG_DIR`` est défini et non vide.

source: Otherwise, use ``$ROS_HOME/log``, using ``~/.ros`` for ``ROS_HOME`` if not set or if empty.
fr: Sinon, utilisez ``$ROS_HOME/log``, en utilisant ``~/.ros`` pour ``ROS_HOME`` s'il n'est pas défini ou s'il est vide.

source: For example, to set the logging directory to ``~/my_logs``:
fr: Par exemple, pour définir le répertoire de journalisation sur ``~/my_logs`` :

source: Windows
fr: les fenêtres

source: You will then find the logs under ``~/my_logs/``.
fr: Vous trouverez alors les logs sous ``~/my_logs/``.

source: Alternatively, you can set ``ROS_HOME`` and the logging directory will be relative to it (``$ROS_HOME/log``). ``ROS_HOME`` is intended to be used by anything that needs a base directory. Note that ``ROS_LOG_DIR`` has to be either unset or empty. For example, with ``ROS_HOME`` set to ``~/my_ros_home``:
fr: Alternativement, vous pouvez définir ``ROS_HOME`` et le répertoire de journalisation lui sera relatif (``$ROS_HOME/log``). ``ROS_HOME`` est destiné à être utilisé par tout ce qui a besoin d'un répertoire de base. Notez que ``ROS_LOG_DIR`` doit être non défini ou vide. Par exemple, avec ``ROS_HOME`` défini sur ``~/my_ros_home`` :

source: You will then find the logs under ``~/my_ros_home/log/``.
fr: Vous trouverez alors les logs sous ``~/my_ros_home/log/``.

source: Logger level configuration: programmatically
fr: Configuration au niveau de l'enregistreur : par programmation

source: After 10 iterations the level of the logger will be set to ``DEBUG``, which will cause additional messages to be logged.
fr: Après 10 itérations, le niveau de l'enregistreur sera défini sur ``DEBUG``, ce qui entraînera la journalisation de messages supplémentaires.

source: Some of these debug messages cause additional functions/expressions to be evaluated, which were previously skipped as ``DEBUG`` log calls were not enabled. See `the source code <https://github.com/ros2/demos/blob/rolling/logging_demo/src/logger_usage_component.cpp>`__ of the demo for further explanation of the calls used, and see the rclcpp logging documentation for a full list of supported logging calls.
fr: Certains de ces messages de débogage entraînent l'évaluation de fonctions/expressions supplémentaires, qui étaient auparavant ignorées car les appels de journal ``DEBUG`` n'étaient pas activés. Voir `le code source <https://github.com/ros2/demos/blob/rolling/logging_demo/src/logger_usage_component.cpp>`__ de la démo pour plus d'explications sur les appels utilisés, et voir la documentation de journalisation rclcpp pour une liste complète des appels de journalisation pris en charge.

source: Logger level configuration: externally
fr: Configuration au niveau de l'enregistreur : externe

source: In the future there will be a generalized approach to external configuration of loggers at runtime (similar to how `rqt_logger_level <https://wiki.ros.org/rqt_logger_level>`__ in ROS 1 allows logger configuration via remote procedural calls). **This concept is not yet officially supported in ROS 2.** In the meantime, this demo provides an **example** service that can be called externally to request configuration of logger levels for known names of loggers in the process.
fr: À l'avenir, il y aura une approche généralisée de la configuration externe des enregistreurs au moment de l'exécution (similaire à la façon dont `rqt_logger_level <https://wiki.ros.org/rqt_logger_level>`__ dans ROS 1 permet la configuration des enregistreurs via des appels procéduraux à distance). **Ce concept n'est pas encore officiellement pris en charge dans ROS 2.** En attendant, cette démo fournit un **exemple** de service qui peut être appelé en externe pour demander la configuration des niveaux d'enregistrement pour les noms connus des enregistreurs dans le processus.

source: The demo previously started is already running this example service. To set the level of the demo's logger back to ``INFO``\ , call the service with:
fr: La démo démarrée précédemment exécute déjà cet exemple de service. Pour remettre le niveau de l'enregistreur de la démo sur ``INFO``\ , appelez le service avec :

source: This service call will work on any logger that is running in the process provided that you know its name. This includes the loggers in the ROS 2 core, such as ``rcl`` (the common client library package). To enable debug logging for ``rcl``, call:
fr: Cet appel de service fonctionnera sur n'importe quel enregistreur en cours d'exécution dans le processus à condition que vous connaissiez son nom. Cela inclut les enregistreurs du noyau ROS 2, tels que ``rcl`` (le package de bibliothèque client commun). Pour activer la journalisation de débogage pour ``rcl``, appelez :

source: You should see debug output from ``rcl`` start to show.
fr: Vous devriez voir la sortie de débogage de ``rcl`` commencer à s'afficher.

source: Using the logger config component
fr: Utilisation du composant de configuration de l'enregistreur

source: The server that responds to the logger configuration requests has been developed as a component so that it may be added to an existing composition-based system. For example, if you are using `a container to run your nodes <../Intermediate/Composition>`, to be able to configure your loggers you only need to request that it additionally load the ``logging_demo::LoggerConfig`` component into the container.
fr: Le serveur qui répond aux requêtes de configuration de l'enregistreur a été développé en tant que composant afin qu'il puisse être ajouté à un système existant basé sur la composition. Par exemple, si vous utilisez `un conteneur pour exécuter vos nœuds <../Intermediate/Composition>`, pour pouvoir configurer vos loggers, il vous suffit de lui demander de charger en plus le composant ``logging_demo::LoggerConfig`` dans le conteneur.

source: As an example, if you want to debug the ``composition::Talker`` demo, you can start the talker as normal with:
fr: Par exemple, si vous souhaitez déboguer la démo ``composition::Talker``, vous pouvez démarrer le talker normalement avec :

source: Shell 1:
fr: Coque 1 :

source: Shell 2:
fr: Coque 2 :

source: And then when you want to enable debug logging, load the ``LoggerConfig`` component with:
fr: Et ensuite, lorsque vous souhaitez activer la journalisation de débogage, chargez le composant ``LoggerConfig`` avec :

source: Shell 2
fr: Coque 2

source: And finally, configure all unset loggers to the debug severity by addressing the empty-named logger. Note that loggers that have been specifically configured to use a particular severity will not be affected by this call.
fr: Et enfin, configurez tous les enregistreurs non définis sur la gravité de débogage en adressant l'enregistreur nommé vide. Notez que les enregistreurs qui ont été spécifiquement configurés pour utiliser une gravité particulière ne seront pas affectés par cet appel.

source: You should see debug output from any previously unset loggers in the process start to appear, including from the ROS 2 core.
fr: Vous devriez voir la sortie de débogage de tous les enregistreurs précédemment non définis dans le processus commencer à apparaître, y compris à partir du noyau ROS 2.

source: Logger level configuration: command line
fr: Configuration au niveau du journal : ligne de commande

source: As of the Bouncy ROS 2 release, the severity level for loggers that have not had their severity set explicitly can be configured from the command line. Restart the demo including the following command line argument:
fr: À partir de la version Bouncy ROS 2, le niveau de gravité des enregistreurs dont la gravité n'a pas été définie explicitement peut être configuré à partir de la ligne de commande. Redémarrez la démo en incluant l'argument de ligne de commande suivant :

source: This configures the default severity for any unset logger to the debug severity level. You should see debug output from loggers from the demo itself and from the ROS 2 core.
fr: Cela configure la gravité par défaut pour tout enregistreur non défini au niveau de gravité de débogage. Vous devriez voir la sortie de débogage des enregistreurs de la démo elle-même et du noyau ROS 2.

source: The severity level for individual loggers can be configured from the command-line. Restart the demo including the following command line arguments:
fr: Le niveau de gravité des enregistreurs individuels peut être configuré à partir de la ligne de commande. Redémarrez la démo en incluant les arguments de ligne de commande suivants :

source: Console output formatting
fr: Formatage de la sortie de la console

source: If you would like more or less verbose formatting, you can use RCUTILS_CONSOLE_OUTPUT_FORMAT environment variable. For example, to additionally get the timestamp and location of the log calls, stop the demo and restart it with the environment variable set:
fr: Si vous souhaitez un formatage plus ou moins verbeux, vous pouvez utiliser la variable d'environnement RCUTILS_CONSOLE_OUTPUT_FORMAT. Par exemple, pour obtenir en plus l'horodatage et l'emplacement des appels de journal, arrêtez la démo et redémarrez-la avec la variable d'environnement définie :

source: You should see the timestamp in seconds and the function name, filename and line number additionally printed with each message. *The ``time`` option is only supported as of the ROS 2 Bouncy release.*
fr: Vous devriez voir l'horodatage en secondes et le nom de la fonction, le nom du fichier et le numéro de ligne imprimés en plus avec chaque message. *L'option ``time`` n'est prise en charge qu'à partir de la version ROS 2 Bouncy.*

source: Console output colorizing
fr: Colorisation de la sortie de la console

source: By default, the output is colorized when it's targeting a terminal. If you would like to force enabling or disabling it, you can use the ``RCUTILS_COLORIZED_OUTPUT`` environment variable. For example:
fr: Par défaut, la sortie est colorisée lorsqu'elle cible un terminal. Si vous souhaitez forcer son activation ou sa désactivation, vous pouvez utiliser la variable d'environnement ``RCUTILS_COLORIZED_OUTPUT``. Par exemple:

source: You should see that debug, warn, error and fatal logs aren't colorized now.
fr: Vous devriez voir que les journaux de débogage, d'avertissement, d'erreur et fatal ne sont plus colorisés maintenant.

source: In Linux and MacOS forcing colorized output means that if you redirect the output to a file, the ansi escape color codes will appear on it. In windows the colorization method relies on console APIs. If it is forced you will get a new warning saying that colorization failed. The default behavior already checks if the output is a console or not, so forcing colorization is not recommended.
fr: Sous Linux et MacOS, forcer la sortie colorisée signifie que si vous redirigez la sortie vers un fichier, les codes de couleur d'échappement ansi apparaîtront dessus. Dans Windows, la méthode de colorisation repose sur les API de la console. S'il est forcé, vous recevrez un nouvel avertissement indiquant que la colorisation a échoué. Le comportement par défaut vérifie déjà si la sortie est une console ou non, il n'est donc pas recommandé de forcer la colorisation.

source: Default stream for console output
fr: Flux par défaut pour la sortie de la console

source: In Foxy and later, the output from all debug levels goes to stderr by default. It is possible to force all output to go to stdout by setting the ``RCUTILS_LOGGING_USE_STDOUT`` environment variable to ``1``. For example:
fr: Dans Foxy et versions ultérieures, la sortie de tous les niveaux de débogage va à stderr par défaut. Il est possible de forcer toutes les sorties à aller sur stdout en définissant la variable d'environnement ``RCUTILS_LOGGING_USE_STDOUT`` sur ``1``. Par exemple:

source: Line buffered console output
fr: Sortie de console en mémoire tampon de ligne

source: By default, all logging output is unbuffered. You can force it to be buffered by setting the ``RCUTILS_LOGGING_BUFFERED_STREAM`` environment variable to 1. For example:
fr: Par défaut, toutes les sorties de journalisation ne sont pas mises en mémoire tampon. Vous pouvez forcer sa mise en mémoire tampon en définissant la variable d'environnement ``RCUTILS_LOGGING_BUFFERED_STREAM`` sur 1. Par exemple :

source: Then run:
fr: Exécutez ensuite :
