Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Tutorials/Demos/Real-Time-Programming.po
Languages: fr

source: Understanding real-time programming
fr: Comprendre la programmation temps réel

source: Table of Contents
fr: Table des matières

source: Background
fr: Arrière-plan

source: Real-time computing is a key feature of many robotics systems, particularly safety- and mission-critical applications such as autonomous vehicles, spacecrafts, and industrial manufacturing. We are designing and prototyping ROS 2 with real-time performance constraints in mind, since this is a requirement that was not considered in the early stages of ROS 1 and it is now intractable to refactor ROS 1 to be real-time friendly.
fr: L'informatique en temps réel est une caractéristique clé de nombreux systèmes robotiques, en particulier des applications critiques pour la sécurité et la mission telles que les véhicules autonomes, les engins spatiaux et la fabrication industrielle. Nous concevons et prototypons ROS 2 en gardant à l'esprit les contraintes de performances en temps réel, car il s'agit d'une exigence qui n'a pas été prise en compte dans les premières étapes de ROS 1 et il est désormais impossible de refactoriser ROS 1 pour qu'il soit compatible avec le temps réel.

source: `This document <https://design.ros2.org/articles/realtime_background.html>`__ outlines the requirements of real-time computing and best practices for software engineers. In short:
fr: `Ce document <https://design.ros2.org/articles/realtime_background.html>`__ décrit les exigences de l'informatique en temps réel et les meilleures pratiques pour les ingénieurs en logiciel. Bref:

source: To make a real-time computer system, our real-time loop must update periodically to meet deadlines. We can only tolerate a small margin of error on these deadlines (our maximum allowable jitter). To do this, we must avoid nondeterministic operations in the execution path, things like: pagefault events, dynamic memory allocation/deallocation, and synchronization primitives that block indefinitely.
fr: Pour faire un système informatique en temps réel, notre boucle en temps réel doit se mettre à jour périodiquement pour respecter les délais. Nous ne pouvons tolérer qu'une petite marge d'erreur sur ces délais (notre gigue maximale autorisée). Pour ce faire, nous devons éviter les opérations non déterministes dans le chemin d'exécution, telles que : les événements de défaut de page, l'allocation/désallocation dynamique de la mémoire et les primitives de synchronisation qui bloquent indéfiniment.

source: A classic example of a controls problem commonly solved by real-time computing is balancing an `inverted pendulum <https://en.wikipedia.org/wiki/Inverted_pendulum>`__. If the controller blocked for an unexpectedly long amount of time, the pendulum would fall down or go unstable. But if the controller reliably updates at a rate faster than the motor controlling the pendulum can operate, the pendulum will successfully adapt react to sensor data to balance the pendulum.
fr: Un exemple classique de problème de contrôle couramment résolu par le calcul en temps réel est l'équilibrage d'un `pendule inversé <https://en.wikipedia.org/wiki/Inverted_pendulum>`__. Si le contrôleur bloquait pendant une durée étonnamment longue, le pendule tomberait ou deviendrait instable. Mais si le contrôleur se met à jour de manière fiable à un rythme plus rapide que le moteur contrôlant le pendule ne peut fonctionner, le pendule s'adaptera avec succès aux données du capteur pour équilibrer le pendule.

source: Now that you know everything about real-time computing, let's try a demo!
fr: Maintenant que vous savez tout sur l'informatique en temps réel, essayons une démo !

source: Install and run the demo
fr: Installer et exécuter la démo

source: The real-time demo was written with Linux operating systems in mind, since many members of the ROS community doing real-time computing use Xenomai or RT_PREEMPT as their real-time solutions. Since many of the operations done in the demo to optimize performance or OS-specific, the demo only builds and runs on Linux systems. **So, if you are an OSX or Windows user, don't try this part!**
fr: La démo en temps réel a été écrite avec les systèmes d'exploitation Linux à l'esprit, car de nombreux membres de la communauté ROS faisant de l'informatique en temps réel utilisent Xenomai ou RT_PREEMPT comme solutions en temps réel. Comme de nombreuses opérations sont effectuées dans la démo pour optimiser les performances ou spécifiques au système d'exploitation, la démo ne se construit et ne s'exécute que sur les systèmes Linux. **Donc, si vous êtes un utilisateur OSX ou Windows, n'essayez pas cette partie !**

source: Also this must be built from source using a the static DDS API. **Currently the only supported implementation is Connext**.
fr: Cela doit également être construit à partir de la source à l'aide d'une API DDS statique. **Actuellement, la seule implémentation prise en charge est Connext**.

source: First, follow the instructions to build ROS 2 :doc:`from source <../../Installation/Alternatives/Ubuntu-Development-Setup>` using Connext DDS as the middleware.
fr: Tout d'abord, suivez les instructions pour compiler ROS 2 :doc:`from source <../../Installation/Alternatives/Ubuntu-Development-Setup>` en utilisant Connext DDS comme middleware.

source: Run the tests
fr: Exécutez les tests

source: **Before you run make sure you have at least 8Gb of RAM free. With the memory locking, swap will not work anymore.**
fr: **Avant de lancer, assurez-vous d'avoir au moins 8 Go de RAM libre. Avec le verrouillage de la mémoire, le swap ne fonctionnera plus.**

source: Source your ROS 2 setup.bash.
fr: Sourcez votre setup.bash ROS 2.

source: Run the demo binary, and redirect the output. You may want to use ``sudo`` in case you get permission error:
fr: Exécutez le binaire de démonstration et redirigez la sortie. Vous pouvez utiliser ``sudo`` au cas où vous auriez une erreur d'autorisation :

source: What the heck just happened?
fr: Que diable vient-il de se passer ?

source: First, even though you redirected stdout, you will see some output to the console (from stderr):
fr: Tout d'abord, même si vous avez redirigé stdout, vous verrez une sortie vers la console (de stderr) :

source: After the initialization stage of the demo program, it will attempt to lock all cached memory into RAM and prevent future dynamic memory allocations using ``mlockall``. This is to prevent pagefaults from loading lots of new memory into RAM. (See `the realtime design article <https://design.ros2.org/articles/realtime_background.html#memory-management>`__ for more information.)
fr: Après l'étape d'initialisation du programme de démonstration, il tentera de verrouiller toute la mémoire cache dans la RAM et d'empêcher les futures allocations de mémoire dynamique à l'aide de ``mlockall``. Cela permet d'empêcher les défauts de page de charger beaucoup de nouvelle mémoire dans la RAM. (Voir `l'article sur la conception en temps réel <https://design.ros2.org/articles/realtime_background.html#memory-management>`__ pour plus d'informations.)

source: The demo will continue on as usual when this occurs. At the bottom of the output.txt file generated by the demo, you'll see the number of pagefaults encountered during execution:
fr: La démo continuera comme d'habitude lorsque cela se produit. Au bas du fichier output.txt généré par la démo, vous verrez le nombre de défauts de page rencontrés lors de l'exécution :

source: If we want those pagefaults to go away, we'll have to...
fr: Si nous voulons que ces défauts de page disparaissent, nous devrons...

source: Adjust permissions for memory locking
fr: Ajuster les autorisations pour le verrouillage de la mémoire

source: Add to ``/etc/security/limits.conf`` (as sudo):
fr: Ajouter à ``/etc/security/limits.conf`` (comme sudo) :

source: A limit of ``-1`` is unlimited. If you choose this, you may need to accompany it with ``ulimit -l unlimited`` after editing the file.
fr: Une limite de ``-1`` est illimitée. Si vous choisissez cette option, vous devrez peut-être l'accompagner de ``ulimit -l unlimited`` après avoir modifié le fichier.

source: After saving the file, log out and log back in. Then rerun the ``pendulum_demo`` invocation.
fr: Après avoir enregistré le fichier, déconnectez-vous et reconnectez-vous. Ensuite, relancez l'appel ``pendulum_demo``.

source: You'll either see zero pagefaults in your output file, or an error saying that a bad_alloc exception was caught. If this happened, you didn't have enough free memory available to lock the memory allocated for the process into RAM. You'll need to install more RAM in your computer to see zero pagefaults!
fr: Vous verrez soit zéro défaut de page dans votre fichier de sortie, soit une erreur indiquant qu'une exception bad_alloc a été interceptée. Si cela se produisait, vous n'aviez pas assez de mémoire disponible pour verrouiller la mémoire allouée au processus dans la RAM. Vous devrez installer plus de RAM sur votre ordinateur pour voir zéro défaut de page !

source: Output overview
fr: Aperçu des sorties

source: To see more output, we have to run the ``pendulum_logger`` node.
fr: Pour voir plus de sortie, nous devons exécuter le nœud ``pendulum_logger``.

source: In one shell with your ``install/setup.bash`` sourced, invoke:
fr: Dans un shell avec votre source ``install/setup.bash``, appelez :

source: You should see the output message:
fr: Vous devriez voir le message de sortie :

source: In another shell with setup.bash sourced, invoke ``pendulum_demo`` again.
fr: Dans un autre shell avec setup.bash, invoquez à nouveau ``pendulum_demo``.

source: As soon as this executable starts, you should see the other shell constantly printing output:
fr: Dès que cet exécutable démarre, vous devriez voir l'autre shell imprimer constamment la sortie :

source: The demo is controlling a very simple inverted pendulum simulation. The pendulum simulation calculates its position in its own thread. A ROS node simulates a motor encoder sensor for the pendulum and publishes its position. Another ROS node acts as a simple PID controller and calculates the next command message.
fr: La démo contrôle une simulation de pendule inversé très simple. La simulation du pendule calcule sa position dans son propre fil. Un nœud ROS simule un capteur d'encodeur moteur pour le pendule et publie sa position. Un autre nœud ROS agit comme un simple contrôleur PID et calcule le prochain message de commande.

source: The logger node periodically prints out the pendulum's state and the runtime performance statistics of the demo during its execution phase.
fr: Le nœud d'enregistrement imprime périodiquement l'état du pendule et les statistiques de performances d'exécution de la démo pendant sa phase d'exécution.

source: After the ``pendulum_demo`` is finished, you'll have to CTRL-C out of the logger node to exit.
fr: Une fois la ``pendulum_demo`` terminée, vous devrez CTRL-C sortir du nœud de l'enregistreur pour quitter.

source: Latency
fr: Latence

source: At the ``pendulum_demo`` execution, you'll see the final statistics collected for the demo:
fr: Lors de l'exécution de ``pendulum_demo``, vous verrez les statistiques finales collectées pour la démo :

source: The latency fields show you the minimum, maximum, and average latency of the update loop in nanoseconds. Here, latency means the amount of time after the update was expected to occur.
fr: Les champs de latence vous indiquent la latence minimale, maximale et moyenne de la boucle de mise à jour en nanosecondes. Ici, la latence signifie la durée après laquelle la mise à jour était censée se produire.

source: The requirements of a real-time system depend on the application, but let's say in this demo we have a 1kHz (1 millisecond) update loop, and we're aiming for a maximum allowable latency of 5% of our update period.
fr: Les exigences d'un système en temps réel dépendent de l'application, mais disons que dans cette démo, nous avons une boucle de mise à jour de 1 kHz (1 milliseconde) et nous visons une latence maximale autorisée de 5 % de notre période de mise à jour.

source: So, our average latency was really good in this run, but the maximum latency was unacceptable because it actually exceeded our update loop! What happened?
fr: Ainsi, notre latence moyenne était vraiment bonne dans cette exécution, mais la latence maximale était inacceptable car elle dépassait en fait notre boucle de mise à jour ! Ce qui s'est passé?

source: We may be suffering from a non-deterministic scheduler. If you're running a vanilla Linux system and you don't have the RT_PREEMPT kernel installed, you probably won't be able to meet the real-time goal we set for ourselves, because the Linux scheduler won't allow you to arbitrarily pre-empt threads at the user level.
fr: Nous souffrons peut-être d'un ordonnanceur non déterministe. Si vous utilisez un système Linux vanille et que le noyau RT_PREEMPT n'est pas installé, vous ne pourrez probablement pas atteindre l'objectif en temps réel que nous nous sommes fixé, car le planificateur Linux ne vous permettra pas de préempter les threads au niveau de l'utilisateur.

source: See the `realtime design article <https://design.ros2.org/articles/realtime_background.html#multithreaded-programming-and-synchronization>`__ for more information.
fr: Voir l'article sur la conception en temps réel <https://design.ros2.org/articles/realtime_background.html#multithreaded-programming-and-synchronization>`__ pour plus d'informations.

source: The demo attempts to set the scheduler and thread priority of the demo to be suitable for real-time performance. If this operation failed, you'll see an error message: "Couldn't set scheduling priority and policy: Operation not permitted". You can get slightly better performance by following the instructions in the next section:
fr: La démo tente de définir le planificateur et la priorité des threads de la démo pour qu'ils soient adaptés aux performances en temps réel. Si cette opération échoue, un message d'erreur s'affichera : "Impossible de définir la priorité et la stratégie de planification : opération non autorisée". Vous pouvez obtenir des performances légèrement meilleures en suivant les instructions de la section suivante :

source: Setting permissions for the scheduler
fr: Définition des autorisations pour le planificateur

source: The range of the rtprio (real-time priority) field is 0-99. However, do NOT set the limit to 99 because then your processes could interfere with important system processes that run at the top priority (e.g. watchdog). This demo will attempt to run the control loop at priority 98.
fr: La plage du champ rtprio (priorité en temps réel) est de 0 à 99. Cependant, ne fixez PAS la limite à 99, car vos processus pourraient alors interférer avec des processus système importants qui s'exécutent avec la priorité la plus élevée (par exemple, le chien de garde). Cette démo tentera d'exécuter la boucle de contrôle à la priorité 98.

source: Plotting results
fr: Tracé des résultats

source: You can plot the latency and pagefault statistics that are collected in this demo after the demo runs.
fr: Vous pouvez tracer les statistiques de latence et de défaut de page collectées dans cette démo après son exécution.

source: Because the code has been instrumented with `rttest <https://github.com/ros2/rttest>`__, there are useful command line arguments available:
fr: Étant donné que le code a été instrumenté avec `rttest <https://github.com/ros2/rtest>`__, des arguments de ligne de commande utiles sont disponibles :

source: Command
fr: Commande

source: Default value
fr: Valeur par défaut

source: -i
fr: -je

source: Specify how many iterations to run the real-time loop
fr: Spécifiez le nombre d'itérations pour exécuter la boucle en temps réel

source: -u
fr: -dans

source: Specify the update period with the default unit being microseconds.
fr: Spécifiez la période de mise à jour avec l'unité par défaut étant les microsecondes.

source: Use the suffix "s" for seconds, "ms" for milliseconds,
fr: Utilisez le suffixe "s" pour les secondes, "ms" pour les millisecondes,

source: "us" for microseconds, and "ns" for nanoseconds.
fr: "us" pour les microsecondes et "ns" pour les nanosecondes.

source: 1ms
fr: 1 milliseconde

source: Specify the name of the file for writing the collected data.
fr: Indiquez le nom du fichier d'écriture des données collectées.

source: Run the demo again with a filename to save results:
fr: Exécutez à nouveau la démo avec un nom de fichier pour enregistrer les résultats :

source: Then run the ``rttest_plot`` script on the resulting file:
fr: Exécutez ensuite le script ``rtest_plot`` sur le fichier résultant :

source: This script will produce three files:
fr: Ce script produira trois fichiers :

source: You can view these plots in an image viewer of your choice.
fr: Vous pouvez visualiser ces tracés dans une visionneuse d'images de votre choix.
