Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/How-To-Guides/Ament-CMake-Documentation.po
Languages: fr

source: Replace ``DLL`` by ``MY_LIBRARY`` (for an example, see visibility control of `rviz_rendering <https://github.com/ros2/rviz/blob/ros2/rviz_rendering/include/rviz_rendering/visibility_control.hpp>`__).
fr: Remplacez ``DLL`` par ``MY_LIBRARY`` (pour un exemple, voir le contrôle de visibilité de `rviz_rendering <https://github.com/ros2/rviz/blob/ros2/rviz_rendering/include/rviz_rendering/visibility_control.hpp> `__).

source: Use the macros "MY_LIBRARY_PUBLIC" for all symbols you need to export (i.e. classes or functions).
fr: Utilisez les macros "MY_LIBRARY_PUBLIC" pour tous les symboles que vous devez exporter (c'est-à-dire les classes ou les fonctions).

source: In the project ``CMakeLists.txt`` use:
fr: Dans le projet ``CMakeLists.txt`` utilisez :

source: For more details, see :ref:`Windows Symbol Visibility in the Windows Tips and Tricks document <Windows_Symbol_Visibility>`.
fr: Pour plus de détails, voir :ref:`Visibilité des symboles Windows dans le document Trucs et astuces Windows <Windows_Symbol_Visibility>`.

source: Testing and Linting
fr: Test et peluchage

source: In order to separate testing from building the library with colcon, wrap all calls to linters and tests in a conditional:
fr: Afin de séparer les tests de la construction de la bibliothèque avec colcon, encapsulez tous les appels aux linters et aux tests dans une condition :

source: Linting
fr: peluchage

source: It's advised to use the combined call from `ament_lint_auto <https://github.com/ament/ament_lint/blob/rolling/ament_lint_auto/doc/index.rst#ament_lint_auto>`_:
fr: Il est conseillé d'utiliser l'appel combiné de `ament_lint_auto <https://github.com/ament/ament_lint/blob/rolling/ament_lint_auto/doc/index.rst#ament_lint_auto>`_ :

source: This will run linters as defined in the ``package.xml``. It is recommended to use the set of linters defined by the package ``ament_lint_common``. The individual linters included there, as well as their functions, can be seen in the `ament_lint_common docs <https://github.com/ament/ament_lint/blob/rolling/ament_lint_common/doc/index.rst>`_.
fr: Cela exécutera les linters comme défini dans le ``package.xml``. Il est recommandé d'utiliser l'ensemble de linters défini par le package ``ament_lint_common``. Les linters individuels qui y sont inclus, ainsi que leurs fonctions, peuvent être vus dans les `ament_lint_common docs <https://github.com/ament/ament_lint/blob/rolling/ament_lint_common/doc/index.rst>`_.

source: Linters provided by ament can also be added separately, instead of running ``ament_lint_auto``. One example of how to do so can be found in the `ament_cmake_lint_cmake documentation <https://github.com/ament/ament_lint/blob/rolling/ament_cmake_lint_cmake/doc/index.rst>`_.
fr: Les linters fournis par ament peuvent également être ajoutés séparément, au lieu d'exécuter ``ament_lint_auto``. Un exemple de la façon de procéder peut être trouvé dans la documentation `ament_cmake_lint_cmake <https://github.com/ament/ament_lint/blob/rolling/ament_cmake_lint_cmake/doc/index.rst>`_.

source: Testing
fr: Essai

source: Ament contains CMake macros to simplify setting up GTests. Call:
fr: Ament contient des macros CMake pour simplifier la configuration des GTests. Appel:

source: to add a GTest. This is then a regular target which can be linked against other libraries (such as the project library). The macros have additional parameters:
fr: pour ajouter un GTest. Il s'agit alors d'une cible régulière qui peut être liée à d'autres bibliothèques (comme la bibliothèque du projet). Les macros ont des paramètres supplémentaires :

source: ``APPEND_ENV``: append environment variables. For instance you can add to the ament prefix path by calling:
fr: ``APPEND_ENV`` : ajoute des variables d'environnement. Par exemple, vous pouvez ajouter au chemin du préfixe ament en appelant :

source: ``APPEND_LIBRARY_DIRS``: append libraries so that they can be found by the linker at runtime. This can be achieved by setting environment variables like ``PATH`` on Windows and ``LD_LIBRARY_PATH`` on Linux, but this makes the call platform specific.
fr: ``APPEND_LIBRARY_DIRS`` : ajoute des bibliothèques afin qu'elles puissent être trouvées par l'éditeur de liens lors de l'exécution. Cela peut être réalisé en définissant des variables d'environnement telles que ``PATH`` sous Windows et ``LD_LIBRARY_PATH`` sous Linux, mais cela rend la plate-forme d'appel spécifique.

source: ``ENV``: set environment variables (same syntax as ``APPEND_ENV``).
fr: ``ENV`` : définit les variables d'environnement (même syntaxe que ``APPEND_ENV``).

source: ``TIMEOUT``: set a test timeout in second. The default for GTests is 60 seconds. For example:
fr: ``TIMEOUT`` : définissez un délai de test en secondes. La valeur par défaut pour les GTests est de 60 secondes. Par example:

source: ``SKIP_TEST``: skip this test (will be shown as "passed" in the console output).
fr: ``SKIP_TEST`` : saute ce test (sera affiché comme "réussi" dans la sortie de la console).

source: ``SKIP_LINKING_MAIN_LIBRARIES``: Don't link against GTest.
fr: ``SKIP_LINKING_MAIN_LIBRARIES`` : ne pas lier avec GTest.

source: ``WORKING_DIRECTORY``: set the working directory for the test.
fr: ``WORKING_DIRECTORY`` : définit le répertoire de travail pour le test.

source: The default working directory otherwise is the ``CMAKE_CURRENT_BINARY_DIR``, which is described in the `CMake documentation <https://cmake.org/cmake/help/latest/variable/CMAKE_CURRENT_BINARY_DIR.html>`_.
fr: Sinon, le répertoire de travail par défaut est le ``CMAKE_CURRENT_BINARY_DIR``, qui est décrit dans la `documentation CMake <https://cmake.org/cmake/help/latest/variable/CMAKE_CURRENT_BINARY_DIR.html>`_.

source: Similarly, there is a CMake macro to set up GTest including GMock:
fr: De même, il existe une macro CMake pour configurer GTest incluant GMock :

source: It has the same additional parameters as ``ament_add_gtest``.
fr: Il a les mêmes paramètres supplémentaires que ``ament_add_gtest``.

source: Extending ament
fr: Ament d'extension

source: It is possible to register additional macros/functions with ``ament_cmake`` and extend it in several ways.
fr: Il est possible d'enregistrer des macros/fonctions supplémentaires avec ``ament_cmake`` et de l'étendre de plusieurs manières.

source: Adding a function/macro to ament
fr: Ajouter une fonction/macro à ament

source: Extending ament will often times mean that you want to have some functions available to other packages. The best way to provide the macro to client packages is to register it with ament.
fr: L'extension de ament signifie souvent que vous souhaitez que certaines fonctions soient disponibles pour d'autres packages. La meilleure façon de fournir la macro aux packages clients est de l'enregistrer avec ament.

source: This can be done by appending the ``${PROJECT_NAME}_CONFIG_EXTRAS`` variable, which is used by ``ament_package()`` via
fr: Cela peut être fait en ajoutant la variable ``${PROJECT_NAME}_CONFIG_EXTRAS``, qui est utilisée par ``ament_package()`` via

source: Alternatively, you can directly add the files to the ``ament_package()`` call:
fr: Alternativement, vous pouvez directement ajouter les fichiers à l'appel ``ament_package()`` :

source: Adding to extension points
fr: Ajout aux points d'extension

source: In addition to simple files with functions that can be used in other packages, you can also add extensions to ament. Those extensions are scripts which are executed with the function which defines the extension point. The most common use-case for ament extensions is probably registering rosidl message generators: When writing a generator, you normally want to generate all messages and services with your generator also without modifying the code for the message/service definition packages. This is possible by registering the generator as an extension to ``rosidl_generate_interfaces``.
fr: En plus des fichiers simples avec des fonctions pouvant être utilisées dans d'autres packages, vous pouvez également ajouter des extensions à ament. Ces extensions sont des scripts qui sont exécutés avec la fonction qui définit le point d'extension. Le cas d'utilisation le plus courant pour les extensions ament est probablement l'enregistrement des générateurs de messages rosidl : lors de l'écriture d'un générateur, vous souhaitez normalement générer tous les messages et services avec votre générateur également sans modifier le code des packages de définition de message/service. Ceci est possible en enregistrant le générateur en tant qu'extension de ``rosidl_generate_interfaces``.

source: As an example, see
fr: A titre d'exemple, voir

source: which registers the macro ``rosidl_generator_cpp_generate_interfaces.cmake`` for the package ``rosidl_generator_cpp`` to the extension point ``rosidl_generate_interfaces``. When the extension point gets executed, this will trigger the execution of the script ``rosidl_generator_cpp_generate_interfaces.cmake`` here. In particular, this will call the generator whenever the function ``rosidl_generate_interfaces`` gets executed.
fr: qui enregistre la macro ``rosidl_generator_cpp_generate_interfaces.cmake`` pour le package ``rosidl_generator_cpp`` au point d'extension ``rosidl_generate_interfaces``. Lorsque le point d'extension est exécuté, cela déclenchera l'exécution du script ``rosidl_generator_cpp_generate_interfaces.cmake`` ici. En particulier, cela appellera le générateur chaque fois que la fonction ``rosidl_generate_interfaces`` sera exécutée.

source: The most important extension point for generators, aside from ``rosidl_generate_interfaces``, is ``ament_package``, which will simply execute scripts with the ``ament_package()`` call. This extension point is useful when registering resources (see below).
fr: Le point d'extension le plus important pour les générateurs, mis à part ``rosidl_generate_interfaces``, est ``ament_package``, qui exécutera simplement des scripts avec l'appel ``ament_package()``. Ce point d'extension est utile lors de l'enregistrement des ressources (voir ci-dessous).

source: ``ament_register_extension`` is a function which takes exactly three arguments:
fr: ``ament_register_extension`` est une fonction qui prend exactement trois arguments :

source: ``extension_point``: The name of the extension point (most of the time this will be one of ``ament_package`` or ``rosidl_generate_interfaces``)
fr: ``extension_point`` : le nom du point d'extension (la plupart du temps, ce sera l'un des ``ament_package`` ou ``rosidl_generate_interfaces``)

source: ``package_name``: The name of the package containing the CMake file (i.e. the project name of the project where the file is written to)
fr: ``package_name`` : le nom du package contenant le fichier CMake (c'est-à-dire le nom du projet dans lequel le fichier est écrit)

source: ``cmake_filename``: The CMake file executed when the extension point is run
fr: ``cmake_filename`` : le fichier CMake exécuté lorsque le point d'extension est exécuté

source: It is possible to define custom extension points in a similar manner to ``ament_package`` and ``rosidl_generate_interfaces``, but this should hardly be necessary.
fr: Il est possible de définir des points d'extension personnalisés de la même manière que ``ament_package`` et ``rosidl_generate_interfaces``, mais cela ne devrait pas être nécessaire.

source: Adding extension points
fr: Ajout de points d'extension

source: Very rarely, it might be interesting to define a new extension point to ament.
fr: Très rarement, il peut être intéressant de définir un nouveau point d'extension à ament.

source: Extension points can be registered within a macro so that all extensions will be executed when the corresponding macro is called. To do so:
fr: Les points d'extension peuvent être enregistrés dans une macro afin que toutes les extensions soient exécutées lorsque la macro correspondante est appelée. Faire cela:

source: Define and document a name for your extension (e.g. ``my_extension_point``), which is the name passed to the ``ament_register_extension`` macro when using the extension point.
fr: Définissez et documentez un nom pour votre extension (par exemple ``my_extension_point``), qui est le nom passé à la macro ``ament_register_extension`` lors de l'utilisation du point d'extension.

source: In the macro/function which should execute the extensions call:
fr: Dans la macro/fonction qui doit exécuter l'appel des extensions :

source: Ament extensions work by defining a variable containing the name of the extension point and filling it with the macros to be executed. Upon calling ``ament_execute_extensions``, the scripts defined in the variable are then executed one after another.
fr: Les extensions Ament fonctionnent en définissant une variable contenant le nom du point d'extension et en la remplissant avec les macros à exécuter. Lors de l'appel de ``ament_execute_extensions``, les scripts définis dans la variable sont alors exécutés les uns après les autres.

source: Adding resources
fr: Ajout de ressources

source: Especially when developing plugins or packages which allow plugins it is often essential to add resources to one ROS package from another (e.g. a plugin). Examples can be plugins for tools using the pluginlib.
fr: Surtout lors du développement de plugins ou de packages qui autorisent les plugins, il est souvent essentiel d'ajouter des ressources à un package ROS à partir d'un autre (par exemple, un plugin). Des exemples peuvent être des plugins pour des outils utilisant pluginlib.

source: This can be achieved using the ament index (also called "resource index").
fr: Ceci peut être réalisé en utilisant l'indice d'ament (également appelé "indice de ressources").

source: The ament index explained
fr: L'indice d'ament expliqué

source: For details on the design and intentions, see `here <https://github.com/ament/ament_cmake/blob/rolling/ament_cmake_core/doc/resource_index.md>`__
fr: Pour plus de détails sur la conception et les intentions, voir `ici <https://github.com/ament/ament_cmake/blob/rolling/ament_cmake_core/doc/resource_index.md>`__

source: In principle, the ament index is contained in a folder within the install/share folder of your package. It contains shallow subfolders named after different types of resources. Within the subfolder, each package providing said resource is referenced by name with a "marker file". The file may contain whatever content necessary to obtain the resources, e.g. relative paths to the installation directories of the resource, it may also be simply empty.
fr: En principe, l'index d'ament est contenu dans un dossier du dossier install/share de votre package. Il contient des sous-dossiers superficiels nommés d'après différents types de ressources. Au sein du sous-dossier, chaque package fournissant ladite ressource est référencé par son nom avec un "fichier marqueur". Le fichier peut contenir tout contenu nécessaire pour obtenir les ressources, par ex. chemins relatifs vers les répertoires d'installation de la ressource, il peut aussi être simplement vide.

source: To give an example, consider providing display plugins for RViz: When providing RViz plugins in a project named ``my_rviz_displays`` which will be read by the pluginlib, you will provide a ``plugin_description.xml`` file, which will be installed and used by the pluginlib to load the plugins. To achieve this, the plugin_description.xml is registered as a resource in the resource_index via
fr: Pour donner un exemple, envisagez de fournir des plugins d'affichage pour RViz : Lorsque vous fournissez des plugins RViz dans un projet nommé ``my_rviz_displays`` qui sera lu par le pluginlib, vous fournirez un fichier ``plugin_description.xml``, qui sera installé et utilisé par le pluginlib pour charger les plugins. Pour ce faire, le plugin_description.xml est enregistré en tant que ressource dans le resource_index via

source: When running ``colcon build``, this installs a file ``my_rviz_displays`` into a subfolder ``rviz_common__pluginlib__plugin`` into the resource_index. Pluginlib factories within rviz_common will know to gather information from all folders named ``rviz_common__pluginlib__plugin`` for packages that export plugins. The marker file for pluginlib factories contains an install-folder relative path to the ``plugins_description.xml`` file (and the name of the library as marker file name). With this information, the pluginlib can load the library and know which plugins to load from the ``plugin_description.xml`` file.
fr: Lors de l'exécution de ``colcon build``, cela installe un fichier ``my_rviz_displays`` dans un sous-dossier ``rviz_common__pluginlib__plugin`` dans le resource_index. Les fabriques de plugins de rviz_common sauront rassembler des informations à partir de tous les dossiers nommés ``rviz_common__pluginlib__plugin`` pour les packages qui exportent des plugins. Le fichier marqueur pour les fabriques pluginlib contient un chemin relatif du dossier d'installation vers le fichier ``plugins_description.xml`` (et le nom de la bibliothèque comme nom de fichier marqueur). Avec ces informations, le pluginlib peut charger la bibliothèque et savoir quels plugins charger à partir du fichier ``plugin_description.xml``.

source: As a second example, consider the possibility to let your own RViz plugins use your own custom meshes. Meshes get loaded at startup time so that the plugin owner does not have to deal with it, but this implies RViz has to know about the meshes. To achieve this, RViz provides a function:
fr: Comme deuxième exemple, envisagez la possibilité de laisser vos propres plugins RViz utiliser vos propres maillages personnalisés. Les maillages sont chargés au démarrage afin que le propriétaire du plugin n'ait pas à s'en occuper, mais cela implique que RViz doit connaître les maillages. Pour cela, RViz propose une fonction :

source: This registers the directories as an ogre_media resource in the ament index. In short, it installs a file named after the project which calls the function into a subfolder called ``rviz_ogre_media_exports``. The file contains the install folder relative paths to the directories listed in the macros. On startup time, RViz can now search for all folders called ``rviz_ogre_media_exports`` and load resources in all folders provided. These searches are done using ``ament_index_cpp`` (or ``ament_index_py`` for Python packages).
fr: Cela enregistre les répertoires en tant que ressource ogre_media dans l'index ament. En bref, il installe un fichier nommé d'après le projet qui appelle la fonction dans un sous-dossier appelé ``rviz_ogre_media_exports``. Le fichier contient les chemins relatifs du dossier d'installation vers les répertoires répertoriés dans les macros. Au démarrage, RViz peut désormais rechercher tous les dossiers appelés ``rviz_ogre_media_exports`` et charger les ressources dans tous les dossiers fournis. Ces recherches sont effectuées à l'aide de ``ament_index_cpp`` (ou ``ament_index_py`` pour les packages Python).

source: In the following sections we will explore how to add your own resources to the ament index and provide best practices for doing so.
fr: Dans les sections suivantes, nous explorerons comment ajouter vos propres ressources à l'index d'ament et fournirons les meilleures pratiques pour le faire.

source: Querying the ament index
fr: Interrogation de l'index d'ament

source: If necessary, it is possible to query the ament index for resources via CMake. To do so, there are three functions:
fr: Si nécessaire, il est possible d'interroger l'index d'ament pour les ressources via CMake. Pour cela, trois fonctions :

source: ``ament_index_has_resource``: obtain a prefix path to the resource if it exists with the following parameters:
fr: ``ament_index_has_resource`` : obtenez un chemin de préfixe vers la ressource si elle existe avec les paramètres suivants :

source: ``var``: the output parameter: fill this variable with FALSE if the resource does not exist or the prefix path to the resource otherwise
fr: ``var`` : le paramètre de sortie : remplissez cette variable avec FALSE si la ressource n'existe pas ou le préfixe du chemin vers la ressource sinon

source: ``resource_type``: The type of the resource (e.g. ``rviz_common__pluginlib__plugin``)
fr: ``resource_type`` : le type de la ressource (par exemple, ``rviz_common__pluginlib__plugin``)

source: ``resource_name``: The name of the resource which usually amounts to the name of the package having added the resource of type resource_type (e.g. ``rviz_default_plugins``)
fr: ``resource_name`` : le nom de la ressource qui correspond généralement au nom du package ayant ajouté la ressource de type resource_type (par exemple, ``rviz_default_plugins``)

source: ``ament_index_get_resource``: Obtain the content of a specific resource, i.e. the contents of the marker file in the ament index.
fr: ``ament_index_get_resource`` : obtient le contenu d'une ressource spécifique, c'est-à-dire le contenu du fichier marqueur dans l'index d'ament.

source: ``var``: the output parameter: filled with the content of the resource marker file if it exists.
fr: ``var`` : le paramètre de sortie : rempli avec le contenu du fichier marqueur de ressource s'il existe.

source: ``PREFIX_PATH``: The prefix path to search for (usually, the default ``ament_index_get_prefix_path()`` will be enough).
fr: ``PREFIX_PATH`` : Le chemin du préfixe à rechercher (généralement, le ``ament_index_get_prefix_path()`` par défaut suffira).

source: Note that ``ament_index_get_resource`` will throw an error if the resource does not exist, so it might be necessary to check using ``ament_index_has_resource``.
fr: Notez que ``ament_index_get_resource`` générera une erreur si la ressource n'existe pas, il peut donc être nécessaire de vérifier en utilisant ``ament_index_has_resource``.

source: ``ament_index_get_resources``: Get all packages which registered resources of a specific type from the index
fr: ``ament_index_get_resources`` : récupère tous les packages qui ont enregistré des ressources d'un type spécifique à partir de l'index

source: ``var``: Output parameter: filled with a list of names of all packages which registered a resource of resource_type
fr: ``var`` : Paramètre de sortie : rempli avec une liste de noms de tous les packages qui ont enregistré une ressource de type_ressource

source: Adding to the ament index
fr: Ajout à l'index des aments

source: Defining a resource requires two bits of information:
fr: La définition d'une ressource nécessite deux informations :

source: a name for the resource which must be unique,
fr: un nom pour la ressource qui doit être unique,

source: a layout of the marker file, which can be anything and could also be empty (this is true for instance for the "package" resource marking a ROS 2 package)
fr: une mise en page du fichier marqueur, qui peut être n'importe quoi et peut aussi être vide (c'est vrai par exemple pour la ressource "package" marquant un package ROS 2)

source: For the RViz mesh resource, the corresponding choices were:
fr: Pour la ressource de maillage RViz, les choix correspondants étaient :

source: ``rviz_ogre_media_exports`` as name of the resource,
fr: ``rviz_ogre_media_exports`` comme nom de la ressource,

source: install path relative paths to all folders containing resources. This will already enable you to write the logic for using the corresponding resource in your package.
fr: chemin d'installation chemins relatifs vers tous les dossiers contenant des ressources. Cela vous permettra déjà d'écrire la logique d'utilisation de la ressource correspondante dans votre package.
