Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/How-To-Guides/Ament-CMake-Documentation.po
Languages: fr

source: ament_cmake user documentation
fr: documentation utilisateur ament_cmake

source: ament_cmake is the build system for CMake based packages in ROS 2 (in particular, it will be used for most if not all C/C++ projects). It is a set of scripts enhancing CMake and adding convenience functionality for package authors. Knowing the basics of `CMake <https://cmake.org/cmake/help/v3.5/>`__ will be very helpful, an official tutorial can be found `here <https://cmake.org/cmake/help/latest/guide/tutorial/index.html>`__.
fr: ament_cmake est le système de construction pour les packages basés sur CMake dans ROS 2 (en particulier, il sera utilisé pour la plupart sinon tous les projets C/C++). Il s'agit d'un ensemble de scripts améliorant CMake et ajoutant des fonctionnalités pratiques pour les auteurs de packages. Connaître les bases de `CMake <https://cmake.org/cmake/help/v3.5/>`__ sera très utile, un tutoriel officiel peut être trouvé `ici <https://cmake.org/cmake/ aide/dernier/guide/tutoriel/index.html>`__.

source: Table of Contents
fr: Table des matières

source: Basics
fr: Bases

source: A basic CMake outline can be produced using ``ros2 pkg create <package_name>`` on the command line. The basic build information is then gathered in two files: the ``package.xml`` and the ``CMakeLists.txt``. The ``package.xml`` must contain all dependencies and a bit of metadata to allow colcon to find the correct build order for your packages, to install the required dependencies in CI as well as provide the information for a release with ``bloom``. The ``CMakeLists.txt`` contains the commands to build and package executables and libraries and will be the main focus of this document.
fr: Un aperçu de base de CMake peut être produit en utilisant ``ros2 pkg create <package_name>`` sur la ligne de commande. Les informations de construction de base sont ensuite rassemblées dans deux fichiers : le ``package.xml`` et le ``CMakeLists.txt``. Le ``package.xml`` doit contenir toutes les dépendances et un peu de métadonnées pour permettre à colcon de trouver le bon ordre de construction pour vos packages, d'installer les dépendances requises dans CI ainsi que de fournir les informations pour une version avec ``bloom ``. Le ``CMakeLists.txt`` contient les commandes pour construire et empaqueter les exécutables et les bibliothèques et sera l'objet principal de ce document.

source: Basic project outline
fr: Aperçu du projet de base

source: The basic outline of the ``CMakeLists.txt`` of an ament package contains:
fr: Le schéma de base du ``CMakeLists.txt`` d'un package ament contient :

source: The argument to ``project`` will be the package name and must be identical to the package name in the ``package.xml``.
fr: L'argument de ``project`` sera le nom du package et doit être identique au nom du package dans ``package.xml``.

source: The project setup is done by ``ament_package()`` and this call must occur exactly once per package. ``ament_package()`` installs the ``package.xml``, registers the package with the ament index, and installs config (and possibly target) files for CMake so that it can be found by other packages using ``find_package``. Since ``ament_package()`` gathers a lot of information from the ``CMakeLists.txt`` it should be the last call in your ``CMakeLists.txt``. Although it is possible to follow calls to ``ament_package()`` by calls to ``install`` functions copying files and directories, it is simpler to just keep ``ament_package()`` the last call.
fr: La configuration du projet est effectuée par ``ament_package()`` et cet appel doit se produire exactement une fois par package. ``ament_package()`` installe le ``package.xml``, enregistre le paquet avec l'index ament et installe les fichiers de configuration (et éventuellement cible) pour CMake afin qu'il puisse être trouvé par d'autres paquets en utilisant ``find_package` `. Étant donné que ``ament_package()`` rassemble beaucoup d'informations à partir de ``CMakeLists.txt``, il devrait être le dernier appel dans votre ``CMakeLists.txt``. Bien qu'il soit possible de suivre les appels à ``ament_package()`` par des appels aux fonctions ``install`` copiant fichiers et répertoires, il est plus simple de garder ``ament_package()`` le dernier appel.

source: ``ament_package`` can be given additional arguments:
fr: ``ament_package`` peut recevoir des arguments supplémentaires :

source: ``CONFIG_EXTRAS``: a list of CMake files (``.cmake`` or ``.cmake.in`` templates expanded by ``configure_file()``) which should be available to clients of the package. For an example of when to use these arguments, see the discussion in `Adding resources`_. For more information on how to use template files, see `the official documentation <https://cmake.org/cmake/help/v3.5/command/configure_file.html>`__.
fr: ``CONFIG_EXTRAS`` : une liste de fichiers CMake (modèles ``.cmake`` ou ``.cmake.in`` développés par ``configure_file()``) qui devraient être disponibles pour les clients du paquet. Pour un exemple d'utilisation de ces arguments, consultez la discussion dans `Ajout de ressources`_. Pour plus d'informations sur l'utilisation des fichiers modèles, consultez `la documentation officielle <https://cmake.org/cmake/help/v3.5/command/configure_file.html>`__.

source: ``CONFIG_EXTRAS_POST``: same as ``CONFIG_EXTRAS``, but the order in which the files are added differs. While ``CONFIG_EXTRAS`` files are included before the files generated for the ``ament_export_*`` calls the files from ``CONFIG_EXTRAS_POST`` are included afterwards.
fr: ``CONFIG_EXTRAS_POST`` : identique à ``CONFIG_EXTRAS``, mais l'ordre dans lequel les fichiers sont ajoutés diffère. Alors que les fichiers ``CONFIG_EXTRAS`` sont inclus avant les fichiers générés pour les appels ``ament_export_*``, les fichiers de ``CONFIG_EXTRAS_POST`` sont inclus après.

source: Instead of adding to ``ament_package``, you can also add to the variable ``${PROJECT_NAME}_CONFIG_EXTRAS`` and ``${PROJECT_NAME}_CONFIG_EXTRAS_POST`` with the same effect. The only difference is again the order in which the files are added with the following total order:
fr: Au lieu d'ajouter à ``ament_package``, vous pouvez également ajouter à la variable ``${PROJECT_NAME}_CONFIG_EXTRAS`` et ``${PROJECT_NAME}_CONFIG_EXTRAS_POST`` avec le même effet. La seule différence est encore une fois l'ordre dans lequel les fichiers sont ajoutés avec l'ordre total suivant :

source: files added by ``CONFIG_EXTRAS``
fr: fichiers ajoutés par ``CONFIG_EXTRAS``

source: files added by appending to ``${PROJECT_NAME}_CONFIG_EXTRAS``
fr: fichiers ajoutés en ajoutant à ``${PROJECT_NAME}_CONFIG_EXTRAS``

source: files added by appending to ``${PROJECT_NAME}_CONFIG_EXTRAS_POST``
fr: fichiers ajoutés en ajoutant à ``${PROJECT_NAME}_CONFIG_EXTRAS_POST``

source: files added by ``CONFIG_EXTRAS_POST``
fr: fichiers ajoutés par ``CONFIG_EXTRAS_POST``

source: Adding files and headers
fr: Ajout de fichiers et d'en-têtes

source: There are two main targets to build: libraries and executables which are built by ``add_library`` and ``add_executable`` respectively.
fr: Il y a deux cibles principales à construire : les bibliothèques et les exécutables qui sont respectivement construits par ``add_library`` et ``add_executable``.

source: With the separation of header files and implementation in C/C++, it is not always necessary to add both files as argument to ``add_library``/ ``add_executable``.
fr: Avec la séparation des fichiers d'en-tête et de l'implémentation en C/C++, il n'est pas toujours nécessaire d'ajouter les deux fichiers comme argument à ``add_library``/``add_executable``.

source: The following best practice is proposed:
fr: La meilleure pratique suivante est proposée :

source: if you are building a library, put all headers which should be usable by clients and therefore must be installed into a subdirectory of the ``include`` folder named like the package, while all other files (``.c/.cpp`` and header files which should not be exported) are inside the ``src`` folder.
fr: si vous construisez une bibliothèque, placez tous les en-têtes qui doivent être utilisables par les clients et doivent donc être installés dans un sous-répertoire du dossier ``include`` nommé comme le paquet, tandis que tous les autres fichiers (``.c/.cpp` ` et les fichiers d'en-tête qui ne doivent pas être exportés) se trouvent dans le dossier ``src``.

source: only cpp files are explicitly referenced in the call to ``add_library`` or ``add_executable``
fr: seuls les fichiers cpp sont explicitement référencés dans l'appel à ``add_library`` ou ``add_executable``

source: allow to find headers via
fr: permettre de trouver des en-têtes via

source: This adds all files in the folder ``${CMAKE_CURRENT_SOURCE_DIR}/include`` to the public interface during build time and all files in the include folder (relative to ``${CMAKE_INSTALL_DIR}``) when being installed.
fr: Cela ajoute tous les fichiers du dossier ``${CMAKE_CURRENT_SOURCE_DIR}/include`` à l'interface publique pendant la construction et tous les fichiers du dossier d'inclusion (par rapport à ``${CMAKE_INSTALL_DIR}``) lors de l'installation.

source: In principle, using generator expressions here is not necessary if both folders are called ``include`` and top-level with respect to ``${CMAKE_CURRENT_SOURCE_DIR}`` and ``${CMAKE_INSTALL_DIR}``, but it is very common.
fr: En principe, l'utilisation d'expressions de générateur ici n'est pas nécessaire si les deux dossiers sont appelés ``include`` et de niveau supérieur par rapport à ``${CMAKE_CURRENT_SOURCE_DIR}`` et ``${CMAKE_INSTALL_DIR}``, mais c'est très courant .

source: Adding Dependencies
fr: Ajout de dépendances

source: There are two ways to link your packages against a new dependency.
fr: Il existe deux façons de lier vos packages à une nouvelle dépendance.

source: The first and recommended way is to use the ament macro ``ament_target_dependencies``. As an example, suppose we want to link ``my_target`` against the linear algebra library Eigen3.
fr: La première méthode recommandée consiste à utiliser la macro ament ``ament_target_dependencies``. Par exemple, supposons que nous voulions lier ``my_target`` à la bibliothèque d'algèbre linéaire Eigen3.

source: It includes the necessary headers and libraries and their dependencies to be correctly found by the project. It will also ensure that the include directories of all dependencies are ordered correctly when using overlay workspaces.
fr: Il comprend les en-têtes et bibliothèques nécessaires et leurs dépendances pour être correctement trouvés par le projet. Cela garantira également que les répertoires d'inclusion de toutes les dépendances sont correctement ordonnés lors de l'utilisation d'espaces de travail superposés.

source: The second way is to use ``target_link_libraries``.
fr: La deuxième façon est d'utiliser ``target_link_libraries``.

source: The recommended way in modern CMake is to only use targets, exporting and linking against them. CMake targets are namespaced, similar to C++. For instance, ``Eigen3`` defines the target ``Eigen3::Eigen``.
fr: La méthode recommandée dans CMake moderne consiste à n'utiliser que des cibles, à les exporter et à les lier. Les cibles CMake ont un espace de noms, similaire à C++. Par exemple, ``Eigen3`` définit la cible ``Eigen3::Eigen``.

source: At least until ``Crystal Clemmys`` target names are not supported in the ``ament_target_dependencies`` macro. Sometimes it will be necessary to call the ``target_link_libaries`` CMake function. In the example of Eigen3, the call should then look like
fr: Au moins jusqu'à ce que les noms de cible ``Crystal Clemmys`` ne soient pas pris en charge dans la macro ``ament_target_dependencies``. Parfois, il sera nécessaire d'appeler la fonction CMake ``target_link_libaries``. Dans l'exemple de Eigen3, l'appel devrait alors ressembler à

source: This will also include necessary headers, libraries and their dependencies, but in contrast to ``ament_target_dependencies`` it might not correctly order the dependencies when using overlay workspaces.
fr: Cela inclura également les en-têtes nécessaires, les bibliothèques et leurs dépendances, mais contrairement à ``ament_target_dependencies``, il se peut que les dépendances ne soient pas correctement ordonnées lors de l'utilisation d'espaces de travail superposés.

source: It should never be necessary to ``find_package`` a library that is not explicitly needed but is a dependency of another dependency that is explicitly needed. If that is the case, file a bug against the corresponding package.
fr: Il ne devrait jamais être nécessaire de ``find_package`` une bibliothèque qui n'est pas explicitement nécessaire mais qui est une dépendance d'une autre dépendance qui est explicitement nécessaire. Si tel est le cas, signalez un bogue sur le paquet correspondant.

source: Building a Library
fr: Construire une bibliothèque

source: When building a reusable library, some information needs to be exported for downstream packages to easily use it.
fr: Lors de la création d'une bibliothèque réutilisable, certaines informations doivent être exportées pour que les packages en aval puissent les utiliser facilement.

source: Here, we assume that the folder ``include`` contains the headers which need to be exported. Note that it is not necessary to put all headers into a separate folder, only those that should be included by clients.
fr: Ici, nous supposons que le dossier ``include`` contient les en-têtes qui doivent être exportés. Notez qu'il n'est pas nécessaire de placer tous les en-têtes dans un dossier séparé, uniquement ceux qui doivent être inclus par les clients.

source: Here is what's happening in the snippet above:
fr: Voici ce qui se passe dans l'extrait ci-dessus :

source: The ``ament_export_targets`` macro exports the targets for CMake. This is necessary to allow your library's clients to use the ``target_link_libraries(client my_library::my_library)`` syntax. ``ament_export_targets`` can take an arbitrary list of targets named as ``EXPORT`` in an install call and an additional option ``HAS_LIBRARY_TARGET``, which adds potential libraries to environment variables.
fr: La macro ``ament_export_targets`` exporte les cibles pour CMake. Ceci est nécessaire pour permettre aux clients de votre bibliothèque d'utiliser la syntaxe ``target_link_libraries(client my_library::my_library)``. ``ament_export_targets`` peut prendre une liste arbitraire de cibles nommées ``EXPORT`` dans un appel d'installation et une option supplémentaire ``HAS_LIBRARY_TARGET``, qui ajoute des bibliothèques potentielles aux variables d'environnement.

source: The ``ament_export_dependencies`` exports dependencies to downstream packages. This is necessary so that the user of the library does not have to call ``find_package`` for those dependencies, too.
fr: Le ``ament_export_dependencies`` exporte les dépendances vers les packages en aval. Ceci est nécessaire pour que l'utilisateur de la bibliothèque n'ait pas à appeler ``find_package`` pour ces dépendances également.

source: The first ``install`` commands installs the header files which should be available to clients.
fr: La première commande ``install`` installe les fichiers d'en-tête qui devraient être disponibles pour les clients.

source: Calling ``ament_export_targets``, ``ament_export_dependencies``, or other ament commands from a CMake subdirectory will not work as expected. This is because the CMake subdirectory has no way of setting necessary variables in the parent scope where ``ament_package`` is called.
fr: L'appel de ``ament_export_targets``, ``ament_export_dependencies`` ou d'autres commandes ament à partir d'un sous-répertoire CMake ne fonctionnera pas comme prévu. C'est parce que le sous-répertoire CMake n'a aucun moyen de définir les variables nécessaires dans la portée parent où ``ament_package`` est appelé.

source: The last large install command installs the library. Archive and library files will be exported to the lib folder, runtime binaries will be installed to the bin folder and the path to installed headers is ``include``.
fr: La dernière grande commande d'installation installe la bibliothèque. Les fichiers d'archive et de bibliothèque seront exportés vers le dossier lib, les binaires d'exécution seront installés dans le dossier bin et le chemin vers les en-têtes installés est ``include``.

source: Windows DLLs are treated as runtime artifacts and installed into the ``RUNTIME DESTINATION`` folder. It is therefore advised to not leave out the ``RUNTIME`` install even when developing libraries on Unix based systems.
fr: Les DLL Windows sont traitées comme des artefacts d'exécution et installées dans le dossier ``RUNTIME DESTINATION``. Il est donc conseillé de ne pas omettre l'installation ``RUNTIME`` même lors du développement de bibliothèques sur des systèmes basés sur Unix.

source: Regarding the ``include directory``, the install command only adds information to CMake, it does not actually install the includes folder. This is done by copying the headers via ``install(DIRECTORY <dir> DESTINATION <dest>)`` as described above.
fr: En ce qui concerne le ``include directory``, la commande d'installation ajoute uniquement des informations à CMake, elle n'installe pas réellement le dossier includes. Ceci est fait en copiant les en-têtes via ``install(DIRECTORY <dir> DESTINATION <dest>)`` comme décrit ci-dessus.

source: The ``EXPORT`` notation of the install call requires additional attention: It installs the CMake files for the ``my_library`` target. It is named exactly like the argument in ``ament_export_targets`` and could be named like the library. However, this will then prohibit using the ``ament_target_dependencies`` way of including your library. To allow for full flexibility, it is advised to prepend the export target with something like ``<target>Targets``.
fr: La notation ``EXPORT`` de l'appel d'installation nécessite une attention supplémentaire : elle installe les fichiers CMake pour la cible ``my_library``. Il est nommé exactement comme l'argument dans ``ament_export_targets`` et pourrait être nommé comme la bibliothèque. Cependant, cela empêchera alors d'utiliser la méthode ``ament_target_dependencies`` pour inclure votre bibliothèque. Pour permettre une flexibilité totale, il est conseillé de faire précéder la cible d'exportation avec quelque chose comme ``<target>Targets``.

source: All install paths are relative to ``CMAKE_INSTALL_PREFIX``, which is already set correctly by colcon/ament
fr: Tous les chemins d'installation sont relatifs à ``CMAKE_INSTALL_PREFIX``, qui est déjà défini correctement par colcon/ament

source: There are two additional functions which can be used but are superfluous for target based installs:
fr: Deux fonctions supplémentaires peuvent être utilisées mais sont superflues pour les installations basées sur la cible :

source: The first macro marks the directory of the exported include directories (this is achieved by ``INCLUDES DESTINATION`` in the target ``install`` call). The second macro marks the location of the installed library (this is done by the ``HAS_LIBRARY_TARGET`` argument in the call to ``ament_export_targets``).
fr: La première macro marque le répertoire des répertoires d'inclusion exportés (ceci est réalisé par ``INCLUDES DESTINATION`` dans l'appel cible ``install``). La deuxième macro marque l'emplacement de la bibliothèque installée (ceci est fait par l'argument ``HAS_LIBRARY_TARGET`` dans l'appel à ``ament_export_targets``).

source: Some of the macros can take different types of arguments for non-target exports, but since the recommended way for modern Make is to use targets, we will not cover them here. Documentation of these options can be found in the source code itself.
fr: Certaines des macros peuvent prendre différents types d'arguments pour les exportations non ciblées, mais comme la méthode recommandée pour Make moderne consiste à utiliser des cibles, nous ne les aborderons pas ici. La documentation de ces options se trouve dans le code source lui-même.

source: Compiler and linker options
fr: Options du compilateur et de l'éditeur de liens

source: ROS 2 targets compilers which comply with the C++14 and C99 standard until at least ``Crystal Clemmys``. Newer versions might be targeted in the future and are referenced `here <https://www.ros.org/reps/rep-2000.html>`__. Therefore it is customary to set the corresponding CMake flags:
fr: ROS 2 cible les compilateurs qui respectent les standards C++14 et C99 jusqu'au moins ``Crystal Clemmys``. Des versions plus récentes pourraient être ciblées à l'avenir et sont référencées `ici <https://www.ros.org/reps/rep-2000.html>`__. Par conséquent, il est d'usage de définir les drapeaux CMake correspondants :

source: To keep the code clean, compilers should throw warnings for questionable code and these warnings should be fixed.
fr: Pour garder le code propre, les compilateurs doivent lancer des avertissements pour le code douteux et ces avertissements doivent être corrigés.

source: It is recommended to at least cover the following warning levels:
fr: Il est recommandé de couvrir au moins les niveaux d'avertissement suivants :

source: For Visual Studio, the default ``W1`` warnings are kept
fr: Pour Visual Studio, les avertissements ``W1`` par défaut sont conservés

source: For GCC and Clang: ``-Wall -Wextra -Wpedantic`` are required and ``-Wshadow -Werror`` are advisable (the latter makes warnings errors).
fr: Pour GCC et Clang : ``-Wall -Wextra -Wpedantic`` sont requis et ``-Wshadow -Werror`` sont conseillés (ce dernier fait des erreurs d'avertissement).

source: Although modern CMake advises to add compiler flags on a target basis, i.e. call
fr: Bien que CMake moderne conseille d'ajouter des indicateurs de compilateur sur une base cible, c'est-à-dire d'appeler

source: it is at the moment recommended to use the directory level function ``add_compile_options(-Wall)`` to not clutter the code with target-based compile options for all executables and tests.
fr: il est actuellement recommandé d'utiliser la fonction au niveau du répertoire ``add_compile_options(-Wall)`` pour ne pas encombrer le code avec des options de compilation basées sur la cible pour tous les exécutables et les tests.

source: Building libraries on Windows
fr: Créer des bibliothèques sous Windows

source: Since Linux, Mac and Windows are all officially supported platforms, to have maximum impact any package should also build on Windows. The Windows library format enforces symbol visibility: Every symbol which should be used from a client has to be explicitly exported by the library (and data symbols need to be implicitly imported).
fr: Étant donné que Linux, Mac et Windows sont tous des plates-formes officiellement prises en charge, pour avoir un impact maximal, tout package doit également être construit sur Windows. Le format de bibliothèque Windows applique la visibilité des symboles : chaque symbole qui doit être utilisé à partir d'un client doit être explicitement exporté par la bibliothèque (et les symboles de données doivent être implicitement importés).

source: To keep this compatible with Clang and GCC builds, it is advised to use the logic in `the GCC wiki <https://gcc.gnu.org/wiki/Visibility>`__. To use it for a package called ``my_library``:
fr: Pour que cela reste compatible avec les builds Clang et GCC, il est conseillé d'utiliser la logique du `wiki GCC <https://gcc.gnu.org/wiki/Visibility>`__. Pour l'utiliser pour un paquet appelé ``my_library`` :

source: Copy the logic in the link into a header file called ``visibility_control.hpp``.
fr: Copiez la logique du lien dans un fichier d'en-tête appelé ``visibility_control.hpp``.
