Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/How-To-Guides/Ament-CMake-Documentation.po
Languages: fr

source: To allow users to easily register resources for your package, you should furthermore provide macros or functions such as the pluginlib function or ``rviz_ogre_media_exports`` function.
fr: Pour permettre aux utilisateurs d'enregistrer facilement des ressources pour votre package, vous devez en outre fournir des macros ou des fonctions telles que la fonction pluginlib ou la fonction ``rviz_ogre_media_exports``.

source: To register a resource, use the ament function ``ament_index_register_resource``. This will create and install the marker files in the resource_index. As an example, the corresponding call for ``rviz_ogre_media_exports`` is the following:
fr: Pour enregistrer une ressource, utilisez la fonction ament ``ament_index_register_resource``. Cela créera et installera les fichiers marqueurs dans le fichier resource_index. Par exemple, l'appel correspondant pour ``rviz_ogre_media_exports`` est le suivant :

source: This installs a file named like ``${PROJECT_NAME}`` into a folder ``rviz_ogre_media_exports`` into the resource_index with content given by variable ``${OGRE_MEDIA_RESOURCE_FILE}``. The macro has a number of parameters that can be useful:
fr: Cela installe un fichier nommé comme ``${PROJECT_NAME}`` dans un dossier ``rviz_ogre_media_exports`` dans le resource_index avec le contenu donné par la variable ``${OGRE_MEDIA_RESOURCE_FILE}``. La macro a un certain nombre de paramètres qui peuvent être utiles :

source: the first (unnamed) parameter is the name of the resource, which amounts to the name of the folder in the resource_index
fr: le premier paramètre (sans nom) est le nom de la ressource, qui équivaut au nom du dossier dans le resource_index

source: ``CONTENT``: The content of the marker file as string. This could be a list of relative paths, etc. ``CONTENT`` cannot be used together with ``CONTENT_FILE``.
fr: ``CONTENT`` : Le contenu du fichier marqueur sous forme de chaîne. Il peut s'agir d'une liste de chemins relatifs, etc. ``CONTENT`` ne peut pas être utilisé avec ``CONTENT_FILE``.

source: ``CONTENT_FILE``: The path to a file which will be use to create the marker file. The file can be a plain file or a template file expanded with ``configure_file()``. ``CONTENT_FILE`` cannot be used together with ``CONTENT``.
fr: ``CONTENT_FILE`` : Le chemin vers un fichier qui sera utilisé pour créer le fichier marqueur. Le fichier peut être un fichier simple ou un fichier modèle développé avec ``configure_file()``. ``CONTENT_FILE`` ne peut pas être utilisé avec ``CONTENT``.

source: ``PACKAGE_NAME``: The name of the package/library exporting the resource, which amounts to the name of the marker file. Defaults to ``${PROJECT_NAME}``.
fr: ``PACKAGE_NAME`` : le nom du package/de la bibliothèque exportant la ressource, qui correspond au nom du fichier marqueur. La valeur par défaut est ``${PROJECT_NAME}``.

source: ``AMENT_INDEX_BINARY_DIR``: The base path of the generated ament index. Unless really necessary, always use the default ``${CMAKE_BINARY_DIR}/ament_cmake_index``.
fr: ``AMENT_INDEX_BINARY_DIR`` : Le chemin de base de l'index d'ament généré. Sauf si vraiment nécessaire, utilisez toujours la valeur par défaut ``${CMAKE_BINARY_DIR}/ament_cmake_index``.

source: ``SKIP_INSTALL``: Skip installing the marker file.
fr: ``SKIP_INSTALL`` : ignore l'installation du fichier marqueur.

source: Since only one marker file exists per package, it is usually a problem if the CMake function/macro gets called twice by the same project. However, for large projects it might be best to split up calls registering resources.
fr: Puisqu'il n'existe qu'un seul fichier marqueur par package, c'est généralement un problème si la fonction/macro CMake est appelée deux fois par le même projet. Cependant, pour les grands projets, il peut être préférable de diviser les appels enregistrant les ressources.

source: Therefore, it is best practice to let a macro registering a resource such as ``register_rviz_ogre_media_exports.cmake`` only fill some variables. The real call to ``ament_index_register_resource`` can then be added within an ament extension to ``ament_package``. Since there must only ever be one call to ``ament_package`` per project, there will always only be one place where the resource gets registered. In the case of ``rviz_ogre_media_exports`` this amounts to the following strategy:
fr: Par conséquent, il est préférable de laisser une macro enregistrant une ressource telle que ``register_rviz_ogre_media_exports.cmake`` ne remplir que certaines variables. Le véritable appel à ``ament_index_register_resource`` peut alors être ajouté dans une extension ament à ``ament_package``. Puisqu'il ne doit y avoir qu'un seul appel à ``ament_package`` par projet, il n'y aura toujours qu'un seul endroit où la ressource sera enregistrée. Dans le cas de ``rviz_ogre_media_exports`` cela revient à la stratégie suivante :

source: The macro ``register_rviz_ogre_media_exports`` takes a list of folders and appends them to a variable called ``OGRE_MEDIA_RESOURCE_FILE``.
fr: La macro ``register_rviz_ogre_media_exports`` prend une liste de dossiers et les ajoute à une variable appelée ``OGRE_MEDIA_RESOURCE_FILE``.

source: Another macro called ``register_rviz_ogre_media_exports_hook`` calls ``ament_index_register_resource`` if ``${OGRE_MEDIA_RESOURCE_FILE}`` is non-empty.
fr: Une autre macro appelée ``register_rviz_ogre_media_exports_hook`` appelle ``ament_index_register_resource`` si ``${OGRE_MEDIA_RESOURCE_FILE}`` n'est pas vide.

source: The ``register_rviz_ogre_media_exports_hook.cmake`` file is registered as an ament extension in a third file ``register_rviz_ogre_media_exports_hook-extras.cmake`` via calling
fr: Le fichier ``register_rviz_ogre_media_exports_hook.cmake`` est enregistré en tant qu'extension ament dans un troisième fichier ``register_rviz_ogre_media_exports_hook-extras.cmake`` via l'appel

source: The files ``register_rviz_ogre_media_exports.cmake`` and ``register_rviz_ogre_media_exports_hook-extra.cmake`` are registered as ``CONFIG_EXTRA`` with ``ament_package()``.
fr: Les fichiers ``register_rviz_ogre_media_exports.cmake`` et ``register_rviz_ogre_media_exports_hook-extra.cmake`` sont enregistrés en tant que ``CONFIG_EXTRA`` avec ``ament_package()``.
