Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/How-To-Guides/Ament-CMake-Python-Documentation.po
Languages: fr

source: ament_cmake_python user documentation
fr: documentation utilisateur ament_cmake_python

source: ``ament_cmake_python`` is a package that provides CMake functions for packages of the ``ament_cmake`` build type that contain Python code. See the :doc:`ament_cmake user documentation <Ament-CMake-Documentation>` for more information.
fr: ``ament_cmake_python`` est un package qui fournit des fonctions CMake pour les packages du type de construction ``ament_cmake`` contenant du code Python. Voir la :doc:`ament_cmake documentation utilisateur <Ament-CMake-Documentation>` pour plus d'informations.

source: Pure Python packages should use the ``ament_python`` build type in most cases. To create an ``ament_python`` package, see :doc:`Creating your first ROS 2 package <../Tutorials/Beginner-Client-Libraries/Creating-Your-First-ROS2-Package>`. ``ament_cmake_python`` should only be used in cases where that is not possible, like when mixing C/C++ and Python code.
fr: Les packages Python purs doivent utiliser le type de construction ``ament_python`` dans la plupart des cas. Pour créer un package ``ament_python``, consultez :doc:`Creating your first ROS 2 package <../Tutorials/Beginner-Client-Libraries/Creating-Your-First-ROS2-Package>`. ``ament_cmake_python`` ne doit être utilisé que dans les cas où cela n'est pas possible, comme lors du mélange de code C/C++ et Python.

source: Table of Contents
fr: Table des matières

source: Basics
fr: Bases

source: Basic project outline
fr: Aperçu du projet de base

source: The outline of a package called "my_project" with the ``ament_cmake`` build type that uses ``ament_cmake_python`` looks like:
fr: Le plan d'un paquet appelé "my_project" avec le type de construction ``ament_cmake`` qui utilise ``ament_cmake_python`` ressemble à :

source: The ``__init__.py`` file can be empty, but it is needed to `make Python treat the directory containing it as a package <https://docs.python.org/3/tutorial/modules.html#packages>`__. There can also be a ``src`` or ``include`` directory alongside the ``CMakeLists.txt`` which holds C/C++ code.
fr: Le fichier ``__init__.py`` peut être vide, mais il est nécessaire pour `faire que Python traite le répertoire le contenant comme un package <https://docs.python.org/3/tutorial/modules.html#packages> `__. Il peut également y avoir un répertoire ``src`` ou ``include`` à côté du ``CMakeLists.txt`` qui contient du code C/C++.

source: Using ament_cmake_python
fr: Utiliser ament_cmake_python

source: The package must declare a dependency on ``ament_cmake_python`` in its ``package.xml``.
fr: Le paquet doit déclarer une dépendance sur ``ament_cmake_python`` dans son ``package.xml``.

source: The ``CMakeLists.txt`` should contain:
fr: Le ``CMakeLists.txt`` doit contenir :

source: The argument to ``ament_python_install_package()`` is the name of the directory alongside the ``CMakeLists.txt`` that contains the Python file. In this case, it is ``my_project``, or ``${PROJECT_NAME}``.
fr: L'argument de ``ament_python_install_package()`` est le nom du répertoire à côté de ``CMakeLists.txt`` qui contient le fichier Python. Dans ce cas, il s'agit de ``my_project``, ou ``${PROJECT_NAME}``.

source: Calling ``rosidl_generate_interfaces`` and ``ament_python_install_package`` in the same CMake project does not work. See this `Github issue <https://github.com/ros2/rosidl_python/issues/141>`_ for more info. It is best practice to instead separate out the message generation into a separate package.
fr: L'appel de ``rosidl_generate_interfaces`` et ``ament_python_install_package`` dans le même projet CMake ne fonctionne pas. Voir ce `problème Github <https://github.com/ros2/rosidl_python/issues/141>`_ pour plus d'informations. Il est préférable de séparer la génération de messages dans un package séparé.

source: Then, another Python package that correctly depends on ``my_project`` can use it as a normal Python module:
fr: Ensuite, un autre package Python qui dépend correctement de ``my_project`` peut l'utiliser comme un module Python normal :

source: Assuming ``my_script.py`` contains a function called ``my_function()``.
fr: En supposant que ``my_script.py`` contient une fonction appelée ``my_function()``.

source: Using ament_cmake_pytest
fr: Utilisation de ament_cmake_pytest

source: The package ``ament_cmake_pytest`` is used to make tests discoverable to ``cmake``. The package must declare a test dependency on ``ament_cmake_pytest`` in its ``package.xml``.
fr: Le package ``ament_cmake_pytest`` est utilisé pour rendre les tests détectables par ``cmake``. Le paquet doit déclarer une dépendance de test sur ``ament_cmake_pytest`` dans son ``package.xml``.

source: Say the package has a file structure like below, with tests in the ``tests`` folder.
fr: Supposons que le paquet ait une structure de fichiers comme ci-dessous, avec des tests dans le dossier ``tests``.

source: Compared to the usage of ament_python, which supports automatic test discovery, ament_cmake_pytest must be called with the path to each test file. The timeout can be reduced as needed.
fr: Par rapport à l'utilisation d'ament_python, qui prend en charge la découverte automatique des tests, ament_cmake_pytest doit être appelé avec le chemin d'accès à chaque fichier de test. Le délai d'attente peut être réduit si nécessaire.

source: Now, you can invoke your tests with the :doc:`standard colcon testing commands <../Tutorials/Intermediate/Testing/CLI>`.
fr: Maintenant, vous pouvez invoquer vos tests avec les :doc:`commandes de test colcon standard <../Tutorials/Intermediate/Testing/CLI>`.
