Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/How-To-Guides/Building-a-Custom-Debian-Package.po
Languages: fr

source: Building a custom Debian package
fr: Construire un paquet Debian personnalisé

source: Many Ubuntu users install ROS 2 on their system by installing :doc:`debian packages <../Installation/Ubuntu-Install-Debians>`. This guide gives a short set of instructions to build local, custom Debian packages.
fr: De nombreux utilisateurs d'Ubuntu installent ROS 2 sur leur système en installant :doc:`debian packages <../Installation/Ubuntu-Install-Debians>`. Ce guide donne un bref ensemble d'instructions pour créer des packages Debian locaux et personnalisés.

source: Table of Contents
fr: Table des matières

source: Prerequisites
fr: Conditions préalables

source: To successfully build a custom package, all of the dependencies of the package to be built must be available locally or in rosdep. Additionally, all of the dependencies of the package should be properly declared in the ``package.xml`` file of the package.
fr: Pour construire avec succès un package personnalisé, toutes les dépendances du package à construire doivent être disponibles localement ou dans rosdep. De plus, toutes les dépendances du paquet doivent être correctement déclarées dans le fichier ``package.xml`` du paquet.

source: Install dependencies
fr: Installer les dépendances

source: Run the following command to install utilities needed for the build:
fr: Exécutez la commande suivante pour installer les utilitaires nécessaires à la compilation :

source: Initialize rosdep
fr: Initialiser rosdep

source: Initialize the rosdep database by calling:
fr: Initialisez la base de données rosdep en appelant :

source: Note that the ``rosdep init`` command may fail if it has already been initialized in the past; this can safely be ignored.
fr: Notez que la commande ``rosdep init`` peut échouer si elle a déjà été initialisée dans le passé ; cela peut être ignoré en toute sécurité.

source: Build the debian from the package
fr: Construire le debian à partir du paquet

source: Run the following commands to build the debian:
fr: Exécutez les commandes suivantes pour compiler Debian :

source: Assuming that all required dependencies are available and that compilation succeeds, the new package will be available in the parent directory of this directory.
fr: En supposant que toutes les dépendances requises sont disponibles et que la compilation réussit, le nouveau package sera disponible dans le répertoire parent de ce répertoire.
