Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/How-To-Guides/Cross-compilation.po
Languages: fr

source: Cross-compilation
fr: Compilation croisée

source: Table of Contents
fr: Table des matières

source: For background information on cross-compilation, see the :doc:`conceptual article <../Concepts/About-Cross-Compilation>`.
fr: Pour des informations générales sur la compilation croisée, consultez :doc:`article conceptuel <../Concepts/About-Cross-Compilation>`.

source: This document provides you with details on how to cross-compile the ROS 2 software stack as well as provide examples for cross-compiling to systems based on the Arm cores.
fr: Ce document vous fournit des détails sur la façon de compiler de manière croisée la pile logicielle ROS 2 ainsi que des exemples de compilation croisée vers des systèmes basés sur les cœurs Arm.

source: cross_compile tool
fr: outil cross_compile

source: Instructions to use the tool are in the `cross_compile package <https://github.com/ros-tooling/cross_compile>`__.
fr: Les instructions d'utilisation de l'outil se trouvent dans le `package cross_compile <https://github.com/ros-tooling/cross_compile>`__.

source: Legacy tool instructions
fr: Instructions de l'ancien outil

source: Follow the steps below only if you are using the old version (release `0.0.1 <https://github.com/ros-tooling/cross_compile/releases/tag/0.0.1>`__) of the cross-compile tool. For all other purposes, follow the `cross_compile <https://github.com/ros-tooling/cross_compile>`__ package documentation.
fr: Suivez les étapes ci-dessous uniquement si vous utilisez l'ancienne version (version `0.0.1 <https://github.com/ros-tooling/cross_compile/releases/tag/0.0.1>`__) de l'outil de compilation croisée . À toutes autres fins, suivez la documentation du package `cross_compile <https://github.com/ros-tooling/cross_compile>`__.

source: Although ROS 2 is a rich software stack with a number of dependencies, it primarily uses two different types of packages:
fr: Bien que ROS 2 soit une pile logicielle riche avec un certain nombre de dépendances, il utilise principalement deux types de packages différents :

source: Python based software, which requires no cross-compilation.
fr: Logiciel basé sur Python, qui ne nécessite aucune compilation croisée.

source: CMake based software, which provides a mechanism to do cross-compilation.
fr: Logiciel basé sur CMake, qui fournit un mécanisme pour effectuer une compilation croisée.

source: Furthermore, the ROS 2 software stack is built with `Colcon <https://github.com/colcon/colcon-core>`__ which provides a mechanism to forward parameters to the CMake instance used for the individual build of each package/library that is part of the ROS 2 distribution.
fr: De plus, la pile logicielle ROS 2 est construite avec `Colcon <https://github.com/colcon/colcon-core>`__ qui fournit un mécanisme pour transmettre les paramètres à l'instance CMake utilisée pour la construction individuelle de chaque package/bibliothèque qui fait partie de la distribution ROS 2.

source: When building ROS 2 natively, the developer is required to download all the dependencies (e.g. Python and other libraries) before compiling the packages that are part of the ROS 2 distribution. When cross-compiling, the same approach is required. The developer must first have the target system's filesystem with all dependencies already installed.
fr: Lors de la construction native de ROS 2, le développeur doit télécharger toutes les dépendances (par exemple, Python et d'autres bibliothèques) avant de compiler les packages qui font partie de la distribution ROS 2. Lors de la compilation croisée, la même approche est requise. Le développeur doit d'abord disposer du système de fichiers du système cible avec toutes les dépendances déjà installées.

source: The next sections of this document explain in detail the use of `cmake-toolchains <https://cmake.org/cmake/help/latest/manual/cmake-toolchains.7.html>`__ and the `CMAKE_SYSROOT <https://cmake.org/cmake/help/latest/variable/CMAKE_SYSROOT.html>`__ feature to cross-compile ROS 2.
fr: Les sections suivantes de ce document expliquent en détail l'utilisation de `cmake-toolchains <https://cmake.org/cmake/help/latest/manual/cmake-toolchains.7.html>`__ et de `CMAKE_SYSROOT <https: //cmake.org/cmake/help/latest/variable/CMAKE_SYSROOT.html>`__ fonctionnalité pour cross-compiler ROS 2.

source: CMake toolchain-file
fr: Fichier de chaîne d'outils CMake

source: A CMake toolchain-file is a file which defines variables to configure CMake for cross-compilation. The basic entries are:
fr: Un fichier de chaîne d'outils CMake est un fichier qui définit des variables pour configurer CMake pour la compilation croisée. Les entrées de base sont :

source: ``CMAKE_SYSTEM_NAME``: the target platform, e.g. ``linux``
fr: ``CMAKE_SYSTEM_NAME`` : la plate-forme cible, par ex. ``Linux``

source: ``CMAKE_SYSTEM_PROCESSOR``: the target architecture, e.g. ``aarch64`` or ``arm``
fr: ``CMAKE_SYSTEM_PROCESSOR`` : l'architecture cible, par ex. ``aarch64`` ou ``arm``

source: ``CMAKE_SYSROOT``: the path to the target file-system
fr: ``CMAKE_SYSROOT`` : le chemin vers le système de fichiers cible

source: ``CMAKE_C_COMPILER``: the C cross-compiler, e.g. ``aarch64-linux-gnu-gcc``
fr: ``CMAKE_C_COMPILER`` : le compilateur croisé C, par ex. ``aarch64-linux-gnu-gcc``

source: ``CMAKE_CXX_COMPILER``: the C++ cross-compiler, e.g. ``aarch64-linux-gnu-g++``
fr: ``CMAKE_CXX_COMPILER`` : le compilateur croisé C++, par ex. ``aarch64-linux-gnu-g++``

source: ``CMAKE_FIND_ROOT_PATH``: an alternative path used by the ``find_*`` command to find the file-system
fr: ``CMAKE_FIND_ROOT_PATH`` : un chemin alternatif utilisé par la commande ``find_*`` pour trouver le système de fichiers

source: When cross-compiling ROS 2, the following options are required to be set:
fr: Lors de la compilation croisée de ROS 2, les options suivantes doivent être définies :

source: ``CMAKE_FIND_ROOT_PATH``: the alternative path used by the ``find_*`` command, use it to specify the path to ROS 2 ``/install`` folder
fr: ``CMAKE_FIND_ROOT_PATH`` : le chemin alternatif utilisé par la commande ``find_*``, utilisez-le pour spécifier le chemin vers le dossier ROS 2 ``/install``

source: ``CMAKE_FIND_ROOT_PATH_MODE_*``: the search strategy for program,package,library, and include, usually: ``NEVER`` (look on the host-fs), ``ONLY`` (look on sysroot), and ``BOTH`` (look on both sysroot and host-fs)
fr: ``CMAKE_FIND_ROOT_PATH_MODE_*`` : la stratégie de recherche pour le programme, le paquet, la bibliothèque et l'inclusion, généralement : `` NEVER`` (regardez sur l'hôte-fs), `` ONLY`` (regardez sur sysroot) et `` BOTH`` (regarde à la fois sur sysroot et host-fs)

source: ``PYTHON_SOABI``: the index name of the python libraries generated by ROS 2, e.g. ``cpython-36m-aarch64-linux-gnu``
fr: ``PYTHON_SOABI`` : le nom d'index des bibliothèques python générées par ROS 2, par ex. ``cpython-36m-aarch64-linux-gnu``

source: ``THREADS_PTHREAD_ARG "0" CACHE STRING "Result from TRY_RUN" FORCE``: Force the result of the ``TRY_RUN`` cmd to 0 (success) because binaries can not run on the host system.
fr: ``THREADS_PTHREAD_ARG "0" CACHE STRING "Résultat de TRY_RUN" FORCE`` : force le résultat de la commande ``TRY_RUN`` à 0 (succès) car les binaires ne peuvent pas s'exécuter sur le système hôte.

source: The toolchain-file is provided to CMake with the ``-DCMAKE_TOOLCHAIN_FILE=path/to/file`` parameter. This will also set the ``CMAKE_CROSSCOMPILING`` variable to ``true`` which can be used by the software being built.
fr: Le fichier de chaîne d'outils est fourni à CMake avec le paramètre ``-DCMAKE_TOOLCHAIN_FILE=path/to/file``. Cela définira également la variable ``CMAKE_CROSSCOMPILING`` sur ``true`` qui peut être utilisée par le logiciel en cours de construction.

source: The ``CMAKE_SYSROOT`` is particularly important for ROS 2 as the packages need many dependencies (e.g. python, openssl, opencv, poco, eigen3, ...). Setting ``CMAKE_SYSROOT`` to a target file-system with all the dependencies installed on it will allow CMake to find them during the cross-compilation.
fr: Le ``CMAKE_SYSROOT`` est particulièrement important pour ROS 2 car les packages ont besoin de nombreuses dépendances (par exemple python, openssl, opencv, poco, eigen3, ...). Définir ``CMAKE_SYSROOT`` sur un système de fichiers cible avec toutes les dépendances installées dessus permettra à CMake de les trouver lors de la compilation croisée.

source: You can find more information on the CMake `documentation <https://cmake.org/cmake/help/latest/manual/cmake-toolchains.7.html>`__ page.
fr: Vous pouvez trouver plus d'informations sur la page CMake `documentation <https://cmake.org/cmake/help/latest/manual/cmake-toolchains.7.html>`__.

source: When downloading the ROS 2 source code, a generic toolchain-file is available in the repository `ros-tooling/cross_compile/cmake-toolchains <https://github.com/ros-tooling/cross_compile>`__ which can be downloaded separately. Further examples on using it can be found on the `Cross-compiling examples for Arm`_ section.
fr: Lors du téléchargement du code source ROS 2, un fichier de chaîne d'outils générique est disponible dans le référentiel `ros-tooling/cross_compile/cmake-toolchains <https://github.com/ros-tooling/cross_compile>`__ qui peut être téléchargé séparément . D'autres exemples d'utilisation peuvent être trouvés dans la section `Exemples de compilation croisée pour Arm`_.

source: Target file-system
fr: Système de fichiers cible

source: As mentioned previously, ROS 2 requires different libraries which needs to be provided to cross-compile.
fr: Comme mentionné précédemment, ROS 2 nécessite différentes bibliothèques qui doivent être fournies pour la compilation croisée.

source: There are a number of ways to obtain the file-system:
fr: Il existe plusieurs façons d'obtenir le système de fichiers :

source: downloading a pre-built image
fr: télécharger une image pré-construite

source: installing the dependencies on the target and exporting the file-system (e.g. with sshfs)
fr: installer les dépendances sur la cible et exporter le système de fichiers (par exemple avec sshfs)

source: using qemu + docker (or chroot) to generate the file-system on the host machine.
fr: en utilisant qemu + docker (ou chroot) pour générer le système de fichiers sur la machine hôte.

source: You can find information on how to use Docker + qemu on the next `Cross-compiling examples for Arm`_ section.
fr: Vous pouvez trouver des informations sur l'utilisation de Docker + qemu dans la prochaine section "Exemples de compilation croisée pour Arm".

source: Build process
fr: Processus de construction

source: The build process is similar to native compilation. The only difference is an extra argument to ``Colcon`` to specify the ``toolchain-file``:
fr: Le processus de construction est similaire à la compilation native. La seule différence est un argument supplémentaire à ``Colcon`` pour spécifier le ``toolchain-file`` :

source: The ``toolchain-file`` provide to CMake the information of the ``cross-compiler`` and the ``target file-system``. ``Colcon`` will call CMake with the given toolchain-file on every package of ROS 2.
fr: Le ``toolchain-file`` fournit à CMake les informations du ``cross-compiler`` et du ``target file-system``. ``Colcon`` appellera CMake avec le fichier de chaîne d'outils donné sur chaque paquet de ROS 2.

source: Cross-compiling examples for Arm
fr: Exemples de compilation croisée pour Arm

source: After :doc:`downloading the ROS 2 source code <../Installation/Alternatives/Ubuntu-Development-Setup>`, you can add cross-compilation assets to the workspace via ``git clone https://github.com/ros-tooling/cross_compile.git -b 0.0.1 src/ros2/cross_compile``. These are working examples on how to cross-compile for Arm cores.
fr: Après :doc:`téléchargement du code source ROS 2 <../Installation/Alternatives/Ubuntu-Development-Setup>`, vous pouvez ajouter des ressources de compilation croisée à l'espace de travail via ``git clone https://github.com/ ros-tooling/cross_compile.git -b 0.0.1 src/ros2/cross_compile``. Ce sont des exemples de travail sur la façon de compiler de manière croisée pour les cœurs Arm.

source: The following targets are supported:
fr: Les cibles suivantes sont prises en charge :

source: Ubuntu-arm64: To be used with any ARMv8-A based system.
fr: Ubuntu-arm64 : à utiliser avec n'importe quel système basé sur ARMv8-A.

source: Ubuntu-armhf: To be used with any modern ARMv7-A based system.
fr: Ubuntu-armhf : à utiliser avec tout système moderne basé sur ARMv7-A.

source: These are the main steps:
fr: Voici les principales étapes :

source: Installing development tools
fr: Installation des outils de développement

source: Downloading ROS 2 source code
fr: Téléchargement du code source ROS 2

source: Downloading the ROS 2 cross-compilation assets
fr: Téléchargement des assets de compilation croisée ROS 2

source: Preparing the sysroot
fr: Préparation de la racine système

source: Cross-compiling the ROS 2 software stack
fr: Compilation croisée de la pile logicielle ROS 2

source: The next sections explains in detail each of these steps. For a quick-setup, have a look at the `Automated Cross-compilation`_.
fr: Les sections suivantes expliquent en détail chacune de ces étapes. Pour une configuration rapide, jetez un œil à la `compilation croisée automatisée`_.

source: These steps were tested on an Ubuntu 18.04 (Bionic)
fr: Ces étapes ont été testées sur un Ubuntu 18.04 (Bionic)

source: 1. Install development tools
fr: 1. Installer les outils de développement

source: This step is similar to when building natively. The difference is that some of the libraries and tools are not required because they will be in the sysroot instead. The following packages are required
fr: Cette étape est similaire à la construction native. La différence est que certaines bibliothèques et certains outils ne sont pas nécessaires car ils se trouveront plutôt dans le sysroot. Les packages suivants sont requis

source: You can install vcstool and colcon-common-extensions via pip. This means you are not required to add extra apt repositories.
fr: Vous pouvez installer vcstool et colcon-common-extensions via pip. Cela signifie que vous n'êtes pas obligé d'ajouter des référentiels apt supplémentaires.

source: Docker is used to build the target environment. Follow the official `documentation <https://docs.docker.com/install/linux/docker-ce/ubuntu/>`__ for the installation.
fr: Docker est utilisé pour créer l'environnement cible. Suivez la `documentation officielle <https://docs.docker.com/install/linux/docker-ce/ubuntu/>`__ pour l'installation.

source: 2. Download ROS 2 source code
fr: 2. Téléchargez le code source de ROS 2

source: Then create a workspace and download the ROS 2 source code:
fr: Créez ensuite un espace de travail et téléchargez le code source de ROS 2 :

source: 3. Prepare the sysroot
fr: 3. Préparez la racine système

source: Build an arm Ubuntu image with all the ROS 2 dependencies using Docker and qemu: Copy the ``qemu-static`` binary to the workspace. It will be used to install the ROS 2 dependencies on the target file-system with docker.
fr: Construisez une image arm Ubuntu avec toutes les dépendances ROS 2 en utilisant Docker et qemu : Copiez le binaire ``qemu-static`` dans l'espace de travail. Il sera utilisé pour installer les dépendances ROS 2 sur le système de fichiers cible avec docker.

source: The standard :doc:`setup <../Installation/Alternatives/Ubuntu-Development-Setup>` process of ROS 2 is run inside an arm docker. This is possible thanks to ``qemu-static``, which will emulate an arm machine. The base image used is an Ubuntu Bionic from Docker Hub.
fr: Le processus standard :doc:`setup <../Installation/Alternatives/Ubuntu-Development-Setup>` de ROS 2 est exécuté dans un docker arm. Ceci est possible grâce à ``qemu-static``, qui émulera une machine à bras. L'image de base utilisée est une Ubuntu Bionic de Docker Hub.

source: Export the resulting container to a tarball and extract it:
fr: Exportez le conteneur résultant dans une archive tar et extrayez-le :

source: This container can be used later as virtual target to run the created file-system and run the demo code.
fr: Ce conteneur peut être utilisé ultérieurement comme cible virtuelle pour exécuter le système de fichiers créé et exécuter le code de démonstration.

source: 4. Build
fr: 4. Construire

source: Set the variables used by the generic toolchain-file
fr: Définir les variables utilisées par le fichier de chaîne d'outils générique

source: The following packages still cause errors during the cross-compilation (under investigation) and must be disabled for now.
fr: Les packages suivants provoquent toujours des erreurs lors de la compilation croisée (en cours d'investigation) et doivent être désactivés pour le moment.

source: The ``Poco`` pre-built has a known issue where it is searching for ``libz`` and ``libpcre`` on the host system instead of SYSROOT. As a workaround for the moment, please link both libraries into the the host's file-system.
fr: Le pré-construit ``Poco`` a un problème connu où il recherche ``libz`` et ``libpcre`` sur le système hôte au lieu de SYSROOT. Comme solution de contournement pour le moment, veuillez lier les deux bibliothèques au système de fichiers de l'hôte.

source: Then, start a build with colcon specifying the toolchain-file:
fr: Ensuite, démarrez une construction avec colcon en spécifiant le fichier de chaîne d'outils :

source: Done! The install and build directories will contain the cross-compiled assets.
fr: Fait! Les répertoires d'installation et de construction contiendront les actifs compilés de manière croisée.

source: Automated Cross-compilation
fr: Compilation croisée automatisée

source: All the steps above are also included into a Dockerfile and can be used for automation/CI.
fr: Toutes les étapes ci-dessus sont également incluses dans un Dockerfile et peuvent être utilisées pour l'automatisation/CI.

source: First, download the dockerfile and build the image:
fr: Tout d'abord, téléchargez le dockerfile et créez l'image :

source: Now run the image with: (it will take a while !)
fr: Maintenant lancez l'image avec : (ça va prendre du temps !)

source: ..note:: The -v /var/run/docker.sock allow us to use Docker inside Docker.
fr: ..note :: Le -v /var/run/docker.sock nous permet d'utiliser Docker dans Docker.

source: The result of the build will be inside the ``ros2_ws`` directory, which can be exported with:
fr: Le résultat de la construction se trouvera dans le répertoire ``ros2_ws``, qui peut être exporté avec :

source: Cross-compiling against a pre-built ROS 2
fr: Compilation croisée avec un ROS 2 pré-construit

source: It is possible to cross-compile your packages against a pre-built ROS 2. The steps are similar to the previous `Cross-compiling examples for Arm`_ section, with the following modifications:
fr: Il est possible de cross-compiler vos packages avec un ROS 2 pré-construit. Les étapes sont similaires à la section précédente `Exemples de compilation croisée pour Arm`_, avec les modifications suivantes :

source: Instead of downloading the ROS 2 stack, just populate your workspace with your package (ros2 examples on this case) and the cross-compilation assets:
fr: Au lieu de télécharger la pile ROS 2, remplissez simplement votre espace de travail avec votre package (exemples ros2 dans ce cas) et les ressources de compilation croisée :

source: Generate and export the file-system as described in `3. Prepare the sysroot`_, but with the provided ``Dockerfile_ubuntu_arm64_prebuilt``. These ``_prebuilt`` Dockerfile will use the :doc:`binary packages <../Installation/Ubuntu-Install-Debians>` to install ROS 2 instead of building from source.
fr: Générez et exportez le système de fichiers comme décrit dans `3. Préparez le sysroot`_, mais avec le ``Dockerfile_ubuntu_arm64_prebuilt`` fourni. Ces Dockerfile ``_prebuilt`` utiliseront les :doc:`packages binaires <../Installation/Ubuntu-Install-Debians>` pour installer ROS 2 au lieu de compiler à partir des sources.

source: Modify the environment variable ``ROS2_INSTALL_PATH`` to point to the installation directory:
fr: Modifiez la variable d'environnement ``ROS2_INSTALL_PATH`` pour qu'elle pointe vers le répertoire d'installation :

source: Source the ``setup.bash`` script on the target file-system:
fr: Sourcez le script ``setup.bash`` sur le système de fichiers cible :

source: Then, start a build with ``Colcon`` specifying the ``toolchain-file``:
fr: Ensuite, démarrez une compilation avec ``Colcon`` en spécifiant le ``toolchain-file`` :

source: Run on the target
fr: Courir sur la cible

source: Copy the file-system on your target or use the previously built docker image:
fr: Copiez le système de fichiers sur votre cible ou utilisez l'image docker précédemment construite :

source: Source the environment:
fr: Source l'environnement :

source: Run some of the C++ or python examples:
fr: Exécutez certains des exemples C++ ou Python :
