Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/How-To-Guides/Developing-a-ROS-2-Package.po
Languages: fr

source: Developing a ROS 2 package
fr: Développement d'un package ROS 2

source: Table of Contents
fr: Table des matières

source: This tutorial will teach you how to create your first ROS 2 application. It is intended for developers who want to learn how to create custom packages in ROS 2, not for people who want to use ROS 2 with its existing packages.
fr: Ce tutoriel vous apprendra comment créer votre première application ROS 2. Il est destiné aux développeurs qui souhaitent apprendre à créer des packages personnalisés dans ROS 2, et non aux personnes souhaitant utiliser ROS 2 avec ses packages existants.

source: Prerequisites
fr: Conditions préalables

source: :doc:`Install ROS <../../Installation>`
fr: :doc:`Installer ROS <../../Installation>`

source: `Install colcon <https://colcon.readthedocs.io/en/released/user/installation.html>`__
fr: `Installer colcon <https://colcon.readthedocs.io/en/released/user/installation.html>`__

source: Setup your workspace by sourcing your ROS 2 installation.
fr: Configurez votre espace de travail en vous procurant votre installation ROS 2.

source: Creating a package
fr: Création d'un paquet

source: All ROS 2 packages begin by running the command
fr: Tous les packages ROS 2 commencent par exécuter la commande

source: in your workspace (usually ``~/ros2_ws/src``).
fr: dans votre espace de travail (généralement ``~/ros2_ws/src``).

source: To create a package for a specific client library:
fr: Pour créer un package pour une bibliothèque cliente spécifique :

source: You can then update the ``package.xml`` with your package info such as dependencies, descriptions, and authorship.
fr: Vous pouvez ensuite mettre à jour le ``package.xml`` avec les informations de votre package telles que les dépendances, les descriptions et la paternité.

source: C++ Packages
fr: Paquets C++

source: You will mostly use the ``add_executable()`` CMake macro along with
fr: Vous utiliserez principalement la macro CMake ``add_executable()`` avec

source: to create executable nodes and link dependencies.
fr: pour créer des nœuds exécutables et des dépendances de liens.

source: To install your launch files and nodes, you can use the ``install()`` macro placed towards the end of the file but before the ``ament_package()`` macro.
fr: Pour installer vos fichiers de lancement et nœuds, vous pouvez utiliser la macro ``install()`` placée vers la fin du fichier mais avant la macro ``ament_package()``.

source: An example for launch files and nodes:
fr: Un exemple pour les fichiers de lancement et les nœuds :

source: Python Packages
fr: Paquets Python

source: ROS 2 follows Python's standard module distribution process that uses ``setuptools``. For Python packages, the ``setup.py`` file complements a C++ package's ``CMakeLists.txt``. More details on distribution can be found in the `official documentation <https://docs.python.org/3/distributing/index.html#distributing-index>`_.
fr: ROS 2 suit le processus de distribution de module standard de Python qui utilise ``setuptools``. Pour les packages Python, le fichier ``setup.py`` complète le ``CMakeLists.txt`` d'un package C++. Plus de détails sur la distribution peuvent être trouvés dans la `documentation officielle <https://docs.python.org/3/distributing/index.html#distributing-index>`_.

source: In your ROS 2 package, you should have a ``setup.cfg`` file which looks like:
fr: Dans votre package ROS 2, vous devriez avoir un fichier ``setup.cfg`` qui ressemble à :

source: and a ``setup.py`` file that looks like:
fr: et un fichier ``setup.py`` qui ressemble à :

source: Combined C++ and Python Packages
fr: Packages combinés C++ et Python

source: When writing a package with both C++ and Python code, the ``setup.py`` file and ``setup.cfg`` file are not used. Instead, use :doc:`ament_cmake_python <./Ament-CMake-Python-Documentation>`.
fr: Lors de l'écriture d'un paquet avec du code C++ et Python, les fichiers ``setup.py`` et ``setup.cfg`` ne sont pas utilisés. À la place, utilisez :doc:`ament_cmake_python <./Ament-CMake-Python-Documentation>`.
