Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/How-To-Guides/Installing-on-Raspberry-Pi.po
Languages: fr

source: ROS 2 on Raspberry Pi
fr: ROS 2 sur Raspberry Pi

source: ROS 2 is supported on both 32 bit (arm32) and 64 bit (arm64) ARM processors. However, you can see `here <https://www.ros.org/reps/rep-2000.html>`__ that arm64 receives Tier 1 support, while arm32 is Tier 3. Tier 1 support means distribution specific packages and binary archives are available, while Tier 3 requires the user to compile ROS 2 from source.
fr: ROS 2 est pris en charge sur les processeurs ARM 32 bits (arm32) et 64 bits (arm64). Cependant, vous pouvez voir `ici <https://www.ros.org/reps/rep-2000.html>`__ qu'arm64 reçoit un support de niveau 1, tandis qu'arm32 est de niveau 3. Le support de niveau 1 signifie des packages et des binaires spécifiques à la distribution des archives sont disponibles, tandis que le niveau 3 oblige l'utilisateur à compiler ROS 2 à partir de la source.

source: The fastest and simplest way to use ROS 2 is to use a Tier 1 supported configuration.
fr: Le moyen le plus rapide et le plus simple d'utiliser ROS 2 consiste à utiliser une configuration prise en charge par le niveau 1.

source: This would mean either installing 64 bit Ubuntu on to the Raspberry Pi, or using the 64 bit version of Raspberry Pi OS and running ROS 2 in Docker.
fr: Cela signifierait soit installer Ubuntu 64 bits sur le Raspberry Pi, soit utiliser la version 64 bits du système d'exploitation Raspberry Pi et exécuter ROS 2 dans Docker.

source: Ubuntu Linux on Raspberry Pi with binary ROS 2 install
fr: Ubuntu Linux sur Raspberry Pi avec installation binaire ROS 2

source: Ubuntu for Raspberry Pi is available `here <https://ubuntu.com/download/raspberry-pi>`__.
fr: Ubuntu pour Raspberry Pi est disponible `ici <https://ubuntu.com/download/raspberry-pi>`__.

source: Make sure to confirm that you have selected the correct version as described in `REP-2000 <https://www.ros.org/reps/rep-2000.html>`__.
fr: Assurez-vous de confirmer que vous avez sélectionné la bonne version, comme décrit dans `REP-2000 <https://www.ros.org/reps/rep-2000.html>`__.

source: You can now install ROS 2 using the normal binary installation instructions for Ubuntu Linux.
fr: Vous pouvez maintenant installer ROS 2 en utilisant les instructions d'installation binaires normales pour Ubuntu Linux.

source: Raspberry Pi OS with ROS 2 in docker
fr: Raspberry Pi OS avec ROS 2 dans le menu fixe

source: Raspberry Pi OS 64 bit version is `available here <https://www.raspberrypi.com/software/operating-systems/>`__.
fr: La version Raspberry Pi OS 64 bits est `disponible ici <https://www.raspberrypi.com/software/operating-systems/>`__.

source: Raspberry Pi OS is based on Debian which receives Tier 3 support, but it can run Ubuntu docker containers for Tier 1 support.
fr: Raspberry Pi OS est basé sur Debian qui reçoit une prise en charge de niveau 3, mais il peut exécuter des conteneurs Docker Ubuntu pour une prise en charge de niveau 1.

source: After flashing the OS, `install Docker <https://docs.docker.com/engine/install/debian/#install-using-the-convenience-script>`__.
fr: Après avoir flashé le système d'exploitation, `installez Docker <https://docs.docker.com/engine/install/debian/#install-using-the-convenience-script>`__.

source: The official OSRF ROS 2 Docker container definitions can be found `here <https://github.com/osrf/docker_images/>`__.
fr: Les définitions officielles du conteneur OSRF ROS 2 Docker peuvent être trouvées `ici <https://github.com/osrf/docker_images/>`__.

source: You may choose from ros-core, ros-base, or ros-desktop. See `here <https://www.ros.org/reps/rep-2001.html>`__ for more information on these variants.
fr: Vous pouvez choisir entre ros-core, ros-base ou ros-desktop. Voir `ici <https://www.ros.org/reps/rep-2001.html>`__ pour plus d'informations sur ces variantes.

source: Clone the `docker_images git repo <https://github.com/osrf/docker_images>`__ onto the Raspberry Pi, change in to the directory linked above, then to the directory with your preferred variant.
fr: Clonez le `docker_images git repo <https://github.com/osrf/docker_images>`__ sur le Raspberry Pi, accédez au répertoire lié ci-dessus, puis au répertoire avec votre variante préférée.

source: Inside of the directory, build the container with:
fr: À l'intérieur du répertoire, créez le conteneur avec :

source: On a supported system it will only take a minute or two to build the docker containers, as the source code is already built in to binaries.
fr: Sur un système pris en charge, la création des conteneurs Docker ne prendra qu'une minute ou deux, car le code source est déjà intégré aux fichiers binaires.

source: Pre-built Docker container
fr: Conteneur Docker pré-construit

source: A pre-built container for the desktop variant is available as well, which only requires a docker pull command.
fr: Un conteneur pré-construit pour la variante de bureau est également disponible, qui ne nécessite qu'une commande docker pull.

source: See :doc:`this page <Run-2-nodes-in-single-or-separate-docker-containers>` for more information.
fr: Voir :doc:`cette page <Run-2-nodes-in-single-or-separate-docker-containers>` pour plus d'informations.
