Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/How-To-Guides/Launching-composable-nodes.po
Languages: fr

source: Using ROS 2 launch to launch composable nodes
fr: Utilisation du lancement de ROS 2 pour lancer des nœuds composables

source: Table of Contents
fr: Table des matières

source: In the :doc:`Composition tutorial <../Tutorials/Intermediate/Composition>`, you learned about composable nodes and how to use them from the command-line. In the :doc:`Launch tutorials <../Tutorials/Intermediate/Launch/Launch-Main>`, you learned about launch files and how to use them to manage multiple nodes.
fr: Dans le :doc:`tutoriel de composition <../Tutorials/Intermediate/Composition>`, vous avez découvert les nœuds composables et comment les utiliser à partir de la ligne de commande. Dans les :doc:`tutoriels de lancement <../Tutorials/Intermediate/Launch/Launch-Main>`, vous avez découvert les fichiers de lancement et comment les utiliser pour gérer plusieurs nœuds.

source: This guide will combine the above two topics and teach you how to write launch files for composable nodes.
fr: Ce guide combinera les deux sujets ci-dessus et vous apprendra à écrire des fichiers de lancement pour les nœuds composables.

source: Setup
fr: Installer

source: See the :doc:`installation instructions <../Installation>` for details on installing ROS 2.
fr: Voir :doc:`instructions d'installation <../Installation>` pour plus de détails sur l'installation de ROS 2.

source: If you've installed ROS 2 from packages, ensure that you have ``ros-rolling-image-tools`` installed. If you downloaded the archive or built ROS 2 from source, it will already be part of the installation.
fr: Si vous avez installé ROS 2 à partir de packages, assurez-vous que ``ros-rolling-image-tools`` est installé. Si vous avez téléchargé l'archive ou construit ROS 2 à partir de la source, cela fera déjà partie de l'installation.

source: Launch file examples
fr: Exemples de fichiers de lancement

source: Below is a launch file that launches composable nodes in Python, XML, and YAML. The launch files all do the following:
fr: Vous trouverez ci-dessous un fichier de lancement qui lance des nœuds composables en Python, XML et YAML. Les fichiers de lancement effectuent tous les opérations suivantes :

source: Instantiate a cam2image composable node with remappings, custom parameters, and extra arguments
fr: Instancier un nœud composable cam2image avec des remappages, des paramètres personnalisés et des arguments supplémentaires

source: Instantiate a showimage composable node with remappings, custom parameters, and extra arguments
fr: Instanciez un nœud composable showimage avec des remappages, des paramètres personnalisés et des arguments supplémentaires

source: Loading composable nodes into an existing container
fr: Charger des nœuds composables dans un conteneur existant

source: Containers can sometimes be launched by other launch files or from a commandline. In that case, you need to add your components to an existing container. For this, you may use ``LoadComposableNodes`` to load components into a given container. The below example launches the same nodes as above.
fr: Les conteneurs peuvent parfois être lancés par d'autres fichiers de lancement ou à partir d'une ligne de commande. Dans ce cas, vous devez ajouter vos composants à un conteneur existant. Pour cela, vous pouvez utiliser ``LoadComposableNodes`` pour charger des composants dans un conteneur donné. L'exemple ci-dessous lance les mêmes nœuds que ci-dessus.

source: Using the Launch files from the command-line
fr: Utilisation des fichiers de lancement à partir de la ligne de commande

source: Any of the launch files above can be run with ``ros2 launch``. Copy the data into a local file, and then run:
fr: N'importe lequel des fichiers de lancement ci-dessus peut être exécuté avec ``ros2 launch``. Copiez les données dans un fichier local, puis exécutez :

source: Intra-process communications
fr: Communications intra-processus

source: All of the above examples use an extra argument to setup intra-process communication between the nodes. For more information on what intra-process communications are, see the :doc:`intra-process comms tutorial <../Tutorials/Demos/Intra-Process-Communication>`.
fr: Tous les exemples ci-dessus utilisent un argument supplémentaire pour configurer la communication intra-processus entre les nœuds. Pour plus d'informations sur les communications intra-processus, consultez le :doc:`tutoriel sur les communications intra-processus <../Tutorials/Demos/Intra-Process-Communication>`.

source: Python, XML, or YAML: Which should I use?
fr: Python, XML ou YAML : lequel dois-je utiliser ?

source: See the discussion in :doc:`Launch-file-different-formats` for more information.
fr: Voir la discussion dans :doc:`Launch-file-different-formats` pour plus d'informations.
