Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/How-To-Guides/Launch-files-migration-guide.po
Languages: fr

source: Migrating launch files from ROS 1 to ROS 2
fr: Migration des fichiers de lancement de ROS 1 vers ROS 2

source: Table of Contents
fr: Table des matières

source: This guide describes how to write XML launch files for an easy migration from ROS 1.
fr: Ce guide décrit comment écrire des fichiers de lancement XML pour une migration facile depuis ROS 1.

source: Background
fr: Fond

source: A description of the ROS 2 launch system and its Python API can be found in :doc:`Launch System tutorial <../Tutorials/Intermediate/Launch/Launch-system>`.
fr: Une description du système de lancement de ROS 2 et de son API Python peut être trouvée dans :doc:`tutoriel du système de lancement <../Tutorials/Intermediate/Launch/Launch-system>`.

source: Migrating tags from ROS 1 to ROS 2
fr: Migrer des tags de ROS 1 vers ROS 2

source: launch
fr: lancement

source: `Available in ROS 1 <https://wiki.ros.org/roslaunch/XML/launch>`__.
fr: `Disponible dans ROS 1 <https://wiki.ros.org/roslaunch/XML/launch>`__.

source: ``launch`` is the root element of any ROS 2 launch XML file.
fr: ``launch`` est l'élément racine de tout fichier XML de lancement de ROS 2.

source: node
fr: nœud

source: `Available in ROS 1 <https://wiki.ros.org/roslaunch/XML/node>`__.
fr: `Disponible dans ROS 1 <https://wiki.ros.org/roslaunch/XML/node>`__.

source: Launches a new node.
fr: Lance un nouveau nœud.

source: Differences from ROS 1:
fr: Différences avec ROS 1 :

source: ``type`` attribute is now ``exec``.
fr: L'attribut ``type`` est maintenant ``exec``.

source: ``ns`` attribute is now ``namespace``.
fr: L'attribut ``ns`` est maintenant ``namespace``.

source: The following attributes aren't available: ``machine``, ``respawn_delay``, ``clear_params``.
fr: Les attributs suivants ne sont pas disponibles : ``machine``, ``respawn_delay``, ``clear_params``.

source: Example
fr: Exemple

source: param
fr: paramètre

source: `Available in ROS 1 <https://wiki.ros.org/roslaunch/XML/param>`__.
fr: `Disponible dans ROS 1 <https://wiki.ros.org/roslaunch/XML/param>`__.

source: Used for passing a parameter to a node.
fr: Utilisé pour passer un paramètre à un nœud.

source: There's no global parameter concept in ROS 2. For that reason, it can only be used nested in a ``node`` tag. Some attributes aren't supported in ROS 2: ``type``, ``textfile``, ``binfile``, ``executable``, ``command``.
fr: Il n'y a pas de concept de paramètre global dans ROS 2. Pour cette raison, il ne peut être utilisé qu'imbriqué dans une balise ``node``. Certains attributs ne sont pas pris en charge dans ROS 2 : ``type``, ``textfile``, ``binfile``, ``executable``, ``command``.

source: Type inference rules
fr: Règles d'inférence de type

source: Here are some examples of how to write parameters:
fr: Voici quelques exemples d'écriture de paramètres :

source: Parameter grouping
fr: Regroupement de paramètres

source: In ROS 2, ``param`` tags are allowed to be nested. For example:
fr: Dans ROS 2, les balises ``param`` peuvent être imbriquées. Par example:

source: That will create two parameters:
fr: Cela créera deux paramètres :

source: A ``group1.group2.my_param`` of value ``1``, hosted by node ``/an_absolute_ns/my_node``.
fr: Un ``group1.group2.my_param`` de valeur ``1``, hébergé par le nœud ``/an_absolute_ns/my_node``.

source: A ``group1.another_param`` of value ``2`` hosted by node ``/an_absolute_ns/my_node``.
fr: Un ``group1.another_param`` de valeur ``2`` hébergé par le nœud ``/an_absolute_ns/my_node``.

source: It's also possible to use full parameter names:
fr: Il est également possible d'utiliser des noms de paramètres complets :

source: rosparam
fr: rosparame

source: `Available in ROS 1 <https://wiki.ros.org/roslaunch/XML/rosparam>`__.
fr: `Disponible dans ROS 1 <https://wiki.ros.org/roslaunch/XML/rosparam>`__.

source: Loads parameters from a yaml file.
fr: Charge les paramètres à partir d'un fichier yaml.

source: It has been replaced with a ``from`` attribute in ``param`` tags.
fr: Il a été remplacé par un attribut ``from`` dans les balises ``param``.

source: remap
fr: remapper

source: `Available in ROS 1 <https://wiki.ros.org/roslaunch/XML/remap>`__.
fr: `Disponible dans ROS 1 <https://wiki.ros.org/roslaunch/XML/remap>`__.

source: Used to pass remapping rules to a node.
fr: Utilisé pour transmettre des règles de remappage à un nœud.

source: It can only be used within ``node`` tags.
fr: Il ne peut être utilisé que dans les balises ``node``.

source: include
fr: comprendre

source: `Available in ROS 1 <https://wiki.ros.org/roslaunch/XML/include>`__.
fr: `Disponible dans ROS 1 <https://wiki.ros.org/roslaunch/XML/include>`__.

source: Allows including another launch file.
fr: Permet d'inclure un autre fichier de lancement.

source: Available in ROS 1, included content was scoped. In ROS 2, it's not. Nest includes in ``group`` tags to scope them.
fr: Disponible dans ROS 1, le contenu inclus a été délimité. Dans ROS 2, ce n'est pas le cas. Nest inclut dans les balises ``group`` pour les définir.

source: ``ns`` attribute is not supported. See example of ``push_ros_namespace`` tag for a workaround.
fr: L'attribut ``ns`` n'est pas pris en charge. Voir l'exemple de balise ``push_ros_namespace`` pour une solution de contournement.

source: ``arg`` tags nested in an ``include`` tag don't support conditionals (``if`` or ``unless``).
fr: Les balises ``arg`` imbriquées dans une balise ``include`` ne prennent pas en charge les conditions (``if`` ou ``unless``).

source: There is no support for nested ``env`` tags. ``set_env`` and ``unset_env`` can be used instead.
fr: Il n'y a pas de support pour les balises ``env`` imbriquées. ``set_env`` et ``unset_env`` peuvent être utilisés à la place.

source: Both ``clear_params`` and ``pass_all_args`` attributes aren't supported.
fr: Les attributs ``clear_params`` et ``pass_all_args`` ne sont pas pris en charge.

source: Examples
fr: Exemples

source: See `Replacing an include tag`_.
fr: Voir `Remplacer une balise include`_.

source: arg
fr: argument

source: `Available in ROS 1 <https://wiki.ros.org/roslaunch/XML/arg>`__.
fr: `Disponible dans ROS 1 <https://wiki.ros.org/roslaunch/XML/arg>`__.

source: ``arg`` is used for declaring a launch argument, or to pass an argument when using ``include`` tags.
fr: ``arg`` est utilisé pour déclarer un argument de lancement, ou pour passer un argument lors de l'utilisation des balises ``include``.

source: ``value`` attribute is not allowed. Use ``let`` tag for this.
fr: L'attribut ``value`` n'est pas autorisé. Utilisez la balise ``let`` pour cela.

source: ``doc`` is now ``description``.
fr: ``doc`` est maintenant ``description``.

source: When nested within an ``include`` tag, ``if`` and ``unless`` attributes aren't allowed.
fr: Lorsqu'ils sont imbriqués dans une balise ``include``, les attributs ``if`` et ``unless`` ne sont pas autorisés.

source: Passing an argument to the launch file
fr: Passer un argument au fichier de lancement

source: In the XML launch file above, the ``topic_name`` defaults to the name ``chatter``, but can be configured on the command-line. Assuming the above launch configuration is in a file named ``mylaunch.xml``, a different topic name can be used by launching it with the following:
fr: Dans le fichier de lancement XML ci-dessus, le ``topic_name`` prend par défaut le nom ``chatter``, mais peut être configuré sur la ligne de commande. En supposant que la configuration de lancement ci-dessus se trouve dans un fichier nommé ``mylaunch.xml``, un nom de sujet différent peut être utilisé en le lançant avec ce qui suit :

source: There is some additional information about passing command-line arguments in :doc:`Using Substitutions <../Tutorials/Intermediate/Launch/Using-Substitutions>`.
fr: Il existe des informations supplémentaires sur la transmission des arguments de ligne de commande dans :doc:`Using Substitutions <../Tutorials/Intermediate/Launch/Using-Substitutions>`.

source: `Available in ROS 1 <https://wiki.ros.org/roslaunch/XML/env>`__.
fr: `Disponible dans ROS 1 <https://wiki.ros.org/roslaunch/XML/env>`__.

source: Sets an environment variable.
fr: Définit une variable d'environnement.

source: It has been replaced with ``env``, ``set_env`` and ``unset_env``:
fr: Il a été remplacé par ``env``, ``set_env`` et ``unset_env`` :

source: ``env`` can only be used nested in a ``node`` or ``executable`` tag. ``if`` and ``unless`` tags aren't supported.
fr: ``env`` ne peut être utilisé qu'imbriqué dans une balise ``node`` ou ``executable``. Les balises ``if`` et ``unless`` ne sont pas prises en charge.

source: ``set_env`` can be nested within the root tag ``launch`` or in ``group`` tags. It accepts the same attributes as ``env``, and also ``if`` and ``unless`` tags.
fr: ``set_env`` peut être imbriqué dans la balise racine ``launch`` ou dans les balises ``group``. Il accepte les mêmes attributs que ``env``, ainsi que les balises ``if`` et ``unless``.

source: ``unset_env`` unsets an environment variable. It accepts a ``name`` attribute and conditionals.
fr: ``unset_env`` supprime une variable d'environnement. Il accepte un attribut ``name`` et des conditions.

source: group
fr: groupe

source: `Available in ROS 1 <https://wiki.ros.org/roslaunch/XML/group>`__.
fr: `Disponible dans ROS 1 <https://wiki.ros.org/roslaunch/XML/group>`__.

source: Allows limiting the scope of launch configurations. Usually used together with ``let``, ``include`` and ``push_ros_namespace`` tags.
fr: Permet de limiter la portée des configurations de lancement. Généralement utilisé avec les balises ``let``, ``include`` et ``push_ros_namespace``.

source: There is no ``ns`` attribute. See the new ``push_ros_namespace`` tag as a workaround.
fr: Il n'y a pas d'attribut ``ns``. Voir la nouvelle balise ``push_ros_namespace`` comme solution de contournement.

source: ``clear_params`` attribute isn't available.
fr: L'attribut ``clear_params`` n'est pas disponible.

source: It doesn't accept ``remap`` nor ``param`` tags as children.
fr: Il n'accepte pas les balises ``remap`` ni ``param`` comme enfants.

source: ``launch-prefix`` configuration affects both ``executable`` and ``node`` tags' actions. This example will use ``time`` as a prefix if ``use_time_prefix_in_talker`` argument is ``1``, only for the talker.
fr: La configuration de ``launch-prefix`` affecte à la fois les actions ``executable`` et ``node`` tags'. Cet exemple utilisera ``time`` comme préfixe si l'argument ``use_time_prefix_in_talker`` est ``1``, uniquement pour le locuteur.

source: It is not supported at the moment.
fr: Il n'est pas pris en charge pour le moment.

source: New tags in ROS 2
fr: Nouvelles balises dans ROS 2

source: set_env and unset_env
fr: set_env et unset_env

source: See `env`_ tag decription.
fr: Voir la description de la balise `env`_.

source: ``include`` and ``group`` tags don't accept an ``ns`` attribute. This action can be used as a workaround:
fr: Les balises ``include`` et ``group`` n'acceptent pas un attribut ``ns``. Cette action peut être utilisée comme solution de contournement :

source: let
fr: laisser

source: It's a replacement of ``arg`` tag with a value attribute.
fr: C'est un remplacement de la balise ``arg`` par un attribut de valeur.

source: executable
fr: exécutable

source: It allows running any executable.
fr: Il permet d'exécuter n'importe quel exécutable.

source: Replacing an include tag
fr: Remplacer une balise include

source: In order to include a launch file under a **namespace** as in ROS 1 then the ``include`` tags must be nested in a ``group`` tag.
fr: Afin d'inclure un fichier de lancement sous un **espace de noms** comme dans ROS 1, les balises ``include`` doivent être imbriquées dans une balise ``group``.

source: Then, instead of using the ``ns`` attribute, add the ``push_ros_namespace`` action tag to specify the namespace:
fr: Ensuite, au lieu d'utiliser l'attribut ``ns``, ajoutez la balise d'action ``push_ros_namespace`` pour spécifier l'espace de noms :

source: Nesting ``include`` tags under a ``group`` tag is only required when specifying a namespace
fr: L'imbrication des balises ``include`` sous une balise ``group`` n'est requise que lors de la spécification d'un espace de noms

source: Substitutions
fr: Remplacements

source: Documentation about ROS 1's substitutions can be found in `roslaunch XML wiki <https://wiki.ros.org/roslaunch/XML>`__. Substitutions syntax hasn't changed, i.e. it still follows the ``$(substitution-name arg1 arg2 ...)`` pattern. There are, however, some changes w.r.t. ROS 1:
fr: La documentation sur les substitutions de ROS 1 peut être trouvée dans `roslaunch XML wiki <https://wiki.ros.org/roslaunch/XML>`__. La syntaxe des substitutions n'a pas changé, c'est-à-dire qu'elle suit toujours le modèle ``$(substitution-name arg1 arg2 ...)``. Il y a cependant quelques changements w.r.t. ROS 1 :

source: ``env`` and ``optenv`` tags have been replaced by the ``env`` tag. ``$(env <NAME>)`` will fail if the environment variable doesn't exist. ``$(env <NAME> '')`` does the same as ROS 1's ``$(optenv <NAME>)``. ``$(env <NAME> <DEFAULT>)`` does the same as ROS 1's ``$(env <NAME> <DEFAULT>)`` or ``$(optenv <NAME> <DEFAULT>)``.
fr: Les balises ``env`` et ``optenv`` ont été remplacées par la balise ``env``. ``$(env <NAME>)`` échouera si la variable d'environnement n'existe pas. ``$(env <NAME> '')`` fait la même chose que ``$(optenv <NAME>)`` de ROS 1. ``$(env <NAME> <DEFAULT>)`` fait la même chose que ``$(env <NAME> <DEFAULT>)`` ou ``$(optenv <NAME> <DEFAULT>)`` de ROS 1.

source: ``find`` has been replaced with ``find-pkg-share`` (substituting the share directory of an installed package). Alternatively ``find-pkg-prefix`` will return the root of an installed package.
fr: ``find`` a été remplacé par ``find-pkg-share`` (remplaçant le répertoire de partage d'un paquet installé). Sinon, ``find-pkg-prefix`` renverra la racine d'un paquet installé.

source: There is a new ``exec-in-pkg`` substitution. e.g.: ``$(exec-in-pkg <package_name> <exec_name>)``.
fr: Il y a une nouvelle substitution ``exec-in-pkg``. par exemple : ``$(exec-in-pkg <package_name> <exec_name>)``.

source: There is a new ``find-exec`` substitution.
fr: Il y a une nouvelle substitution ``find-exec``.

source: ``arg`` has been replaced with ``var``. It looks at configurations defined either with ``arg`` or ``let`` tag.
fr: ``arg`` a été remplacé par ``var``. Il examine les configurations définies avec la balise ``arg`` ou ``let``.

source: ``eval`` and ``dirname`` substitutions haven't changed.
fr: Les substitutions ``eval`` et ``dirname`` n'ont pas changé.

source: ``anon`` substitution is not supported.
fr: La substitution ``anon`` n'est pas prise en charge.

source: The rules that were shown in ``Type inference rules`` subsection of ``param`` tag applies to any attribute. For example:
fr: Les règles affichées dans la sous-section ``Règles d'inférence de type`` de la balise ``param`` s'appliquent à n'importe quel attribut. Par example:

source: Some attributes accept more than a single type, for example ``value`` attribute of ``param`` tag. It's usual that parameters that are of type ``int`` (or ``float``) also accept an ``str``, that will be later substituted and tried to convert to an ``int`` (or ``float``) by the action.
fr: Certains attributs acceptent plusieurs types, par exemple l'attribut ``value`` de la balise ``param``. Il est courant que les paramètres de type ``int`` (ou ``float``) acceptent également une ``str``, qui sera ultérieurement substituée et essayée de se convertir en ``int`` (ou `` float``) par l'action.
