Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/How-To-Guides/Launch-file-different-formats.po
Languages: fr

source: Using Python, XML, and YAML for ROS 2 Launch Files
fr: Utilisation de Python, XML et YAML pour les fichiers de lancement ROS 2

source: Table of Contents
fr: Table des matières

source: ROS 2 launch files can be written in Python, XML, and YAML. This guide shows how to use these different formats to accomplish the same task, as well as has some discussion on when to use each format.
fr: Les fichiers de lancement ROS 2 peuvent être écrits en Python, XML et YAML. Ce guide montre comment utiliser ces différents formats pour accomplir la même tâche, ainsi qu'une discussion sur le moment d'utilisation de chaque format.

source: Launch file examples
fr: Exemples de fichiers de lancement

source: Below is a launch file implemented in Python, XML, and YAML. Each launch file performs the following actions:
fr: Vous trouverez ci-dessous un fichier de lancement implémenté en Python, XML et YAML. Chaque fichier de lancement effectue les actions suivantes :

source: Setup command line arguments with defaults
fr: Configurer les arguments de ligne de commande avec les valeurs par défaut

source: Include another launch file
fr: Inclure un autre fichier de lancement

source: Include another launch file in another namespace
fr: Inclure un autre fichier de lancement dans un autre espace de noms

source: Start a node and setting its namespace
fr: Démarrer un nœud et définir son espace de noms

source: Start a node, setting its namespace, and setting parameters in that node (using the args)
fr: Démarrez un nœud, définissez son espace de noms et définissez les paramètres de ce nœud (à l'aide des arguments)

source: Create a node to remap messages from one topic to another
fr: Créer un nœud pour remapper les messages d'un sujet à un autre

source: Using the Launch files from the command line
fr: Utilisation des fichiers de lancement à partir de la ligne de commande

source: Launching
fr: Lancement

source: Any of the launch files above can be run with ``ros2 launch``. To try them locally, you can either create a new package and use
fr: N'importe lequel des fichiers de lancement ci-dessus peut être exécuté avec ``ros2 launch``. Pour les essayer localement, vous pouvez soit créer un nouveau package et utiliser

source: or run the file directly by specifying the path to the launch file
fr: ou exécutez le fichier directement en spécifiant le chemin vers le fichier de lancement

source: Setting arguments
fr: Définition des arguments

source: To set the arguments that are passed to the launch file, you should use ``key:=value`` syntax. For example, you can set the value of ``background_r`` in the following way:
fr: Pour définir les arguments passés au fichier de lancement, vous devez utiliser la syntaxe ``key:=value``. Par exemple, vous pouvez définir la valeur de ``background_r`` de la manière suivante :

source: or
fr: ou alors

source: Controlling the turtles
fr: Contrôler les tortues

source: To test that the remapping is working, you can control the turtles by running the following command in another terminal:
fr: Pour tester que le remappage fonctionne, vous pouvez contrôler les tortues en exécutant la commande suivante dans un autre terminal :

source: Python, XML, or YAML: Which should I use?
fr: Python, XML ou YAML : lequel dois-je utiliser ?

source: Launch files in ROS 1 were written in XML, so XML may be the most familiar to people coming from ROS 1. To see what's changed, you can visit :doc:`Launch-files-migration-guide`.
fr: Les fichiers de lancement dans ROS 1 ont été écrits en XML, donc XML est peut-être le plus familier aux personnes venant de ROS 1. Pour voir ce qui a changé, vous pouvez visiter :doc:`Launch-files-migration-guide`.

source: For most applications the choice of which ROS 2 launch format comes down to developer preference. However, if your launch file requires flexibility that you cannot achieve with XML or YAML, you can use Python to write your launch file. Using Python for ROS 2 launch is more flexible because of following two reasons:
fr: Pour la plupart des applications, le choix du format de lancement de ROS 2 dépend des préférences du développeur. Toutefois, si votre fichier de lancement nécessite une flexibilité que vous ne pouvez pas obtenir avec XML ou YAML, vous pouvez utiliser Python pour écrire votre fichier de lancement. L'utilisation de Python pour le lancement de ROS 2 est plus flexible pour les deux raisons suivantes :

source: Python is a scripting language, and thus you can leverage the language and its libraries in your launch files.
fr: Python est un langage de script, et vous pouvez donc tirer parti du langage et de ses bibliothèques dans vos fichiers de lancement.

source: `ros2/launch <https://github.com/ros2/launch>`_ (general launch features) and `ros2/launch_ros <https://github.com/ros2/launch_ros>`_ (ROS 2 specific launch features) are written in Python and thus you have lower level access to launch features that may not be exposed by XML and YAML.
fr: `ros2/launch <https://github.com/ros2/launch>`_ (fonctionnalités de lancement générales) et `ros2/launch_ros <https://github.com/ros2/launch_ros>`_ (fonctionnalités de lancement spécifiques à ROS 2 ) sont écrits en Python et vous avez donc un accès de niveau inférieur pour lancer des fonctionnalités qui peuvent ne pas être exposées par XML et YAML.

source: That being said, a launch file written in Python may be more complex and verbose than one in XML or YAML.
fr: Cela étant dit, un fichier de lancement écrit en Python peut être plus complexe et verbeux qu'un fichier en XML ou YAML.
