Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/How-To-Guides/Node-arguments.po
Languages: fr

source: Passing ROS arguments to nodes via the command-line
fr: Passer des arguments ROS aux nœuds via la ligne de commande

source: Table of Contents
fr: Table des matières

source: All ROS nodes take a set of arguments that allow various properties to be reconfigured. Examples include configuring the name/namespace of the node, topic/service names used, and parameters on the node. All ROS-specific arguments have to be specified after a ``--ros-args`` flag:
fr: Tous les nœuds ROS prennent un ensemble d'arguments qui permettent de reconfigurer diverses propriétés. Les exemples incluent la configuration du nom/espace de noms du nœud, les noms de sujet/service utilisés et les paramètres sur le nœud. Tous les arguments spécifiques à ROS doivent être spécifiés après un drapeau ``--ros-args`` :

source: For more details, see `this design doc <https://design.ros2.org/articles/ros_command_line_arguments.html>`__.
fr: Pour plus de détails, voir `ce document de conception <https://design.ros2.org/articles/ros_command_line_arguments.html>`__.

source: Name remapping
fr: Remappage du nom

source: Names within a node (e.g. topics/services) can be remapped using the syntax ``-r <old name>:=<new name>``. The name/namespace of the node itself can be remapped using ``-r __node:=<new node name>`` and ``-r __ns:=<new node namespace>``.
fr: Les noms au sein d'un nœud (par exemple, les sujets/services) peuvent être remappés en utilisant la syntaxe ``-r <ancien nom>:=<nouveau nom>``. Le nom/espace de noms du nœud lui-même peut être remappé en utilisant ``-r __node:=<nouveau nom de nœud>`` et ``-r __ns:=<nouvel espace de noms de nœud>``.

source: Note that these remappings are "static" remappings, in that they apply for the lifetime of the node. "Dynamic" remapping of names after nodes have been started is not yet supported.
fr: Notez que ces remappages sont des remappages "statiques", en ce sens qu'ils s'appliquent pendant toute la durée de vie du nœud. Le remappage "dynamique" des noms après le démarrage des nœuds n'est pas encore pris en charge.

source: See `this design doc <https://design.ros2.org/articles/static_remapping.html>`__ for more details on remapping arguments (not all functionality is available yet).
fr: Voir `cette documentation de conception <https://design.ros2.org/articles/static_remapping.html>`__ pour plus de détails sur les arguments de remappage (toutes les fonctionnalités ne sont pas encore disponibles).

source: Example
fr: Exemple

source: The following invocation will cause the ``talker`` node to be started under the node name ``my_talker``, publishing on the topic named ``my_topic`` instead of the default of ``chatter``. The namespace, which must start with a forward slash, is set to ``/demo``, which means that topics are created in that namespace (``/demo/my_topic``), as opposed to globally (``/my_topic``).
fr: L'invocation suivante entraînera le démarrage du nœud ``talker`` sous le nom de nœud ``my_talker``, en publiant sur le sujet nommé ``my_topic`` au lieu de la valeur par défaut de ``chatter``. L'espace de noms, qui doit commencer par une barre oblique, est défini sur ``/demo``, ce qui signifie que les sujets sont créés dans cet espace de noms (``/demo/my_topic``), par opposition à globalement (``/my_topic ``).

source: Passing remapping arguments to specific nodes
fr: Passer des arguments de remappage à des nœuds spécifiques

source: If multiple nodes are being run within a single process (e.g. using :doc:`Composition <../Concepts/About-Composition>`), remapping arguments can be passed to a specific node using its name as a prefix. For example, the following will pass the remapping arguments to the specified nodes:
fr: Si plusieurs nœuds sont exécutés dans un même processus (par exemple, en utilisant :doc:`Composition <../Concepts/About-Composition>`), les arguments de remappage peuvent être passés à un nœud spécifique en utilisant son nom comme préfixe. Par exemple, ce qui suit transmettra les arguments de remappage aux nœuds spécifiés :

source: The following example will both change the node name and remap a topic (node and namespace changes are always applied *before* topic remapping):
fr: L'exemple suivant modifiera à la fois le nom du nœud et remappera un sujet (les changements de nœud et d'espace de noms sont toujours appliqués *avant* le remappage du sujet) :

source: Logger configuration
fr: Configuration de l'enregistreur

source: See ``--log-level`` argument usage in :doc:`the logging page <../Tutorials/Demos/Logging-and-logger-configuration>`.
fr: Voir l'utilisation de l'argument ``--log-level`` dans :doc:`la page de journalisation <../Tutorials/Demos/Logging-and-logger-configuration>`.

source: Parameters
fr: Paramètres

source: Setting parameters directly from the command line
fr: Réglage des paramètres directement depuis la ligne de commande

source: You can set parameters directly from the command line using the following syntax:
fr: Vous pouvez définir les paramètres directement depuis la ligne de commande en utilisant la syntaxe suivante :

source: As an example, you can run:
fr: Par exemple, vous pouvez exécuter :

source: Other nodes will be able to retrieve the parameter values, e.g.:
fr: D'autres nœuds pourront récupérer les valeurs des paramètres, par exemple :

source: Setting parameters from YAML files
fr: Définition des paramètres à partir de fichiers YAML

source: Parameters can be set from the command-line in the form of yaml files.
fr: Les paramètres peuvent être définis à partir de la ligne de commande sous la forme de fichiers yaml.

source: `See here <https://github.com/ros2/rcl/tree/rolling/rcl_yaml_param_parser>`__ for examples of the yaml file syntax.
fr: `Voir ici <https://github.com/ros2/rcl/tree/rolling/rcl_yaml_param_parser>`__ pour des exemples de la syntaxe du fichier yaml.

source: As an example, save the following as ``demo_params.yaml``:
fr: Par exemple, enregistrez ce qui suit sous ``demo_params.yaml`` :

source: Then either declare the parameters within your node with ``declare_parameter`` or ``declare_parameters`` (see `documentation <https://docs.ros2.org/foxy/api/rclcpp/classrclcpp_1_1Node.html#a095ea977b26e7464d9371efea5f36c42>`__ for function signatures), or `set the node to automatically declare parameters <https://docs.ros2.org/foxy/api/rclcpp/classrclcpp_1_1NodeOptions.html#a094ceb7af7c9b358ec007a4b8e14d40d>`__ if they were passed in via a command line override.
fr: Ensuite, déclarez les paramètres dans votre nœud avec ``declare_parameter`` ou ``declare_parameters`` (voir `documentation <https://docs.ros2.org/foxy/api/rclcpp/classrclcpp_1_1Node.html#a095ea977b26e7464d9371efea5f36c42>`__ pour signatures de fonction), ou `configurer le nœud pour qu'il déclare automatiquement les paramètres <https://docs.ros2.org/foxy/api/rclcpp/classrclcpp_1_1NodeOptions.html#a094ceb7af7c9b358ec007a4b8e14d40d>`__ s'ils ont été transmis via un remplacement de ligne de commande.

source: Then run the following:
fr: Exécutez ensuite ce qui suit :
