Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/How-To-Guides/Overriding-QoS-Policies-For-Recording-And-Playback.po
Languages: fr

source: rosbag2: Overriding QoS Policies
fr: rosbag2 : Remplacement des politiques de QoS

source: **Goal:** Override Ros2Bag QoS profile settings for recording and playback.
fr: **Objectif :** Remplacer les paramètres du profil QoS Ros2Bag pour l'enregistrement et la lecture.

source: Contents
fr: Contenu

source: Background
fr: Fond

source: With the introduction of DDS in ROS 2, Quality of Service (QoS) compatibility for publisher/subscriber nodes needs to be considered when recording and playing back data. More detail on how QoS works can be found :doc:`here <../Concepts/About-Quality-of-Service-Settings>`. For the purposes of this guide, it is sufficient to know that only the reliability and durability policies affect whether publishers/subscribers are compatible and can receive data from one other.
fr: Avec l'introduction de DDS dans ROS 2, la compatibilité de la qualité de service (QoS) pour les nœuds éditeur/abonné doit être prise en compte lors de l'enregistrement et de la lecture des données. Vous trouverez plus de détails sur le fonctionnement de QoS :doc:`ici <../Concepts/About-Quality-of-Service-Settings>`. Pour les besoins de ce guide, il suffit de savoir que seules les politiques de fiabilité et de durabilité déterminent si les éditeurs/abonnés sont compatibles et peuvent recevoir des données les uns des autres.

source: Ros2Bag adapts its requested/offered QoS profile when recording/playing data from a topic to prevent dropped messages. During playback, Ros2bag also attempts to preserve the policy originally offered by the topic. Certain situations may require specifying explicit QoS profile settings so Ros2Bag can record/playback topics. These QoS profile overrides can be specified via the CLI using the ``--qos-profile-overrides-path`` flag.
fr: Ros2Bag adapte son profil de QoS demandé/offert lors de l'enregistrement/de la lecture des données d'un sujet pour éviter les messages perdus. Pendant la lecture, Ros2bag tente également de préserver la politique proposée à l'origine par le sujet. Certaines situations peuvent nécessiter de spécifier des paramètres de profil QoS explicites afin que Ros2Bag puisse enregistrer/lire des sujets. Ces remplacements de profil QoS peuvent être spécifiés via la CLI en utilisant le drapeau ``--qos-profile-overrides-path``.

source: Using QoS Overrides
fr: Utilisation des remplacements de QoS

source: The YAML schema for the profile overrides is a dictionary of topic names with key/value pairs for each QoS policy:
fr: Le schéma YAML pour les remplacements de profil est un dictionnaire de noms de sujets avec des paires clé/valeur pour chaque stratégie QoS :

source: If a policy value is not specified, the value will fallback to the default used by Ros2Bag. If you specify a Duration based policy such as ``deadline`` or ``lifespan``, you will need to specify both seconds and nanoseconds. Policy values are determined by the policy’s short keys which can be found using ``ros2topic`` verbs such as ``ros2 topic pub --help``. All values are replicated below for reference.
fr: Si une valeur de stratégie n'est pas spécifiée, la valeur reviendra à la valeur par défaut utilisée par Ros2Bag. Si vous spécifiez une politique basée sur la durée telle que ``deadline`` ou ``lifespan``, vous devrez spécifier à la fois les secondes et les nanosecondes. Les valeurs de la politique sont déterminées par les raccourcis clavier de la politique qui peuvent être trouvés en utilisant des verbes ``ros2topic`` tels que ``ros2 topic pub --help``. Toutes les valeurs sont répliquées ci-dessous pour référence.

source: Example
fr: Exemple

source: Consider a topic ``/talker`` offering a ``transient_local`` Durability policy. ROS 2 publishers by default request ``volatile`` Durability.
fr: Considérons un sujet ``/talker`` proposant une politique de durabilité ``transient_local``. Les éditeurs ROS 2 demandent par défaut la durabilité ``volatile``.

source: In order for Ros2Bag to record the data, we would want to override the recording policy for that specific topic like so:
fr: Pour que Ros2Bag enregistre les données, nous voudrions remplacer la politique d'enregistrement pour ce sujet spécifique comme ceci :

source: And call it from the CLI:
fr: Et appelez-le depuis la CLI :

source: If we want to playback the bag file but with a different Reliability policy, we can specify one as such;
fr: Si nous voulons lire le fichier bag mais avec une politique de fiabilité différente, nous pouvons en spécifier une en tant que telle ;

source: We can see the results with ``ros2 topic``
fr: Nous pouvons voir les résultats avec ``sujet ros2``
