Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/How-To-Guides/Parameters-YAML-files-migration-guide.po
Languages: fr

source: Migrating YAML parameter files from ROS 1 to ROS 2
fr: Migration des fichiers de paramètres YAML de ROS 1 vers ROS 2

source: This guide describes how to adapt ROS 1 parameters files for ROS 2.
fr: Ce guide décrit comment adapter les fichiers de paramètres ROS 1 pour ROS 2.

source: YAML file example
fr: Exemple de fichier YAML

source: YAML is used to write parameters files in both ROS 1 and ROS 2. The main difference in ROS 2 is that node names must be used to address parameters. In addition to the fully qualified node name, we use the key "ros__parameters" to signal the start of parameters for the node.
fr: YAML est utilisé pour écrire des fichiers de paramètres dans ROS 1 et ROS 2. La principale différence dans ROS 2 est que les noms de nœud doivent être utilisés pour adresser les paramètres. En plus du nom de nœud complet, nous utilisons la clé "ros__parameters" pour signaler le début des paramètres du nœud.

source: For example, here is a parameters file in ROS 1:
fr: Par exemple, voici un fichier de paramètres dans ROS 1 :

source: Let's assume that the first two parameters are for a node named ``/lidar_ns/lidar_node_name``, the next parameter is for a node named ``/imu``, and the last parameter we want to set on both nodes.
fr: Supposons que les deux premiers paramètres sont pour un nœud nommé ``/lidar_ns/lidar_node_name``, le paramètre suivant est pour un nœud nommé ``/imu``, et le dernier paramètre que nous voulons définir sur les deux nœuds.

source: We would construct our ROS 2 parameters file as follows:
fr: Nous construirions notre fichier de paramètres ROS 2 comme suit :

source: Note the use of wildcards (``/**``) to indicate that the parameter ``debug`` should be set on any node in any namespace.
fr: Notez l'utilisation de caractères génériques (``/**``) pour indiquer que le paramètre ``debug`` doit être défini sur n'importe quel nœud dans n'importe quel espace de noms.

source: Feature parity
fr: Parité des fonctionnalités

source: Some features of ROS 1 parameters files do not exist in ROS 2:
fr: Certaines fonctionnalités des fichiers de paramètres ROS 1 n'existent pas dans ROS 2 :

source: Mixed types in a list is not supported yet (`related issue <https://github.com/ros2/rcl/issues/463>`_)
fr: Les types mixtes dans une liste ne sont pas encore pris en charge (`problème connexe <https://github.com/ros2/rcl/issues/463>`_)

source: ``deg`` and ``rad`` substitutions are not supported
fr: Les substitutions ``deg`` et ``rad`` ne sont pas prises en charge
