Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/How-To-Guides/RQt-Source-Install.po
Languages: fr

source: Building RQt from source
fr: Construire RQt à partir de la source

source: We've provided our development setup here to aid future users in easily extending RQt by creating their own plugins. We encourage you to contribute those plugins back to the ``ros-visualization`` GitHub repository!
fr: Nous avons fourni notre configuration de développement ici pour aider les futurs utilisateurs à étendre facilement RQt en créant leurs propres plugins. Nous vous encourageons à remettre ces plugins dans le référentiel GitHub ``ros-visualization`` !

source: System Requirements
fr: Configuration requise

source: These instructions are written for the target platforms for Crystal Clemmys (see `REP <https://www.ros.org/reps/rep-2000.html>`__).
fr: Ces instructions sont écrites pour les plates-formes cibles de Crystal Clemmys (voir `REP <https://www.ros.org/reps/rep-2000.html>`__).

source: Ubuntu Bionic Beaver 18.04 64-bit
fr: Ubuntu Bionic Beaver 18.04 64 bits

source: Mac OSX Sierra 10.12.x
fr: Macos Sierra 10.12.x

source: Windows 10 with Visual Studio 2017
fr: Windows 10 avec Visual Studio 2017

source: Other Requirements
fr: Autres exigences

source: In ROS 2 Crystal the minimum Qt version is ``Qt5``
fr: Dans ROS 2 Crystal, la version minimale de Qt est ``Qt5``

source: Building From Source
fr: Construire à partir de la source

source: In order to build RQt from source, first create a ROS 2 workspace at ``~/ros2_ws/``. This is step is already covered in :doc:`building ROS 2 from source instructions <../Installation>`, so we skip it here.
fr: Afin de construire RQt à partir des sources, créez d'abord un espace de travail ROS 2 à ``~/ros2_ws/``. Cette étape est déjà couverte dans :doc:`construire ROS 2 à partir des instructions source <../Installation>`, nous l'ignorons donc ici.

source: Download RQt Repositories
fr: Télécharger les référentiels RQt

source: As an alternative to the hosted ``.repos`` file you can use ``rosinstall_generator`` to generate a custom one:
fr: Comme alternative au fichier hébergé ``.repos``, vous pouvez utiliser ``rosinstall_generator`` pour en générer un personnalisé :

source: Install Dependencies
fr: Installer les dépendances

source: For non-Linux platforms, see the :doc:`macOS RQt source install page <RQt-Source-Install-MacOS>` or the :doc:`Windows 10 RQt source install page <RQt-Source-Install-Windows10>` before continuing here.
fr: Pour les plates-formes non-Linux, consultez la :doc:`page d'installation de la source macOS RQt <RQt-Source-Install-MacOS>` ou la :doc:`page d'installation de la source Windows 10 RQt <RQt-Source-Install-Windows10>` avant continue ici.

source: Build The Workspace
fr: Construire l'espace de travail

source: Generally building a workspace is as simple as:
fr: Généralement, la construction d'un espace de travail est aussi simple que :

source: For Windows, it is recommended to use the ``--merge-install`` option.
fr: Pour Windows, il est recommandé d'utiliser l'option ``--merge-install``.

source: Advanced Colcon usages:
fr: Utilisations avancées de Colcon :

source: Show verbose output on the console:
fr: Afficher la sortie détaillée sur la console :

source: Only build one package and its dependencies:
fr: Construisez un seul package et ses dépendances :

source: Source your environment
fr: Sourcez votre environnement

source: Linux or macOS
fr: Linux ou macOS

source: Windows
fr: les fenêtres

source: Using RQt
fr: Utilisation de Ryat

source: See :doc:`Overview of RQt <../Concepts/About-RQt>`.
fr: Voir :doc:`Aperçu de RQt <../Concepts/About-RQt>`.
