Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/How-To-Guides/RQt-Source-Install-Windows10.po
Languages: fr

source: Building RQt from source on Windows 10
fr: Construire RQt à partir de la source sur Windows 10

source: This page provides specific information to building RQt from source on Windows. Follow these instructions before proceeding with the :doc:`RQt Source Install <RQt-Source-Install>` page.
fr: Cette page fournit des informations spécifiques à la construction de RQt à partir des sources sous Windows. Suivez ces instructions avant de passer à la page :doc:`RQt Source Install <RQt-Source-Install>`.

source: If you have not done so, follow the :doc:`ROS 2 Windows Development Setup guide <../Installation/Alternatives/Windows-Development-Setup>` before continuing.
fr: Si vous ne l'avez pas encore fait, suivez le :doc:`guide de configuration du développement Windows ROS 2 <../Installation/Alternatives/Windows-Development-Setup>` avant de continuer.

source: System Requirements
fr: Configuration requise

source: Currently Visual Studio 15.8 fails to build ROS 2 (`see issue <https://github.com/osrf/osrf_testing_tools_cpp/issues/15>`__). Older versions of VS can be found `here <https://docs.microsoft.com/en-us/visualstudio/productinfo/installing-an-earlier-release-of-vs2017>`__.
fr: Actuellement, Visual Studio 15.8 ne parvient pas à créer ROS 2 (`voir le problème <https://github.com/osrf/osrf_testing_tools_cpp/issues/15>`__). Les anciennes versions de VS peuvent être trouvées `ici <https://docs.microsoft.com/en-us/visualstudio/productinfo/installing-an-earlier-release-of-vs2017>`__.

source: Dependencies
fr: Dépendances

source: The primary dependencies of the RQt package are sip and PyQt5. PySide2 may be supported in the future. Even though they are provided through PyPI and chocolatey, you must install them by source to get compatible versions.
fr: Les principales dépendances du package RQt sont sip et PyQt5. PySide2 pourrait être pris en charge à l'avenir. Même s'ils sont fournis via PyPI et chocolatey, vous devez les installer par source pour obtenir des versions compatibles.

source: Install sip by source
fr: Installer sip par source

source: Download from https://www.riverbankcomputing.com/software/sip/download
fr: Télécharger depuis https://www.riverbankcomputing.com/software/sip/download

source: Run the x64 Native Tools Command Prompt as Administrator, and ``cd`` to the uncompressed source directory.
fr: Exécutez l'invite de commande x64 Native Tools en tant qu'administrateur et ``cd`` dans le répertoire source non compressé.

source: Run:
fr: Cours:

source: If ``python3`` is installed on your system as ``python``, be sure to use that program name instead.
fr: Si ``python3`` est installé sur votre système en tant que ``python``, assurez-vous d'utiliser ce nom de programme à la place.

source: Install PyQt5 by source
fr: Installer PyQt5 par source

source: Download from https://www.riverbankcomputing.com/software/pyqt/download5
fr: Télécharger depuis https://www.riverbankcomputing.com/software/pyqt/download5

source: Run the x64 Native Tools Command Prompt as Administrator, and ``cd`` to the uncompressed source directory. I ran into trouble with Qt 5.11.3 and PyQt5 compiling QtNfc, but it can be easily disabled.
fr: Exécutez l'invite de commande x64 Native Tools en tant qu'administrateur et ``cd`` dans le répertoire source non compressé. J'ai rencontré des problèmes avec Qt 5.11.3 et PyQt5 compilant QtNfc, mais il peut être facilement désactivé.

source: Test that it works
fr: Testez que cela fonctionne

source: If install occurred without failure, try the commands below. They should run without issue and you should see 4.19.13 as your ``sip.exe`` version.
fr: Si l'installation s'est déroulée sans échec, essayez les commandes ci-dessous. Ils devraient fonctionner sans problème et vous devriez voir 4.19.13 comme votre version ``sip.exe``.

source: Other dependencies
fr: Autres dépendances

source: Install GraphViz from https://graphviz.gitlab.io/_pages/Download/Download_windows.html.
fr: Installez GraphViz à partir de https://graphviz.gitlab.io/_pages/Download/Download_windows.html.

source: Install ``pydot`` and ``pyparsing``:
fr: Installez ``pydot`` et ``pyparsing`` :

source: PyGraphViz is a test dependency of ``qt_dotgraph``, but it is currently unsupported on Windows and building by source is not straight forward. Manually merging this patch is the currently recommended solution (not verified): `pygraphviz patch <https://github.com/Kagami/pygraphviz/commit/fe442dc16accb629c3feaf157af75f67ccabbd6e>`__
fr: PyGraphViz est une dépendance de test de ``qt_dotgraph``, mais il n'est actuellement pas pris en charge sous Windows et la construction par source n'est pas simple. La fusion manuelle de ce correctif est la solution actuellement recommandée (non vérifiée) : `pygraphviz patch <https://github.com/Kagami/pygraphviz/commit/fe442dc16accb629c3feaf157af75f67ccabbd6e>`__

source: Install RQt by source
fr: Installer RQt par source

source: Continue with the :doc:`RQt source install page <RQt-Source-Install>`.
fr: Continuez avec la :doc:`page d'installation des sources RQt <RQt-Source-Install>`.
