Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/How-To-Guides/RQt-Port-Plugin-Windows.po
Languages: fr

source: Porting RQt plugins to Windows
fr: Portage des plugins RQt vers Windows

source: Table of Contents
fr: Table des matières

source: RQt Porting examples
fr: Exemples de portage RQt

source: Here is the ROS 2 port of `qt_gui_core <https://github.com/ros-visualization/qt_gui_core/commit/6fb9624033a849f56d1bc1aad0e40d252bf99c2b>`_.
fr: Voici le port ROS 2 de `qt_gui_core <https://github.com/ros-visualization/qt_gui_core/commit/6fb9624033a849f56d1bc1aad0e40d252bf99c2b>`_.

source: Here is the ROS 2 port of `python_qt_binding <https://github.com/ros-visualization/python_qt_binding/pull/56>`__.
fr: Voici le port ROS 2 de `python_qt_binding <https://github.com/ros-visualization/python_qt_binding/pull/56>`__.

source: Considerations for Windows 10
fr: Considérations pour Windows 10

source: Troubles with TinyXML version 1
fr: Problèmes avec TinyXML version 1

source: I could not successfully use TinyXML. I upgraded to TinyXML-2 where needed. It’s a pretty straight forward change.
fr: Je n'ai pas pu utiliser TinyXML avec succès. J'ai mis à niveau vers TinyXML-2 si nécessaire. C'est un changement assez simple.

source: Checkout `this PR <https://github.com/ros-visualization/qt_gui_core/pull/147>`__ for an example of porting to TinyXML-2.
fr: Consultez `ce PR <https://github.com/ros-visualization/qt_gui_core/pull/147>`__ pour un exemple de portage vers TinyXML-2.

source: Code that uses ``__cplusplus`` and code that requires pluginlib
fr: Code qui utilise ``__cplusplus`` et code qui nécessite pluginlib

source: In some places, notably in the ROS 2 port of pluginlib, there is use of the ``__cplusplus`` flag. Unfortunately on Windows Visual Studio does not set this flag correctly regardless of the C++ standard that is actually being used. See `this page <https://docs.microsoft.com/en-us/cpp/build/reference/zc-cplusplus?view=vs-2017>`__ for more information.
fr: À certains endroits, notamment dans le port ROS 2 de pluginlib, le drapeau ``__cplusplus`` est utilisé. Malheureusement, sous Windows, Visual Studio ne définit pas correctement cet indicateur, quel que soit le standard C++ réellement utilisé. Voir `cette page <https://docs.microsoft.com/en-us/cpp/build/reference/zc-cplusplus?view=vs-2017>`__ pour plus d'informations.

source: To set it, you need to add the compile option ``/Zc:__cplusplus``.
fr: Pour le définir, vous devez ajouter l'option de compilation ``/Zc:__cplusplus``.

source: For example, in CMake you could do something like this:
fr: Par exemple, dans CMake, vous pourriez faire quelque chose comme ceci :

source: Locations of build artifacts (before install)
fr: Emplacements des artefacts de build (avant l'installation)

source: This only came up during when building ``qt_gui_cpp``. In that package, a custom command depends on a target library in another part of the package. However, that library isn’t installed until build is complete. Windows builds in a ${configuration} directory. For example:
fr: Cela n'est apparu que lors de la construction de ``qt_gui_cpp``. Dans ce package, une commande personnalisée dépend d'une bibliothèque cible dans une autre partie du package. Cependant, cette bibliothèque n'est pas installée tant que la construction n'est pas terminée. Windows construit dans un répertoire ${configuration}. Par example:

source: On Linux, ``qt_gui_cpp.a`` would be built in: <ros2_ws>/build/qt_gui_cpp/src/qt_gui_cpp/
fr: Sous Linux, ``qt_gui_cpp.a`` serait intégré : <ros2_ws>/build/qt_gui_cpp/src/qt_gui_cpp/

source: But on Windows ``qt_gui_cpp.lib`` is built in <ros2_ws>/build/qt_gui_cpp/src/qt_gui_cpp/Release
fr: Mais sous Windows ``qt_gui_cpp.lib`` est construit dans <ros2_ws>/build/qt_gui_cpp/src/qt_gui_cpp/Release

source: For compatibility across platforms in this situation, use `CMake generator expressions <https://cmake.org/cmake/help/v3.5/manual/cmake-generator-expressions.7.html>`__. However, when you need a library to link against be sure to use ``$<TARGET_LINKER_FILE:_target>`` instead of ``$<TARGET_FILE:_target>``. The latter will find ``.dll`` files, which cannot be linked against on Windows. See an `example here <https://github.com/ros-visualization/qt_gui_core/pull/162/files>`__.
fr: Pour assurer la compatibilité entre les plates-formes dans cette situation, utilisez `CMake generator expressions <https://cmake.org/cmake/help/v3.5/manual/cmake-generator-expressions.7.html>`__. Cependant, lorsque vous avez besoin d'une bibliothèque à lier, assurez-vous d'utiliser ``$<TARGET_LINKER_FILE:_target>`` au lieu de ``$<TARGET_FILE:_target>``. Ce dernier trouvera les fichiers ``.dll``, qui ne peuvent pas être liés sous Windows. Voir un `exemple ici <https://github.com/ros-visualization/qt_gui_core/pull/162/files>`__.

source: Compiler and linker flags
fr: Drapeaux du compilateur et de l'éditeur de liens

source: In general when porting to Windows, many packages might make use of additional compiler flags. You can find the Windows compiler flags on `Microsoft's documentation <https://docs.microsoft.com/en-us/cpp/build/reference/compiler-options-listed-by-category?view=vs-2017>`__. The C++ compiler is called ``cl.exe``.
fr: En général, lors du portage vers Windows, de nombreux packages peuvent utiliser des indicateurs de compilateur supplémentaires. Vous pouvez trouver les drapeaux du compilateur Windows sur la `documentation de Microsoft <https://docs.microsoft.com/en-us/cpp/build/reference/compiler-options-listed-by-category?view=vs-2017>`__ . Le compilateur C++ s'appelle ``cl.exe``.

source: For linker flags see `Microsoft's documentation <https://docs.microsoft.com/en-us/cpp/build/reference/linker-options?view=vs-2017>`__. The linker program is called ``link.exe``.
fr: Pour les drapeaux de l'éditeur de liens, consultez la `documentation de Microsoft <https://docs.microsoft.com/en-us/cpp/build/reference/linker-options?view=vs-2017>`__. Le programme de liaison s'appelle ``link.exe``.

source: However, CMake actually provides many of these options in variables. This `StackOverflow page <https://stackoverflow.com/questions/9298278/cmake-print-out-all-accessible-variables-in-a-script>`__ contains a good example of how to see all the CMake variables available in a script.
fr: Cependant, CMake fournit en fait bon nombre de ces options dans des variables. Cette `page StackOverflow <https://stackoverflow.com/questions/9298278/cmake-print-out-all-accessible-variables-in-a-script>`__ contient un bon exemple de la façon de voir toutes les variables CMake disponibles dans un scénario.
