Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/How-To-Guides/RQt-Source-Install-MacOS.po
Languages: fr

source: Building RQt from source on macOS
fr: Construire RQt à partir de la source sur macOS

source: This page provides specific information to building RQt from source on macOS. Follow these instructions before proceeding with :doc:`RQt Source Install <RQt-Source-Install>` page.
fr: Cette page fournit des informations spécifiques à la construction de RQt à partir de la source sur macOS. Suivez ces instructions avant de passer à la page :doc:`RQt Source Install <RQt-Source-Install>`.

source: System Requirements
fr: Configuration requise

source: RQt is supported on macOS 10.12, but 10.13 also seems to work.
fr: RQt est pris en charge sur macOS 10.12, mais 10.13 semble également fonctionner.

source: Dependencies
fr: Dépendances

source: The primary dependencies of the RQt package are sip and PyQt5. PySide2 may be supported in the future.
fr: Les principales dépendances du package RQt sont sip et PyQt5. PySide2 pourrait être pris en charge à l'avenir.

source: Install dependencies
fr: Installer les dépendances

source: This is the quickest solution but may cause issues when upgrading Qt or if other packages are expecting Qt 4. Another option is to update your ``PATH`` and ``CMAKE_PREFIX_PATH`` to include the Qt install location:
fr: C'est la solution la plus rapide mais cela peut causer des problèmes lors de la mise à jour de Qt ou si d'autres packages attendent Qt 4. Une autre option consiste à mettre à jour votre ``PATH`` et ``CMAKE_PREFIX_PATH`` pour inclure l'emplacement d'installation de Qt :

source: Install RQt by source
fr: Installer RQt par source

source: Continue with the :doc:`RQt source install page <RQt-Source-Install>`.
fr: Continuez avec la :doc:`page d'installation des sources RQt <RQt-Source-Install>`.
