Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/How-To-Guides/Run-2-nodes-*-single-*-separate-docker-containers.po
Languages: fr

source: Running ROS 2 nodes in Docker [community-contributed]
fr: Exécution de nœuds ROS 2 dans Docker [contribution de la communauté]

source: Run two nodes in a single docker container
fr: Exécutez deux nœuds dans un seul conteneur docker

source: Pull the ROS docker image with tag "rolling-desktop".
fr: Extrayez l'image du docker ROS avec la balise "rolling-desktop".

source: Run the image in a container in interactive mode.
fr: Exécutez l'image dans un conteneur en mode interactif.

source: Your best friend is the ``ros2`` command line help now.
fr: Votre meilleur ami est maintenant l'aide en ligne de commande de ``ros2``.

source: E.g. list all installed packages.
fr: Par exemple. répertorier tous les packages installés.

source: E.g. list all executables:
fr: Par exemple. liste tous les exécutables :

source: Run a minimal example of 2 C++ nodes (1 topic subscriber ``listener``, 1 topic publisher ``talker``) from the package ``demo_nodes_cpp`` in this container:
fr: Exécutez un exemple minimal de 2 nœuds C++ (1 abonné à la rubrique ``listener``, 1 éditeur de rubrique ``talker``) à partir du package ``demo_nodes_cpp`` dans ce conteneur :

source: Run two nodes in two separate docker containers
fr: Exécutez deux nœuds dans deux conteneurs Docker distincts

source: Open a terminal. Run the image in a container in interactive mode and launch a topic publisher (executable ``talker`` from the package ``demo_nodes_cpp``) with ``ros2 run``:
fr: Ouvrez un terminal. Exécutez l'image dans un conteneur en mode interactif et lancez un éditeur de rubrique (exécutable ``talker`` du package ``demo_nodes_cpp``) avec ``ros2 run`` :

source: Open a second terminal. Run the image in a container in interactive mode and launch a topic subscriber (executable ``listener`` from the package ``demo_nodes_cpp``) with ``ros2 run``:
fr: Ouvrez un deuxième terminal. Exécutez l'image dans un conteneur en mode interactif et lancez un abonné au sujet (exécutable ``listener`` du package ``demo_nodes_cpp``) avec ``ros2 run`` :

source: As an alternative to the command line invocation, you can create a ``docker-compose.yml`` file (here version 2) with the following (minimal) content:
fr: Comme alternative à l'appel en ligne de commande, vous pouvez créer un fichier ``docker-compose.yml`` (ici la version 2) avec le contenu (minimal) suivant :

source: To run the containers call ``docker-compose up`` in the same directory. You can close the containers with ``Ctrl+C``.
fr: Pour exécuter les conteneurs, appelez ``docker-compose up`` dans le même répertoire. Vous pouvez fermer les conteneurs avec ``Ctrl+C``.
