Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/How-To-Guides/Sync-Vs-Async.po
Languages: fr

source: Synchronous vs. asynchronous service clients
fr: Clients de service synchrones ou asynchrones

source: **Level:** Intermediate
fr: **Niveau :** Intermédiaire

source: **Time:** 10 minutes
fr: **Durée :** 10 minutes

source: Contents
fr: Contenu

source: This guide is intended to warn users of the risks associated with the Python synchronous service client ``call()`` API. It is very easy to mistakenly cause deadlock when calling services synchronously, so we do not recommend using ``call()``.
fr: Ce guide est destiné à avertir les utilisateurs des risques associés à l'API ``call()`` du client de service synchrone Python. Il est très facile de provoquer par erreur un interblocage lors de l'appel de services de manière synchrone, nous ne recommandons donc pas d'utiliser ``call()``.

source: We provide an example on how to use ``call()`` correctly for experienced users who wish to use synchronous calls and are aware of the pitfalls. We also highlight possible scenarios for deadlock that accompany it.
fr: Nous fournissons un exemple sur la façon d'utiliser correctement ``call()`` pour les utilisateurs expérimentés qui souhaitent utiliser des appels synchrones et sont conscients des pièges. Nous mettons également en évidence les scénarios possibles de blocage qui l'accompagnent.

source: Because we recommend avoiding sync calls, this guide will also address the features and usage of the recommended alternative, async calls (``call_async()``).
fr: Étant donné que nous recommandons d'éviter les appels de synchronisation, ce guide abordera également les fonctionnalités et l'utilisation de l'alternative recommandée, les appels asynchrones (``call_async()``).

source: The C++ service call API is only available in async, so the comparisons and examples in this guide pertain to Python services and clients. The definition of async given here generally applies to C++, with some exceptions.
fr: L'API d'appel de service C++ n'est disponible qu'en mode asynchrone, de sorte que les comparaisons et les exemples de ce guide concernent les services et les clients Python. La définition d'async donnée ici s'applique généralement à C++, à quelques exceptions près.

source: 1 Synchronous calls
fr: 1 Appels synchrones

source: A synchronous client will block the calling thread when sending a request to a service until a response has been received; nothing else can happen on that thread during the call. The call can take arbitrary amounts of time to complete. Once complete, the response returns directly to the client.
fr: Un client synchrone bloquera le thread appelant lors de l'envoi d'une requête à un service jusqu'à ce qu'une réponse ait été reçue ; rien d'autre ne peut se produire sur ce fil pendant l'appel. L'appel peut prendre un temps arbitraire pour se terminer. Une fois terminée, la réponse revient directement au client.

source: The following is an example of how to correctly execute a synchronous service call from a client node, similar to the async node in the :doc:`Simple Service and Client <../Tutorials/Beginner-Client-Libraries/Writing-A-Simple-Py-Publisher-And-Subscriber>` tutorial.
fr: Voici un exemple d'exécution correcte d'un appel de service synchrone à partir d'un nœud client, similaire au nœud asynchrone dans :doc:`Simple Service and Client <../Tutorials/Beginner-Client-Libraries/Writing-A- Tutoriel Simple-Py-Publisher-And-Subscriber>`.

source: Note inside ``main()`` that the client calls ``rclpy.spin`` in a separate thread. Both ``send_request`` and ``rclpy.spin`` are blocking, so they need to be on separate threads.
fr: Notez dans ``main()`` que le client appelle ``rclpy.spin`` dans un thread séparé. ``send_request`` et ``rclpy.spin`` sont bloquants, ils doivent donc être sur des threads séparés.

source: 1.1 Sync deadlock
fr: 1.1 Blocage de synchronisation

source: There are several ways that the synchronous ``call()`` API can cause deadlock.
fr: L'API synchrone ``call()`` peut provoquer un blocage de plusieurs manières.

source: As mentioned in the comments of the example above, failing to create a separate thread to spin ``rclpy`` is one cause of deadlock. When a client is blocking a thread waiting for a response, but the response can only be returned on that same thread, the client will never stop waiting, and nothing else can happen.
fr: Comme mentionné dans les commentaires de l'exemple ci-dessus, ne pas créer un thread séparé pour lancer ``rclpy`` est une cause de blocage. Lorsqu'un client bloque un thread en attente d'une réponse, mais que la réponse ne peut être renvoyée que sur ce même thread, le client n'arrêtera jamais d'attendre et rien d'autre ne peut se produire.

source: Another cause of deadlock is blocking ``rclpy.spin`` by calling a service synchronously in a subscription, timer callback or service callback. For example, if the synchronous client's ``send_request`` is placed in a callback:
fr: Une autre cause de blocage est le blocage de ``rclpy.spin`` en appelant un service de manière synchrone dans un abonnement, un rappel de minuterie ou un rappel de service. Par exemple, si la ``send_request`` du client synchrone est placée dans un rappel :

source: Deadlock occurs because ``rclpy.spin`` will not preempt the callback with the ``send_request`` call. In general, callbacks should only perform light and fast operations.
fr: L'interblocage se produit car ``rclpy.spin`` ne préemptera pas le rappel avec l'appel ``send_request``. En général, les rappels ne doivent effectuer que des opérations légères et rapides.

source: When deadlock occurs, you will not receive any indication that the service is blocked. There will be no warning or exception thrown, no indication in the stack trace, and the call will not fail.
fr: En cas d'interblocage, vous ne recevrez aucune indication indiquant que le service est bloqué. Il n'y aura pas d'avertissement ou d'exception levée, aucune indication dans la trace de la pile et l'appel n'échouera pas.

source: 2 Asynchronous calls
fr: 2 appels asynchrones

source: Async calls in ``rclpy`` are entirely safe and the recommended method of calling services. They can be made from anywhere without running the risk of blocking other ROS and non-ROS processes, unlike sync calls.
fr: Les appels asynchrones dans ``rclpy`` sont entièrement sûrs et constituent la méthode recommandée pour appeler les services. Ils peuvent être effectués depuis n'importe où sans courir le risque de bloquer d'autres processus ROS et non ROS, contrairement aux appels de synchronisation.

source: An asynchronous client will immediately return ``future``, a value that indicates whether the call and response is finished (not the value of the response itself), after sending a request to a service. The returned ``future`` may be queried for a response at any time.
fr: Un client asynchrone retournera immédiatement ``future``, une valeur qui indique si l'appel et la réponse sont terminés (pas la valeur de la réponse elle-même), après avoir envoyé une requête à un service. Le ``futur`` retourné peut être interrogé pour une réponse à tout moment.

source: Since sending a request doesn’t block anything, a loop can be used to both spin ``rclpy`` and check ``future`` in the same thread, for example:
fr: Étant donné que l'envoi d'une requête ne bloque rien, une boucle peut être utilisée à la fois pour faire tourner ``rclpy`` et vérifier ``future`` dans le même thread, par exemple :

source: The :doc:`Simple Service and Client <../Tutorials/Beginner-Client-Libraries/Writing-A-Simple-Py-Publisher-And-Subscriber>` tutorial for Python illustrates how to perform an async service call and retrieve the ``future`` using a loop.
fr: Le didacticiel :doc:`Simple Service and Client <../Tutorials/Beginner-Client-Libraries/Writing-A-Simple-Py-Publisher-And-Subscriber>` pour Python illustre comment effectuer un appel de service asynchrone et récupérer le ``futur`` en utilisant une boucle.

source: The ``future`` can also be retrieved using a timer or callback, like in `this example <https://github.com/ros2/examples/blob/rolling/rclpy/services/minimal_client/examples_rclpy_minimal_client/client_async_callback.py>`_, a dedicated thread, or by another method. It is up to you, as the caller, to decide how to store ``future``, check on its status, and retrieve your response.
fr: Le ``futur`` peut également être récupéré à l'aide d'un minuteur ou d'un rappel, comme dans `cet exemple <https://github.com/ros2/examples/blob/rolling/rclpy/services/minimal_client/examples_rclpy_minimal_client/client_async_callback.py> `_, un thread dédié, ou par une autre méthode. C'est à vous, en tant qu'appelant, de décider comment stocker ``future``, vérifier son statut et récupérer votre réponse.

source: Summary
fr: Résumé

source: It is not recommended to implement a synchronous service client. They are susceptible to deadlock, but will not provide any indication of issue when deadlock occurs. If you must use synchronous calls, the example in section `1 Synchronous calls`_ is a safe method of doing so. You should also be aware of the conditions that cause deadlock outlined in section `1.1 Sync deadlock`_. We recommend using async service clients instead.
fr: Il n'est pas recommandé d'implémenter un client de service synchrone. Ils sont susceptibles de se bloquer, mais ne fourniront aucune indication de problème en cas de blocage. Si vous devez utiliser des appels synchrones, l'exemple de la section `1 Appels synchrones`_ est une méthode sûre pour le faire. Vous devez également être conscient des conditions qui provoquent un blocage décrites dans la section `1.1 Blocage de synchronisation`_. Nous vous recommandons d'utiliser plutôt des clients de service asynchrones.
