Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/How-To-Guides/Topics-Services-Actions.po
Languages: fr

source: Topics vs Services vs Actions
fr: Sujets vs Services vs Actions

source: Contents
fr: Contenu

source: When designing a system there are three primary styles of interfaces. The specifications for the content is in the :doc:`Interfaces Overview <../Concepts/About-ROS-Interfaces>`. This is written to provide the reader with guidelines about when to use each type of interface.
fr: Lors de la conception d'un système, il existe trois principaux styles d'interfaces. Les spécifications du contenu se trouvent dans :doc:`Aperçu des interfaces <../Concepts/About-ROS-Interfaces>`. Ceci est écrit pour fournir au lecteur des directives sur le moment d'utilisation de chaque type d'interface.

source: Topics
fr: Les sujets

source: Should be used for continuous data streams (sensor data, robot state, ...).
fr: Doit être utilisé pour les flux de données continus (données de capteur, état du robot, ...).

source: Are for continuous data flow. Data might be published and subscribed at any time independent of any senders/receivers. Many to many connection. Callbacks receive data once it is available. The publisher decides when data is sent.
fr: Sont pour un flux de données continu. Les données peuvent être publiées et souscrites à tout moment, indépendamment de tout expéditeur/destinataire. Connexion plusieurs à plusieurs. Les rappels reçoivent les données dès qu'elles sont disponibles. L'éditeur décide quand les données sont envoyées.

source: Services
fr: Prestations de service

source: Should be used for remote procedure calls that terminate quickly, e.g. for querying the state of a node or doing a quick calculation such as IK. They should never be used for longer running processes, in particular processes that might be required to preempt if exceptional situations occur and they should never change or depend on state to avoid unwanted side effects for other nodes.
fr: Doit être utilisé pour les appels de procédure à distance qui se terminent rapidement, par ex. pour interroger l'état d'un nœud ou effectuer un calcul rapide tel que IK. Ils ne doivent jamais être utilisés pour des processus d'exécution plus longs, en particulier les processus qui pourraient être nécessaires pour anticiper si des situations exceptionnelles se produisent et ils ne doivent jamais changer ou dépendre de l'état pour éviter des effets secondaires indésirables pour d'autres nœuds.

source: Simple blocking call. Mostly used for comparably fast tasks as requesting specific data. Semantically for processing requests.
fr: Appel bloquant simple. Principalement utilisé pour des tâches relativement rapides comme la demande de données spécifiques. Sémantiquement pour le traitement des requêtes.

source: Should be used for any discrete behavior that moves a robot or that runs for a longer time but provides feedback during execution.
fr: Doit être utilisé pour tout comportement discret qui déplace un robot ou qui s'exécute pendant une durée plus longue mais qui fournit une rétroaction pendant l'exécution.

source: The most important property of actions is that they can be preempted and preemption should always be implemented cleanly by action servers.
fr: La propriété la plus importante des actions est qu'elles peuvent être préemptées et la préemption doit toujours être implémentée proprement par les serveurs d'action.

source: Actions can keep state for the lifetime of a goal, i.e. if executing two action goals in parallel on the same server, for each client a separate state instance can be kept since the goal is uniquely identified by its id.
fr: Les actions peuvent conserver l'état pendant toute la durée de vie d'un objectif, c'est-à-dire que si vous exécutez deux objectifs d'action en parallèle sur le même serveur, pour chaque client, une instance d'état distincte peut être conservée puisque l'objectif est identifié de manière unique par son identifiant.

source: Slow perception routines which take several seconds to terminate or initiating a lower-level control mode are good use cases for actions.
fr: Les routines de perception lente qui prennent plusieurs secondes pour se terminer ou initier un mode de contrôle de niveau inférieur sont de bons cas d'utilisation pour les actions.

source: More complex non-blocking background processing. Used for longer tasks like execution of robot actions. Semantically for real-world actions.
fr: Traitement en arrière-plan non bloquant plus complexe. Utilisé pour des tâches plus longues comme l'exécution d'actions de robot. Sémantiquement pour les actions du monde réel.
