Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/How-To-Guides/Using-Python-Packages.po
Languages: fr

source: Using Python Packages with ROS 2
fr: Utilisation de packages Python avec ROS 2

source: **Goal:** Explain how to interoperate with other Python packages from the ROS2 ecosystem.
fr: **Objectif :** Expliquer comment interagir avec d'autres packages Python de l'écosystème ROS2.

source: Contents
fr: Contenu

source: A cautionary note, if you intended to use pre-packaged binaries (either ``deb`` files, or the “fat” binary distributions), the Python interpreter must match what was used to build the original binaries. If you intend to use something like ``virtualenv`` or ``pipenv``\, make sure to use the system interpreter. If you use something like ``conda``, it is very likely that the interpreter will not match the system interpreter and will be incompatible with ROS2 binaries.
fr: Une mise en garde, si vous avez l'intention d'utiliser des binaires pré-emballés (soit des fichiers ``deb``, soit les distributions binaires "fat"), l'interpréteur Python doit correspondre à ce qui a été utilisé pour construire les binaires d'origine. Si vous avez l'intention d'utiliser quelque chose comme ``virtualenv`` ou ``pipenv``\, assurez-vous d'utiliser l'interpréteur système. Si vous utilisez quelque chose comme ``conda``, il est très probable que l'interpréteur ne correspondra pas à l'interpréteur système et sera incompatible avec les binaires ROS2.

source: Installing via ``rosdep``
fr: Installation via ``rosdep``

source: The fastest way to include third-party python packages is to use their corresponding rosdep keys, if available. ``rosdep`` keys can be checked via:
fr: Le moyen le plus rapide d'inclure des packages python tiers consiste à utiliser leurs clés rosdep correspondantes, si elles sont disponibles. Les clés ``rosdep`` peuvent être vérifiées via :

source: These ``rosdep`` keys can be added to your ``package.xml`` file, which indicates to the build system that your package (and dependent packages) depend on those keys. In a new workspace, you can also quickly install all rosdep keys with:
fr: Ces clés ``rosdep`` peuvent être ajoutées à votre fichier ``package.xml``, ce qui indique au système de construction que votre paquet (et les paquets dépendants) dépendent de ces clés. Dans un nouvel espace de travail, vous pouvez également installer rapidement toutes les clés rosdep avec :

source: If there aren’t currently ``rosdep`` keys for the package that you are interested in, it is possible to add them by following the `rosdep key contribution guide`_.
fr: S'il n'y a pas actuellement de clés ``rosdep`` pour le package qui vous intéresse, il est possible de les ajouter en suivant le `guide de contribution des clés rosdep`_.

source: To learn more about the ``rosdep`` tool and how it works, consult the `rosdep documentation`_.
fr: Pour en savoir plus sur l'outil ``rosdep`` et son fonctionnement, consultez la `documentation rosdep`_.

source: Installing via a package manager
fr: Installation via un gestionnaire de paquets

source: If you don’t want to make a rosdep key, but the package is available in your system package manager (eg ``apt``), you can install and use the package that way:
fr: Si vous ne souhaitez pas créer de clé rosdep, mais que le package est disponible dans votre gestionnaire de packages système (par exemple, ``apt``), vous pouvez installer et utiliser le package de cette manière :

source: If the package is available on `The Python Package Index (PyPI) <https://pypi.org/>`_ and you want to install globally on your system:
fr: Si le package est disponible sur `The Python Package Index (PyPI) <https://pypi.org/>`_ et que vous souhaitez l'installer globalement sur votre système :

source: If the package is available on PyPI and you want to install locally to your user:
fr: Si le package est disponible sur PyPI et que vous souhaitez l'installer localement chez votre utilisateur :

source: Installing via a virtual environment
fr: Installation via un environnement virtuel

source: First, create a Colcon workspace:
fr: Tout d'abord, créez un espace de travail Colcon :

source: Then setup your virtual environment:
fr: Configurez ensuite votre environnement virtuel :

source: Next, install the Python packages that you want in your virtual environment:
fr: Ensuite, installez les packages Python que vous souhaitez dans votre environnement virtuel :

source: Now you can build your workspace and run your python node that depends on packages installed in your virtual environment.
fr: Vous pouvez maintenant créer votre espace de travail et exécuter votre nœud python qui dépend des packages installés dans votre environnement virtuel.

source: If you want release your package on Bloom, you should to add the packages you require to ``rosdep``, see the `rosdep key contribution guide`_.
fr: Si vous souhaitez publier votre package sur Bloom, vous devez ajouter les packages dont vous avez besoin à ``rosdep``, voir le `rosdep key contribution guide`_.
