Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/How-To-Guides/Using-Variants.po
Languages: fr

source: Using variants
fr: Utiliser des variantes

source: Metapackages do not provide software directly but depend on a group of other related packages to provide a convienent installation mechanism for the complete group of packages. [#]_ [#]_ Variants are a list of official metapackages for commonly useful groups of ROS packages.
fr: Les métapaquets ne fournissent pas directement le logiciel mais dépendent d'un groupe d'autres paquets associés pour fournir un mécanisme d'installation pratique pour le groupe complet de paquets. [#]_ [#]_ Les variantes sont une liste de métapaquets officiels pour des groupes de paquets ROS couramment utiles.

source: The different variants in ROS 2 are specified in `REP-2001 <https://ros.org/reps/rep-2001.html>`_.
fr: Les différentes variantes de ROS 2 sont spécifiées dans `REP-2001 <https://ros.org/reps/rep-2001.html>`_.

source: In addition to the official variants, there may be metapackages for specific institutions or robots as described in `REP-108 <https://www.ros.org/reps/rep-0108.html#institution-specific>`_.
fr: En plus des variantes officielles, il peut y avoir des métapaquets pour des institutions ou des robots spécifiques, comme décrit dans `REP-108 <https://www.ros.org/reps/rep-0108.html#institution-specific>`_.

source: Adding variants
fr: Ajouter des variantes

source: Additional variants that are of general use to the ROS community can be proposed by contributing an update to `REP-2001 via pull request <https://github.com/ros-infrastructure/rep/blob/master/rep-2001.rst>`_ describing the packages included in the new variant. Institution and robot specific variants can be published directly by their respective maintainers and no update to REP-2001 is required.
fr: Des variantes supplémentaires d'usage général pour la communauté ROS peuvent être proposées en contribuant à une mise à jour de `REP-2001 via une demande d'extraction <https://github.com/ros-infrastructure/rep/blob/master/rep-2001.rst >`_ décrivant les packages inclus dans la nouvelle variante. Les variantes spécifiques aux institutions et aux robots peuvent être publiées directement par leurs responsables respectifs et aucune mise à jour vers REP-2001 n'est requise.

source: Creating project-specific variants
fr: Création de variantes spécifiques au projet

source: If you are creating ROS packages to use privately in your own projects, you can create variants specific to your projects using the official variants as examples. To do so you need only create two files:
fr: Si vous créez des packages ROS à utiliser en privé dans vos propres projets, vous pouvez créer des variantes spécifiques à vos projets en utilisant les variantes officielles comme exemples. Pour ce faire, il vous suffit de créer deux fichiers :

source: A minimal variant package is created as a package with the ``ament_cmake`` build type, a ``buildtool_depend`` on ``ament_cmake`` and ``exec_depend`` entries for each package you want to include in the variant.
fr: Un package de variante minimal est créé en tant que package avec le type de construction ``ament_cmake``, un ``buildtool_depend`` sur les entrées ``ament_cmake`` et ``exec_depend`` pour chaque package que vous souhaitez inclure dans la variante.

source: A minimal ament_cmake package includes a ``CMakeLists.txt`` which registers the package.xml as an ament package for use in ROS 2.
fr: Un package minimal ament_cmake inclut un ``CMakeLists.txt`` qui enregistre le package.xml en tant que package ament à utiliser dans ROS 2.

source: You can then build and install your variant package alongside your other private packages.
fr: Vous pouvez ensuite créer et installer votre package de variantes avec vos autres packages privés.

source: Creating custom variants with platform-specific tools
fr: Création de variantes personnalisées avec des outils spécifiques à la plateforme

source: Some platforms have tools for creating basic packages that do not require a full ROS build farm environment or equivalent infrastructure. It is possible to use these tools to create platform-dependent variants. This approach does not include support for ROS packaging tools and is platform dependent but requires much less infrastructure to produce if you are creating collections of existing packages rather than a mix of public and private ROS packages. For example, on Debian or Ubuntu systems you can use the ``equivs`` utilities. The Debian Administrator's handbook has a `Section on meta-packages <https://www.debian.org/doc/manuals/debian-handbook/sect.building-first-package.en.html#id-1.18.5.2>`_.
fr: Certaines plates-formes disposent d'outils pour créer des packages de base qui ne nécessitent pas un environnement de batterie de génération ROS complet ou une infrastructure équivalente. Il est possible d'utiliser ces outils pour créer des variantes dépendantes de la plateforme. Cette approche n'inclut pas la prise en charge des outils d'empaquetage ROS et dépend de la plate-forme, mais nécessite beaucoup moins d'infrastructure à produire si vous créez des collections de packages existants plutôt qu'un mélange de packages ROS publics et privés. Par exemple, sur les systèmes Debian ou Ubuntu, vous pouvez utiliser les utilitaires ``equivs``. Le manuel de l'administrateur Debian a une `Section sur les méta-paquets <https://www.debian.org/doc/manuals/debian-handbook/sect.building-first-package.en.html#id-1.18.5.2>` _.
