Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/How-To-Guides/Using-ros1_bridge-Jammy-upstream.po
Languages: fr

source: Using ``ros1_bridge`` with upstream ROS on Ubuntu 22.04
fr: Utilisation de ``ros1_bridge`` avec ROS en amont sur Ubuntu 22.04

source: Table of Contents
fr: Table des matières

source: The release of ROS 2 Humble (and Rolling) on Ubuntu 22.04 Jammy Jellyfish marks the first ROS 2 release on a platform with no official ROS 1 release. While ROS 1 Noetic will continue to be supported through the duration of its `long term support window <https://www.ros.org/reps/rep-0003.html#noetic-ninjemys-may-2020-may-2025>`__, it will only target Ubuntu 20.04. Alternatively, there are `upstream variants of ROS 1 packages <https://packages.ubuntu.com/jammy/ros-desktop>`__ in Debian and Ubuntu that are not maintained as an official distribution by the ROS maintainers.
fr: La sortie de ROS 2 Humble (et Rolling) sur Ubuntu 22.04 Jammy Jellyfish marque la première version de ROS 2 sur une plate-forme sans version officielle de ROS 1. Alors que ROS 1 Noetic continuera d'être pris en charge pendant toute la durée de sa "fenêtre de support à long terme" <https://www.ros.org/reps/rep-0003.html#noetic-ninjemys-may-2020-may-2025> `__, il ne ciblera que Ubuntu 20.04. Alternativement, il existe des `variantes en amont des packages ROS 1 <https://packages.ubuntu.com/jammy/ros-desktop>`__ dans Debian et Ubuntu qui ne sont pas maintenues en tant que distribution officielle par les responsables du ROS.

source: This guide outlines the current mechanism for bridging ROS 2 releases with these upstream packages on Ubuntu 22.04 Jammy Jellyfish. This provides a migration path for users who still depend on ROS 1, but desire moving to newer ROS 2 and Ubuntu releases.
fr: Ce guide décrit le mécanisme actuel de pontage des versions de ROS 2 avec ces packages en amont sur Ubuntu 22.04 Jammy Jellyfish. Cela fournit un chemin de migration pour les utilisateurs qui dépendent toujours de ROS 1, mais qui souhaitent passer aux nouvelles versions de ROS 2 et d'Ubuntu.

source: ROS 2 via Debian packages
fr: ROS 2 via les paquets Debian

source: Installing :doc:`ROS 2 from Debian packages <../Installation/Ubuntu-Install-Debians>` currently does not work for ROS 2 on Ubuntu Jammy. The version of ``catkin-pkg-modules`` available in the Ubuntu repository conflicts with that in the ROS 2 package repository.
fr: L'installation de :doc:`ROS 2 à partir des packages Debian <../Installation/Ubuntu-Install-Debians>` ne fonctionne actuellement pas pour ROS 2 sur Ubuntu Jammy. La version de ``catkin-pkg-modules`` disponible dans le référentiel Ubuntu est en conflit avec celle du référentiel de packages ROS 2.

source: If the ROS 2 apt repository is in the available apt repositories (``/etc/apt/sources.list.d``), no ROS 1 packages will be installable. The error will be:
fr: Si le référentiel apt ROS 2 se trouve dans les référentiels apt disponibles (``/etc/apt/sources.list.d``), aucun package ROS 1 ne pourra être installé. L'erreur sera :

source: To correct this, remove packages.ros.org from your ``sources.list``. If you were following the ROS 2 installation guide, simply remove ``/etc/apt/sources.list.d/ros-2-latest.list``
fr: Pour corriger cela, supprimez packages.ros.org de votre ``sources.list``. Si vous suiviez le guide d'installation de ROS 2, supprimez simplement ``/etc/apt/sources.list.d/ros-2-latest.list``

source: For now, to support ``ros1_bridge``, follow the instructions below for building ROS 2 from source.
fr: Pour l'instant, pour prendre en charge ``ros1_bridge``, suivez les instructions ci-dessous pour construire ROS 2 à partir des sources.

source: ROS 2 from source
fr: ROS 2 depuis la source

source: Installing :doc:`ROS 2 from Source <../Installation/Alternatives/Ubuntu-Development-Setup>` is the only configuration that works for ROS 2 on Ubuntu Jammy.
fr: L'installation de :doc:`ROS 2 à partir de la source <../Installation/Alternatives/Ubuntu-Development-Setup>` est la seule configuration qui fonctionne pour ROS 2 sur Ubuntu Jammy.

source: Below is a summary of the necessary instructions from the source build instructions. The substantial deviation is that we skip using the ROS 2 apt repositories because of conflicting packages.
fr: Vous trouverez ci-dessous un résumé des instructions nécessaires à partir des instructions de construction source. L'écart substantiel est que nous n'utilisons pas les référentiels ROS 2 apt en raison de packages en conflit.

source: Install development tools and ROS tools
fr: Installer les outils de développement et les outils ROS

source: Since we aren't using the ROS 2 apt repositories, ``colcon`` must be installed via ``pip``.
fr: Comme nous n'utilisons pas les dépôts apt de ROS 2, ``colcon`` doit être installé via ``pip``.

source: From here, continue with the :doc:`source install guide <../Installation/Alternatives/Ubuntu-Development-Setup>` to build ROS 2.
fr: À partir de là, continuez avec le :doc:`guide d'installation source <../Installation/Alternatives/Ubuntu-Development-Setup>` pour compiler ROS 2.

source: Install ROS 1 from Ubuntu packages
fr: Installer ROS 1 à partir des packages Ubuntu

source: Build ``ros1_bridge``
fr: Construire ``ros1_bridge``

source: After building all of ``ros1_bridge``, the remainder of the `ros1_bridge examples <https://github.com/ros2/ros1_bridge#example-1-run-the-bridge-and-the-example-talker-and-listener>`__ should work with your new installation
fr: Après avoir construit tout ``ros1_bridge``, le reste des exemples `ros1_bridge <https://github.com/ros2/ros1_bridge#example-1-run-the-bridge-and-the-example-talker-and- listener>`__ devrait fonctionner avec votre nouvelle installation
