Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/How-To-Guides/Visualizing-ROS-2-Data-With-Foxglove-Studio.po
Languages: fr

source: Visualizing ROS 2 data with Foxglove Studio
fr: Visualiser les données ROS 2 avec Foxglove Studio

source: `Foxglove Studio <https://foxglove.dev/studio>`__ is an open source visualization and debugging tool for your robotics data.
fr: `Foxglove Studio <https://foxglove.dev/studio>`__ est un outil de visualisation et de débogage open source pour vos données robotiques.

source: It is available in a variety of ways to make development as convenient as possible – it can be run as a standalone desktop app, accessed via your browser, or even self-hosted on your own domain.
fr: Il est disponible de différentes manières pour rendre le développement aussi pratique que possible - il peut être exécuté comme une application de bureau autonome, accessible via votre navigateur ou même auto-hébergé sur votre propre domaine.

source: View the source code on `GitHub <https://www.github.com/foxglove/studio>`__.
fr: Affichez le code source sur `GitHub <https://www.github.com/foxglove/studio>`__.

source: To use the web app, simply open Google Chrome and navigate to `studio.foxglove.dev <https://studio.foxglove.dev>`__.
fr: Pour utiliser l'application Web, ouvrez simplement Google Chrome et accédez à `studio.foxglove.dev <https://studio.foxglove.dev>`__.

source: To use the desktop app for Linux, macOS, or Windows, download it directly from the `Foxglove Studio website <https://foxglove.dev/download>`__.
fr: Pour utiliser l'application de bureau pour Linux, macOS ou Windows, téléchargez-la directement depuis le `site Web de Foxglove Studio <https://foxglove.dev/download>`__.

source: Connect to a data source
fr: Se connecter à une source de données

source: On opening Foxglove Studio, you will see a dialog with a list of `all possible data sources <https://foxglove.dev/docs/studio/connection/data-sources>`__.
fr: Lors de l'ouverture de Foxglove Studio, vous verrez une boîte de dialogue avec une liste de `toutes les sources de données possibles <https://foxglove.dev/docs/studio/connection/data-sources>`__.

source: To connect to your ROS 2 stack, click "Open connection", select the "Rosbridge (ROS 1 & 2)" tab, and configure your "WebSocket URL".
fr: Pour vous connecter à votre pile ROS 2, cliquez sur "Ouvrir une connexion", sélectionnez l'onglet "Rosbridge (ROS 1 & 2)", et configurez votre "URL WebSocket".

source: You could also drag-and-drop any local ROS 2 ``.db3`` files directly into the application to load them for playback.
fr: Vous pouvez également glisser-déposer n'importe quel fichier local ROS 2 ``.db3`` directement dans l'application pour les charger pour la lecture.

source: In order to `load custom message definitions in your ROS 2 files <https://github.com/ros2/rosbag2/issues/782>`__, try converting them to the `MCAP file format <https://mcap.dev>`__.
fr: Afin de `charger des définitions de messages personnalisés dans vos fichiers ROS 2 <https://github.com/ros2/rosbag2/issues/782>`__, essayez de les convertir au `format de fichier MCAP <https://mcap.dev >`__.

source: Check out the `Foxglove Studio docs <https://foxglove.dev/docs/studio/connection/native>`__ for more detailed instructions.
fr: Consultez la `docs Foxglove Studio <https://foxglove.dev/docs/studio/connection/native>`__ pour des instructions plus détaillées.

source: Building layouts with panels
fr: Plans de construction avec panneaux

source: `Panels <https://foxglove.dev/docs/studio/panels/introduction>`__ are modular visualization interfaces that can be configured and arranged into Studio `layouts <https://foxglove.dev/docs/studio/layouts>`__. You can also save your layouts for future use, for your own personal reference or with your larger robotics team.
fr: Les `Panels <https://foxglove.dev/docs/studio/panels/introduction>`__ sont des interfaces de visualisation modulaires qui peuvent être configurées et organisées dans Studio `layouts <https://foxglove.dev/docs/studio/layouts> `__. Vous pouvez également enregistrer vos mises en page pour une utilisation future, pour votre propre référence personnelle ou avec votre plus grande équipe de robotique.

source: Find the full list of available panels in the sidebar's "Add panel" tab.
fr: Retrouvez la liste complète des panneaux disponibles dans l'onglet "Ajouter un panneau" de la barre latérale.

source: We've highlighted some particularly useful ones below:
fr: Nous en avons souligné quelques-uns particulièrement utiles ci-dessous :

source: 1 3D: Display visualization markers in a 3D scene
fr: 1 3D : Afficher les marqueurs de visualisation dans une scène 3D

source: Publish marker messages to add primitive shapes (arrows, spheres, etc.) and more complex visualizations (occupancy grids, point clouds, etc.) to your 3D panel's scene.
fr: Publiez des messages marqueurs pour ajouter des formes primitives (flèches, sphères, etc.) et des visualisations plus complexes (grilles d'occupation, nuages ​​de points, etc.) à la scène de votre panneau 3D.

source: Choose the topics you want to display via the topic picker on the left, and configure each topic's visualization settings in the "Edit topic settings" menu.
fr: Choisissez les sujets que vous souhaitez afficher via le sélecteur de sujet sur la gauche, et configurez les paramètres de visualisation de chaque sujet dans le menu "Modifier les paramètres du sujet".

source: Foxglove Studio's 3D panel
fr: Panneau 3D de Foxglove Studio

source: Reference the `docs <https://foxglove.dev/docs/studio/panels/3d>`__ for a full list of `supported message types <https://foxglove.dev/docs/studio/panels/3d#supported-messages>`__ and some useful `user interactions <https://foxglove.dev/docs/studio/panels/3d#user-interactions>`__.
fr: Référencez les `docs <https://foxglove.dev/docs/studio/panels/3d>`__ pour une liste complète des `types de messages pris en charge <https://foxglove.dev/docs/studio/panels/3d#supported -messages>`__ et quelques `interactions utilisateur utiles <https://foxglove.dev/docs/studio/panels/3d#user-interactions>`__.

source: 2 Diagnostics: Filter and sort diagnostics messages
fr: 2 Diagnostics : filtrer et trier les messages de diagnostic

source: Display the status of seen nodes (i.e. stale, error, warn, or OK) from topics with a ``diagnostic_msgs/msg/DiagnosticArray`` datatype in a running feed, and display the diagnostics data for a given ``diagnostic_name/hardware_id``.
fr: Afficher l'état des nœuds vus (c'est-à-dire obsolète, erreur, avertissement ou OK) à partir de sujets avec un type de données ``diagnostic_msgs/msg/DiagnosticArray`` dans un flux en cours d'exécution, et afficher les données de diagnostic pour un ``diagnostic_name/hardware_id` donné `.

source: Foxglove Studio's Diagnostics panel
fr: Panneau de diagnostic de Foxglove Studio

source: Reference the `docs <https://foxglove.dev/docs/studio/panels/diagnostics>`__ for more details.
fr: Référez-vous à la `docs <https://foxglove.dev/docs/studio/panels/diagnostics>`__ pour plus de détails.

source: 3 Image: View camera feed images
fr: 3 Image : Afficher les images du flux de la caméra

source: Select a ``sensor_msgs/msg/Image`` or ``sensor_msgs/msg/CompressedImage`` topic to display.
fr: Sélectionnez un sujet ``sensor_msgs/msg/Image`` ou ``sensor_msgs/msg/CompressedImage`` à afficher.

source: Foxglove Studio's Image panel
fr: Panneau Image de Foxglove Studio

source: Reference the `docs <https://foxglove.dev/docs/studio/panels/image>`__ for more details.
fr: Référez-vous à la `docs <https://foxglove.dev/docs/studio/panels/image>`__ pour plus de détails.

source: 4 Log: View log messages
fr: 4 Journal : afficher les messages du journal

source: To view ``rcl_interfaces/msg/Log`` messages live, use the desktop app to `connect <https://foxglove.dev/docs/studio/connection/native>`__ to your running ROS stack. To view ``rcl_interfaces/msg/Log`` messages from a pre-recorded data file, you can drag-and-drop your file into either the `web <https://studio.foxglove.dev>`__ or desktop app.
fr: Pour afficher les messages ``rcl_interfaces/msg/Log`` en direct, utilisez l'application de bureau pour `connecter <https://foxglove.dev/docs/studio/connection/native>`__ à votre pile ROS en cours d'exécution. Pour afficher les messages ``rcl_interfaces/msg/Log`` à partir d'un fichier de données préenregistré, vous pouvez glisser-déposer votre fichier dans l'application `web <https://studio.foxglove.dev>`__ ou de bureau .

source: Next, add a `Log <https://foxglove.dev/docs/studio/panels/log>`__ panel to your layout. If you've connected to your ROS stack correctly, you should now see a list of your log messages, with the ability to filter them by node name or severity level.
fr: Ensuite, ajoutez un panneau `Log <https://foxglove.dev/docs/studio/panels/log>`__ à votre mise en page. Si vous vous êtes correctement connecté à votre pile ROS, vous devriez maintenant voir une liste de vos messages de journal, avec la possibilité de les filtrer par nom de nœud ou niveau de gravité.

source: Reference the `docs <https://foxglove.dev/docs/studio/panels/log>`__ for more details.
fr: Référez-vous à la `docs <https://foxglove.dev/docs/studio/panels/log>`__ pour plus de détails.

source: 5 Plot: Plot arbitrary values over time
fr: 5 Tracé : tracer des valeurs arbitraires dans le temps

source: Plot arbitrary values from your topics' message paths over playback time.
fr: Tracez des valeurs arbitraires à partir des chemins de message de vos sujets sur la durée de lecture.

source: Specify the topic values you want to plot along the y-axis. For the x-axis, choose between plotting the y-axis value's timestamp, element index, or another custom topic message path.
fr: Spécifiez les valeurs de sujet que vous souhaitez tracer le long de l'axe y. Pour l'axe des x, choisissez entre tracer l'horodatage de la valeur de l'axe des y, l'index d'élément ou un autre chemin de message de sujet personnalisé.

source: Foxglove Studio's Plot panel
fr: Panneau de tracé de Foxglove Studio

source: Reference the `docs <https://foxglove.dev/docs/studio/panels/plot>`__ for more details.
fr: Référez-vous à la `docs <https://foxglove.dev/docs/studio/panels/plot>`__ pour plus de détails.

source: 6 Raw Messages: View incoming topic messages
fr: 6 Messages bruts : afficher les messages de sujet entrants

source: Display incoming topic data in an easy-to-read collapsible JSON tree format.
fr: Affichez les données de rubrique entrantes dans un format d'arborescence JSON facile à lire.

source: Foxglove Studio's Raw Messages panel
fr: Panneau Messages bruts de Foxglove Studio

source: Reference the `docs <https://foxglove.dev/docs/studio/panels/raw-messages>`__ for more details.
fr: Référez-vous à la `docs <https://foxglove.dev/docs/studio/panels/raw-messages>`__ pour plus de détails.

source: 7 Teleop: Teleoperate your robot
fr: 7 Teleop : Télé-opérez votre robot

source: Teleoperate your physical robot by publishing ``geometry_msgs/msg/Twist`` messages on a given topic back to your live ROS stack.
fr: Télé-opérez votre robot physique en publiant des messages ``geometry_msgs/msg/Twist`` sur un sujet donné dans votre pile ROS en direct.

source: Foxglove Studio's URDF Viewer panel
fr: Panneau de visualisation URDF de Foxglove Studio

source: Reference the `docs <https://foxglove.dev/docs/studio/panels/teleop>`__ for more details.
fr: Référez-vous à la `docs <https://foxglove.dev/docs/studio/panels/teleop>`__ pour plus de détails.

source: 8 URDF Viewer: View and manipulate your URDF model
fr: 8 URDF Viewer : affichez et manipulez votre modèle URDF

source: To visualize and control your robot model in Foxglove Studio, open the web or desktop application and add a `URDF Viewer <https://foxglove.dev/docs/studio/panels/urdf-viewer>`__ panel to your layout. Then, drag and drop your URDF file into that panel to visualize your robot model.
fr: Pour visualiser et contrôler votre modèle de robot dans Foxglove Studio, ouvrez l'application Web ou de bureau et ajoutez un panneau `URDF Viewer <https://foxglove.dev/docs/studio/panels/urdf-viewer>`__ à votre mise en page. Ensuite, faites glisser et déposez votre fichier URDF dans ce panneau pour visualiser votre modèle de robot.

source: Select any topic publishing a ``JointState`` message to update the visualization based on the published joint states (defaults to ``/joint_states``).
fr: Sélectionnez n'importe quel sujet publiant un message ``JointState`` pour mettre à jour la visualisation en fonction des états conjoints publiés (par défaut, ``/joint_states``).

source: Toggle to "Manual joint control" to set joint positions using the provided controls.
fr: Basculez sur "Contrôle manuel des articulations" pour définir les positions des articulations à l'aide des commandes fournies.

source: Foxglove Studio's URDF Viewer panel with editable joint positions
fr: Panneau de visualisation URDF de Foxglove Studio avec positions d'articulation modifiables

source: Reference the `docs <https://foxglove.dev/docs/studio/panels/urdf-viewer>`__ for more details.
fr: Référez-vous à la `docs <https://foxglove.dev/docs/studio/panels/urdf-viewer>`__ pour plus de détails.

source: Other basic actions
fr: Autres actions de base

source: 1 View your ROS graph
fr: 1 Affichez votre graphique ROS

source: `Using the desktop app <https://foxglove.dev/download>`__, `connect <https://foxglove.dev/docs/studio/connection/native>`__ to your running ROS stack. Next, add a `Topic Graph <https://foxglove.dev/docs/studio/panels/topic-graph>`__ panel to your layout. If you've connected to your ROS stack correctly, you should now see a computational graph of your ROS nodes, topics, and services in that panel. Use the controls on the right side of the panel to select which topics to display or to toggle services.
fr: `À l'aide de l'application de bureau <https://foxglove.dev/download>`__, `connectez <https://foxglove.dev/docs/studio/connection/native>`__ à votre pile ROS en cours d'exécution. Ensuite, ajoutez un panneau `Topic Graph <https://foxglove.dev/docs/studio/panels/topic-graph>`__ à votre mise en page. Si vous vous êtes correctement connecté à votre pile ROS, vous devriez maintenant voir un graphique de calcul de vos nœuds, sujets et services ROS dans ce panneau. Utilisez les commandes sur le côté droit du panneau pour sélectionner les rubriques à afficher ou pour basculer entre les services.

source: 2 View and edit your ROS params
fr: 2 Affichez et modifiez vos paramètres ROS

source: `Using the desktop app <https://foxglove.dev/download>`__, `connect <https://foxglove.dev/docs/studio/connection/native>`__ to your running ROS stack. Next, add a `Parameters <https://foxglove.dev/docs/studio/panels/parameters>`__ panel to your layout. If you've connected to your ROS stack correctly, you should now see a live view of your current ``rosparams``. You can edit these parameter values to publish ``rosparam`` updates back to your ROS stack.
fr: `À l'aide de l'application de bureau <https://foxglove.dev/download>`__, `connectez <https://foxglove.dev/docs/studio/connection/native>`__ à votre pile ROS en cours d'exécution. Ensuite, ajoutez un panneau `Parameters <https://foxglove.dev/docs/studio/panels/parameters>`__ à votre mise en page. Si vous vous êtes correctement connecté à votre pile ROS, vous devriez maintenant voir une vue en direct de vos ``rosparams`` actuels. Vous pouvez modifier ces valeurs de paramètres pour publier les mises à jour de ``rosparam`` dans votre pile ROS.

source: 3 Publish messages back to your live ROS stack
fr: 3 Publiez les messages sur votre pile ROS en direct

source: `Using the desktop app <https://foxglove.dev/download>`__, `connect <https://foxglove.dev/docs/studio/connection/native>`__ to your running ROS stack. Next, add a `Publish <https://foxglove.dev/docs/studio/panels/publish>`__ panel to your layout.
fr: `À l'aide de l'application de bureau <https://foxglove.dev/download>`__, `connectez <https://foxglove.dev/docs/studio/connection/native>`__ à votre pile ROS en cours d'exécution. Ensuite, ajoutez un panneau `Publier <https://foxglove.dev/docs/studio/panels/publish>`__ à votre mise en page.

source: Specify the topic you want to publish on to infer its datatype and populate the text field with a JSON message template.
fr: Spécifiez le sujet sur lequel vous souhaitez publier pour déduire son type de données et remplissez le champ de texte avec un modèle de message JSON.

source: Selecting a datatype in the dropdown of common ROS datatypes will also populate the text field with a JSON message template.
fr: La sélection d'un type de données dans la liste déroulante des types de données ROS courants remplira également le champ de texte avec un modèle de message JSON.

source: Edit the template to customize your message before hitting "Publish".
fr: Modifiez le modèle pour personnaliser votre message avant de cliquer sur "Publier".

source: Foxglove Studio's Publish panel
fr: Panneau de publication de Foxglove Studio
