Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/How-To-Guides/Working-with-multiple-RMW-implementations.po
Languages: fr

source: Working with multiple ROS 2 middleware implementations
fr: Travailler avec plusieurs implémentations de middleware ROS 2

source: Table of Contents
fr: Table des matières

source: This page explains the default RMW implementation and how to specify an alternative.
fr: Cette page explique l'implémentation RMW par défaut et comment spécifier une alternative.

source: Prerequisites
fr: Conditions préalables

source: You should have already read the :doc:`DDS and ROS middleware implementations page <../Concepts/About-Different-Middleware-Vendors>`.
fr: Vous devriez déjà avoir lu la :doc:`page d'implémentation des middlewares DDS et ROS <../Concepts/About-Different-Middleware-Vendors>`.

source: Specifying RMW implementations
fr: Spécification des implémentations RMW

source: To have multiple RMW implementations available for use you must have installed the ROS 2 binaries and any additional dependencies for specific RMW implementations, or built ROS 2 from source with multiple RMW implementations in the workspace (the RMW implementations are included in the build by default if their compile-time dependencies are met). See :doc:`Install DDS implementations <../Installation/DDS-Implementations>`.
fr: Pour avoir plusieurs implémentations RMW disponibles, vous devez avoir installé les binaires ROS 2 et toutes les dépendances supplémentaires pour des implémentations RMW spécifiques, ou construit ROS 2 à partir de la source avec plusieurs implémentations RMW dans l'espace de travail (les implémentations RMW sont incluses dans la construction par défaut si leurs dépendances au moment de la compilation sont satisfaites). Voir :doc:`Installer les implémentations DDS <../Installation/DDS-Implementations>`.

source: Both C++ and Python nodes support an environment variable ``RMW_IMPLEMENTATION`` that allows the user to select the RMW implementation to use when running ROS 2 applications.
fr: Les nœuds C++ et Python prennent en charge une variable d'environnement ``RMW_IMPLEMENTATION`` qui permet à l'utilisateur de sélectionner l'implémentation RMW à utiliser lors de l'exécution d'applications ROS 2.

source: The user may set this variable to a specific implementation identifier, such as ``rmw_cyclonedds_cpp``, ``rmw_fastrtps_cpp``, ``rmw_connextdds``, or ``rmw_gurumdds_cpp``.
fr: L'utilisateur peut définir cette variable sur un identifiant d'implémentation spécifique, tel que ``rmw_cyclonedds_cpp``, ``rmw_fastrtps_cpp``, ``rmw_connextdds`` ou ``rmw_gurumdds_cpp``.

source: For example, to run the talker demo using the C++ talker and Python listener with the Connext RMW implementation:
fr: Par exemple, pour exécuter la démo de talker à l'aide du talker C++ et de l'écouteur Python avec l'implémentation Connext RMW :

source: Windows
fr: les fenêtres

source: Adding RMW implementations to your workspace
fr: Ajouter des implémentations RMW à votre espace de travail

source: Suppose that you have built your ROS 2 workspace with only Fast DDS installed and therefore only the Fast DDS RMW implementation built. The last time your workspace was built, any other RMW implementation packages, ``rmw_connextdds`` for example, were probably unable to find installations of the relevant DDS implementations. If you then install an additional DDS implementation, Connext for example, you will need to re-trigger the check for a Connext installation that occurs when the Connext RMW implementation is being built. You can do this by specifying the ``--cmake-force-configure`` flag on your next workspace build, and you should see that the RMW implementation package then gets built for the newly installed DDS implementation.
fr: Supposons que vous ayez construit votre espace de travail ROS 2 avec uniquement Fast DDS installé et donc uniquement l'implémentation Fast DDS RMW construite. La dernière fois que votre espace de travail a été construit, tout autre package d'implémentation RMW, ``rmw_connextdds`` par exemple, était probablement incapable de trouver des installations des implémentations DDS pertinentes. Si vous installez ensuite une implémentation DDS supplémentaire, Connext par exemple, vous devrez relancer la vérification d'une installation Connext qui se produit lors de la construction de l'implémentation Connext RMW. Vous pouvez le faire en spécifiant le drapeau ``--cmake-force-configure`` lors de la prochaine construction de votre espace de travail, et vous devriez voir que le package d'implémentation RMW est alors construit pour l'implémentation DDS nouvellement installée.

source: It is possible to run into a problem when "rebuilding" the workspace with an additional RMW implementation using the ``--cmake-force-configure`` option where the build complains about the default RMW implementation changing. To resolve this, you can either set the default implementation to what is was before with the ``RMW_IMPLEMENTATION`` CMake argument or you can delete the build folder for packages that complain and continue the build with ``--start-with <package name>``.
fr: Il est possible de rencontrer un problème lors de la "reconstruction" de l'espace de travail avec une implémentation RMW supplémentaire à l'aide de l'option ``--cmake-force-configure`` où la construction se plaint du changement de l'implémentation RMW par défaut. Pour résoudre ce problème, vous pouvez soit définir l'implémentation par défaut sur ce qui était avant avec l'argument ``RMW_IMPLEMENTATION`` CMake ou vous pouvez supprimer le dossier de construction pour les packages qui se plaignent et continuer la construction avec ``--start-with <package nom>``.

source: Troubleshooting
fr: Dépannage

source: Checking the Current RMW
fr: Vérification de la RMW actuelle

source: To check the RMW that is currently in use you simply check the ``RMW_IMPLEMENTATION`` environment variable. On Linux systems ``printenv`` prints the full list of environment variables. Other operating systems will have other procedures for viewing environment variables. If ``RMW_IMPLEMENTATION`` is not in the environment it is safe to assume you are using the default for your ROS distro, otherwise the current RMW is the value listed. The default RMW for each ROS Distro can be found in `REP-2000 <https://www.ros.org/reps/rep-2000.html#platforms-by-distribution>`_.
fr: Pour vérifier le RMW actuellement utilisé, il vous suffit de vérifier la variable d'environnement ``RMW_IMPLEMENTATION``. Sur les systèmes Linux, ``printenv`` imprime la liste complète des variables d'environnement. D'autres systèmes d'exploitation auront d'autres procédures pour afficher les variables d'environnement. Si ``RMW_IMPLEMENTATION`` n'est pas dans l'environnement, il est prudent de supposer que vous utilisez la valeur par défaut pour votre distribution ROS, sinon le RMW actuel est la valeur indiquée. Le RMW par défaut pour chaque distribution ROS se trouve dans `REP-2000 <https://www.ros.org/reps/rep-2000.html#platforms-by-distribution>`_.

source: Ensuring use of a particular RMW implementation
fr: Garantir l'utilisation d'une implémentation RMW particulière

source: If the ``RMW_IMPLEMENTATION`` environment variable is set to an RMW implementation for which support is not installed, you will see an error message similar to the following if you have only one implementation installed:
fr: Si la variable d'environnement ``RMW_IMPLEMENTATION`` est définie sur une implémentation RMW pour laquelle le support n'est pas installé, vous verrez un message d'erreur semblable au suivant si vous n'avez installé qu'une seule implémentation :

source: If you have support for multiple RMW implementations installed and you request use of one that is not installed, you will see something similar to:
fr: Si plusieurs implémentations RMW sont prises en charge et que vous demandez l'utilisation d'une qui n'est pas installée, vous verrez quelque chose de similaire à :

source: If this occurs, double check that your ROS 2 installation includes support for the RMW implementation that you have specified in the ``RMW_IMPLEMENTATION`` environment variable.
fr: Si cela se produit, vérifiez que votre installation ROS 2 inclut la prise en charge de l'implémentation RMW que vous avez spécifiée dans la variable d'environnement ``RMW_IMPLEMENTATION``.

source: If you want to switch between RMW implementations, verify that the ROS 2 daemon process is not running with the previous RMW implementation to avoid any issues between nodes and command line tools such as ``ros2 node``. For example, if you run:
fr: Si vous souhaitez basculer entre les implémentations RMW, vérifiez que le processus démon ROS 2 n'est pas en cours d'exécution avec l'implémentation RMW précédente pour éviter tout problème entre les nœuds et les outils de ligne de commande tels que ``ros2 node``. Par exemple, si vous exécutez :

source: and
fr: et

source: it will generate a daemon with a Fast DDS implementation:
fr: il générera un démon avec une implémentation Fast DDS :

source: Even if you run the command line tool again with the correct RMW implementation, the daemon's RMW implementation will not change and the ROS 2 command line tools will fail.
fr: Même si vous exécutez à nouveau l'outil de ligne de commande avec l'implémentation RMW correcte, l'implémentation RMW du démon ne changera pas et les outils de ligne de commande ROS 2 échoueront.

source: To solve this, simply stop the daemon process:
fr: Pour résoudre ce problème, arrêtez simplement le processus démon :

source: and rerun the ROS 2 command line tool with the correct RMW implementation.
fr: et réexécutez l'outil de ligne de commande ROS 2 avec l'implémentation RMW correcte.

source: RTI Connext on OSX: Failure due to insufficient shared memory kernel settings
fr: RTI Connext sur OSX : Échec dû à des paramètres de noyau de mémoire partagée insuffisants

source: If you receive an error message similar to below when running RTI Connext on OSX:
fr: Si vous recevez un message d'erreur similaire à celui ci-dessous lors de l'exécution de RTI Connext sur OSX :

source: This error is caused by an insufficient number or size of shared memory segments allowed by the operating system. As a result, the ``DomainParticipant`` is unable to allocate enough resources and calculate its participant index which causes the error.
fr: Cette erreur est causée par un nombre ou une taille insuffisants de segments de mémoire partagée autorisés par le système d'exploitation. Par conséquent, le ``DomainParticipant`` est incapable d'allouer suffisamment de ressources et de calculer son index de participant, ce qui provoque l'erreur.

source: You can increase the shared memory resources of your machine either temporarily or permanently.
fr: Vous pouvez augmenter les ressources de mémoire partagée de votre machine de manière temporaire ou permanente.

source: To increase the settings temporarily, you can run the following commands as user root:
fr: Pour augmenter temporairement les paramètres, vous pouvez exécuter les commandes suivantes en tant qu'utilisateur root :

source: To increase the settings permanently, you will need to edit or create the file ``/etc/sysctl.conf``. Creating or editing this file will require root permissions. Either add to your existing ``etc/sysctl.conf`` file or create ``/etc/sysctl.conf`` with the following lines:
fr: Pour augmenter les paramètres de façon permanente, vous devrez éditer ou créer le fichier ``/etc/sysctl.conf``. La création ou la modification de ce fichier nécessitera des autorisations root. Ajoutez à votre fichier ``etc/sysctl.conf`` existant ou créez ``/etc/sysctl.conf`` avec les lignes suivantes :

source: You will need to reboot the machine after modifying this file to have the changes take effect.
fr: Vous devrez redémarrer la machine après avoir modifié ce fichier pour que les modifications prennent effet.

source: This solution is edited from the RTI Connext community forum. See the `original post <https://community.rti.com/kb/osx510>`__ for more detailed explanation.
fr: Cette solution est éditée depuis le forum de la communauté RTI Connext. Voir le `message d'origine <https://community.rti.com/kb/osx510>`__ pour une explication plus détaillée.
