Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Tutorials/Intermediate/URDF/Adding-Physical-and-Collision-Properties-to-a-URDF-Model.po
Languages: fr

source: Adding physical and collision properties
fr: Ajout de propriétés physiques et de collision

source: **Goal:** Learn how to add collision and inertial properties to links, and how to add joint dynamics to joints.
fr: **Objectif :** Découvrez comment ajouter des propriétés de collision et d'inertie aux liens, et comment ajouter une dynamique d'articulation aux articulations.

source: **Tutorial level:** Intermediate
fr: **Niveau du didacticiel :** Intermédiaire

source: **Time:** 10 minutes
fr: **Durée :** 10 minutes

source: Contents
fr: Contenu

source: In this tutorial, we’ll look at how to add some basic physical properties to your URDF model and how to specify its collision properties.
fr: Dans ce didacticiel, nous verrons comment ajouter des propriétés physiques de base à votre modèle URDF et comment spécifier ses propriétés de collision.

source: So far, we’ve only specified our links with a single sub-element, ``visual``, which defines (not surprisingly) what the robot looks like. However, in order to get collision detection to work or to simulate the robot, we need to define a ``collision`` element as well. `Here is the new urdf <https://raw.githubusercontent.com/ros/urdf_tutorial/master/urdf/07-physics.urdf>`_ with collision and physical properties.
fr: Jusqu'à présent, nous n'avons spécifié nos liens qu'avec un seul sous-élément, ``visual``, qui définit (sans surprise) à quoi ressemble le robot. Cependant, pour que la détection de collision fonctionne ou pour simuler le robot, nous devons également définir un élément ``collision``. `Voici le nouvel urdf <https://raw.githubusercontent.com/ros/urdf_tutorial/master/urdf/07-physics.urdf>`_ avec collision et propriétés physiques.

source: Here is the code for our new base link.
fr: Voici le code de notre nouveau lien de base.

source: The collision element is a direct subelement of the link object, at the same level as the visual tag.
fr: L'élément collision est un sous-élément direct de l'objet lien, au même niveau que la balise visuelle.

source: The collision element defines its shape the same way the visual element does, with a geometry tag. The format for the geometry tag is exactly the same here as with the visual.
fr: L'élément de collision définit sa forme de la même manière que l'élément visuel, avec une balise geometry. Le format de la balise geometry est exactement le même ici que pour le visuel.

source: You can also specify an origin in the same way as a subelement of the collision tag (as with the visual).
fr: Vous pouvez également spécifier une origine de la même manière qu'un sous-élément de la balise de collision (comme pour le visuel).

source: In many cases, you’ll want the collision geometry and origin to be exactly the same as the visual geometry and origin. However, there are two main cases where you wouldn’t:
fr: Dans de nombreux cas, vous souhaiterez que la géométrie et l'origine de la collision soient exactement les mêmes que la géométrie et l'origine visuelles. Cependant, il existe deux cas principaux où vous ne le feriez pas :

source: **Quicker Processing**. Doing collision detection for two meshes is a lot more computational complex than for two simple geometries. Hence, you may want to replace the meshes with simpler geometries in the collision element.
fr: **Traitement plus rapide**. La détection de collision pour deux maillages est beaucoup plus complexe en termes de calcul que pour deux géométries simples. Par conséquent, vous pouvez remplacer les maillages par des géométries plus simples dans l'élément de collision.

source: **Safe Zones**. You may want to restrict movement close to sensitive equipment. For instance, if we didn’t want anything to collide with R2D2’s head, we might define the collision geometry to be a cylinder encasing his head to prevent anything from getting too close to his head.
fr: **Zones de sécurité**. Vous voudrez peut-être restreindre les mouvements à proximité d'équipements sensibles. Par exemple, si nous ne voulions pas que quoi que ce soit entre en collision avec la tête de R2D2, nous pourrions définir la géométrie de collision comme étant un cylindre enveloppant sa tête pour empêcher quoi que ce soit de s'approcher trop près de sa tête.

source: Physical Properties
fr: Propriétés physiques

source: In order to get your model to simulate properly, you need to define several physical properties of your robot, i.e. the properties that a physics engine like Gazebo would need.
fr: Pour que votre modèle simule correctement, vous devez définir plusieurs propriétés physiques de votre robot, c'est-à-dire les propriétés dont un moteur physique comme Gazebo aurait besoin.

source: Inertia
fr: Inertie

source: Every link element being simulated needs an inertial tag. Here is a simple one.
fr: Chaque élément de lien simulé a besoin d'une balise inertielle. En voici une simple.

source: This element is also a subelement of the link object.
fr: Cet élément est également un sous-élément de l'objet lien.

source: The mass is defined in kilograms.
fr: La masse est définie en kilogrammes.

source: The 3x3 rotational inertia matrix is specified with the inertia element. Since this is symmetrical, it can be represented by only 6 elements, as such.
fr: La matrice d'inertie de rotation 3x3 est spécifiée avec l'élément d'inertie. Puisqu'il est symétrique, il ne peut être représenté que par 6 éléments, en tant que tel.

source: **ixx**
fr: **xx**

source: **iyy**
fr: **aaa**

source: **iyz**
fr: **aaaa**

source: This information can be provided to you by modeling programs such as MeshLab. The inertia of geometric primitives (cylinder, box, sphere) can be computed using Wikipedia's `list of moment of inertia tensors <https://en.wikipedia.org/wiki/List_of_moments_of_inertia#List_of_3D_inertia_tensors>`_ (and is used in the above example).
fr: Ces informations peuvent vous être fournies par des programmes de modélisation tels que MeshLab. L'inertie des primitives géométriques (cylindre, boîte, sphère) peut être calculée à l'aide de la `liste des tenseurs de moment d'inertie de Wikipedia <https://en.wikipedia.org/wiki/List_of_moments_of_inertia#List_of_3D_inertia_tensors>`_ (et est utilisée dans ce qui précède exemple).

source: The inertia tensor depends on both the mass and the distribution of mass of the object. A good first approximation is to assume equal distribution of mass in the volume of the object and compute the inertia tensor based on the object's shape, as outlined above.
fr: Le tenseur d'inertie dépend à la fois de la masse et de la distribution de masse de l'objet. Une bonne première approximation consiste à supposer une répartition égale de la masse dans le volume de l'objet et à calculer le tenseur d'inertie en fonction de la forme de l'objet, comme indiqué ci-dessus.

source: If unsure what to put, a matrix with ixx/iyy/izz=1e-3 or smaller is often a reasonable default for a mid-sized link (it corresponds to a box of 0.1 m side length with a mass of 0.6 kg). The identity matrix is a particularly bad choice, since it is often much too high (it corresponds to a box of 0.1 m side length with a mass of 600 kg!).
fr: Si vous ne savez pas quoi mettre, une matrice avec ixx/iyy/izz=1e-3 ou moins est souvent une valeur par défaut raisonnable pour un lien de taille moyenne (cela correspond à une boîte de 0,1 m de côté avec une masse de 0,6 kg). La matrice d'identité est un choix particulièrement mauvais, car elle est souvent beaucoup trop élevée (elle correspond à une boîte de 0,1 m de côté avec une masse de 600 kg !).

source: You can also specify an origin tag to specify the center of gravity and the inertial reference frame (relative to the link's reference frame).
fr: Vous pouvez également spécifier une balise d'origine pour spécifier le centre de gravité et le référentiel inertiel (par rapport au référentiel du lien).

source: When using realtime controllers, inertia elements of zero (or almost zero) can cause the robot model to collapse without warning, and all links will appear with their origins coinciding with the world origin.
fr: Lors de l'utilisation de contrôleurs en temps réel, des éléments d'inertie de zéro (ou presque) peuvent provoquer l'effondrement du modèle de robot sans avertissement, et tous les liens apparaîtront avec leurs origines coïncidant avec l'origine du monde.

source: Contact Coefficients
fr: Coefficients de contact

source: You can also define how the links behave when they are in contact with one another. This is done with a subelement of the collision tag called contact_coefficients. There are three attributes to specify:
fr: Vous pouvez également définir le comportement des liens lorsqu'ils sont en contact les uns avec les autres. Cela se fait avec un sous-élément de la balise de collision appelé contact_coefficients. Il y a trois attributs à spécifier :

source: mu - `Friction coefficient <https://simple.wikipedia.org/wiki/Coefficient_of_friction>`_
fr: mu - `Coefficient de frottement <https://simple.wikipedia.org/wiki/Coefficient_of_friction>`_

source: kp - `Stiffness coefficient <https://en.wikipedia.org/wiki/Stiffness>`_
fr: kp - `Coefficient de rigidité <https://en.wikipedia.org/wiki/Stiffness>`_

source: kd - `Dampening coefficient <https://en.wikipedia.org/wiki/Damping_ratio#Damping_ratio_definition>`_
fr: kd - `Coefficient d'amortissement <https://en.wikipedia.org/wiki/Damping_ratio#Damping_ratio_definition>`_

source: Joint Dynamics
fr: Dynamique articulaire

source: How the joint moves is defined by the dynamics tag for the joint. There are two attributes here:
fr: La manière dont l'articulation se déplace est définie par la balise dynamique de l'articulation. Il y a deux attributs ici :

source: ``friction`` - The physical static friction. For prismatic joints, the units are Newtons. For revolving joints, the units are Newton meters.
fr: ``friction`` - Le frottement statique physique. Pour les joints prismatiques, les unités sont les Newtons. Pour les joints tournants, les unités sont les Newton mètres.

source: ``damping`` - The physical damping value. For prismatic joints, the units are Newton seconds per meter. For revolving joints, Newton meter seconds per radian.
fr: ``damping`` - La valeur d'amortissement physique. Pour les joints prismatiques, les unités sont des Newton secondes par mètre. Pour les joints tournants, Newton mètre seconde par radian.

source: If not specified, these coefficients default to zero.
fr: S'ils ne sont pas spécifiés, ces coefficients sont par défaut à zéro.

source: Other Tags
fr: Autres balises

source: In the realm of pure URDF (i.e. excluding Gazebo-specific tags), there are two remaining tags to help define the joints: calibration and safety controller. Check out the `spec <https://wiki.ros.org/urdf/XML/joint>`_, as they are not included in this tutorial.
fr: Dans le domaine de l'URDF pur (c'est-à-dire à l'exclusion des balises spécifiques à Gazebo), il reste deux balises pour aider à définir les articulations : étalonnage et contrôleur de sécurité. Consultez les `spécifications <https://wiki.ros.org/urdf/XML/joint>`_, car elles ne sont pas incluses dans ce didacticiel.

source: Next Steps
fr: Prochaines étapes

source: Reduce the amount of code and annoying math you have to do by :doc:`using xacro <./Using-Xacro-to-Clean-Up-a-URDF-File>`.
fr: Réduisez la quantité de code et de calculs ennuyeux que vous devez faire en :doc:`using xacro <./Using-Xacro-to-Clean-Up-a-URDF-File>`.
