Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Tutorials/Intermediate/URDF/Building-a-Visual-Robot-Model-with-URDF-from-Scratch.po
Languages: fr

source: Building a visual robot model from scratch
fr: Construire un modèle de robot visuel à partir de zéro

source: **Goal:** Learn how to build a visual model of a robot that you can view in Rviz
fr: **Objectif :** Apprendre à construire un modèle visuel d'un robot que vous pouvez voir dans Rviz

source: **Tutorial level:** Intermediate
fr: **Niveau du didacticiel :** Intermédiaire

source: **Time:** 20 minutes
fr: **Durée :** 20 minutes

source: Contents
fr: Contenu

source: This tutorial assumes you know how to write well-formatted XML code
fr: Ce tutoriel suppose que vous savez écrire du code XML bien formaté

source: In this tutorial, we’re going to build a visual model of a robot that vaguely looks like R2D2. In later tutorials, you’ll learn how to :doc:`articulate the model <./Building-a-Movable-Robot-Model-with-URDF>`, :doc:`add in some physical properties <./Adding-Physical-and-Collision-Properties-to-a-URDF-Model>`, and :doc:`generate neater code with xacro <./Using-Xacro-to-Clean-Up-a-URDF-File>`, but for now, we’re going to focus on getting the visual geometry correct.
fr: Dans ce tutoriel, nous allons construire un modèle visuel d'un robot qui ressemble vaguement à R2D2. Dans les didacticiels ultérieurs, vous apprendrez à :doc:`articuler le modèle <./Building-a-Movable-Robot-Model-with-URDF>`, :doc:`ajouter des propriétés physiques <./Adding- Physical-and-Collision-Properties-to-a-URDF-Model>`, et :doc:`générer un code plus propre avec xacro <./Using-Xacro-to-Clean-Up-a-URDF-File>`, mais pour l'instant, nous allons nous concentrer sur l'obtention d'une géométrie visuelle correcte.

source: Before continuing, make sure you have the `joint_state_publisher <https://index.ros.org/p/joint_state_publisher>`_ package installed. If you installed `urdf_tutorial <https://index.ros.org/p/urdf_tutorial>`_ binaries, this should already be the case. If not, please update your installation to include that package (use ``rosdep`` to check).
fr: Avant de continuer, assurez-vous que le package `joint_state_publisher <https://index.ros.org/p/joint_state_publisher>`_ est installé. Si vous avez installé les binaires `urdf_tutorial <https://index.ros.org/p/urdf_tutorial>`_, cela devrait déjà être le cas. Si ce n'est pas le cas, veuillez mettre à jour votre installation pour inclure ce paquet (utilisez ``rosdep`` pour vérifier).

source: All of the robot models mentioned in this tutorial (and the source files) can be found in the `urdf_tutorial <https://index.ros.org/p/urdf_tutorial>`_ package.
fr: Tous les modèles de robots mentionnés dans ce didacticiel (et les fichiers sources) se trouvent dans le package `urdf_tutorial <https://index.ros.org/p/urdf_tutorial>`_.

source: One Shape
fr: Une forme

source: First, we’re just going to explore one simple shape. Here’s about as simple as a urdf as you can make. `[Source: 01-myfirst.urdf] <https://github.com/ros/urdf_tutorial/blob/ros2/urdf/01-myfirst.urdf>`_
fr: Tout d'abord, nous allons juste explorer une forme simple. Voici à peu près aussi simple qu'un urdf que vous pouvez faire. `[Source : 01-myfirst.urdf] <https://github.com/ros/urdf_tutorial/blob/ros2/urdf/01-myfirst.urdf>`_

source: To translate the XML into English, this is a robot with the name ``myfirst``, that contains only one link (a.k.a. part), whose visual component is just a cylinder 0.6 meters long with a 0.2 meter radius. This may seem like a lot of enclosing tags for a simple “hello world” type example, but it will get more complicated, trust me.
fr: Pour traduire le XML en anglais, il s'agit d'un robot nommé ``myfirst``, qui ne contient qu'un seul lien (c'est-à-dire une partie), dont le composant visuel est juste un cylindre de 0,6 mètre de long avec un rayon de 0,2 mètre. Cela peut sembler beaucoup de balises englobantes pour un simple exemple de type "hello world", mais cela deviendra plus compliqué, croyez-moi.

source: To examine the model, launch the ``display.launch.py`` file:
fr: Pour examiner le modèle, lancez le fichier ``display.launch.py`` :

source: This does three things:
fr: Cela fait trois choses :

source: Loads the specified model and saves it as a parameter
fr: Charge le modèle spécifié et l'enregistre en tant que paramètre

source: Runs nodes to publish `sensor_msgs/msg/JointState <https://github.com/ros2/common_interfaces/blob/eloquent/sensor_msgs/msg/JointState.msg>`_ and transforms (more on these later)
fr: Exécute des nœuds pour publier `sensor_msgs/msg/JointState <https://github.com/ros2/common_interfaces/blob/eloquent/sensor_msgs/msg/JointState.msg>`_ et transforme (plus sur ceux-ci plus tard)

source: Starts Rviz with a configuration file
fr: Démarre Rviz avec un fichier de configuration

source: Note that the launch command above assumes that you are executing it from the `urdf_tutorial <https://index.ros.org/p/urdf_tutorial>`_ package directory (ie: the ``urdf`` directory is a direct child of the current working directory). If that is not the case, the relative path to ``01-myfirst.urdf`` will not be valid, and you'll receive an error as soon as the launcher tries to load the urdf as a parameter.
fr: Notez que la commande de lancement ci-dessus suppose que vous l'exécutez à partir du répertoire ``urdf_tutorial <https://index.ros.org/p/urdf_tutorial>`_ package'' (c'est-à-dire : le répertoire ``urdf`` est un enfant direct de le répertoire de travail courant). Si ce n'est pas le cas, le chemin relatif vers ``01-myfirst.urdf`` ne sera pas valide, et vous recevrez une erreur dès que le lanceur essaiera de charger l'urdf en paramètre.

source: A slightly modified argument allows this to work regardless of the current working directory:
fr: Un argument légèrement modifié permet à cela de fonctionner quel que soit le répertoire de travail actuel :

source: You'll have to change all example launch commands given in these tutorials if you are not running them from the ``urdf_tutorial`` package location.
fr: Vous devrez modifier tous les exemples de commandes de lancement donnés dans ces tutoriels si vous ne les exécutez pas à partir de l'emplacement du package ``urdf_tutorial``.

source: After launching ``display.launch.py``, you should end up with RViz showing you the following:
fr: Après avoir lancé ``display.launch.py``, vous devriez vous retrouver avec RViz vous montrant ce qui suit :

source: my first image
fr: ma première image

source: Things to note:
fr: À noter :

source: The fixed frame is the transform frame where the center of the grid is located. Here, it’s a frame defined by our one link, base_link.
fr: Le cadre fixe est le cadre de transformation où se trouve le centre de la grille. Ici, c'est un cadre défini par notre seul lien, base_link.

source: The visual element (the cylinder) has its origin at the center of its geometry as a default. Hence, half the cylinder is below the grid.
fr: L'élément visuel (le cylindre) a son origine au centre de sa géométrie par défaut. Par conséquent, la moitié du cylindre est sous la grille.

source: Multiple Shapes
fr: Formes multiples

source: Now let’s look at how to add multiple shapes/links. If we just add more link elements to the urdf, the parser won’t know where to put them. So, we have to add joints. Joint elements can refer to both flexible and inflexible joints. We’ll start with inflexible, or fixed joints. `[Source: 02-multipleshapes.urdf] <https://github.com/ros/urdf_tutorial/blob/ros2/urdf/02-multipleshapes.urdf>`_
fr: Voyons maintenant comment ajouter plusieurs formes/liens. Si nous ajoutons simplement plus d'éléments de lien à l'urdf, l'analyseur ne saura pas où les mettre. Il faut donc rajouter des joints. Les éléments de joint peuvent faire référence à la fois aux joints flexibles et inflexibles. Nous commencerons par des joints inflexibles ou fixes. `[Source : 02-multipleshapes.urdf] <https://github.com/ros/urdf_tutorial/blob/ros2/urdf/02-multipleshapes.urdf>`_

source: Note how we defined a 0.6m x 0.1m x 0.2m box
fr: Notez comment nous avons défini une boîte de 0,6 m x 0,1 m x 0,2 m

source: The joint is defined in terms of a parent and a child. URDF is ultimately a tree structure with one root link. This means that the leg’s position is dependent on the base_link’s position.
fr: L'articulation est définie en termes d'un parent et d'un enfant. URDF est finalement une structure arborescente avec un lien racine. Cela signifie que la position de la jambe dépend de la position de base_link.

source: Both of the shapes overlap with each other, because they share the same origin. If we want them not to overlap we must define more origins.
fr: Les deux formes se chevauchent, car elles partagent la même origine. Si nous voulons qu'ils ne se chevauchent pas, nous devons définir plus d'origines.

source: Origins
fr: Origines

source: R2D2’s leg attaches to the top half of his torso, on the side. So that’s where we specify the origin of the JOINT to be. Also, it doesn’t attach to the middle of the leg, it attaches to the upper part, so we must offset the origin for the leg as well. We also rotate the leg so it is upright. `[Source: 03-origins.urdf] <https://github.com/ros/urdf_tutorial/blob/ros2/urdf/03-origins.urdf>`_
fr: La jambe de R2D2 s'attache à la moitié supérieure de son torse, sur le côté. C'est donc là que nous spécifions l'origine du JOINT. De plus, il ne s'attache pas au milieu de la jambe, il s'attache à la partie supérieure, il faut donc décaler l'origine pour la jambe également. Nous faisons également pivoter la jambe pour qu'elle soit droite. `[Source : 03-origins.urdf] <https://github.com/ros/urdf_tutorial/blob/ros2/urdf/03-origins.urdf>`_

source: Let’s start by examining the joint’s origin. It is defined in terms of the parent’s reference frame. So we are -0.22 meters in the y direction (to our left, but to the right relative to the axes) and 0.25 meters in the z direction (up). This means that the origin for the child link will be up and to the right, regardless of the child link’s visual origin tag. Since we didn’t specify a rpy (roll pitch yaw) attribute, the child frame will be default have the same orientation as the parent frame.
fr: Commençons par examiner l'origine de l'articulation. Il est défini en fonction du cadre de référence du parent. Nous sommes donc à -0,22 mètre dans la direction y (à notre gauche, mais à droite par rapport aux axes) et à 0,25 mètre dans la direction z (vers le haut). Cela signifie que l'origine du lien enfant sera en haut et à droite, quelle que soit la balise d'origine visuelle du lien enfant. Comme nous n'avons pas spécifié d'attribut rpy (roll pitch lacet), le cadre enfant aura par défaut la même orientation que le cadre parent.

source: Now, looking at the leg’s visual origin, it has both a xyz and rpy offset. This defines where the center of the visual element should be, relative to its origin. Since we want the leg to attach at the top, we offset the origin down by setting the z offset to be -0.3 meters. And since we want the long part of the leg to be parallel to the z axis, we rotate the visual part PI/2 around the Y axis.
fr: Maintenant, en regardant l'origine visuelle de la jambe, elle a à la fois un décalage xyz et rpy. Cela définit où le centre de l'élément visuel doit être, par rapport à son origine. Puisque nous voulons que la jambe s'attache en haut, nous décalons l'origine vers le bas en définissant le décalage z sur -0,3 mètre. Et puisque nous voulons que la partie longue de la jambe soit parallèle à l'axe z, nous faisons pivoter la partie visuelle PI/2 autour de l'axe Y.

source: Origins Screenshot
fr: Capture d'écran des origines

source: The launch file runs packages that will create TF frames for each link in your model based on your URDF. Rviz uses this information to figure out where to display each shape.
fr: Le fichier de lancement exécute des packages qui créeront des cadres TF pour chaque lien de votre modèle en fonction de votre URDF. Rviz utilise ces informations pour déterminer où afficher chaque forme.

source: If a TF frame does not exist for a given URDF link, then it will be placed at the origin in white (ref. `related question <http://answers.ros.org/question/207947/how-do-you-use-externally-defined-materials-in-a-urdfxacro-file/>`_).
fr: Si une trame TF n'existe pas pour un lien URDF donné, alors elle sera placée à l'origine en blanc (réf. `question connexe <http://answers.ros.org/question/207947/how-do-you- use-externally-defined-materials-in-a-urdfxacro-file/>`_).

source: Material Girl
fr: Fille matérialiste

source: “Alright,” I hear you say. “That’s very cute, but not everyone owns a B21. My robot and R2D2 are not red!” That’s a good point. Let’s take a look at the material tag. `[Source: 04-materials.urdf] <https://github.com/ros/urdf_tutorial/blob/ros2/urdf/04-materials.urdf>`_
fr: "D'accord", je vous entends dire. "C'est très mignon, mais tout le monde ne possède pas un B21. Mon robot et R2D2 ne sont pas rouges ! C'est un bon point. Jetons un coup d'œil à la balise de matériau. `[Source : 04-materials.urdf] <https://github.com/ros/urdf_tutorial/blob/ros2/urdf/04-materials.urdf>`_

source: The body is now blue. We’ve defined a new material called “blue”, with the red, green, blue and alpha channels defined as 0,0,0.8 and 1 respectively. All of the values can be in the range [0,1]. This material is then referenced by the base_link's visual element. The white material is defined similarly.
fr: Le corps est maintenant bleu. Nous avons défini un nouveau matériau appelé "bleu", avec les canaux rouge, vert, bleu et alpha définis comme 0, 0, 0,8 et 1 respectivement. Toutes les valeurs peuvent être dans la plage [0,1]. Ce matériel est ensuite référencé par l'élément visuel de base_link. Le matériau blanc est défini de la même manière.

source: You could also define the material tag from within the visual element, and even reference it in other links. No one will even complain if you redefine it though.
fr: Vous pouvez également définir la balise de matériau à partir de l'élément visuel et même la référencer dans d'autres liens. Personne ne se plaindra même si vous le redéfinissez.

source: You can also use a texture to specify an image file to be used for coloring the object
fr: Vous pouvez également utiliser une texture pour spécifier un fichier image à utiliser pour colorer l'objet

source: Materials Screenshot
fr: Capture d'écran des matériaux

source: Finishing the Model
fr: Finition du modèle

source: Now we finish the model off with a few more shapes: feet, wheels, and head. Most notably, we add a sphere and a some meshes. We’ll also add few other pieces that we’ll use later. `[Source: 05-visual.urdf] <https://github.com/ros/urdf_tutorial/blob/ros2/urdf/05-visual.urdf>`_
fr: Maintenant, nous terminons le modèle avec quelques formes supplémentaires : pieds, roues et tête. Plus particulièrement, nous ajoutons une sphère et quelques mailles. Nous ajouterons également quelques autres pièces que nous utiliserons plus tard. `[Source : 05-visual.urdf] <https://github.com/ros/urdf_tutorial/blob/ros2/urdf/05-visual.urdf>`_

source: Visual Screenshot
fr: Capture d'écran visuelle

source: How to add the sphere should be fairly self explanatory:
fr: Comment ajouter la sphère devrait être assez explicite :

source: The meshes here were borrowed from the PR2. They are separate files which you have to specify the path for. You should use the ``package://NAME_OF_PACKAGE/path`` notation. The meshes for this tutorial are located within the ``urdf_tutorial`` package, in a folder called meshes.
fr: Les mailles ici ont été empruntées au PR2. Ce sont des fichiers séparés dont vous devez spécifier le chemin. Vous devez utiliser la notation ``package://NAME_OF_PACKAGE/path``. Les maillages de ce tutoriel sont situés dans le package ``urdf_tutorial``, dans un dossier appelé meshes.

source: The meshes can be imported in a number of different formats. STL is fairly common, but the engine also supports DAE, which can have its own color data, meaning you don’t have to specify the color/material. Often these are in separate files. These meshes reference the ``.tif`` files also in the meshes folder.
fr: Les maillages peuvent être importés dans un certain nombre de formats différents. STL est assez courant, mais le moteur prend également en charge DAE, qui peut avoir ses propres données de couleur, ce qui signifie que vous n'avez pas à spécifier la couleur/le matériau. Souvent, ceux-ci sont dans des fichiers séparés. Ces maillages référencent les fichiers ``.tif`` également dans le dossier des maillages.

source: Meshes can also be sized using relative scaling parameters or a bounding box size.
fr: Les maillages peuvent également être dimensionnés à l'aide de paramètres d'échelle relatifs ou d'une taille de boîte englobante.

source: We could have also referred to meshes in a completely different package.
fr: Nous aurions également pu faire référence à des maillages dans un package complètement différent.

source: There you have it. A R2D2-like URDF model. Now you can continue on to the next step, :doc:`making it move <./Building-a-Movable-Robot-Model-with-URDF>`.
fr: Voilà. Un modèle URDF de type R2D2. Vous pouvez maintenant passer à l'étape suivante, :doc:`le faire bouger <./Building-a-Movable-Robot-Model-with-URDF>`.
