Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Tutorials/Intermediate/URDF/Using-URDF-with-Robot-State-Publisher.po
Languages: fr

source: Using URDF with ``robot_state_publisher``
fr: Utiliser URDF avec ``robot_state_publisher``

source: **Goal:** Simulate a walking robot modeled in URDF and view it in Rviz.
fr: **Objectif :** Simulez un robot marcheur modélisé en URDF et visualisez-le dans Rviz.

source: **Tutorial level:** Intermediate
fr: **Niveau du didacticiel :** Intermédiaire

source: **Time:** 15 minutes
fr: **Durée :** 15 minutes

source: Contents
fr: Contenu

source: Background
fr: Arrière-plan

source: This tutorial will show you how to model a walking robot, publish the state as a `tf2 <https://wiki.ros.org/tf2>`__ message and view the simulation in Rviz. First, we create the URDF model describing the robot assembly. Next we write a node which simulates the motion and publishes the JointState and transforms. We then use ``robot_state_publisher`` to publish the entire robot state to ``/tf2``.
fr: Ce didacticiel vous montrera comment modéliser un robot marcheur, publier l'état en tant que message `tf2 <https://wiki.ros.org/tf2>`__ et afficher la simulation dans Rviz. Tout d'abord, nous créons le modèle URDF décrivant l'assemblage du robot. Ensuite, nous écrivons un nœud qui simule le mouvement et publie le JointState et les transformations. Nous utilisons ensuite ``robot_state_publisher`` pour publier l'état complet du robot dans ``/tf2``.

source: Prerequisites
fr: Conditions préalables

source: `rviz2 <https://index.ros.org/p/rviz2/>`__
fr: refze <http://index.rus.org/b/refzie/> a

source: As always, don’t forget to source ROS 2 in :doc:`every new terminal you open <../../Beginner-CLI-Tools/Configuring-ROS2-Environment>`.
fr: Comme toujours, n'oubliez pas de sourcer ROS 2 dans :doc:`chaque nouveau terminal que vous ouvrez <../../Beginner-CLI-Tools/Configuring-ROS2-Environment>`.

source: Tasks
fr: Tâches

source: 1 Create a package
fr: 1 Créer un package

source: You should now see a ``urdf_tutorial_r2d2`` folder. Next you will make several changes to it.
fr: Vous devriez maintenant voir un dossier ``urdf_tutorial_r2d2``. Ensuite, vous y apporterez plusieurs modifications.

source: 2 Create the URDF File
fr: 2 Créer le fichier URDF

source: Create the directory where we will store some assets:
fr: Créez le répertoire où nous allons stocker certains actifs :

source: Download the :download:`URDF file <documents/r2d2.urdf.xml>` and save it as ``~/second_ros2_ws/src/urdf_tutorial_r2d2/urdf/r2d2.urdf.xml``. Download the :download:`Rviz configuration file <documents/r2d2.rviz>` and save it as ``~/second_ros2_ws/src/urdf_tutorial_r2d2/urdf/r2d2.rviz``.
fr: Téléchargez le :download:`fichier URDF <documents/r2d2.urdf.xml>` et enregistrez-le sous ``~/second_ros2_ws/src/urdf_tutorial_r2d2/urdf/r2d2.urdf.xml``. Téléchargez le :download:`fichier de configuration Rviz <documents/r2d2.rviz>` et enregistrez-le sous ``~/second_ros2_ws/src/urdf_tutorial_r2d2/urdf/r2d2.rviz``.

source: 3 Publish the state
fr: 3 Publier l'état

source: Now we need a method for specifying what state the robot is in. To do this, we must specify all three joints and the overall odometry.
fr: Nous avons maintenant besoin d'une méthode pour spécifier dans quel état se trouve le robot. Pour ce faire, nous devons spécifier les trois articulations et l'odométrie globale.

source: Fire up your favorite editor and paste the following code into ``~/second_ros2_ws/src/urdf_tutorial_r2d2/urdf_tutorial_r2d2/state_publisher.py``
fr: Lancez votre éditeur préféré et collez le code suivant dans ``~/second_ros2_ws/src/urdf_tutorial_r2d2/urdf_tutorial_r2d2/state_publisher.py``

source: 4 Create a launch file
fr: 4 Créer un fichier de lancement

source: Create a new ``~/second_ros2_ws/src/urdf_tutorial_r2d2/launch`` folder. Open your editor and paste the following code, saving it as ``~/second_ros2_ws/src/urdf_tutorial_r2d2/launch/demo.launch.py``
fr: Créez un nouveau dossier ``~/second_ros2_ws/src/urdf_tutorial_r2d2/launch``. Ouvrez votre éditeur et collez le code suivant, en l'enregistrant sous ``~/second_ros2_ws/src/urdf_tutorial_r2d2/launch/demo.launch.py``

source: 5 Edit the setup.py file
fr: 5 Modifiez le fichier setup.py

source: You must tell the **colcon** build tool how to install your Python package. Edit the ``~/second_ros2_ws/src/urdf_tutorial_r2d2/setup.py`` file as follows:
fr: Vous devez indiquer à l'outil de construction **colcon** comment installer votre package Python. Modifiez le fichier ``~/second_ros2_ws/src/urdf_tutorial_r2d2/setup.py`` comme suit :

source: include these import statements
fr: inclure ces déclarations d'importation

source: append these 2 lines inside ``data_files``
fr: ajoutez ces 2 lignes à l'intérieur de ``data_files``

source: modify the ``entry_points`` table so you can later run 'state_publisher' from a console
fr: modifiez la table ``entry_points`` afin de pouvoir exécuter ultérieurement 'state_publisher' à partir d'une console

source: Save the ``setup.py`` file with your changes.
fr: Enregistrez le fichier ``setup.py`` avec vos modifications.

source: 6 Install the package
fr: 6 Installez le paquet

source: 7 View the results
fr: 7 Visualiser les résultats

source: Launch the package
fr: Lancer le package

source: Open a new terminal, the run Rviz using
fr: Ouvrez un nouveau terminal, exécutez Rviz en utilisant

source: See the `User Guide <http://wiki.ros.org/rviz/UserGuide>`__ for details on how to use Rviz.
fr: Voir le `Guide de l'utilisateur <http://wiki.ros.org/rviz/UserGuide>`__ pour plus de détails sur l'utilisation de Rviz.

source: Summary
fr: Résumé

source: You created a JointState publisher node and coupled it with ``robot_state_publisher`` to simulate a walking robot. The code used in these examples can be found `here <https://github.com/benbongalon/ros2-migration/tree/master/urdf_tutorial>`__.
fr: Vous avez créé un nœud d'éditeur JointState et l'avez couplé avec ``robot_state_publisher`` pour simuler un robot marchant. Le code utilisé dans ces exemples peut être trouvé `ici <https://github.com/benbongalon/ros2-migration/tree/master/urdf_tutorial>`__.

source: Credit is given to the authors of this `ROS 1 tutorial <http://wiki.ros.org/urdf/Tutorials/Using%20urdf%20with%20robot_state_publisher>`__ from which some content was reused.
fr: Le crédit est donné aux auteurs de ce `tutoriel ROS 1 <http://wiki.ros.org/urdf/Tutorials/Using%20urdf%20with%20robot_state_publisher>`__ dont une partie du contenu a été réutilisé.
