Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Tutorials/Advanced/Allocator-Template-Tutorial.po
Languages: fr

source: Implementing a custom memory allocator
fr: Implémentation d'un répartiteur de mémoire personnalisé

source: **Goal:** This tutorial will show how to use a custom memory allocator when writing ROS 2 C++ code.
fr: **Objectif :** Ce didacticiel montre comment utiliser un répartiteur de mémoire personnalisé lors de l'écriture de code ROS 2 C++.

source: **Tutorial level:** Advanced
fr: **Niveau du didacticiel :** Avancé

source: **Time:** 20 minutes
fr: **Durée :** 20 minutes

source: Table of Contents
fr: Table des matières

source: This tutorial will teach you how to integrate a custom allocator for publishers and subscribers so that the default heap allocator is never called while your ROS nodes are executing. The code for this tutorial is available `here <https://github.com/ros2/demos/blob/rolling/demo_nodes_cpp/src/topics/allocator_tutorial.cpp>`__.
fr: Ce didacticiel vous apprendra comment intégrer un alternateur personnalisé pour les éditeurs et les abonnés afin que l'allocateur de tas par défaut ne soit jamais appelé pendant l'exécution de vos nœuds ROS. Le code de ce tutoriel est disponible `ici <https://github.com/ros2/demos/blob/rolling/demo_nodes_cpp/src/topics/allocator_tutorial.cpp>`__.

source: Background
fr: Arrière-plan

source: Suppose you want to write real-time safe code, and you've heard about the many dangers of calling "new" during the real-time critical section, because the default heap allocator on most platforms is nondeterministic.
fr: Supposons que vous souhaitiez écrire du code sécurisé en temps réel et que vous ayez entendu parler des nombreux dangers liés à l'appel de "new" pendant la section critique en temps réel, car l'allocateur de tas par défaut sur la plupart des plates-formes n'est pas déterministe.

source: By default, many C++ standard library structures will implicitly allocate memory as they grow, such as ``std::vector``. However, these data structures also accept an "Allocator" template argument. If you specify a custom allocator to one of these data structures, it will use that allocator for you instead of the system allocator to grow or shrink the data structure. Your custom allocator could have a pool of memory preallocated on the stack, which might be better suited to real-time applications.
fr: Par défaut, de nombreuses structures de bibliothèques standard C++ alloueront implicitement de la mémoire au fur et à mesure de leur croissance, comme ``std::vector``. Cependant, ces structures de données acceptent également un argument de modèle "Allocator". Si vous spécifiez un alternateur personnalisé à l'une de ces structures de données, il utilisera cet alternateur pour vous au lieu de l'allocateur système pour agrandir ou réduire la structure de données. Votre alternateur personnalisé peut avoir un pool de mémoire préalloué sur la pile, ce qui peut être mieux adapté aux applications en temps réel.

source: In the ROS 2 C++ client library (rclcpp), we are following a similar philosophy to the C++ standard library. Publishers, subscribers, and the Executor accept an Allocator template parameter that controls allocations made by that entity during execution.
fr: Dans la bibliothèque cliente ROS 2 C++ (rclcpp), nous suivons une philosophie similaire à la bibliothèque standard C++. Les éditeurs, les abonnés et l'exécuteur acceptent un paramètre de modèle Allocator qui contrôle les allocations effectuées par cette entité lors de l'exécution.

source: Writing an allocator
fr: Écrire un répartiteur

source: To write an allocator compatible with ROS 2's allocator interface, your allocator must be compatible with the C++ standard library allocator interface.
fr: Pour écrire un alternateur compatible avec l'interface d'allocation de ROS 2, votre alternateur doit être compatible avec l'interface d'allocation de la bibliothèque standard C++.

source: The C++11 library provides something called ``allocator_traits``. The C++11 standard specifies that a custom allocator only needs to fulfil a minimal set of requirements to be used to allocate and deallocate memory in a standard way. ``allocator_traits`` is a generic structure that fills out other qualities of an allocator based on an allocator written with the minimal requirements.
fr: La bibliothèque C++11 fournit quelque chose appelé ``allocator_traits``. La norme C++11 spécifie qu'un alternateur personnalisé n'a besoin de remplir qu'un ensemble minimal d'exigences pour être utilisé pour allouer et libérer de la mémoire de manière standard. ``allocator_traits`` est une structure générique qui remplit d'autres qualités d'un alternateur basé sur un alternateur écrit avec les exigences minimales.

source: For example, the following declaration for a custom allocator would satisfy ``allocator_traits`` (of course, you would still need to implement the declared functions in this struct):
fr: Par exemple, la déclaration suivante pour un alternateur personnalisé satisferait ``allocator_traits`` (bien sûr, vous devrez toujours implémenter les fonctions déclarées dans cette structure) :

source: You could then access other functions and members of the allocator filled in by ``allocator_traits`` like so: ``std::allocator_traits<custom_allocator<T>>::construct(...)``
fr: Vous pouvez ensuite accéder à d'autres fonctions et membres de l'allocateur remplis par ``allocator_traits`` comme ceci : ``std::allocator_traits<custom_allocator<T>>::construct(...)``

source: To learn about the full capabilities of ``allocator_traits``, see https://en.cppreference.com/w/cpp/memory/allocator_traits .
fr: Pour en savoir plus sur toutes les fonctionnalités de ``allocator_traits``, consultez https://en.cppreference.com/w/cpp/memory/allocator_traits .

source: However, some compilers that only have partial C++11 support, such as GCC 4.8, still require allocators to implement a lot of boilerplate code to work with standard library structures such as vectors and strings, because these structures do not use ``allocator_traits`` internally. Therefore, if you're using a compiler with partial C++11 support, your allocator will need to look more like this:
fr: Cependant, certains compilateurs qui n'ont qu'une prise en charge partielle de C++11, tels que GCC 4.8, nécessitent toujours que les allocateurs implémentent beaucoup de code passe-partout pour fonctionner avec des structures de bibliothèque standard telles que des vecteurs et des chaînes, car ces structures n'utilisent pas `` allocator_traits `` en interne. Par conséquent, si vous utilisez un compilateur avec une prise en charge partielle de C++11, votre alternateur devra ressembler davantage à ceci :

source: Writing an example main
fr: Rédaction d'un exemple principal

source: Once you have written a valid C++ allocator, you must pass it as a shared pointer to your publisher, subscriber, and executor.
fr: Une fois que vous avez écrit un répartiteur C++ valide, vous devez le transmettre en tant que pointeur partagé à votre éditeur, abonné et exécuteur.

source: You will also need to use your allocator to allocate any messages that you pass along the execution codepath.
fr: Vous devrez également utiliser votre alternateur pour allouer tous les messages que vous transmettez le long du chemin de code d'exécution.

source: Once you've instantiated the node and added the executor to the node, it's time to spin:
fr: Une fois que vous avez instancié le nœud et ajouté l'exécuteur au nœud, il est temps de lancer :

source: Passing an allocator to the intra-process pipeline
fr: Passer un alternateur au pipeline intra-processus

source: Even though we instantiated a publisher and subscriber in the same process, we aren't using the intra-process pipeline yet.
fr: Même si nous avons instancié un éditeur et un abonné dans le même processus, nous n'utilisons pas encore le pipeline intra-processus.

source: The IntraProcessManager is a class that is usually hidden from the user, but in order to pass a custom allocator to it we need to expose it by getting it from the rclcpp Context. The IntraProcessManager makes use of several standard library structures, so without a custom allocator it will call the default new.
fr: L'IntraProcessManager est une classe qui est généralement cachée à l'utilisateur, mais pour lui transmettre un alternateur personnalisé, nous devons l'exposer en l'obtenant à partir du contexte rclcpp. L'IntraProcessManager utilise plusieurs structures de bibliothèque standard, donc sans un alternateur personnalisé, il appellera le new par défaut.

source: Make sure to instantiate publishers and subscribers AFTER constructing the node in this way.
fr: Assurez-vous d'instancier les éditeurs et les abonnés APRÈS avoir construit le nœud de cette manière.

source: Testing and verifying the code
fr: Tester et vérifier le code

source: How do you know that your custom allocator is actually getting called?
fr: Comment savez-vous que votre répartiteur personnalisé est effectivement appelé ?

source: The obvious thing to do would be to count the calls made to your custom allocator's ``allocate`` and ``deallocate`` functions and compare that to the calls to ``new`` and ``delete``.
fr: La chose évidente à faire serait de compter les appels effectués aux fonctions ``allocate`` et ``deallocate`` de votre allocation personnalisée et de comparer cela aux appels à ``new`` et ``delete``.

source: Adding counting to the custom allocator is easy:
fr: L'ajout du comptage à l'allocateur personnalisé est simple :

source: You can also override the global new and delete operators:
fr: Vous pouvez également remplacer les opérateurs globaux new et delete :

source: where the variables we are incrementing are just global static integers, and ``is_running`` is a global static boolean that gets toggled right before the call to ``spin``.
fr: où les variables que nous incrémentons ne sont que des entiers statiques globaux, et ``is_running`` est un booléen statique global qui est basculé juste avant l'appel à ``spin``.

source: The `example executable <https://github.com/ros2/demos/blob/rolling/demo_nodes_cpp/src/topics/allocator_tutorial.cpp>`__ prints the value of the variables. To run the example executable, use:
fr: L'exemple d'exécutable <https://github.com/ros2/demos/blob/rolling/demo_nodes_cpp/src/topics/allocator_tutorial.cpp>`__ affiche la valeur des variables. Pour exécuter l'exemple d'exécutable, utilisez :

source: or, to run the example with the intra-process pipeline on:
fr: ou, pour exécuter l'exemple avec le pipeline intra-processus sur :

source: You should get numbers like:
fr: Vous devriez obtenir des nombres comme :

source: We've caught about 2/3 of the allocations/deallocations that happen on the execution path, but where do the remaining 1/3 come from?
fr: Nous avons détecté environ 2/3 des allocations/désallocations qui se produisent sur le chemin d'exécution, mais d'où vient le 1/3 restant ?

source: As a matter of fact, these allocations/deallocations originate in the underlying DDS implementation used in this example.
fr: En fait, ces allocations/désallocations proviennent de l'implémentation DDS sous-jacente utilisée dans cet exemple.

source: Proving this is out of the scope of this tutorial, but you can check out the test for the allocation path that gets run as part of the ROS 2 continuous integration testing, which backtraces through the code and figures out whether certain function calls originate in the rmw implementation or in a DDS implementation:
fr: Prouver cela n'entre pas dans le cadre de ce didacticiel, mais vous pouvez consulter le test du chemin d'allocation qui est exécuté dans le cadre des tests d'intégration continue ROS 2, qui revient sur le code et détermine si certains appels de fonction proviennent du implémentation rmw ou dans une implémentation DDS :

source: Note that this test is not using the custom allocator we just created, but the TLSF allocator (see below).
fr: Notez que ce test n'utilise pas l'allocateur personnalisé que nous venons de créer, mais l'allocateur TLSF (voir ci-dessous).

source: The TLSF allocator
fr: L'allocateur TLSF

source: ROS 2 offers support for the TLSF (Two Level Segregate Fit) allocator, which was designed to meet real-time requirements:
fr: ROS 2 prend en charge l'allocateur TLSF (Two Level Segregate Fit), qui a été conçu pour répondre aux exigences en temps réel :

source: For more information about TLSF, see http://www.gii.upv.es/tlsf/
fr: Pour plus d'informations sur TLSF, voir http://www.gii.upv.es/tlsf/

source: Note that the TLSF allocator is licensed under a dual-GPL/LGPL license.
fr: Notez que l'allocateur TLSF est sous licence double GPL/LGPL.

source: A full working example using the TLSF allocator is here: https://github.com/ros2/realtime_support/blob/rolling/tlsf_cpp/example/allocator_example.cpp
fr: Un exemple de travail complet utilisant l'allocateur TLSF est ici : https://github.com/ros2/realtime_support/blob/rolling/tlsf_cpp/example/allocator_example.cpp
