Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Tutorials/Advanced/FastDDS-Configuration.po
Languages: fr

source: Also be sure to remove the "default_subscriber" subscriber profile. Open two terminals. Do not forget to source the setup files and to set the required environment variables. On the first terminal run the publisher node, and the subscriber node on the other one. You should see that only the ``/async_topic`` messages are reaching the subscriber. The ``/sync_topic`` subscriber is not receiving the data as it is in a different partition from the corresponding publisher.
fr: Assurez-vous également de supprimer le profil d'abonné "default_subscriber". Ouvrez deux terminaux. N'oubliez pas de sourcer les fichiers d'installation et de définir les variables d'environnement requises. Sur le premier terminal, exécutez le nœud éditeur et le nœud abonné sur l'autre. Vous devriez voir que seuls les messages ``/async_topic`` parviennent à l'abonné. L'abonné ``/sync_topic`` ne reçoit pas les données car elles se trouvent dans une partition différente de l'éditeur correspondant.

source: Configuring a service and a client
fr: Configurer un service et un client

source: Services and clients have a publisher and a subscriber each, that communicate through two different topics. For example, for a service named ``ping`` there is:
fr: Les services et les clients ont chacun un éditeur et un abonné, qui communiquent via deux sujets différents. Par exemple, pour un service nommé ``ping`` il y a :

source: A service subscriber listening to requests on ``/rq/ping``.
fr: Un abonné au service écoutant les requêtes sur ``/rq/ping``.

source: A service publisher sending responses on ``/rr/ping``.
fr: Un éditeur de service envoyant des réponses sur ``/rr/ping``.

source: A client publisher sending requests on ``/rq/ping``.
fr: Un éditeur client envoyant des requêtes sur ``/rq/ping``.

source: A client subscriber listening to responses on ``/rr/ping``.
fr: Un abonné client écoutant les réponses sur ``/rr/ping``.

source: Although you can use these topic names to set the configuration profiles on the XML, sometimes you may wish to apply the same profile to all services or clients on a node. Instead of copying the same profile with all topic names generated for all services, you can just create a publisher and subscriber profile pair named ``service``. The same can be done for clients creating a pair named ``client``.
fr: Bien que vous puissiez utiliser ces noms de rubrique pour définir les profils de configuration sur le XML, vous pouvez parfois souhaiter appliquer le même profil à tous les services ou clients sur un nœud. Au lieu de copier le même profil avec tous les noms de sujets générés pour tous les services, vous pouvez simplement créer une paire de profils d'éditeur et d'abonné nommée ``service``. La même chose peut être faite pour les clients créant une paire nommée ``client``.

source: Create the nodes with the service and client
fr: Créer les nœuds avec le service et le client

source: Start creating the node with the service. Add a new source file named ``src/ping_service.cpp`` on your package with the following content:
fr: Commencez à créer le nœud avec le service. Ajoutez un nouveau fichier source nommé ``src/ping_service.cpp`` sur votre package avec le contenu suivant :

source: Create the client in a file named ``src/ping_client.cpp`` with the following content:
fr: Créez le client dans un fichier nommé ``src/ping_client.cpp`` avec le contenu suivant :

source: Open the ``CMakeLists.txt`` file and add two new executables ``ping_service`` and ``ping_client``:
fr: Ouvrez le fichier ``CMakeLists.txt`` et ajoutez deux nouveaux exécutables ``ping_service`` et ``ping_client`` :

source: Finally, build the package.
fr: Enfin, construisez le package.

source: Create the XML profiles for the service and client
fr: Créer les profils XML pour le service et le client

source: Create a file with name ``ping.xml`` with the following content:
fr: Créez un fichier avec le nom ``ping.xml`` avec le contenu suivant :

source: This configuration file sets the publication mode to ``SYNCHRONOUS`` on the service and to ``ASYNCHRONOUS`` on the client. Note that we are only defining the publisher profiles for both the service and the client, but subscriber profiles could be provided too.
fr: Ce fichier de configuration définit le mode de publication sur ``SYNCHRONOUS`` sur le service et sur ``ASYNCHRONOUS`` sur le client. Notez que nous ne définissons que les profils d'éditeur pour le service et le client, mais des profils d'abonnés peuvent également être fournis.

source: Execute the nodes
fr: Exécuter les nœuds

source: Open two terminals and source the setup files on each one. Then set the required environment variables for the XML to be loaded:
fr: Ouvrez deux terminaux et sourcez les fichiers de configuration sur chacun d'eux. Définissez ensuite les variables d'environnement requises pour le XML à charger :

source: On the first terminal run the service node.
fr: Sur le premier terminal, exécutez le nœud de service.

source: You should see the service waiting for requests:
fr: Vous devriez voir le service en attente de demandes :

source: On the second terminal, run the client node.
fr: Sur le deuxième terminal, exécutez le nœud client.

source: You should see the client sending the request and receiving the response:
fr: Vous devriez voir le client envoyer la requête et recevoir la réponse :

source: At the same time, the output in the server console has been updated:
fr: Dans le même temps, la sortie dans la console du serveur a été mise à jour :
