Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Tutorials/Beginner-Client-Libraries/Colcon-Tutorial.po
Languages: fr

source: Using ``colcon`` to build packages
fr: Utiliser ``colcon`` pour créer des packages

source: Table of Contents
fr: Table des matières

source: **Goal:** Build a ROS 2 workspace with ``colcon``.
fr: **Objectif :** Construire un espace de travail ROS 2 avec ``colcon``.

source: **Tutorial level:** Beginner
fr: **Niveau du tutoriel :** Débutant

source: **Time:** 20 minutes
fr: **Durée :** 20 minutes

source: This is a brief tutorial on how to create and build a ROS 2 workspace with ``colcon``. It is a practical tutorial and not designed to replace the core documentation.
fr: Ceci est un bref tutoriel sur la façon de créer et de construire un espace de travail ROS 2 avec ``colcon``. Il s'agit d'un didacticiel pratique et non conçu pour remplacer la documentation de base.

source: Background
fr: Arrière-plan

source: ``colcon`` is an iteration on the ROS build tools ``catkin_make``, ``catkin_make_isolated``, ``catkin_tools`` and ``ament_tools``. For more information on the design of colcon see `this document <https://design.ros2.org/articles/build_tool.html>`__.
fr: ``colcon`` est une itération sur les outils de compilation ROS ``catkin_make``, ``catkin_make_isolated``, ``catkin_tools`` et ``ament_tools``. Pour plus d'informations sur la conception de colcon, consultez `ce document <https://design.ros2.org/articles/build_tool.html>`__.

source: The source code can be found in the `colcon GitHub organization <https://github.com/colcon>`__.
fr: Le code source se trouve dans l'organisation `colcon GitHub <https://github.com/colcon>`__.

source: Prerequisites
fr: Conditions préalables

source: Install colcon
fr: Installer Colcon

source: Windows
fr: les fenêtres

source: Install ROS 2
fr: Installer ROS 2

source: To build the samples, you will need to install ROS 2.
fr: Pour créer les exemples, vous devrez installer ROS 2.

source: Follow the :doc:`installation instructions <../../Installation>`.
fr: Suivez les :doc:`instructions d'installation <../../Installation>`.

source: If installing from Debian packages, this tutorial requires the :ref:`desktop installation <linux-install-debians-install-ros-2-packages>`.
fr: Si vous installez à partir de packages Debian, ce didacticiel nécessite l':ref:`installation de bureau <linux-install-debian-install-ros-2-packages>`.

source: Basics
fr: Bases

source: A ROS workspace is a directory with a particular structure. Commonly there is a ``src`` subdirectory. Inside that subdirectory is where the source code of ROS packages will be located. Typically the directory starts otherwise empty.
fr: Un espace de travail ROS est un répertoire avec une structure particulière. Généralement, il existe un sous-répertoire ``src``. À l'intérieur de ce sous-répertoire se trouve le code source des packages ROS. En règle générale, le répertoire démarre sinon vide.

source: colcon does out of source builds. By default it will create the following directories as peers of the ``src`` directory:
fr: colcon fait des builds hors source. Par défaut, il créera les répertoires suivants en tant que pairs du répertoire ``src`` :

source: The ``build`` directory will be where intermediate files are stored. For each package a subfolder will be created in which e.g. CMake is being invoked.
fr: Le répertoire ``build`` sera l'endroit où les fichiers intermédiaires sont stockés. Pour chaque package, un sous-dossier sera créé dans lequel, par ex. CMake est appelé.

source: The ``install`` directory is where each package will be installed to. By default each package will be installed into a separate subdirectory.
fr: Le répertoire ``install`` est l'endroit où chaque paquet sera installé. Par défaut, chaque package sera installé dans un sous-répertoire séparé.

source: The ``log`` directory contains various logging information about each colcon invocation.
fr: Le répertoire ``log`` contient diverses informations de journalisation sur chaque invocation colcon.

source: Compared to catkin there is no ``devel`` directory.
fr: Contrairement à catkin, il n'y a pas de répertoire ``devel``.

source: Create a workspace
fr: Créer un espace de travail

source: First, create a directory (``ros2_ws``) to contain our workspace:
fr: Tout d'abord, créez un répertoire (``ros2_ws``) pour contenir notre espace de travail :

source: At this point the workspace contains a single empty directory ``src``:
fr: À ce stade, l'espace de travail contient un seul répertoire vide ``src`` :

source: Add some sources
fr: Ajouter des sources

source: Let's clone the `examples <https://github.com/ros2/examples>`__ repository into the ``src`` directory of the workspace:
fr: Clonons le dépôt `examples <https://github.com/ros2/examples>`__ dans le répertoire ``src`` de l'espace de travail :

source: Now the workspace should have the source code to the ROS 2 examples:
fr: L'espace de travail doit maintenant contenir le code source des exemples ROS 2 :

source: Source an underlay
fr: Sourcer une sous-couche

source: It is important that we have sourced the environment for an existing ROS 2 installation that will provide our workspace with the necessary build dependencies for the example packages. This is achieved by sourcing the setup script provided by a binary installation or a source installation, ie. another colcon workspace (see :doc:`Installation <../../Installation>`). We call this environment an **underlay**.
fr: Il est important que nous ayons trouvé l'environnement pour une installation ROS 2 existante qui fournira à notre espace de travail les dépendances de construction nécessaires pour les exemples de packages. Ceci est réalisé en générant le script de configuration fourni par une installation binaire ou une installation source, c'est-à-dire. un autre espace de travail colcon (voir :doc:`Installation <../../Installation>`). Nous appelons cet environnement une **sous-couche**.

source: Our workspace, ``ros2_ws``, will be an **overlay** on top of the existing ROS 2 installation. In general, it is recommended to use an overlay when you plan to iterate on a small number of packages, rather than putting all of your packages into the same workspace.
fr: Notre espace de travail, ``ros2_ws``, sera une **superposition** au-dessus de l'installation ROS 2 existante. En général, il est recommandé d'utiliser une superposition lorsque vous prévoyez d'itérer sur un petit nombre de packages, plutôt que de placer tous vos packages dans le même espace de travail.

source: Build the workspace
fr: Construire l'espace de travail

source: To build packages on Windows you need to be in a Visual Studio environment, see :ref:`Building the ROS 2 Code <windows-dev-build-ros2>` for more details.
fr: Pour créer des packages sous Windows, vous devez être dans un environnement Visual Studio, voir :ref:`Construire le code ROS 2 <windows-dev-build-ros2>` pour plus de détails.

source: In the root of the workspace, run ``colcon build``. Since build types such as ``ament_cmake`` do not support the concept of the ``devel`` space and require the package to be installed, colcon supports the option ``--symlink-install``. This allows the installed files to be changed by changing the files in the ``source`` space (e.g. Python files or other not compiled resourced) for faster iteration.
fr: A la racine de l'espace de travail, lancez ``colcon build``. Étant donné que les types de construction tels que ``ament_cmake`` ne prennent pas en charge le concept de l'espace ``devel`` et nécessitent l'installation du paquet, colcon prend en charge l'option ``--symlink-install``. Cela permet de modifier les fichiers installés en modifiant les fichiers dans l'espace ``source`` (par exemple, des fichiers Python ou d'autres ressources non compilées) pour une itération plus rapide.

source: Windows doesn’t allow long paths, so ``merge-install`` will combine all the paths into the ``install`` directory.
fr: Windows n'autorise pas les longs chemins, donc ``merge-install`` combinera tous les chemins dans le répertoire ``install``.

source: After the build is finished, we should see the ``build``, ``install``, and ``log`` directories:
fr: Une fois la construction terminée, nous devrions voir les répertoires ``build``, ``install`` et ``log`` :

source: Run tests
fr: Exécuter des tests

source: To run tests for the packages we just built, run the following:
fr: Pour exécuter des tests pour les packages que nous venons de créer, exécutez ce qui suit :

source: Remember to use a ``x64 Native Tools Command Prompt for VS 2019`` for executing the following command, as we are going to build a workspace.
fr: N'oubliez pas d'utiliser une ``invite de commande x64 Native Tools pour VS 2019`` pour exécuter la commande suivante, car nous allons créer un espace de travail.

source: You also need to specify ``--merge-install`` here since we used it for building above.
fr: Vous devez également spécifier ``--merge-install`` ici puisque nous l'avons utilisé pour la construction ci-dessus.

source: Source the environment
fr: Sourcer l'environnement

source: When colcon has completed building successfully, the output will be in the ``install`` directory. Before you can use any of the installed executables or libraries, you will need to add them to your path and library paths. colcon will have generated bash/bat files in the ``install`` directory to help setup the environment. These files will add all of the required elements to your path and library paths as well as provide any bash or shell commands exported by packages.
fr: Lorsque colcon a terminé la construction avec succès, la sortie sera dans le répertoire ``install``. Avant de pouvoir utiliser l'un des exécutables ou bibliothèques installés, vous devez les ajouter à votre chemin et aux chemins de bibliothèque. colcon aura généré des fichiers bash/bat dans le répertoire ``install`` pour aider à configurer l'environnement. Ces fichiers ajouteront tous les éléments requis à votre chemin et aux chemins de bibliothèque, ainsi que toutes les commandes bash ou shell exportées par les packages.

source: Or with Powershell:
fr: Ou avec Powershell :

source: Try a demo
fr: Essayez une démo

source: With the environment sourced we can run executables built by colcon. Let's run a subscriber node from the examples:
fr: Avec l'environnement sourcé, nous pouvons exécuter des exécutables construits par colcon. Exécutons un nœud d'abonné à partir des exemples :

source: In another terminal, let's run a publisher node (don't forget to source the setup script):
fr: Dans un autre terminal, lançons un nœud d'éditeur (n'oubliez pas de sourcer le script de configuration) :

source: You should see messages from the publisher and subscriber with numbers incrementing.
fr: Vous devriez voir les messages de l'éditeur et de l'abonné avec des numéros incrémentés.

source: Create your own package
fr: Créez votre propre forfait

source: colcon uses the ``package.xml`` specification defined in `REP 149 <https://www.ros.org/reps/rep-0149.html>`__ (`format 2 <https://www.ros.org/reps/rep-0140.html>`__ is also supported).
fr: colcon utilise la spécification ``package.xml`` définie dans `REP 149 <https://www.ros.org/reps/rep-0149.html>`__ (`format 2 <https://www.ros. org/reps/rep-0140.html>`__ est également pris en charge).

source: colcon supports multiple build types. The recommended build types are ``ament_cmake`` and ``ament_python``. Also supported are pure ``cmake`` packages.
fr: colcon prend en charge plusieurs types de construction. Les types de construction recommandés sont ``ament_cmake`` et ``ament_python``. Les packages ``cmake`` purs sont également pris en charge.

source: An example of an ``ament_python`` build is the `ament_index_python package <https://github.com/ament/ament_index/tree/rolling/ament_index_python>`__ , where the setup.py is the primary entry point for building.
fr: Un exemple de construction ``ament_python`` est le package `ament_index_python <https://github.com/ament/ament_index/tree/rolling/ament_index_python>`__ , où setup.py est le point d'entrée principal pour la construction.

source: A package such as `demo_nodes_cpp <https://github.com/ros2/demos/tree/rolling/demo_nodes_cpp>`__ uses the ``ament_cmake`` build type, and uses CMake as the build tool.
fr: Un package tel que `demo_nodes_cpp <https://github.com/ros2/demos/tree/rolling/demo_nodes_cpp>`__ utilise le type de construction ``ament_cmake`` et utilise CMake comme outil de construction.

source: For convenience, you can use the tool ``ros2 pkg create`` to create a new package based on a template.
fr: Pour plus de commodité, vous pouvez utiliser l'outil ``ros2 pkg create`` pour créer un nouveau package basé sur un modèle.

source: For ``catkin`` users, this is the equivalent of ``catkin_create_package``.
fr: Pour les utilisateurs de ``catkin``, c'est l'équivalent de ``catkin_create_package``.

source: Setup ``colcon_cd``
fr: Configurer ``colcon_cd``

source: The command ``colcon_cd`` allows you to quickly change the current working directory of your shell to the directory of a package. As an example ``colcon_cd some_ros_package`` would quickly bring you to the directory ``~/ros2_install/src/some_ros_package``.
fr: La commande ``colcon_cd`` vous permet de changer rapidement le répertoire de travail courant de votre shell vers le répertoire d'un paquet. Par exemple, ``colcon_cd some_ros_package`` vous amènerait rapidement au répertoire ``~/ros2_install/src/some_ros_package``.

source: Not yet available
fr: Pas encore disponible

source: Depending to the way you installed ``colcon_cd`` and where your workspace is, the instructions above may vary, please refer to `the documentation <https://colcon.readthedocs.io/en/released/user/installation.html#quick-directory-changes>`__ for more details. To undo this in Linux and macOS, locate your system’s shell startup script and remove the appended source and export commands.
fr: Selon la manière dont vous avez installé ``colcon_cd`` et où se trouve votre espace de travail, les instructions ci-dessus peuvent varier, veuillez vous référer à `la documentation <https://colcon.readthedocs.io/en/released/user/installation.html# changements de répertoire rapides>`__ pour plus de détails. Pour annuler cette opération sous Linux et macOS, localisez le script de démarrage du shell de votre système et supprimez les commandes source et export ajoutées.

source: Setup ``colcon`` tab completion
fr: Configuration de l'achèvement de l'onglet ``colcon``

source: The command ``colcon`` `supports command completion <https://colcon.readthedocs.io/en/released/user/installation.html#enable-completion>`__ for bash and bash-like shells if the ``colcon-argcomplete`` package is installed.
fr: La commande ``colcon`` `prend en charge la complétion de commande <https://colcon.readthedocs.io/en/released/user/installation.html#enable-completion>`__ pour les shells bash et de type bash si le ``colcon -argcomplete`` est installé.

source: Depending to the way you installed ``colcon`` and where your workspace is, the instructions above may vary, please refer to `the documentation <https://colcon.readthedocs.io/en/released/user/installation.html>`__ for more details. To undo this in Linux and macOS, locate your system’s shell startup script and remove the appended source command.
fr: Selon la manière dont vous avez installé ``colcon`` et l'endroit où se trouve votre espace de travail, les instructions ci-dessus peuvent varier, veuillez vous référer à `la documentation <https://colcon.readthedocs.io/en/released/user/installation.html> `__ pour plus de détails. Pour annuler cela sous Linux et macOS, localisez le script de démarrage du shell de votre système et supprimez la commande source ajoutée.

source: Tips
fr: Conseils

source: If you do not want to build a specific package place an empty file named ``COLCON_IGNORE`` in the directory and it will not be indexed.
fr: Si vous ne souhaitez pas construire un package spécifique, placez un fichier vide nommé ``COLCON_IGNORE`` dans le répertoire et il ne sera pas indexé.

source: If you want to avoid configuring and building tests in CMake packages you can pass: ``--cmake-args -DBUILD_TESTING=0``.
fr: Si vous voulez éviter de configurer et de construire des tests dans les packages CMake, vous pouvez passer : ``--cmake-args -DBUILD_TESTING=0``.

source: If you want to run a single particular test from a package:
fr: Si vous souhaitez exécuter un seul test particulier à partir d'un package :
