Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Tutorials/Beginner-Client-Libraries/Creating-Your-First-ROS2-Package.po
Languages: fr

source: Creating a package
fr: Création d'un paquet

source: **Goal:** Create a new package using either CMake or Python, and run its executable.
fr: **Objectif :** Créer un nouveau package à l'aide de CMake ou de Python, et exécuter son exécutable.

source: **Tutorial level:** Beginner
fr: **Niveau du tutoriel :** Débutant

source: **Time:** 15 minutes
fr: **Durée :** 15 minutes

source: Contents
fr: Contenu

source: Background
fr: Arrière-plan

source: 1 What is a ROS 2 package?
fr: 1 Qu'est-ce qu'un package ROS 2 ?

source: A package can be considered a container for your ROS 2 code. If you want to be able to install your code or share it with others, then you’ll need it organized in a package. With packages, you can release your ROS 2 work and allow others to build and use it easily.
fr: Un paquet peut être considéré comme un conteneur pour votre code ROS 2. Si vous voulez pouvoir installer votre code ou le partager avec d'autres, vous en aurez besoin organisé dans un package. Avec les packages, vous pouvez publier votre travail ROS 2 et permettre à d'autres de le construire et de l'utiliser facilement.

source: Package creation in ROS 2 uses ament as its build system and colcon as its build tool. You can create a package using either CMake or Python, which are officially supported, though other build types do exist.
fr: La création de packages dans ROS 2 utilise ament comme système de construction et colcon comme outil de construction. Vous pouvez créer un package à l'aide de CMake ou de Python, qui sont officiellement pris en charge, bien que d'autres types de construction existent.

source: 2 What makes up a ROS 2 package?
fr: 2 Qu'est-ce qui constitue un package ROS 2 ?

source: ROS 2 Python and CMake packages each have their own minimum required contents:
fr: Les packages ROS 2 Python et CMake ont chacun leur propre contenu minimum requis :

source: ``package.xml`` file containing meta information about the package
fr: ``package.xml`` fichier contenant des méta-informations sur le paquet

source: ``CMakeLists.txt`` file that describes how to build the code within the package
fr: ``CMakeLists.txt`` fichier qui décrit comment construire le code dans le package

source: ``setup.py`` containing instructions for how to install the package
fr: ``setup.py`` contenant des instructions sur la façon d'installer le paquet

source: ``setup.cfg`` is required when a package has executables, so ``ros2 run`` can find them
fr: ``setup.cfg`` est requis lorsqu'un paquet contient des exécutables, donc ``ros2 run`` peut les trouver

source: ``/<package_name>`` - a directory with the same name as your package, used by ROS 2 tools to find your package, contains ``__init__.py``
fr: ``/<package_name>`` - un répertoire portant le même nom que votre package, utilisé par les outils ROS 2 pour trouver votre package, contient ``__init__.py``

source: The simplest possible package may have a file structure that looks like:
fr: Le package le plus simple possible peut avoir une structure de fichier qui ressemble à :

source: 3 Packages in a workspace
fr: 3 packages dans un espace de travail

source: A single workspace can contain as many packages as you want, each in their own folder. You can also have packages of different build types in one workspace (CMake, Python, etc.). You cannot have nested packages.
fr: Un seul espace de travail peut contenir autant de packages que vous le souhaitez, chacun dans son propre dossier. Vous pouvez également avoir des packages de différents types de construction dans un espace de travail (CMake, Python, etc.). Vous ne pouvez pas avoir de packages imbriqués.

source: Best practice is to have a ``src`` folder within your workspace, and to create your packages in there. This keeps the top level of the workspace “clean”.
fr: La meilleure pratique est d'avoir un dossier ``src`` dans votre espace de travail et d'y créer vos packages. Cela permet de garder le niveau supérieur de l'espace de travail "propre".

source: A trivial workspace might look like:
fr: Un espace de travail trivial pourrait ressembler à :

source: Prerequisites
fr: Conditions préalables

source: You should have a ROS 2 workspace after following the instructions in the :doc:`previous tutorial <./Creating-A-Workspace/Creating-A-Workspace>`. You will create your package in this workspace.
fr: Vous devriez avoir un espace de travail ROS 2 après avoir suivi les instructions du :doc:`tutoriel précédent <./Creating-A-Workspace/Creating-A-Workspace>`. Vous allez créer votre package dans cet espace de travail.

source: Tasks
fr: Tâches

source: 1 Create a package
fr: 1 Créer un package

source: First, :doc:`source your ROS 2 installation <../Beginner-CLI-Tools/Configuring-ROS2-Environment>`.
fr: Tout d'abord, :doc:`sourcez votre installation ROS 2 <../Beginner-CLI-Tools/Configuring-ROS2-Environment>`.

source: Let’s use the workspace you created in the :ref:`previous tutorial <new-directory>`, ``ros2_ws``, for your new package.
fr: Utilisons l'espace de travail que vous avez créé dans le :ref:`tutoriel précédent <nouveau-répertoire>`, ``ros2_ws``, pour votre nouveau package.

source: Make sure you are in the ``src`` folder before running the package creation command.
fr: Assurez-vous d'être dans le dossier ``src`` avant d'exécuter la commande de création de paquet.

source: Windows
fr: les fenêtres

source: The command syntax for creating a new package in ROS 2 is:
fr: La syntaxe de commande pour créer un nouveau package dans ROS 2 est :

source: For this tutorial, you will use the optional argument ``--node-name`` which creates a simple Hello World type executable in the package.
fr: Pour ce tutoriel, vous utiliserez l'argument optionnel ``--node-name`` qui crée un simple exécutable de type Hello World dans le package.

source: Enter the following command in your terminal:
fr: Saisissez la commande suivante dans votre terminal :

source: You will now have a new folder within your workspace’s ``src`` directory called ``my_package``.
fr: Vous aurez maintenant un nouveau dossier dans le répertoire ``src`` de votre espace de travail appelé ``my_package``.

source: After running the command, your terminal will return the message:
fr: Après avoir exécuté la commande, votre terminal renverra le message :

source: You can see the automatically generated files for the new package.
fr: Vous pouvez voir les fichiers générés automatiquement pour le nouveau package.

source: 2 Build a package
fr: 2 Créer un package

source: Putting packages in a workspace is especially valuable because you can build many packages at once by running ``colcon build`` in the workspace root. Otherwise, you would have to build each package individually.
fr: Placer des packages dans un espace de travail est particulièrement utile car vous pouvez créer plusieurs packages à la fois en exécutant ``colcon build`` à la racine de l'espace de travail. Sinon, vous devrez créer chaque package individuellement.

source: Return to the root of your workspace:
fr: Retournez à la racine de votre espace de travail :

source: Now you can build your packages:
fr: Vous pouvez maintenant créer vos packages :

source: Windows doesn’t allow long paths, so ``merge-install`` will combine all the paths into the ``install`` directory.
fr: Windows n'autorise pas les longs chemins, donc ``merge-install`` combinera tous les chemins dans le répertoire ``install``.

source: Recall from the last tutorial that you also have the ``ros_tutorials`` packages in your ``ros2_ws``. You might’ve noticed that running ``colcon build`` also built the ``turtlesim`` package. That’s fine when you only have a few packages in your workspace, but when there are many packages, ``colcon build`` can take a long time.
fr: Rappelez-vous du dernier tutoriel que vous avez également les packages ``ros_tutorials`` dans votre ``ros2_ws``. Vous avez peut-être remarqué que l'exécution de ``colcon build`` a également construit le paquet ``turtlesim``. C'est bien quand vous n'avez que quelques packages dans votre espace de travail, mais quand il y a beaucoup de packages, ``colcon build`` peut prendre beaucoup de temps.

source: To build only the ``my_package`` package next time, you can run:
fr: Pour compiler uniquement le package ``my_package`` la prochaine fois, vous pouvez exécuter :

source: 3 Source the setup file
fr: 3 Source du fichier d'installation

source: To use your new package and executable, first open a new terminal and source your main ROS 2 installation.
fr: Pour utiliser votre nouveau package et exécutable, ouvrez d'abord un nouveau terminal et sourcez votre installation principale de ROS 2.

source: Then, from inside the ``ros2_ws`` directory, run the following command to source your workspace:
fr: Ensuite, depuis le répertoire ``ros2_ws``, exécutez la commande suivante pour sourcer votre espace de travail :

source: Now that your workspace has been added to your path, you will be able to use your new package’s executables.
fr: Maintenant que votre espace de travail a été ajouté à votre chemin, vous pourrez utiliser les exécutables de votre nouveau package.

source: 4 Use the package
fr: 4 Utilisez le forfait

source: To run the executable you created using the ``--node-name`` argument during package creation, enter the command:
fr: Pour exécuter l'exécutable que vous avez créé à l'aide de l'argument ``--node-name`` lors de la création du package, entrez la commande :

source: Which will return a message to your terminal:
fr: Ce qui renverra un message à votre terminal :

source: 5 Examine package contents
fr: 5 Examinez le contenu de l'emballage

source: Inside ``ros2_ws/src/my_package``, you will see the files and folders that ``ros2 pkg create`` automatically generated:
fr: Dans ``ros2_ws/src/my_package``, vous verrez les fichiers et dossiers générés automatiquement par ``ros2 pkg create`` :

source: ``my_node.cpp`` is inside the ``src`` directory. This is where all your custom C++ nodes will go in the future.
fr: ``my_node.cpp`` se trouve dans le répertoire ``src``. C'est là que tous vos nœuds C++ personnalisés iront à l'avenir.

source: ``my_node.py`` is inside the ``my_package`` directory. This is where all your custom Python nodes will go in the future.
fr: ``my_node.py`` se trouve dans le répertoire ``my_package``. C'est là que tous vos nœuds Python personnalisés iront à l'avenir.

source: 6 Customize package.xml
fr: 6 Personnaliser package.xml

source: You may have noticed in the return message after creating your package that the fields ``description`` and ``license`` contain ``TODO`` notes. That’s because the package description and license declaration are not automatically set, but are required if you ever want to release your package. The ``maintainer`` field may also need to be filled in.
fr: Vous avez peut-être remarqué dans le message de retour après la création de votre package que les champs ``description`` et ``license`` contiennent des notes ``TODO``. En effet, la description du package et la déclaration de licence ne sont pas automatiquement définies, mais sont requises si vous souhaitez publier votre package. Le champ ``mainteneur`` peut également devoir être rempli.

source: From ``ros2_ws/src/my_package``, open ``package.xml`` using your preferred text editor:
fr: Depuis ``ros2_ws/src/my_package``, ouvrez ``package.xml`` en utilisant votre éditeur de texte préféré :

source: Input your name and email on the ``maintainer`` line if it hasn't been automatically populated for you. Then, edit the ``description`` line to summarize the package:
fr: Entrez votre nom et votre email sur la ligne ``maintainer`` si elle n'a pas été automatiquement remplie pour vous. Ensuite, modifiez la ligne ``description`` pour résumer le package :

source: Then update the ``license`` line. You can read more about open source licenses `here <https://opensource.org/licenses/alphabetical>`__. Since this package is only for practice, it’s safe to use any license. We use ``Apache License 2.0``:
fr: Ensuite, mettez à jour la ligne ``license``. Vous pouvez en savoir plus sur les licences open source `ici <https://opensource.org/licenses/alphabetical>`__. Étant donné que ce package est uniquement destiné à la pratique, vous pouvez utiliser n'importe quelle licence en toute sécurité. Nous utilisons ``Apache License 2.0`` :

source: Don’t forget to save once you’re done editing.
fr: N'oubliez pas de sauvegarder une fois que vous avez terminé l'édition.

source: Below the license tag, you will see some tag names ending with ``_depend``. This is where your ``package.xml`` would list its dependencies on other packages, for colcon to search for. ``my_package`` is simple and doesn’t have any dependencies, but you will see this space being utilized in upcoming tutorials.
fr: Sous la balise de licence, vous verrez des noms de balises se terminant par ``_depend``. C'est là que votre ``package.xml`` listerait ses dépendances sur d'autres packages, pour que colcon les recherche. ``my_package`` est simple et n'a aucune dépendance, mais vous verrez cet espace utilisé dans les prochains tutoriels.

source: You’re all done for now!
fr: Vous avez terminé pour l'instant !

source: The ``setup.py`` file contains the same description, maintainer and license fields as ``package.xml``, so you need to set those as well. They need to match exactly in both files. The version and name (``package_name``) also need to match exactly, and should be automatically populated in both files.
fr: Le fichier ``setup.py`` contient les mêmes champs de description, de responsable et de licence que ``package.xml``, vous devez donc également les définir. Ils doivent correspondre exactement dans les deux fichiers. La version et le nom (``package_name``) doivent également correspondre exactement et doivent être automatiquement renseignés dans les deux fichiers.

source: Open ``setup.py`` with your preferred text editor.
fr: Ouvrez ``setup.py`` avec votre éditeur de texte préféré.

source: Edit the ``maintainer``, ``maintainer_email``, and ``description`` lines to match ``package.xml``.
fr: Modifiez les lignes ``maintainer``, ``maintainer_email`` et ``description`` pour qu'elles correspondent à ``package.xml``.

source: Don’t forget to save the file.
fr: N'oubliez pas de sauvegarder le fichier.

source: Summary
fr: Résumé

source: You’ve created a package to organize your code and make it easy to use for others.
fr: Vous avez créé un package pour organiser votre code et le rendre facile à utiliser pour les autres.

source: Your package was automatically populated with the necessary files, and then you used colcon to build it so you can use its executables in your local environment.
fr: Votre package a été automatiquement rempli avec les fichiers nécessaires, puis vous avez utilisé colcon pour le construire afin que vous puissiez utiliser ses exécutables dans votre environnement local.

source: Next steps
fr: Prochaines étapes

source: Next, let's add something meaningful to a package. You'll start with a simple publisher/subscriber system, which you can choose to write in either :doc:`C++ <./Writing-A-Simple-Cpp-Publisher-And-Subscriber>` or :doc:`Python <./Writing-A-Simple-Py-Publisher-And-Subscriber>`.
fr: Ensuite, ajoutons quelque chose de significatif à un package. Vous commencerez avec un simple système éditeur/abonné, que vous pouvez choisir d'écrire en :doc:`C++ <./Writing-A-Simple-Cpp-Publisher-And-Subscriber>` ou :doc:`Python < ./Writing-A-Simple-Py-Publisher-And-Subscriber>`.
