Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Tutorials/Beginner-Client-Libraries/Custom-ROS2-Interfaces.po
Languages: fr

source: Creating custom msg and srv files
fr: Création de fichiers msg et srv personnalisés

source: **Goal:** Define custom interface files (``.msg`` and ``.srv``) and use them with Python and C++ nodes.
fr: **Objectif :** Définir des fichiers d'interface personnalisés (``.msg`` et ``.srv``) et les utiliser avec les nœuds Python et C++.

source: **Tutorial level:** Beginner
fr: **Niveau du tutoriel :** Débutant

source: **Time:** 20 minutes
fr: **Durée :** 20 minutes

source: Contents
fr: Contenu

source: Background
fr: Arrière-plan

source: In previous tutorials you utilized message and service interfaces to learn about :doc:`topics <../Beginner-CLI-Tools/Understanding-ROS2-Topics/Understanding-ROS2-Topics>`, :doc:`services <../Beginner-CLI-Tools/Understanding-ROS2-Services/Understanding-ROS2-Services>`, and simple publisher/subscriber (:doc:`C++ <./Writing-A-Simple-Cpp-Publisher-And-Subscriber>`/:doc:`Python<./Writing-A-Simple-Py-Publisher-And-Subscriber>`) and service/client (:doc:`C++ <./Writing-A-Simple-Cpp-Service-And-Client>`/:doc:`Python<./Writing-A-Simple-Py-Service-And-Client>`) nodes. The interfaces you used were predefined in those cases.
fr: Dans les didacticiels précédents, vous avez utilisé des interfaces de message et de service pour en savoir plus sur :doc:`topics <../Beginner-CLI-Tools/Understanding-ROS2-Topics/Understanding-ROS2-Topics>`, :doc:`services <../ Beginner-CLI-Tools/Understanding-ROS2-Services/Understanding-ROS2-Services>`, et simple éditeur/abonné (:doc:`C++ <./Writing-A-Simple-Cpp-Publisher-And-Subscriber>`/ :doc:`Python<./Writing-A-Simple-Py-Publisher-And-Subscriber>`) et service/client (:doc:`C++ <./Writing-A-Simple-Cpp-Service-And-Client >`/:doc:`Python<./Writing-A-Simple-Py-Service-And-Client>`). Les interfaces que vous avez utilisées ont été prédéfinies dans ces cas.

source: While it’s good practice to use predefined interface definitions, you will probably need to define your own messages and services sometimes as well. This tutorial will introduce you to the simplest method of creating custom interface definitions.
fr: Bien qu'il soit recommandé d'utiliser des définitions d'interface prédéfinies, vous devrez probablement également définir vos propres messages et services. Ce didacticiel vous présentera la méthode la plus simple de création de définitions d'interface personnalisées.

source: Prerequisites
fr: Conditions préalables

source: You should have a :doc:`ROS 2 workspace <./Creating-A-Workspace/Creating-A-Workspace>`.
fr: Vous devriez avoir un :doc:`espace de travail ROS 2 <./Creating-A-Workspace/Creating-A-Workspace>`.

source: This tutorial also uses the packages created in the publisher/subscriber (:doc:`C++ <./Writing-A-Simple-Cpp-Publisher-And-Subscriber>` and :doc:`Python<./Writing-A-Simple-Py-Publisher-And-Subscriber>`) and service/client (:doc:`C++ <./Writing-A-Simple-Cpp-Service-And-Client>` and :doc:`Python<./Writing-A-Simple-Py-Service-And-Client>`) tutorials to try out the new custom messages.
fr: Ce tutoriel utilise également les packages créés dans l'éditeur/abonné (:doc:`C++ <./Writing-A-Simple-Cpp-Publisher-And-Subscriber>` et :doc:`Python<./Writing-A-Simple -Py-Publisher-And-Subscriber>`) et service/client (:doc:`C++ <./Writing-A-Simple-Cpp-Service-And-Client>` et :doc:`Python<./Writing- A-Simple-Py-Service-And-Client>`) tutoriels pour essayer les nouveaux messages personnalisés.

source: Tasks
fr: Tâches

source: 1 Create a new package
fr: 1 Créer un nouveau package

source: For this tutorial you will be creating custom ``.msg`` and ``.srv`` files in their own package, and then utilizing them in a separate package. Both packages should be in the same workspace.
fr: Pour ce didacticiel, vous allez créer des fichiers personnalisés ``.msg`` et ``.srv`` dans leur propre package, puis les utiliser dans un package séparé. Les deux packages doivent se trouver dans le même espace de travail.

source: Since we will use the pub/sub and service/client packages created in earlier tutorials, make sure you are in the same workspace as those packages (``ros2_ws/src``), and then run the following command to create a new package:
fr: Puisque nous allons utiliser les packages pub/sub et service/client créés dans les tutoriels précédents, assurez-vous que vous êtes dans le même espace de travail que ces packages (``ros2_ws/src``), puis exécutez la commande suivante pour créer un nouveau package :

source: ``tutorial_interfaces`` is the name of the new package. Note that it is a CMake package; there currently isn’t a way to generate a ``.msg`` or ``.srv`` file in a pure Python package. You can create a custom interface in a CMake package, and then use it in a Python node, which will be covered in the last section.
fr: ``tutorial_interfaces`` est le nom du nouveau paquet. Notez qu'il s'agit d'un package CMake ; il n'existe actuellement aucun moyen de générer un fichier ``.msg`` ou ``.srv`` dans un package Python pur. Vous pouvez créer une interface personnalisée dans un package CMake, puis l'utiliser dans un nœud Python, qui sera traité dans la dernière section.

source: The ``.msg`` and ``.srv`` files are required to be placed in directories called ``msg`` and ``srv`` respectively. Create the directories in ``ros2_ws/src/tutorial_interfaces``:
fr: Les fichiers ``.msg`` et ``.srv`` doivent être placés dans des répertoires appelés respectivement ``msg`` et ``srv``. Créez les répertoires dans ``ros2_ws/src/tutorial_interfaces`` :

source: 2 Create custom definitions
fr: 2 Créer des définitions personnalisées

source: 2.1 msg definition
fr: 2.1 définition des messages

source: In the ``tutorial_interfaces/msg`` directory you just created, make a new file called ``Num.msg`` with one line of code declaring its data structure:
fr: Dans le répertoire ``tutorial_interfaces/msg`` que vous venez de créer, créez un nouveau fichier appelé ``Num.msg`` avec une ligne de code déclarant sa structure de données :

source: This is a custom message that transfers a single 64-bit integer called ``num``.
fr: Il s'agit d'un message personnalisé qui transfère un seul entier 64 bits appelé ``num``.

source: Also in the ``tutorial_interfaces/msg`` directory you just created, make a new file called ``Sphere.msg`` with the following content:
fr: Toujours dans le répertoire ``tutorial_interfaces/msg`` que vous venez de créer, créez un nouveau fichier appelé ``Sphere.msg`` avec le contenu suivant :

source: This custom message uses a message from another message package (``geometry_msgs/Point`` in this case).
fr: Ce message personnalisé utilise un message d'un autre package de message (``geometry_msgs/Point`` dans ce cas).

source: 2.2 srv definition
fr: 2.2 définition srv

source: Back in the ``tutorial_interfaces/srv`` directory you just created, make a new file called ``AddThreeInts.srv`` with the following request and response structure:
fr: De retour dans le répertoire ``tutorial_interfaces/srv`` que vous venez de créer, créez un nouveau fichier appelé ``AddThreeInts.srv`` avec la structure de requête et de réponse suivante :

source: This is your custom service that requests three integers named ``a``, ``b``, and ``c``, and responds with an integer called ``sum``.
fr: Il s'agit de votre service personnalisé qui demande trois entiers nommés ``a``, ``b`` et ``c``, et répond avec un entier appelé ``sum``.

source: To convert the interfaces you defined into language-specific code (like C++ and Python) so that they can be used in those languages, add the following lines to ``CMakeLists.txt``:
fr: Pour convertir les interfaces que vous avez définies en code spécifique à un langage (comme C++ et Python) afin qu'elles puissent être utilisées dans ces langages, ajoutez les lignes suivantes à ``CMakeLists.txt`` :

source: The library name must match ${PROJECT_NAME} (see https://github.com/ros2/rosidl/issues/441#issuecomment-591025515).
fr: Le nom de la bibliothèque doit correspondre à ${PROJECT_NAME} (voir https://github.com/ros2/rosidl/issues/441#issuecomment-591025515).

source: 4 ``package.xml``
fr: 4 ``paquet.xml``

source: Because the interfaces rely on ``rosidl_default_generators`` for generating language-specific code, you need to declare a dependency on it. The ``<exec_depend>`` tag is used to specify runtime or execution-stage dependencies and the ``rosidl_interface_packages`` is the name of the dependency group to which the package belongs, declared using the ``<member_of_group>`` tag.
fr: Parce que les interfaces s'appuient sur ``rosidl_default_generators`` pour générer du code spécifique au langage, vous devez déclarer une dépendance sur celui-ci. La balise ``<exec_depend>`` est utilisée pour spécifier les dépendances d'exécution ou d'étape d'exécution et ``rosidl_interface_packages`` est le nom du groupe de dépendances auquel appartient le package, déclaré à l'aide de la balise ``<member_of_group>`` .

source: Add the following lines to ``package.xml``
fr: Ajoutez les lignes suivantes à ``package.xml``

source: 5 Build the ``tutorial_interfaces`` package
fr: 5 Construisez le package ``tutorial_interfaces``

source: Now that all the parts of your custom interfaces package are in place, you can build the package. In the root of your workspace (``~/ros2_ws``), run the following command:
fr: Maintenant que toutes les parties de votre package d'interfaces personnalisées sont en place, vous pouvez créer le package. À la racine de votre espace de travail (``~/ros2_ws``), exécutez la commande suivante :

source: Windows
fr: les fenêtres

source: Now the interfaces will be discoverable by other ROS 2 packages.
fr: Désormais, les interfaces seront détectables par d'autres packages ROS 2.

source: 6 Confirm msg and srv creation
fr: 6 Confirmer la création de msg et srv

source: In a new terminal, run the following command from within your workspace (``ros2_ws``) to source it:
fr: Dans un nouveau terminal, exécutez la commande suivante depuis votre espace de travail (``ros2_ws``) pour le source :

source: Now you can confirm that your interface creation worked by using the ``ros2 interface show`` command:
fr: Vous pouvez maintenant confirmer que la création de votre interface a fonctionné en utilisant la commande ``ros2 interface show`` :

source: should return:
fr: doit retourner :

source: And
fr: Et

source: 7 Test the new interfaces
fr: 7 Testez les nouvelles interfaces

source: For this step you can use the packages you created in previous tutorials. A few simple modifications to the nodes, ``CMakeLists`` and ``package`` files will allow you to use your new interfaces.
fr: Pour cette étape, vous pouvez utiliser les packages que vous avez créés dans les didacticiels précédents. Quelques modifications simples sur les nœuds, les fichiers ``CMakeLists`` et ``package`` vous permettront d'utiliser vos nouvelles interfaces.

source: 7.1 Testing ``Num.msg`` with pub/sub
fr: 7.1 Tester ``Num.msg`` avec pub/sub

source: With some slight modifications to the publisher/subscriber package created in a previous tutorial (:doc:`C++ <./Writing-A-Simple-Cpp-Publisher-And-Subscriber>` or :doc:`Python <./Writing-A-Simple-Py-Publisher-And-Subscriber>`), you can see ``Num.msg`` in action. Since you’ll be changing the standard string msg to a numerical one, the output will be slightly different.
fr: Avec quelques légères modifications du package éditeur/abonné créé dans un tutoriel précédent (:doc:`C++ <./Writing-A-Simple-Cpp-Publisher-And-Subscriber>` ou :doc:`Python <./Writing- A-Simple-Py-Publisher-And-Subscriber>`), vous pouvez voir ``Num.msg`` en action. Puisque vous allez changer la chaîne standard msg en une chaîne numérique, la sortie sera légèrement différente.

source: Publisher:
fr: Éditeur:

source: Subscriber:
fr: Abonné:

source: Add the following lines (C++ only):
fr: Ajoutez les lignes suivantes (C++ uniquement) :

source: Add the following line:
fr: Ajoutez la ligne suivante :

source: After making the above edits and saving all the changes, build the package:
fr: Après avoir effectué les modifications ci-dessus et enregistré toutes les modifications, créez le package :

source: On Windows:
fr: Sous Windows :

source: Then open two new terminals, source ``ros2_ws`` in each, and run:
fr: Ouvrez ensuite deux nouveaux terminaux, source ``ros2_ws`` dans chacun, et exécutez :

source: Since ``Num.msg`` relays only an integer, the talker should only be publishing integer values, as opposed to the string it published previously:
fr: Étant donné que ``Num.msg`` ne relaie qu'un entier, le locuteur ne devrait publier que des valeurs entières, contrairement à la chaîne qu'il a publiée précédemment :

source: 7.2 Testing ``AddThreeInts.srv`` with service/client
fr: 7.2 Tester ``AddThreeInts.srv`` avec service/client

source: With some slight modifications to the service/client package created in a previous tutorial (:doc:`C++ <./Writing-A-Simple-Cpp-Service-And-Client>` or :doc:`Python <./Writing-A-Simple-Py-Service-And-Client>`), you can see ``AddThreeInts.srv`` in action. Since you’ll be changing the original two integer request srv to a three integer request srv, the output will be slightly different.
fr: Avec quelques légères modifications du package service/client créé dans un tutoriel précédent (:doc:`C++ <./Writing-A-Simple-Cpp-Service-And-Client>` ou :doc:`Python <./Writing- A-Simple-Py-Service-And-Client>`), vous pouvez voir ``AddThreeInts.srv`` en action. Étant donné que vous allez changer le srv de requête à deux entiers d'origine en un srv de requête à trois entiers, la sortie sera légèrement différente.

source: Summary
fr: Résumé

source: In this tutorial, you learned how to create custom interfaces in their own package and how to utilize those interfaces from within other packages.
fr: Dans ce didacticiel, vous avez appris à créer des interfaces personnalisées dans leur propre package et à utiliser ces interfaces à partir d'autres packages.

source: This is a simple method of interface creation and utilization. You can learn more about interfaces :doc:`here <../../Concepts/About-ROS-Interfaces>`.
fr: Il s'agit d'une méthode simple de création et d'utilisation de l'interface. Vous pouvez en savoir plus sur les interfaces :doc:`ici <../../Concepts/About-ROS-Interfaces>`.

source: Next steps
fr: Prochaines étapes

source: The :doc:`next tutorial <./Single-Package-Define-And-Use-Interface>` covers more ways to use interfaces in ROS 2.
fr: Le :doc:`tutoriel suivant <./Single-Package-Define-And-Use-Interface>` couvre d'autres façons d'utiliser les interfaces dans ROS 2.
