Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Tutorials/Beginner-Client-Libraries/Getting-Started-With-Ros2doctor.po
Languages: fr

source: Using ``ros2doctor`` to identify issues
fr: Utiliser ``ros2doctor`` pour identifier les problèmes

source: **Goal:** Identify issues in your ROS 2 setup using the ``ros2doctor`` tool.
fr: **Objectif :** Identifiez les problèmes dans votre configuration ROS 2 à l'aide de l'outil ``ros2doctor``.

source: **Tutorial level:** Beginner
fr: **Niveau du tutoriel :** Débutant

source: **Time:** 10 minutes
fr: **Durée :** 10 minutes

source: Contents
fr: Contenu

source: Background
fr: Arrière-plan

source: When your ROS 2 setup is not running as expected, you can check its settings with the ``ros2doctor`` tool.
fr: Lorsque votre configuration ROS 2 ne fonctionne pas comme prévu, vous pouvez vérifier ses paramètres avec l'outil ``ros2doctor``.

source: ``ros2doctor`` checks all aspects of ROS 2, including platform, version, network, environment, running systems and more, and warns you about possible errors and reasons for issues.
fr: ``ros2doctor`` vérifie tous les aspects de ROS 2, y compris la plate-forme, la version, le réseau, l'environnement, les systèmes en cours d'exécution et plus encore, et vous avertit des erreurs possibles et des raisons des problèmes.

source: Prerequisites
fr: Conditions préalables

source: ``ros2doctor`` is part of the ``ros2cli`` package. As long as you have ``ros2cli`` installed (which any normal install should have), you will be able to use ``ros2doctor``.
fr: ``ros2doctor`` fait partie du paquet ``ros2cli``. Tant que ``ros2cli`` est installé (ce que toute installation normale devrait avoir), vous pourrez utiliser ``ros2doctor``.

source: This tutorial uses :doc:`turtlesim <../Beginner-CLI-Tools/Introducing-Turtlesim/Introducing-Turtlesim>` to illustrate some of the examples.
fr: Ce tutoriel utilise :doc:`turtlesim <../Beginner-CLI-Tools/Introducing-Turtlesim/Introducing-Turtlesim>` pour illustrer certains des exemples.

source: Tasks
fr: Tâches

source: 1 Check your setup
fr: 1 Vérifiez votre configuration

source: Let’s examine your general ROS 2 setup as a whole with ``ros2doctor``. First, source ROS 2 in a new terminal, then enter the command:
fr: Examinons votre configuration générale de ROS 2 dans son ensemble avec ``ros2doctor``. Tout d'abord, sourcez ROS 2 dans un nouveau terminal, puis entrez la commande :

source: This will conduct checks over all your setup modules and return warnings and errors.
fr: Cela effectuera des vérifications sur tous vos modules de configuration et renverra des avertissements et des erreurs.

source: If your ROS 2 setup is in perfect shape, you’ll see a message similar to this:
fr: Si votre configuration ROS 2 est en parfait état, vous verrez un message similaire à celui-ci :

source: However, it’s not unusual to have a few warnings returned. A ``UserWarning`` doesn’t mean your setup is unusable; it’s more likely just an indication that something is configured in a way that’s not ideal.
fr: Cependant, il n'est pas rare que quelques avertissements soient renvoyés. Un ``UserWarning`` ne signifie pas que votre configuration est inutilisable ; c'est plus probablement juste une indication que quelque chose est configuré d'une manière qui n'est pas idéale.

source: If you do receive a warning, it will look something like this:
fr: Si vous recevez un avertissement, il ressemblera à ceci :

source: For example, ``ros2doctor`` will find this warning if you’re using an unstable ROS 2 distribution:
fr: Par exemple, ``ros2doctor`` trouvera cet avertissement si vous utilisez une distribution ROS 2 instable :

source: If ``ros2doctor`` only finds warnings in your system, you will still receive the ``All <n> checks passed`` message.
fr: Si ``ros2doctor`` ne trouve que des avertissements dans votre système, vous recevrez toujours le message ``Tous les <n> contrôles réussis``.

source: Most checks are categorized as warnings as opposed to errors. It’s mostly up to you, the user, to determine the importance of the feedback ``ros2doctor`` returns. If it does find a rare error in your setup, indicated by ``UserWarning: ERROR:``, the check is considered failed.
fr: La plupart des vérifications sont classées comme des avertissements plutôt que comme des erreurs. C'est principalement à vous, l'utilisateur, de déterminer l'importance des retours de ``ros2doctor``. S'il trouve une erreur rare dans votre configuration, indiquée par ``UserWarning: ERROR:``, la vérification est considérée comme ayant échoué.

source: You will see a message similar to this following the list of issue feedback:
fr: Un message semblable à celui-ci s'affichera à la suite de la liste des commentaires sur les problèmes :

source: An error indicates the system is missing important settings or functions that are crucial to ROS 2. Errors should be addressed to ensure the system functions properly.
fr: Une erreur indique que le système manque de paramètres ou de fonctions importants qui sont cruciaux pour ROS 2. Les erreurs doivent être corrigées pour garantir le bon fonctionnement du système.

source: 2 Check a system
fr: 2 Vérifier un système

source: You can also examine a running ROS 2 system to identify possible causes for issues. To see ``ros2doctor`` working on a running system, let's run Turtlesim, which has nodes actively communicating with each other.
fr: Vous pouvez également examiner un système ROS 2 en cours d'exécution pour identifier les causes possibles des problèmes. Pour voir ``ros2doctor`` fonctionner sur un système en cours d'exécution, lançons Turtlesim, qui a des nœuds qui communiquent activement entre eux.

source: Start up the system by opening a new terminal, sourcing ROS 2, and entering the command:
fr: Démarrez le système en ouvrant un nouveau terminal, en alimentant ROS 2 et en saisissant la commande :

source: Open another terminal and source ROS 2 to run the teleop controls:
fr: Ouvrez un autre terminal et sourcez ROS 2 pour exécuter les commandes téléop :

source: Now run ``ros2doctor`` again in its own terminal. You will see the warnings and errors you had the last time you ran ``ros2doctor`` on your setup, if you had any. Following those will be a couple new warnings relating to the system itself:
fr: Maintenant, exécutez à nouveau ``ros2doctor`` dans son propre terminal. Vous verrez les avertissements et les erreurs que vous aviez la dernière fois que vous avez exécuté ``ros2doctor`` sur votre configuration, si vous en aviez. Suivront quelques nouveaux avertissements concernant le système lui-même :

source: It seems that the ``/turtlesim`` node publishes data to two topics that aren’t being subscribed to, and ``ros2doctor`` thinks this could possibly lead to issues.
fr: Il semble que le nœud ``/turtlesim`` publie des données sur deux sujets auxquels vous n'êtes pas abonné, et ``ros2doctor`` pense que cela pourrait éventuellement entraîner des problèmes.

source: If you run commands to echo the ``/color_sensor`` and ``/pose`` topics, those warnings will disappear because the publishers will have subscribers.
fr: Si vous exécutez des commandes pour renvoyer les sujets ``/color_sensor`` et ``/pose``, ces avertissements disparaîtront car les éditeurs auront des abonnés.

source: You can try this by opening two new terminals while turtlesim is still running, sourcing ROS 2 in each, and running each of the following commands in their own terminal:
fr: Vous pouvez essayer cela en ouvrant deux nouveaux terminaux pendant que turtlesim est toujours en cours d'exécution, en alimentant ROS 2 dans chacun et en exécutant chacune des commandes suivantes dans leur propre terminal :

source: Then run ``ros2doctor`` in its terminal again. The ``publisher without subscriber`` warnings will be gone. (Make sure to enter ``Ctrl+C`` in the terminals where you ran ``echo``).
fr: Ensuite, exécutez à nouveau ``ros2doctor`` dans son terminal. Les avertissements ``éditeur sans abonné`` auront disparu. (Assurez-vous d'entrer ``Ctrl+C`` dans les terminaux où vous avez exécuté ``echo``).

source: Now try exiting either the turtlesim window or quitting the teleop and running ``ros2doctor`` again. You’ll see more warnings indicating ``publisher without subscriber`` or ``subscriber without publisher`` for different topics, now that one node in the system isn’t available.
fr: Essayez maintenant de quitter la fenêtre turtlesim ou de quitter le teleop et de relancer ``ros2doctor``. Vous verrez plus d'avertissements indiquant ``éditeur sans abonné`` ou ``abonné sans éditeur`` pour différents sujets, maintenant qu'un nœud du système n'est plus disponible.

source: In a complex system with many nodes, ``ros2doctor`` would be invaluable for identifying possible reasons for communication issues.
fr: Dans un système complexe avec de nombreux nœuds, ``ros2doctor`` serait inestimable pour identifier les raisons possibles des problèmes de communication.

source: 3 Get a full report
fr: 3 Obtenez un rapport complet

source: While ``ros2doctor`` will let you know warnings about your network, system, etc., running it with the ``--report`` argument will give you much more detail to help you analyze issues.
fr: Alors que ``ros2doctor`` vous informera des avertissements concernant votre réseau, votre système, etc., l'exécuter avec l'argument ``--report`` vous donnera beaucoup plus de détails pour vous aider à analyser les problèmes.

source: You might want to use ``--report`` if you get a warning about your network setup and want to find out exactly what part of your configuration is causing the warning.
fr: Vous voudrez peut-être utiliser ``--report`` si vous recevez un avertissement concernant la configuration de votre réseau et que vous souhaitez savoir exactement quelle partie de votre configuration est à l'origine de l'avertissement.

source: It’s also very helpful when you need to open a support ticket to get help with ROS 2. You can copy and paste the relevant parts of your report into the ticket so the people helping you can better understand your environment and provide better assistance.
fr: C'est également très utile lorsque vous devez ouvrir un ticket d'assistance pour obtenir de l'aide avec ROS 2. Vous pouvez copier et coller les parties pertinentes de votre rapport dans le ticket afin que les personnes qui vous aident puissent mieux comprendre votre environnement et fournir une meilleure assistance.

source: To get a full report, enter the following command in the terminal:
fr: Pour obtenir un rapport complet, saisissez la commande suivante dans le terminal :

source: Which will return a list of information categorized into five groups:
fr: Ce qui renverra une liste d'informations classées en cinq groupes :

source: You can crosscheck the information here against the warnings you get from running ``ros2 doctor``. For example, if ``ros2doctor`` returned the warning (mentioned earlier) that your distribution is “not fully supported or tested”, you might take a look at the ``ROS 2 INFORMATION`` section of the report:
fr: Vous pouvez comparer les informations ici avec les avertissements que vous recevez en exécutant ``ros2 doctor``. Par exemple, si ``ros2doctor`` a renvoyé l'avertissement (mentionné précédemment) indiquant que votre distribution n'est "pas entièrement prise en charge ou testée", vous pouvez consulter la section ``ROS 2 INFORMATION`` du rapport :

source: Here you can see the ``distribution status`` is ``prerelease``, which explains why it’s not fully supported.
fr: Ici, vous pouvez voir que le ``statut de distribution`` est ``prerelease``, ce qui explique pourquoi il n'est pas entièrement pris en charge.

source: Summary
fr: Résumé

source: ``ros2doctor`` will inform you of problems in your ROS 2 setup and running systems. You can get a deeper look at information behind those warnings by using the ``--report`` argument.
fr: ``ros2doctor`` vous informera des problèmes de configuration et d'exécution de ROS 2. Vous pouvez obtenir un aperçu plus approfondi des informations derrière ces avertissements en utilisant l'argument ``--report``.

source: Keep in mind, ``ros2doctor`` is not a debug tool; it won’t help with errors in your code or on the implementation side of your system.
fr: Gardez à l'esprit que ``ros2doctor`` n'est pas un outil de débogage ; cela n'aidera pas les erreurs dans votre code ou du côté de la mise en œuvre de votre système.

source: Related content
fr: Contenu connexe

source: `ros2doctor’s README <https://github.com/ros2/ros2cli/tree/rolling/ros2doctor>`__ will tell you more about different arguments. You might want to take a look around the ``ros2doctor`` repo as well, since it's fairly beginner friendly and a great place to get started with contributing.
fr: `Le fichier README de ros2doctor <https://github.com/ros2/ros2cli/tree/rolling/ros2doctor>`__ vous en dira plus sur les différents arguments. Vous voudrez peut-être également jeter un coup d'œil au référentiel ``ros2doctor``, car il est assez convivial pour les débutants et constitue un excellent endroit pour commencer à contribuer.

source: Next steps
fr: Prochaines étapes

source: You’ve completed the beginner level tutorials!
fr: Vous avez terminé les didacticiels de niveau débutant !
