Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Tutorials/Beginner-Client-Libraries/Single-Package-Define-And-Use-Interface.po
Languages: fr

source: Implementing custom interfaces
fr: Implémentation d'interfaces personnalisées

source: **Goal:** Learn more ways to implement custom interfaces in ROS 2
fr: **Objectif :** Découvrir d'autres façons d'implémenter des interfaces personnalisées dans ROS 2

source: **Tutorial level:** Beginner
fr: **Niveau du tutoriel :** Débutant

source: **Time:** 15 minutes
fr: **Durée :** 15 minutes

source: Contents
fr: Contenu

source: Background
fr: Arrière-plan

source: In a :doc:`previous tutorial <./Custom-ROS2-Interfaces>`, you learned how to create custom msg and srv interfaces.
fr: Dans un :doc:`tutoriel précédent <./Custom-ROS2-Interfaces>`, vous avez appris à créer des interfaces msg et srv personnalisées.

source: While best practice is to declare interfaces in dedicated interface packages, sometimes it can be convenient to declare, create and use an interface all in one package.
fr: Bien que la meilleure pratique consiste à déclarer les interfaces dans des packages d'interface dédiés, il peut parfois être pratique de déclarer, de créer et d'utiliser une interface dans un seul package.

source: Recall that interfaces can currently only be defined in CMake packages. It is possible, however, to have Python libraries and nodes in CMake packages (using `ament_cmake_python <https://github.com/ament/ament_cmake/tree/rolling/ament_cmake_python>`_), so you could define interfaces and Python nodes together in one package. We'll use a CMake package and C++ nodes here for the sake of simplicity.
fr: Rappelez-vous que les interfaces ne peuvent actuellement être définies que dans les packages CMake. Il est cependant possible d'avoir des bibliothèques et des nœuds Python dans les packages CMake (en utilisant `ament_cmake_python <https://github.com/ament/ament_cmake/tree/rolling/ament_cmake_python>`_), vous pouvez donc définir des interfaces et des nœuds Python ensemble dans un seul paquet. Nous utiliserons ici un package CMake et des nœuds C++ par souci de simplicité.

source: This tutorial will focus on the msg interface type, but the steps here are applicable to all interface types.
fr: Ce didacticiel se concentrera sur le type d'interface msg, mais les étapes ici sont applicables à tous les types d'interface.

source: Prerequisites
fr: Conditions préalables

source: We assume you've reviewed the basics in the :doc:`./Custom-ROS2-Interfaces` tutorial before working through this one.
fr: Nous supposons que vous avez passé en revue les bases du didacticiel :doc:`./Custom-ROS2-Interfaces` avant de travailler sur celui-ci.

source: You should have :doc:`ROS 2 installed <../../Installation>`, a :doc:`workspace <./Creating-A-Workspace/Creating-A-Workspace>`, and an understanding of :doc:`creating packages <./Creating-Your-First-ROS2-Package>`.
fr: Vous devez avoir :doc:`ROS 2 installé <../../Installation>`, un :doc:`workspace <./Creating-A-Workspace/Creating-A-Workspace>` et une compréhension de :doc :`création de packages <./Creating-Your-First-ROS2-Package>`.

source: As always, don’t forget to :doc:`source ROS 2 <../Beginner-CLI-Tools/Configuring-ROS2-Environment>` in every new terminal you open.
fr: Comme toujours, n'oubliez pas de :doc:`source ROS 2 <../Beginner-CLI-Tools/Configuring-ROS2-Environment>` dans chaque nouveau terminal que vous ouvrez.

source: Tasks
fr: Tâches

source: 1 Create a package
fr: 1 Créer un package

source: In your workspace ``src`` directory, create a package ``more_interfaces`` and make a folder within it for msg files:
fr: Dans le répertoire ``src`` de votre espace de travail, créez un package ``more_interfaces`` et créez-y un dossier pour les fichiers msg :

source: 2 Create a msg file
fr: 2 Créer un fichier msg

source: Inside ``more_interfaces/msg``, create a new file ``AddressBook.msg``
fr: Dans ``more_interfaces/msg``, créez un nouveau fichier ``AddressBook.msg``

source: Paste the following code to create a message meant to carry information about an individual:
fr: Collez le code suivant pour créer un message destiné à transmettre des informations sur un individu :

source: This message is composed of 5 fields:
fr: Ce message est composé de 5 champs :

source: first_name: of type string
fr: prénom : de type chaîne

source: last_name: of type string
fr: nom_de_famille : de type chaîne

source: gender: of type bool, that can be either MALE or FEMALE
fr: genre : de type bool, qui peut être soit MALE soit FEMALE

source: age: of type uint8
fr: âge : de type uint8

source: address: of type string
fr: adresse : de type chaîne

source: Notice that it's possible to set default values for fields within the message definition. See :doc:`../../Concepts/About-ROS-Interfaces` for more ways you can customize interfaces.
fr: Notez qu'il est possible de définir des valeurs par défaut pour les champs dans la définition du message. Voir :doc:`../../Concepts/About-ROS-Interfaces` pour plus de façons de personnaliser les interfaces.

source: Next, we need to make sure that the msg file is turned into source code for C++, Python, and other languages.
fr: Ensuite, nous devons nous assurer que le fichier msg est transformé en code source pour C++, Python et d'autres langages.

source: 2.1 Build a msg file
fr: 2.1 Construire un fichier msg

source: Open ``package.xml``, and add the following lines:
fr: Ouvrez ``package.xml`` et ajoutez les lignes suivantes :

source: Note that at build time, we need ``rosidl_default_generators``, while at runtime, we only need ``rosidl_default_runtime``.
fr: Notez qu'au moment de la construction, nous avons besoin de ``rosidl_default_generators``, tandis qu'au moment de l'exécution, nous n'avons besoin que de ``rosidl_default_runtime``.

source: Open ``CMakeLists.txt`` and add the following lines:
fr: Ouvrez ``CMakeLists.txt`` et ajoutez les lignes suivantes :

source: Find the package that generates message code from msg/srv files:
fr: Recherchez le package qui génère le code de message à partir des fichiers msg/srv :

source: Declare the list of messages you want to generate:
fr: Déclarez la liste des messages que vous souhaitez générer :

source: By adding the .msg files manually, we make sure that CMake knows when it has to reconfigure the project after you add other .msg files.
fr: En ajoutant les fichiers .msg manuellement, nous nous assurons que CMake sait quand il doit reconfigurer le projet après avoir ajouté d'autres fichiers .msg.

source: Generate the messages:
fr: Générez les messages :

source: Also make sure you export the message runtime dependency:
fr: Assurez-vous également d'exporter la dépendance d'exécution du message :

source: Now you're ready to generate source files from your msg definition. We'll skip the compile step for now as we do it all together below in step 4.
fr: Vous êtes maintenant prêt à générer des fichiers source à partir de votre définition msg. Nous allons ignorer l'étape de compilation pour l'instant car nous le faisons tous ensemble ci-dessous à l'étape 4.

source: 2.2 (Extra) Set multiple interfaces
fr: 2.2 (Extra) Définir plusieurs interfaces

source: You can use ``set`` to neatly list all of your interfaces:
fr: Vous pouvez utiliser ``set`` pour lister soigneusement toutes vos interfaces :

source: And generate all lists at once like so:
fr: Et générez toutes les listes à la fois comme ceci :

source: 3 Use an interface from the same package
fr: 3 Utiliser une interface du même package

source: Now we can start writing code that uses this message.
fr: Nous pouvons maintenant commencer à écrire du code qui utilise ce message.

source: In ``more_interfaces/src`` create a file called ``publish_address_book.cpp`` and paste the following code:
fr: Dans ``more_interfaces/src`` créez un fichier appelé ``publish_address_book.cpp`` et collez le code suivant :

source: 3.1 The code explained
fr: 3.1 Le code expliqué

source: Include the header of our newly created ``AddressBook.msg``.
fr: Incluez l'en-tête de notre nouveau ``AddressBook.msg``.

source: Create a node and an ``AddressBook`` publisher.
fr: Créez un nœud et un éditeur ``AddressBook``.

source: Create a callback to publish the messages periodically.
fr: Créez un rappel pour publier périodiquement les messages.

source: Create an ``AddressBook`` message instance that we will later publish.
fr: Créez une instance de message ``AddressBook`` que nous publierons plus tard.

source: Populate ``AddressBook`` fields.
fr: Remplir les champs ``Carnet d'adresses``.

source: Finally send the message periodically.
fr: Enfin, envoyez le message périodiquement.

source: Create a 1 second timer to call our ``publish_msg`` function every second.
fr: Créez un minuteur de 1 seconde pour appeler notre fonction ``publish_msg`` toutes les secondes.

source: 3.2 Build the publisher
fr: 3.2 Créer l'éditeur

source: We need to create a new target for this node in the ``CMakeLists.txt``:
fr: Nous devons créer une nouvelle cible pour ce nœud dans le ``CMakeLists.txt`` :

source: 3.3 Link against the interface
fr: 3.3 Lien contre l'interface

source: In order to use the messages generated in the same package we need to use the following CMake code:
fr: Pour utiliser les messages générés dans le même package, nous devons utiliser le code CMake suivant :

source: This finds the relevant generated C++ code from ``AddressBook.msg`` and allows your target to link against it.
fr: Cela trouve le code C++ généré pertinent à partir de ``AddressBook.msg`` et permet à votre cible de s'y connecter.

source: You may have noticed that this step was not necessary when the interfaces being used were from a package that was built separately. This CMake code is only required when you want to use interfaces in the same package as the one in which they are used.
fr: Vous avez peut-être remarqué que cette étape n'était pas nécessaire lorsque les interfaces utilisées provenaient d'un package construit séparément. Ce code CMake n'est requis que lorsque vous souhaitez utiliser des interfaces dans le même package que celui dans lequel elles sont utilisées.

source: 4 Try it out
fr: 4 Essayez-le

source: Return to the root of the workspace to build the package:
fr: Revenez à la racine de l'espace de travail pour créer le package :

source: Windows
fr: les fenêtres

source: Then source the workspace and run the publisher:
fr: Sourcez ensuite l'espace de travail et exécutez l'éditeur :

source: Or using Powershell:
fr: Ou en utilisant Powershell :

source: You should see the publisher relaying the msg you defined, including the values you set in ``publish_address_book.cpp``.
fr: Vous devriez voir l'éditeur relayer le message que vous avez défini, y compris les valeurs que vous avez définies dans ``publish_address_book.cpp``.

source: To confirm the message is being published on the ``address_book`` topic, open another terminal, source the workspace, and call ``topic echo``:
fr: Pour confirmer que le message est publié sur le sujet ``address_book``, ouvrez un autre terminal, sourcez l'espace de travail et appelez ``topic echo`` :

source: We won't create a subscriber in this tutorial, but you can try to write one yourself for practice (use :doc:`./Writing-A-Simple-Cpp-Publisher-And-Subscriber` to help).
fr: Nous ne créerons pas d'abonné dans ce didacticiel, mais vous pouvez essayer d'en écrire un vous-même pour vous entraîner (utilisez :doc:`./Writing-A-Simple-Cpp-Publisher-And-Subscriber` pour vous aider).

source: 5 (Extra) Use an existing interface definition
fr: 5 (Extra) Utiliser une définition d'interface existante

source: You can use an existing interface definition in a new interface definition. For example, let's say there is a message named ``Contact.msg`` that belongs to an existing ROS 2 package named ``rosidl_tutorials_msgs``. Assume that its definition is identical to our custom-made ``AddressBook.msg`` interface from earlier.
fr: Vous pouvez utiliser une définition d'interface existante dans une nouvelle définition d'interface. Par exemple, supposons qu'il existe un message nommé ``Contact.msg`` qui appartient à un package ROS 2 existant nommé ``rosidl_tutorials_msgs``. Supposons que sa définition soit identique à notre interface personnalisée ``AddressBook.msg`` de la version précédente.

source: In that case you could have defined ``AddressBook.msg`` (an interface in the package *with* your nodes) as type ``Contact`` (an interface in a *separate* package). You could even define ``AddressBook.msg`` as an *array* of type ``Contact``, like so:
fr: Dans ce cas, vous auriez pu définir ``AddressBook.msg`` (une interface dans le package *avec* vos nœuds) comme type ``Contact`` (une interface dans un package *séparé*). Vous pouvez même définir ``AddressBook.msg`` comme un *tableau* de type ``Contact``, comme ceci :

source: To generate this message you would need to declare a dependency on ``Contact.msg's`` package, ``rosidl_tutorials_msgs``, in ``package.xml``:
fr: Pour générer ce message, vous devez déclarer une dépendance au package ``Contact.msg's``, ``rosidl_tutorials_msgs``, dans ``package.xml`` :

source: And in ``CMakeLists.txt``:
fr: Et dans ``CMakeLists.txt`` :

source: You would also need to include the header of ``Contact.msg`` in you publisher node in order to be able to add ``contacts`` to your ``address_book``.
fr: Vous devrez également inclure l'en-tête de ``Contact.msg`` dans votre nœud d'éditeur afin de pouvoir ajouter ``contacts`` à votre ``carnet d'adresses``.

source: You could change the call back to something like this:
fr: Vous pouvez modifier l'appel en quelque chose comme ceci :

source: Building and running these changes would show the msg defined as expected, as well as the array of msgs defined above.
fr: La construction et l'exécution de ces modifications afficheraient le msg défini comme prévu, ainsi que le tableau de msgs défini ci-dessus.

source: Summary
fr: Résumé

source: In this tutorial, you tried out different field types for defining interfaces, then built an interface in the same package where it's being used.
fr: Dans ce didacticiel, vous avez essayé différents types de champs pour définir des interfaces, puis créé une interface dans le même package où elle est utilisée.

source: You also learned how to use another interface as a field type, as well as the ``package.xml``, ``CMakeLists.txt``, and ``#include`` statements necessary for utilizing that feature.
fr: Vous avez également appris à utiliser une autre interface comme type de champ, ainsi que les instructions ``package.xml``, ``CMakeLists.txt`` et ``#include`` nécessaires à l'utilisation de cette fonctionnalité.

source: Next steps
fr: Prochaines étapes

source: Next you will create a simple ROS 2 package with a custom parameter that you will learn to set from a launch file. Again, you can choose to write it in either :doc:`C++ <./Using-Parameters-In-A-Class-CPP>` or :doc:`Python <./Using-Parameters-In-A-Class-Python>`.
fr: Ensuite, vous allez créer un package ROS 2 simple avec un paramètre personnalisé que vous apprendrez à définir à partir d'un fichier de lancement. Encore une fois, vous pouvez choisir de l'écrire en :doc:`C++ <./Using-Parameters-In-A-Class-CPP>` ou :doc:`Python <./Using-Parameters-In-A-Class- Python>`.

source: Related content
fr: Contenu connexe

source: There are `several design articles <https://design.ros2.org/#interfaces>`_ on ROS 2 interfaces and the IDL (interface definition language).
fr: Il existe `plusieurs articles de conception <https://design.ros2.org/#interfaces>`_ sur les interfaces ROS 2 et l'IDL (langage de définition d'interface).
