Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Tutorials/Beginner-Client-Libraries/Using-Parameters-*-A-Class-Python.po
Languages: fr

source: Using parameters in a class (Python)
fr: Utiliser des paramètres dans une classe (Python)

source: **Goal:** Create and run a class with ROS parameters using Python.
fr: **Objectif :** créer et exécuter une classe avec des paramètres ROS à l'aide de Python.

source: **Tutorial level:** Beginner
fr: **Niveau du tutoriel :** Débutant

source: **Time:** 20 minutes
fr: **Durée :** 20 minutes

source: Contents
fr: Contenu

source: Background
fr: Arrière-plan

source: When making your own :doc:`nodes <../Beginner-CLI-Tools/Understanding-ROS2-Nodes/Understanding-ROS2-Nodes>` you will sometimes need to add parameters that can be set from the launch file.
fr: Lorsque vous créez vos propres :doc:`nodes <../Beginner-CLI-Tools/Understanding-ROS2-Nodes/Understanding-ROS2-Nodes>`, vous devrez parfois ajouter des paramètres pouvant être définis à partir du fichier de lancement.

source: This tutorial will show you how to create those parameters in a Python class, and how to set them in a launch file.
fr: Ce didacticiel vous montrera comment créer ces paramètres dans une classe Python et comment les définir dans un fichier de lancement.

source: Prerequisites
fr: Conditions préalables

source: In previous tutorials, you learned how to :doc:`create a workspace <./Creating-A-Workspace/Creating-A-Workspace>` and :doc:`create a package <./Creating-Your-First-ROS2-Package>`. You have also learned about :doc:`parameters <../Beginner-CLI-Tools/Understanding-ROS2-Parameters/Understanding-ROS2-Parameters>` and their function in a ROS 2 system.
fr: Dans les tutoriels précédents, vous avez appris à :doc:`créer un espace de travail <./Creating-A-Workspace/Creating-A-Workspace>` et :doc:`créer un package <./Creating-Your-First-ROS2- Forfait>`. Vous avez également découvert :doc:`parameters <../Beginner-CLI-Tools/Understanding-ROS2-Parameters/Understanding-ROS2-Parameters>` et leur fonction dans un système ROS 2.

source: Tasks
fr: Tâches

source: 1 Create a package
fr: 1 Créer un package

source: Open a new terminal and :doc:`source your ROS 2 installation <../Beginner-CLI-Tools/Configuring-ROS2-Environment>` so that ``ros2`` commands will work.
fr: Ouvrez un nouveau terminal et :doc:`sourcez votre installation ROS 2 <../Beginner-CLI-Tools/Configuring-ROS2-Environment>` pour que les commandes ``ros2`` fonctionnent.

source: Follow :ref:`these instructions <new-directory>` to create a new workspace named ``ros2_ws``.
fr: Suivez :ref:`ces instructions <nouveau-répertoire>` pour créer un nouvel espace de travail nommé ``ros2_ws``.

source: Recall that packages should be created in the ``src`` directory, not the root of the workspace. Navigate into ``ros2_ws/src`` and create a new package:
fr: Rappelez-vous que les packages doivent être créés dans le répertoire ``src``, et non à la racine de l'espace de travail. Accédez à ``ros2_ws/src`` et créez un nouveau package :

source: Your terminal will return a message verifying the creation of your package ``python_parameters`` and all its necessary files and folders.
fr: Votre terminal renverra un message vérifiant la création de votre package ``python_parameters`` et tous ses fichiers et dossiers nécessaires.

source: The ``--dependencies`` argument will automatically add the necessary dependency lines to ``package.xml`` and ``CMakeLists.txt``.
fr: L'argument ``--dependencies`` ajoutera automatiquement les lignes de dépendance nécessaires à ``package.xml`` et ``CMakeLists.txt``.

source: 1.1 Update ``package.xml``
fr: 1.1 Mettre à jour ``package.xml``

source: Because you used the ``--dependencies`` option during package creation, you don’t have to manually add dependencies to ``package.xml`` or ``CMakeLists.txt``.
fr: Comme vous avez utilisé l'option ``--dependencies`` lors de la création du package, vous n'avez pas besoin d'ajouter manuellement des dépendances à ``package.xml`` ou ``CMakeLists.txt``.

source: As always, though, make sure to add the description, maintainer email and name, and license information to ``package.xml``.
fr: Comme toujours, assurez-vous d'ajouter la description, l'adresse e-mail et le nom du responsable, ainsi que les informations de licence à ``package.xml``.

source: 2 Write the Python node
fr: 2 Écrivez le nœud Python

source: Inside the ``ros2_ws/src/python_parameters/python_parameters`` directory, create a new file called ``python_parameters_node.py`` and paste the following code within:
fr: Dans le répertoire ``ros2_ws/src/python_parameters/python_parameters``, créez un nouveau fichier appelé ``python_parameters_node.py`` et collez le code suivant à l'intérieur :

source: 2.1 Examine the code
fr: 2.1 Examiner le code

source: The ``import`` statements at the top are used to import the package dependencies.
fr: Les instructions ``import`` en haut sont utilisées pour importer les dépendances du package.

source: The next piece of code creates the class and the constructor. The line ``self.declare_parameter('my_parameter', 'world')`` of the constructor creates a parameter with the name ``my_parameter`` and a default value of ``world``. The parameter type is inferred from the default value, so in this case it would be set to a string type. Next the ``timer`` is initialized with a period of 1, which causes the ``timer_callback`` function to be executed once every second.
fr: Le morceau de code suivant crée la classe et le constructeur. La ligne ``self.declare_parameter('my_parameter', 'world')`` du constructeur crée un paramètre avec le nom ``my_parameter`` et une valeur par défaut de ``world``. Le type de paramètre est déduit de la valeur par défaut, donc dans ce cas, il serait défini sur un type de chaîne. Ensuite, le ``timer`` est initialisé avec une période de 1, ce qui provoque l'exécution de la fonction ``timer_callback`` une fois par seconde.

source: The first line of our ``timer_callback`` function gets the parameter ``my_parameter`` from the node, and stores it in ``my_param``. Next the ``get_logger`` function ensures the message is logged. The ``set_parameters`` function then sets the parameter ``my_parameter`` back to the default string value ``world``. In the case that the user changed the parameter externally, this ensures it is always reset back to the original.
fr: La première ligne de notre fonction ``timer_callback`` récupère le paramètre ``my_parameter`` du nœud et le stocke dans ``my_param``. Ensuite, la fonction ``get_logger`` s'assure que le message est enregistré. La fonction ``set_parameters`` définit ensuite le paramètre ``my_parameter`` à la valeur de chaîne par défaut ``world``. Dans le cas où l'utilisateur a modifié le paramètre de manière externe, cela garantit qu'il est toujours réinitialisé à l'original.

source: Following the ``timer_callback`` is our ``main``. Here ROS 2 is initialized, an instance of the ``MinimalParam`` class is constructed, and ``rclpy.spin`` starts processing data from the node.
fr: Après le ``timer_callback`` se trouve notre ``main``. Ici, ROS 2 est initialisé, une instance de la classe ``MinimalParam`` est construite et ``rclpy.spin`` commence à traiter les données du nœud.

source: 2.1.1 (Optional) Add ParameterDescriptor
fr: 2.1.1 (Facultatif) Ajouter un descripteur de paramètre

source: Optionally, you can set a descriptor for the parameter. Descriptors allow you to specify a text description of the parameter and parameters constraints, like making it read-only, specifying a range, etc. For that to work, the ``__init__`` code has to be changed to:
fr: Vous pouvez éventuellement définir un descripteur pour le paramètre. Les descripteurs vous permettent de spécifier une description textuelle du paramètre et des contraintes de paramètres, comme le rendre en lecture seule, spécifier une plage, etc. Pour que cela fonctionne, le code ``__init__`` doit être changé en :

source: The rest of the code remains the same. Once you run the node, you can then run ``ros2 param describe /minimal_param_node my_parameter`` to see the type and description.
fr: Le reste du code reste le même. Une fois que vous avez exécuté le nœud, vous pouvez alors exécuter ``ros2 param describe /minimal_param_node my_parameter`` pour voir le type et la description.

source: 2.2 Add an entry point
fr: 2.2 Ajouter un point d'entrée

source: Open the ``setup.py`` file. Again, match the ``maintainer``, ``maintainer_email``, ``description`` and ``license`` fields to your ``package.xml``:
fr: Ouvrez le fichier ``setup.py``. Encore une fois, faites correspondre les champs ``maintainer``, ``maintainer_email``, ``description`` et ``license`` à votre ``package.xml`` :

source: Add the following line within the ``console_scripts`` brackets of the ``entry_points`` field:
fr: Ajoutez la ligne suivante entre les parenthèses ``console_scripts`` du champ ``entry_points`` :

source: Don’t forget to save.
fr: N'oubliez pas de sauvegarder.

source: 3 Build and run
fr: 3 Construire et exécuter

source: It's good practice to run ``rosdep`` in the root of your workspace (``ros2_ws``) to check for missing dependencies before building:
fr: Il est recommandé d'exécuter ``rosdep`` à la racine de votre espace de travail (``ros2_ws``) pour vérifier les dépendances manquantes avant de compiler :

source: rosdep only runs on Linux, so you can skip ahead to next step.
fr: rosdep ne fonctionne que sous Linux, vous pouvez donc passer à l'étape suivante.

source: Windows
fr: les fenêtres

source: Navigate back to the root of your workspace, ``ros2_ws``, and build your new package:
fr: Revenez à la racine de votre espace de travail, ``ros2_ws``, et créez votre nouveau package :

source: Open a new terminal, navigate to ``ros2_ws``, and source the setup files:
fr: Ouvrez un nouveau terminal, accédez à ``ros2_ws`` et sourcez les fichiers d'installation :

source: Now run the node:
fr: Exécutez maintenant le nœud :

source: The terminal should return the following message every second:
fr: Le terminal doit renvoyer le message suivant toutes les secondes :

source: Now you can see the default value of your parameter, but you want to be able to set it yourself. There are two ways to accomplish this.
fr: Vous pouvez maintenant voir la valeur par défaut de votre paramètre, mais vous souhaitez pouvoir la définir vous-même. Il existe deux façons d'y parvenir.

source: 3.1 Change via the console
fr: 3.1 Modification via la console

source: This part will use the knowledge you have gained from the :doc:`tutoral about parameters <../Beginner-CLI-Tools/Understanding-ROS2-Parameters/Understanding-ROS2-Parameters>` and apply it to the node you have just created.
fr: Cette partie utilisera les connaissances que vous avez acquises grâce au :doc:`tutoriel sur les paramètres <../Beginner-CLI-Tools/Understanding-ROS2-Parameters/Understanding-ROS2-Parameters>` et les appliquera au nœud que vous venez de créé.

source: Make sure the node is running:
fr: Assurez-vous que le nœud est en cours d'exécution :

source: Open another terminal, source the setup files from inside ``ros2_ws`` again, and enter the following line:
fr: Ouvrez un autre terminal, sourcez à nouveau les fichiers d'installation depuis ``ros2_ws`` et entrez la ligne suivante :

source: There you will see the custom parameter ``my_parameter``. To change it simply run the following line in the console:
fr: Vous y verrez le paramètre personnalisé ``my_parameter``. Pour le changer, exécutez simplement la ligne suivante dans la console :

source: You know it went well if you get the output ``Set parameter successful``. If you look at the other terminal, you should see the output change to ``[INFO] [minimal_param_node]: Hello earth!``
fr: Vous savez que cela s'est bien passé si vous obtenez la sortie ``Set parameters réussi``. Si vous regardez l'autre terminal, vous devriez voir la sortie changer en ``[INFO] [minimal_param_node] : Hello Earth !``

source: Since the node then set the parameter back to ``world``, further outputs show ``[INFO] [minimal_param_node]: Hello world!``
fr: Étant donné que le nœud a ensuite redéfini le paramètre sur ``world``, d'autres sorties affichent ``[INFO] [minimal_param_node] : Hello world !``

source: 3.2 Change via a launch file
fr: 3.2 Modification via un fichier de lancement

source: You can also set parameters in a launch file, but first you will need to add a launch directory. Inside the ``ros2_ws/src/python_parameters/`` directory, create a new directory called ``launch``. In there, create a new file called ``python_parameters_launch.py``
fr: Vous pouvez également définir des paramètres dans un fichier de lancement, mais vous devrez d'abord ajouter un répertoire de lancement. Dans le répertoire ``ros2_ws/src/python_parameters/``, créez un nouveau répertoire appelé ``launch``. Là, créez un nouveau fichier appelé ``python_parameters_launch.py``

source: Here you can see that we set ``my_parameter`` to ``earth`` when we launch our node ``parameter_node``. By adding the two lines below, we ensure our output is printed in our console.
fr: Ici, vous pouvez voir que nous définissons ``my_parameter`` sur ``earth`` lorsque nous lançons notre nœud ``parameter_node``. En ajoutant les deux lignes ci-dessous, nous nous assurons que notre sortie est imprimée dans notre console.

source: Now open the ``setup.py`` file. Add the ``import`` statements to the top of the file, and the other new statement to the ``data_files`` parameter to include all launch files:
fr: Ouvrez maintenant le fichier ``setup.py``. Ajoutez les instructions ``import`` en haut du fichier et l'autre nouvelle instruction au paramètre ``data_files`` pour inclure tous les fichiers de lancement :

source: Open a console and navigate to the root of your workspace, ``ros2_ws``, and build your new package:
fr: Ouvrez une console et accédez à la racine de votre espace de travail, ``ros2_ws``, et créez votre nouveau package :

source: Then source the setup files in a new terminal:
fr: Sourcez ensuite les fichiers de configuration dans un nouveau terminal :

source: Now run the node using the launch file we have just created:
fr: Exécutez maintenant le nœud en utilisant le fichier de lancement que nous venons de créer :

source: Summary
fr: Résumé

source: You created a node with a custom parameter, that can be set either from a launch file or the command line. You added the dependencies, executables, and a launch file to the package configuration files so that you could build and run them, and see the parameter in action.
fr: Vous avez créé un nœud avec un paramètre personnalisé, qui peut être défini à partir d'un fichier de lancement ou de la ligne de commande. Vous avez ajouté les dépendances, les exécutables et un fichier de lancement aux fichiers de configuration du package afin de pouvoir les générer et les exécuter, et voir le paramètre en action.

source: Next steps
fr: Prochaines étapes

source: Now that you have some packages and ROS 2 systems of your own, the :doc:`next tutorial <./Getting-Started-With-Ros2doctor>` will show you how to examine issues in your environment and systems in case you have problems.
fr: Maintenant que vous disposez de certains packages et de vos propres systèmes ROS 2, le :doc:`next tutorial <./Getting-Started-With-Ros2doctor>` vous montrera comment examiner les problèmes de votre environnement et de vos systèmes au cas où vous auriez des problèmes .
