Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Tutorials/Beginner-Client-Libraries/Writing-A-Simple-Py-Publisher-And-Subscriber.po
Languages: fr

source: Writing a simple publisher and subscriber (Python)
fr: Écrire un simple éditeur et abonné (Python)

source: **Goal:** Create and run a publisher and subscriber node using Python
fr: **Objectif :** Créer et exécuter un nœud d'éditeur et d'abonné à l'aide de Python

source: **Tutorial level:** Beginner
fr: **Niveau du tutoriel :** Débutant

source: **Time:** 20 minutes
fr: **Durée :** 20 minutes

source: Contents
fr: Contenu

source: Background
fr: Arrière-plan

source: In this tutorial, you will create :doc:`nodes <../Beginner-CLI-Tools/Understanding-ROS2-Nodes/Understanding-ROS2-Nodes>` that pass information in the form of string messages to each other over a :doc:`topic <../Beginner-CLI-Tools/Understanding-ROS2-Topics/Understanding-ROS2-Topics>`. The example used here is a simple “talker” and “listener” system; one node publishes data and the other subscribes to the topic so it can receive that data.
fr: Dans ce didacticiel, vous allez créer des :doc:`nodes <../Beginner-CLI-Tools/Understanding-ROS2-Nodes/Understanding-ROS2-Nodes>` qui se transmettent des informations sous forme de messages de chaîne via un : doc:`sujet <../Beginner-CLI-Tools/Understanding-ROS2-Topics/Understanding-ROS2-Topics>`. L'exemple utilisé ici est un simple système « locuteur » et « auditeur » ; un nœud publie des données et l'autre s'abonne au sujet afin de pouvoir recevoir ces données.

source: The code used in these examples can be found `here <https://github.com/ros2/examples/tree/rolling/rclpy/topics>`__.
fr: Le code utilisé dans ces exemples peut être trouvé `ici <https://github.com/ros2/examples/tree/rolling/rclpy/topics>`__.

source: Prerequisites
fr: Conditions préalables

source: In previous tutorials, you learned how to :doc:`create a workspace <./Creating-A-Workspace/Creating-A-Workspace>` and :doc:`create a package <./Creating-Your-First-ROS2-Package>`.
fr: Dans les tutoriels précédents, vous avez appris à :doc:`créer un espace de travail <./Creating-A-Workspace/Creating-A-Workspace>` et :doc:`créer un package <./Creating-Your-First-ROS2- Forfait>`.

source: A basic understanding of Python is recommended, but not entirely necessary.
fr: Une compréhension de base de Python est recommandée, mais pas entièrement nécessaire.

source: Tasks
fr: Tâches

source: 1 Create a package
fr: 1 Créer un package

source: Open a new terminal and :doc:`source your ROS 2 installation <../Beginner-CLI-Tools/Configuring-ROS2-Environment>` so that ``ros2`` commands will work.
fr: Ouvrez un nouveau terminal et :doc:`sourcez votre installation ROS 2 <../Beginner-CLI-Tools/Configuring-ROS2-Environment>` pour que les commandes ``ros2`` fonctionnent.

source: Navigate into the ``ros2_ws`` directory created in a :ref:`previous tutorial <new-directory>`.
fr: Naviguez dans le répertoire ``ros2_ws`` créé dans un :ref:`tutoriel précédent <nouveau-répertoire>`.

source: Recall that packages should be created in the ``src`` directory, not the root of the workspace. So, navigate into ``ros2_ws/src``, and run the package creation command:
fr: Rappelez-vous que les packages doivent être créés dans le répertoire ``src``, et non à la racine de l'espace de travail. Alors, naviguez dans ``ros2_ws/src`` et exécutez la commande de création de package :

source: Your terminal will return a message verifying the creation of your package ``py_pubsub`` and all its necessary files and folders.
fr: Votre terminal renverra un message vérifiant la création de votre package ``py_pubsub`` et tous ses fichiers et dossiers nécessaires.

source: 2 Write the publisher node
fr: 2 Écrivez le nœud de l'éditeur

source: Navigate into ``ros2_ws/src/py_pubsub/py_pubsub``. Recall that this directory is a `Python package <https://docs.python.org/3/tutorial/modules.html#packages>`__ with the same name as the ROS 2 package it's nested in.
fr: Accédez à ``ros2_ws/src/py_pubsub/py_pubsub``. Rappelez-vous que ce répertoire est un `package Python <https://docs.python.org/3/tutorial/modules.html#packages>`__ avec le même nom que le package ROS 2 dans lequel il est imbriqué.

source: Download the example talker code by entering the following command:
fr: Téléchargez l'exemple de code Talker en saisissant la commande suivante :

source: Windows
fr: les fenêtres

source: In a Windows command line prompt:
fr: Dans une invite de ligne de commande Windows :

source: Or in powershell:
fr: Ou en powershell :

source: Now there will be a new file named ``publisher_member_function.py`` adjacent to ``__init__.py``.
fr: Il y aura maintenant un nouveau fichier nommé ``publisher_member_function.py`` adjacent à ``__init__.py``.

source: Open the file using your preferred text editor.
fr: Ouvrez le fichier à l'aide de votre éditeur de texte préféré.

source: 2.1 Examine the code
fr: 2.1 Examiner le code

source: The first lines of code after the comments import ``rclpy`` so its ``Node`` class can be used.
fr: Les premières lignes de code après les commentaires importent ``rclpy`` afin que sa classe ``Node`` puisse être utilisée.

source: The next statement imports the built-in string message type that the node uses to structure the data that it passes on the topic.
fr: L'instruction suivante importe le type de message de chaîne intégré que le nœud utilise pour structurer les données qu'il transmet sur le sujet.

source: These lines represent the node’s dependencies. Recall that dependencies have to be added to ``package.xml``, which you’ll do in the next section.
fr: Ces lignes représentent les dépendances du nœud. Rappelez-vous que les dépendances doivent être ajoutées à ``package.xml``, ce que vous ferez dans la section suivante.

source: Next, the ``MinimalPublisher`` class is created, which inherits from (or is a subclass of) ``Node``.
fr: Ensuite, la classe ``MinimalPublisher`` est créée, qui hérite de (ou est une sous-classe de) ``Node``.

source: Following is the definition of the class’s constructor. ``super().__init__`` calls the ``Node`` class’s constructor and gives it your node name, in this case ``minimal_publisher``.
fr: Voici la définition du constructeur de la classe. ``super().__init__`` appelle le constructeur de la classe ``Node`` et lui donne le nom de votre nœud, dans ce cas ``minimal_publisher``.

source: ``create_publisher`` declares that the node publishes messages of type ``String`` (imported from the ``std_msgs.msg`` module), over a topic named ``topic``, and that the “queue size" is 10. Queue size is a required QoS (quality of service) setting that limits the amount of queued messages if a subscriber is not receiving them fast enough.
fr: ``create_publisher`` déclare que le nœud publie des messages de type ``String`` (importés du module ``std_msgs.msg``), sur un sujet nommé ``topic``, et que la "taille de la file d'attente" est 10. La taille de la file d'attente est un paramètre QoS (qualité de service) requis qui limite la quantité de messages en file d'attente si un abonné ne les reçoit pas assez rapidement.

source: Next, a timer is created with a callback to execute every 0.5 seconds. ``self.i`` is a counter used in the callback.
fr: Ensuite, une minuterie est créée avec un rappel à exécuter toutes les 0,5 secondes. ``self.i`` est un compteur utilisé dans le rappel.

source: ``timer_callback`` creates a message with the counter value appended, and publishes it to the console with ``get_logger().info``.
fr: ``timer_callback`` crée un message avec la valeur du compteur ajoutée et le publie sur la console avec ``get_logger().info``.

source: Lastly, the main function is defined.
fr: Enfin, la fonction principale est définie.

source: First the ``rclpy`` library is initialized, then the node is created, and then it “spins” the node so its callbacks are called.
fr: La bibliothèque ``rclpy`` est d'abord initialisée, puis le nœud est créé, puis il "fait tourner" le nœud pour que ses rappels soient appelés.

source: 2.2 Add dependencies
fr: 2.2 Ajouter des dépendances

source: Navigate one level back to the ``ros2_ws/src/py_pubsub`` directory, where the ``setup.py``, ``setup.cfg``, and ``package.xml`` files have been created for you.
fr: Naviguez d'un niveau vers le répertoire ``ros2_ws/src/py_pubsub``, où les fichiers ``setup.py``, ``setup.cfg`` et ``package.xml`` ont été créés pour vous.

source: Open ``package.xml`` with your text editor.
fr: Ouvrez ``package.xml`` avec votre éditeur de texte.

source: As mentioned in the :doc:`previous tutorial <./Creating-Your-First-ROS2-Package>`, make sure to fill in the ``<description>``, ``<maintainer>`` and ``<license>`` tags:
fr: Comme mentionné dans le :doc:`tutoriel précédent <./Creating-Your-First-ROS2-Package>`, assurez-vous de remplir les champs ``<description>``, ``<maintainer>`` et ``< licence>`` balises :

source: After the lines above, add the following dependencies corresponding to your node’s import statements:
fr: Après les lignes ci-dessus, ajoutez les dépendances suivantes correspondant aux instructions d'importation de votre nœud :

source: This declares the package needs ``rclpy`` and ``std_msgs`` when its code is executed.
fr: Cela déclare que le paquet a besoin de ``rclpy`` et ``std_msgs`` lorsque son code est exécuté.

source: Make sure to save the file.
fr: Assurez-vous de sauvegarder le fichier.

source: 2.3 Add an entry point
fr: 2.3 Ajouter un point d'entrée

source: Open the ``setup.py`` file. Again, match the ``maintainer``, ``maintainer_email``, ``description`` and ``license`` fields to your ``package.xml``:
fr: Ouvrez le fichier ``setup.py``. Encore une fois, faites correspondre les champs ``maintainer``, ``maintainer_email``, ``description`` et ``license`` à votre ``package.xml`` :

source: Add the following line within the ``console_scripts`` brackets of the ``entry_points`` field:
fr: Ajoutez la ligne suivante entre les parenthèses ``console_scripts`` du champ ``entry_points`` :

source: Don’t forget to save.
fr: N'oubliez pas de sauvegarder.

source: 2.4 Check setup.cfg
fr: 2.4 Vérifier setup.cfg

source: The contents of the ``setup.cfg`` file should be correctly populated automatically, like so:
fr: Le contenu du fichier ``setup.cfg`` doit être correctement rempli automatiquement, comme ceci :

source: This is simply telling setuptools to put your executables in ``lib``, because ``ros2 run`` will look for them there.
fr: Cela indique simplement à setuptools de mettre vos exécutables dans ``lib``, car ``ros2 run`` les cherchera là-bas.

source: You could build your package now, source the local setup files, and run it, but let’s create the subscriber node first so you can see the full system at work.
fr: Vous pouvez créer votre package maintenant, sourcer les fichiers d'installation locaux et l'exécuter, mais créons d'abord le nœud d'abonné afin que vous puissiez voir le système complet au travail.

source: 3 Write the subscriber node
fr: 3 Écrivez le nœud de l'abonné

source: Return to ``ros2_ws/src/py_pubsub/py_pubsub`` to create the next node. Enter the following code in your terminal:
fr: Retournez à ``ros2_ws/src/py_pubsub/py_pubsub`` pour créer le nœud suivant. Entrez le code suivant dans votre terminal :

source: Now the directory should have these files:
fr: Maintenant, le répertoire devrait contenir ces fichiers :

source: 3.1 Examine the code
fr: 3.1 Examiner le code

source: Open the ``subscriber_member_function.py`` with your text editor.
fr: Ouvrez le ``subscriber_member_function.py`` avec votre éditeur de texte.

source: The subscriber node’s code is nearly identical to the publisher’s. The constructor creates a subscriber with the same arguments as the publisher. Recall from the :doc:`topics tutorial <../Beginner-CLI-Tools/Understanding-ROS2-Topics/Understanding-ROS2-Topics>` that the topic name and message type used by the publisher and subscriber must match to allow them to communicate.
fr: Le code du nœud d'abonné est presque identique à celui de l'éditeur. Le constructeur crée un abonné avec les mêmes arguments que l'éditeur. Rappelez-vous du tutoriel :doc:`topics <../Beginner-CLI-Tools/Understanding-ROS2-Topics/Understanding-ROS2-Topics>` que le nom du sujet et le type de message utilisés par l'éditeur et l'abonné doivent correspondre pour leur permettre communiquer.

source: The subscriber’s constructor and callback don’t include any timer definition, because it doesn't need one. Its callback gets called as soon as it receives a message.
fr: Le constructeur et le rappel de l'abonné n'incluent aucune définition de minuterie, car il n'en a pas besoin. Son rappel est appelé dès qu'il reçoit un message.

source: The callback definition simply prints an info message to the console, along with the data it received. Recall that the publisher defines ``msg.data = 'Hello World: %d' % self.i``
fr: La définition de rappel imprime simplement un message d'information sur la console, ainsi que les données qu'elle a reçues. Rappelons que l'éditeur définit ``msg.data = 'Hello World: %d' % self.i``

source: The ``main`` definition is almost exactly the same, replacing the creation and spinning of the publisher with the subscriber.
fr: La définition ``principale`` est presque exactement la même, remplaçant la création et la rotation de l'éditeur par l'abonné.

source: Since this node has the same dependencies as the publisher, there’s nothing new to add to ``package.xml``. The ``setup.cfg`` file can also remain untouched.
fr: Étant donné que ce nœud a les mêmes dépendances que l'éditeur, il n'y a rien de nouveau à ajouter à ``package.xml``. Le fichier ``setup.cfg`` peut également rester intact.

source: 3.2 Add an entry point
fr: 3.2 Ajouter un point d'entrée

source: Reopen ``setup.py`` and add the entry point for the subscriber node below the publisher’s entry point. The ``entry_points`` field should now look like this:
fr: Rouvrez ``setup.py`` et ajoutez le point d'entrée du nœud d'abonné sous le point d'entrée de l'éditeur. Le champ ``entry_points`` devrait maintenant ressembler à ceci :

source: Make sure to save the file, and then your pub/sub system should be ready for use.
fr: Assurez-vous d'enregistrer le fichier, puis votre système pub/sub devrait être prêt à l'emploi.

source: 4 Build and run
fr: 4 Construire et exécuter

source: You likely already have the ``rclpy`` and ``std_msgs`` packages installed as part of your ROS 2 system. It's good practice to run ``rosdep`` in the root of your workspace (``ros2_ws``) to check for missing dependencies before building:
fr: Vous avez probablement déjà les packages ``rclpy`` et ``std_msgs`` installés dans le cadre de votre système ROS 2. Il est recommandé d'exécuter ``rosdep`` à la racine de votre espace de travail (``ros2_ws``) pour vérifier les dépendances manquantes avant de compiler :

source: rosdep only runs on Linux, so you can skip ahead to next step.
fr: rosdep ne fonctionne que sous Linux, vous pouvez donc passer à l'étape suivante.

source: Still in the root of your workspace, ``ros2_ws``, build your new package:
fr: Toujours à la racine de votre espace de travail, ``ros2_ws``, construisez votre nouveau package :

source: Open a new terminal, navigate to ``ros2_ws``, and source the setup files:
fr: Ouvrez un nouveau terminal, accédez à ``ros2_ws`` et sourcez les fichiers d'installation :

source: Now run the talker node:
fr: Exécutez maintenant le nœud Talker :

source: The terminal should start publishing info messages every 0.5 seconds, like so:
fr: Le terminal devrait commencer à publier des messages d'information toutes les 0,5 seconde, comme ceci :

source: Open another terminal, source the setup files from inside ``ros2_ws`` again, and then start the listener node:
fr: Ouvrez un autre terminal, sourcez à nouveau les fichiers de configuration depuis ``ros2_ws``, puis démarrez le nœud d'écoute :

source: The listener will start printing messages to the console, starting at whatever message count the publisher is on at that time, like so:
fr: L'écouteur commencera à imprimer des messages sur la console, à partir du nombre de messages sur lequel l'éditeur se trouve à ce moment-là, comme ceci :

source: Enter ``Ctrl+C`` in each terminal to stop the nodes from spinning.
fr: Entrez ``Ctrl+C`` dans chaque terminal pour empêcher les nœuds de tourner.

source: Summary
fr: Résumé

source: You created two nodes to publish and subscribe to data over a topic. Before running them, you added their dependencies and entry points to the package configuration files.
fr: Vous avez créé deux nœuds pour publier et vous abonner à des données sur une rubrique. Avant de les exécuter, vous avez ajouté leurs dépendances et leurs points d'entrée aux fichiers de configuration du package.

source: Next steps
fr: Prochaines étapes

source: Next you'll create another simple ROS 2 package using the service/client model. Again, you can choose to write it in either :doc:`C++ <./Writing-A-Simple-Cpp-Service-And-Client>` or :doc:`Python <./Writing-A-Simple-Py-Service-And-Client>`.
fr: Ensuite, vous allez créer un autre package ROS 2 simple en utilisant le modèle service/client. Encore une fois, vous pouvez choisir de l'écrire en :doc:`C++ <./Writing-A-Simple-Cpp-Service-And-Client>` ou :doc:`Python <./Writing-A-Simple-Py- Service-Et-Client>`.

source: Related content
fr: Contenu connexe

source: There are several ways you could write a publisher and subscriber in Python; check out the ``minimal_publisher`` and ``minimal_subscriber`` packages in the `ros2/examples <https://github.com/ros2/examples/tree/rolling/rclpy/topics>`_ repo.
fr: Il existe plusieurs façons d'écrire un éditeur et un abonné en Python ; consultez les packages ``minimal_publisher`` et ``minimal_subscriber`` dans le `ros2/examples <https://github.com/ros2/examples/tree/rolling/rclpy/topics>`_ repo.
