Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Tutorials/Intermediate/Composition.po
Languages: fr

source: Composing multiple nodes in a single process
fr: Composer plusieurs nœuds en un seul processus

source: Table of Contents
fr: Table des matières

source: **Goal:** Compose multiple nodes into a single process.
fr: **Objectif :** Composez plusieurs nœuds en un seul processus.

source: **Tutorial level:** Intermediate
fr: **Niveau du didacticiel :** Intermédiaire

source: **Time:** 20 minutes
fr: **Durée :** 20 minutes

source: Background
fr: Arrière-plan

source: See the :doc:`conceptual article <../../Concepts/About-Composition>`.
fr: Voir :doc:`article conceptuel <../../Concepts/About-Composition>`.

source: Run the demos
fr: Exécutez les démos

source: The demos use executables from `rclcpp_components <https://github.com/ros2/rclcpp/tree/rolling/rclcpp_components>`__, `ros2component <https://github.com/ros2/ros2cli/tree/rolling/ros2component>`__, and `composition <https://github.com/ros2/demos/tree/rolling/composition>`__ packages, and can be run with the following commands.
fr: Les démos utilisent des exécutables de `rclcpp_components <https://github.com/ros2/rclcpp/tree/rolling/rclcpp_components>`__, `ros2component <https://github.com/ros2/ros2cli/tree/rolling/ros2component> `__ et `composition <https://github.com/ros2/demos/tree/rolling/composition>`__ packages, et peuvent être exécutés avec les commandes suivantes.

source: Discover available components
fr: Découvrez les composants disponibles

source: To see what components are registered and available in the workspace, execute the following in a shell:
fr: Pour voir quels composants sont enregistrés et disponibles dans l'espace de travail, exécutez ce qui suit dans un shell :

source: The terminal will return the list of all available components:
fr: Le terminal renverra la liste de tous les composants disponibles :

source: Run-time composition using ROS services with a publisher and subscriber
fr: Composition d'exécution à l'aide des services ROS avec un éditeur et un abonné

source: In the first shell, start the component container:
fr: Dans le premier shell, démarrez le conteneur de composants :

source: Open the second shell and verify that the container is running via ``ros2`` command line tools:
fr: Ouvrez le deuxième shell et vérifiez que le conteneur s'exécute via les outils de ligne de commande ``ros2`` :

source: You should see a name of the component:
fr: Vous devriez voir un nom du composant :

source: In the second shell load the talker component (see `talker <https://github.com/ros2/demos/blob/rolling/composition/src/talker_component.cpp>`__ source code):
fr: Dans le second shell, chargez le composant talker (voir `talker <https://github.com/ros2/demos/blob/rolling/composition/src/talker_component.cpp>`__ code source) :

source: The command will return the unique ID of the loaded component as well as the node name:
fr: La commande renverra l'ID unique du composant chargé ainsi que le nom du nœud :

source: Now the first shell should show a message that the component was loaded as well as repeated message for publishing a message.
fr: Maintenant, le premier shell doit afficher un message indiquant que le composant a été chargé ainsi qu'un message répété pour la publication d'un message.

source: Run another command in the second shell to load the listener component (see `listener <https://github.com/ros2/demos/blob/rolling/composition/src/listener_component.cpp>`__ source code):
fr: Exécutez une autre commande dans le deuxième shell pour charger le composant d'écouteur (voir `listener <https://github.com/ros2/demos/blob/rolling/composition/src/listener_component.cpp>`__ code source) :

source: Terminal will return:
fr: Le terminal renverra :

source: The ``ros2`` command line utility can now be used to inspect the state of the container:
fr: L'utilitaire de ligne de commande ``ros2`` peut maintenant être utilisé pour inspecter l'état du conteneur :

source: You will see the following result:
fr: Vous verrez le résultat suivant :

source: Now the first shell should show repeated output for each received message.
fr: Maintenant, le premier shell doit afficher une sortie répétée pour chaque message reçu.

source: Run-time composition using ROS services with a server and client
fr: Composition d'exécution à l'aide des services ROS avec un serveur et un client

source: The example with a server and a client is very similar.
fr: L'exemple avec un serveur et un client est très similaire.

source: In the first shell:
fr: Dans la première coque :

source: In the second shell (see `server <https://github.com/ros2/demos/blob/rolling/composition/src/server_component.cpp>`__ and `client <https://github.com/ros2/demos/blob/rolling/composition/src/client_component.cpp>`__ source code):
fr: Dans le second shell (voir `server <https://github.com/ros2/demos/blob/rolling/composition/src/server_component.cpp>`__ et `client <https://github.com/ros2/demos /blob/rolling/composition/src/client_component.cpp>`__ code source) :

source: In this case the client sends a request to the server, the server processes the request and replies with a response, and the client prints the received response.
fr: Dans ce cas, le client envoie une demande au serveur, le serveur traite la demande et répond avec une réponse, et le client imprime la réponse reçue.

source: Compile-time composition using ROS services
fr: Composition au moment de la compilation à l'aide des services ROS

source: This demos shows that the same shared libraries can be reused to compile a single executable running multiple components. The executable contains all four components from above: talker and listener as well as server and client.
fr: Cette démo montre que les mêmes bibliothèques partagées peuvent être réutilisées pour compiler un seul exécutable exécutant plusieurs composants. L'exécutable contient les quatre composants ci-dessus : locuteur et écouteur ainsi que serveur et client.

source: In the shell call (see `source code <https://github.com/ros2/demos/blob/rolling/composition/src/manual_composition.cpp>`__):
fr: Dans l'appel du shell (voir `code source <https://github.com/ros2/demos/blob/rolling/composition/src/manual_composition.cpp>`__) :

source: This should show repeated messages from both pairs, the talker and the listener as well as the server and the client.
fr: Cela devrait montrer des messages répétés des deux paires, le locuteur et l'auditeur ainsi que le serveur et le client.

source: Manually-composed components will not be reflected in the ``ros2 component list`` command line tool output.
fr: Les composants composés manuellement ne seront pas reflétés dans la sortie de l'outil de ligne de commande ``ros2 component list``.

source: Run-time composition using dlopen
fr: Composition d'exécution à l'aide de dlopen

source: This demo presents an alternative to run-time composition by creating a generic container process and explicitly passing the libraries to load without using ROS interfaces. The process will open each library and create one instance of each "rclcpp::Node" class in the library `source code <https://github.com/ros2/demos/blob/rolling/composition/src/dlopen_composition.cpp>`__).
fr: Cette démo présente une alternative à la composition d'exécution en créant un processus de conteneur générique et en passant explicitement les bibliothèques à charger sans utiliser les interfaces ROS. Le processus ouvrira chaque bibliothèque et créera une instance de chaque classe "rclcpp :: Node" dans le code source de la bibliothèque <https://github.com/ros2/demos/blob/rolling/composition/src/dlopen_composition.cpp> `__).

source: Windows
fr: les fenêtres

source: to get the path to where composition is installed. Then call
fr: pour obtenir le chemin d'accès à l'emplacement d'installation de la composition. Alors appelez

source: Now the shell should show repeated output for each sent and received message.
fr: Maintenant, le shell doit afficher une sortie répétée pour chaque message envoyé et reçu.

source: dlopen-composed components will not be reflected in the ``ros2 component list`` command line tool output.
fr: Les composants composés par dlopen ne seront pas reflétés dans la sortie de l'outil de ligne de commande ``ros2 component list``.

source: Composition using launch actions
fr: Composition à l'aide d'actions de lancement

source: While the command line tools are useful for debugging and diagnosing component configurations, it is frequently more convenient to start a set of components at the same time. To automate this action, we can use the functionality in ``ros2 launch``.
fr: Bien que les outils de ligne de commande soient utiles pour le débogage et le diagnostic des configurations de composants, il est souvent plus pratique de démarrer un ensemble de composants en même temps. Pour automatiser cette action, nous pouvons utiliser la fonctionnalité de ``ros2 launch``.

source: Advanced Topics
fr: Sujets avancés

source: Now that we have seen the basic operation of components, we can discuss a few more advanced topics.
fr: Maintenant que nous avons vu le fonctionnement de base des composants, nous pouvons aborder quelques sujets plus avancés.

source: Unloading components
fr: Déchargement des composants

source: Verify that the container is running via ``ros2`` command line tools:
fr: Vérifiez que le conteneur s'exécute via les outils de ligne de commande ``ros2`` :

source: In the second shell load both the talker and listener as we have before:
fr: Dans le deuxième shell, chargez à la fois le locuteur et l'auditeur comme nous l'avons fait auparavant :

source: Use the unique ID to unload the node from the component container.
fr: Utilisez l'ID unique pour décharger le nœud du conteneur de composants.

source: The terminal should return:
fr: Le terminal doit renvoyer :

source: In the first shell, verify that the repeated messages from talker and listener have stopped.
fr: Dans le premier shell, vérifiez que les messages répétés du locuteur et de l'auditeur se sont arrêtés.

source: Remapping container name and namespace
fr: Remappage du nom du conteneur et de l'espace de noms

source: The component manager name and namespace can be remapped via standard command line arguments:
fr: Le nom et l'espace de noms du gestionnaire de composants peuvent être remappés via des arguments de ligne de commande standard :

source: In a second shell, components can be loaded by using the updated container name:
fr: Dans un deuxième shell, les composants peuvent être chargés en utilisant le nom de conteneur mis à jour :

source: Namespace remappings of the container do not affect loaded components.
fr: Les remappages d'espace de noms du conteneur n'affectent pas les composants chargés.

source: Remap component names and namespaces
fr: Remapper les noms de composants et les espaces de noms

source: Component names and namespaces may be adjusted via arguments to the load command.
fr: Les noms de composants et les espaces de noms peuvent être ajustés via des arguments à la commande load.

source: Some examples of how to remap names and namespaces.
fr: Quelques exemples de remappage de noms et d'espaces de noms.

source: Remap node name:
fr: Remapper le nom du nœud :

source: Remap namespace:
fr: Remapper l'espace de noms :

source: Remap both:
fr: Remappez les deux :

source: Now use ``ros2`` command line utility:
fr: Utilisez maintenant l'utilitaire de ligne de commande ``ros2`` :

source: In the console you should see corresponding entries:
fr: Dans la console, vous devriez voir les entrées correspondantes :

source: Passing parameter values into components
fr: Passer des valeurs de paramètres dans des composants

source: The ``ros2 component load`` command-line supports passing arbitrary parameters to the node as it is constructed. This functionality can be used as follows:
fr: La ligne de commande ``ros2 component load`` prend en charge la transmission de paramètres arbitraires au nœud lors de sa construction. Cette fonctionnalité peut être utilisée comme suit :

source: Passing additional arguments into components
fr: Passer des arguments supplémentaires dans les composants

source: The ``ros2 component load`` command-line supports passing particular options to the component manager for use when constructing the node. As of now, the only command-line option that is supported is to instantiate a node using intra-process communication. This functionality can be used as follows:
fr: La ligne de commande ``ros2 component load`` prend en charge la transmission d'options particulières au gestionnaire de composants à utiliser lors de la construction du nœud. À l'heure actuelle, la seule option de ligne de commande prise en charge consiste à instancier un nœud à l'aide de la communication intra-processus. Cette fonctionnalité peut être utilisée comme suit :

source: Composable nodes as shared libraries
fr: Nœuds composables en tant que bibliothèques partagées

source: If you want to export a composable node as a shared library from a package and use that node in another package that does link-time composition, add code to the CMake file which imports the actual targets in downstream packages.
fr: Si vous souhaitez exporter un nœud composable en tant que bibliothèque partagée à partir d'un package et utiliser ce nœud dans un autre package qui effectue la composition au moment de la liaison, ajoutez du code au fichier CMake qui importe les cibles réelles dans les packages en aval.

source: Then install the generated file and export the generated file.
fr: Installez ensuite le fichier généré et exportez le fichier généré.

source: A practical example can be seen here: `ROS Discourse - Ament best practice for sharing libraries <https://discourse.ros.org/t/ament-best-practice-for-sharing-libraries/3602>`__
fr: Un exemple pratique peut être vu ici : `ROS Discourse - Ament best practice for sharing library <https://discourse.ros.org/t/ament-best-practice-for-sharing-libraries/3602>`__
