Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Tutorials/Intermediate/Creating-an-Action.po
Languages: fr

source: Creating an action
fr: Créer une action

source: **Goal:** Define an action in a ROS 2 package.
fr: **Objectif :** Définir une action dans un package ROS 2.

source: **Tutorial level:** Intermediate
fr: **Niveau du didacticiel :** Intermédiaire

source: **Time:** 5 minutes
fr: **Durée :** 5 minutes

source: Contents
fr: Contenu

source: Background
fr: Arrière-plan

source: You learned about actions previously in the :doc:`../Beginner-CLI-Tools/Understanding-ROS2-Actions/Understanding-ROS2-Actions` tutorial. Like the other communication types and their respective interfaces (topics/msg and services/srv), you can also custom-define actions in your packages. This tutorial shows you how to define and build an action that you can use with the action server and action client you will write in the next tutorial.
fr: Vous avez appris les actions précédemment dans le didacticiel :doc:`../Beginner-CLI-Tools/Understanding-ROS2-Actions/Understanding-ROS2-Actions`. Comme les autres types de communication et leurs interfaces respectives (topics/msg et services/srv), vous pouvez également définir des actions personnalisées dans vos packages. Ce didacticiel vous montre comment définir et créer une action que vous pouvez utiliser avec le serveur d'action et le client d'action que vous écrirez dans le prochain didacticiel.

source: Prerequisites
fr: Conditions préalables

source: You should have :doc:`ROS 2 <../../Installation>` and `colcon <https://colcon.readthedocs.org>`__ installed.
fr: Vous devriez avoir :doc:`ROS 2 <../../Installation>` et `colcon <https://colcon.readthedocs.org>`__ installés.

source: Set up a :doc:`workspace <../Beginner-Client-Libraries/Creating-A-Workspace/Creating-A-Workspace>` and create a package named ``action_tutorials_interfaces``:
fr: Configurez un :doc:`workspace <../Beginner-Client-Libraries/Creating-A-Workspace/Creating-A-Workspace>` et créez un package nommé ``action_tutorials_interfaces`` :

source: (Remember to :doc:`source your ROS 2 installation <../Beginner-CLI-Tools/Configuring-ROS2-Environment>` first.)
fr: (N'oubliez pas de :doc:`sourcer votre installation ROS 2 <../Beginner-CLI-Tools/Configuring-ROS2-Environment>` en premier.)

source: Windows
fr: les fenêtres

source: Tasks
fr: Tâches

source: 1 Defining an action
fr: 1 Définir une action

source: Actions are defined in ``.action`` files of the form:
fr: Les actions sont définies dans des fichiers ``.action`` de la forme :

source: An action definition is made up of three message definitions separated by ``---``.
fr: Une définition d'action est composée de trois définitions de message séparées par ``---``.

source: A *request* message is sent from an action client to an action server initiating a new goal.
fr: Un message *request* est envoyé d'un client d'action à un serveur d'action initiant un nouvel objectif.

source: A *result* message is sent from an action server to an action client when a goal is done.
fr: Un message *result* est envoyé d'un serveur d'action à un client d'action lorsqu'un objectif est atteint.

source: *Feedback* messages are periodically sent from an action server to an action client with updates about a goal.
fr: Des messages *Feedback* sont périodiquement envoyés d'un serveur d'action à un client d'action avec des mises à jour sur un objectif.

source: An instance of an action is typically referred to as a *goal*.
fr: Une instance d'action est généralement appelée *objectif*.

source: Say we want to define a new action "Fibonacci" for computing the `Fibonacci sequence <https://en.wikipedia.org/wiki/Fibonacci_number>`__.
fr: Disons que nous voulons définir une nouvelle action "Fibonacci" pour calculer la `suite de Fibonacci <https://en.wikipedia.org/wiki/Fibonacci_number>`__.

source: Create an ``action`` directory in our ROS 2 package ``action_tutorials_interfaces``:
fr: Créez un répertoire ``action`` dans notre package ROS 2 ``action_tutorials_interfaces`` :

source: Within the ``action`` directory, create a file called ``Fibonacci.action`` with the following contents:
fr: Dans le répertoire ``action``, créez un fichier appelé ``Fibonacci.action`` avec le contenu suivant :

source: The goal request is the ``order`` of the Fibonacci sequence we want to compute, the result is the final ``sequence``, and the feedback is the ``partial_sequence`` computed so far.
fr: La demande d'objectif est l'``ordre`` de la séquence de Fibonacci que nous voulons calculer, le résultat est la ``séquence`` finale et le retour est la ``séquence_partielle`` calculée jusqu'à présent.

source: 2 Building an action
fr: 2 Construire une action

source: Before we can use the new Fibonacci action type in our code, we must pass the definition to the rosidl code generation pipeline.
fr: Avant de pouvoir utiliser le nouveau type d'action Fibonacci dans notre code, nous devons transmettre la définition au pipeline de génération de code rosidl.

source: This is accomplished by adding the following lines to our ``CMakeLists.txt`` before the ``ament_package()`` line, in the ``action_tutorials_interfaces``:
fr: Ceci est accompli en ajoutant les lignes suivantes à notre ``CMakeLists.txt`` avant la ligne ``ament_package()``, dans ``action_tutorials_interfaces`` :

source: We should also add the required dependencies to our ``package.xml``:
fr: Nous devrions également ajouter les dépendances requises à notre ``package.xml`` :

source: We should now be able to build the package containing the ``Fibonacci`` action definition:
fr: Nous devrions maintenant pouvoir construire le package contenant la définition de l'action ``Fibonacci`` :

source: We're done!
fr: Avaient fini!

source: By convention, action types will be prefixed by their package name and the word ``action``. So when we want to refer to our new action, it will have the full name ``action_tutorials_interfaces/action/Fibonacci``.
fr: Par convention, les types d'action seront préfixés par leur nom de package et le mot ``action``. Ainsi, lorsque nous voulons faire référence à notre nouvelle action, elle aura le nom complet ``action_tutorials_interfaces/action/Fibonacci``.

source: We can check that our action built successfully with the command line tool:
fr: Nous pouvons vérifier que notre action a bien été construite avec l'outil de ligne de commande :

source: You should see the Fibonacci action definition printed to the screen.
fr: Vous devriez voir la définition de l'action de Fibonacci imprimée à l'écran.

source: Summary
fr: Résumé

source: In this tutorial, you learned the structure of an action definition. You also learned how to correctly build a new action interface using ``CMakeLists.txt`` and ``package.xml``, and how to verify a successful build.
fr: Dans ce didacticiel, vous avez appris la structure d'une définition d'action. Vous avez également appris comment construire correctement une nouvelle interface d'action en utilisant ``CMakeLists.txt`` et ``package.xml``, et comment vérifier une construction réussie.

source: Next steps
fr: Prochaines étapes

source: Next, let's utilize your newly defined action interface by creating an action service and client (in :doc:`Python <Writing-an-Action-Server-Client/Py>` or :doc:`C++ <Writing-an-Action-Server-Client/Cpp>`).
fr: Ensuite, utilisons votre interface d'action nouvellement définie en créant un service d'action et un client (dans :doc:`Python <Writing-an-Action-Server-Client/Py>` ou :doc:`C++ <Writing-an-Action- Serveur-Client/Cpp>`).

source: Related content
fr: Contenu connexe

source: For more detailed information about ROS actions, please refer to the `design article <http://design.ros2.org/articles/actions.html>`__.
fr: Pour des informations plus détaillées sur les actions ROS, veuillez vous référer à l'`article de conception <http://design.ros2.org/articles/actions.html>`__.
