Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Tutorials/Intermediate/Rosdep.po
Languages: fr

source: Managing Dependencies with rosdep
fr: Gestion des dépendances avec rosdep

source: **Goal:** Manage external dependencies using ``rosdep``.
fr: **Objectif :** Gérer les dépendances externes à l'aide de ``rosdep``.

source: **Tutorial level:** Intermediate
fr: **Niveau du didacticiel :** Intermédiaire

source: **Time:** 5 minutes
fr: **Durée :** 5 minutes

source: Contents
fr: Contenu

source: Author: Steve Macenski
fr: Auteur : Steve Macenski

source: This tutorial will explain how to manage external dependencies using ``rosdep``.
fr: Ce tutoriel explique comment gérer les dépendances externes à l'aide de ``rosdep``.

source: What is rosdep?
fr: Qu'est-ce que le rosdep ?

source: ``rosdep`` is ROS's dependency management utility that can work with ROS packages and external libraries. ``rosdep`` is a command-line utility for identifying and installing dependencies to build or install a package. It can be or is invoked when:
fr: ``rosdep`` est l'utilitaire de gestion des dépendances de ROS qui peut fonctionner avec les packages ROS et les bibliothèques externes. ``rosdep`` est un utilitaire de ligne de commande permettant d'identifier et d'installer des dépendances pour construire ou installer un paquet. Il peut être ou est invoqué lorsque :

source: Building a workspace and needing appropriate dependencies to build the packages within
fr: Construire un espace de travail et avoir besoin de dépendances appropriées pour créer les packages à l'intérieur

source: Install packages (e.g. ``sudo apt install ros-rolling-demo-nodes-cpp``) to check the dependencies needed for it to execute
fr: Installez des packages (par exemple, ``sudo apt install ros-rolling-demo-nodes-cpp``) pour vérifier les dépendances nécessaires à son exécution

source: and more!
fr: et plus!

source: It has the ability to work over a single package or over a directory of packages (e.g. workspace).
fr: Il a la capacité de travailler sur un seul package ou sur un répertoire de packages (par exemple, un espace de travail).

source: A little about package.xml files
fr: Un peu sur les fichiers package.xml

source: A package's ``package.xml`` file contains a set of dependencies. The dependencies in this file are generally referred to as "rosdep keys". These are represented in the tags ``<depend>``, ``<test_depend>``, ``<exec_depend>``, ``<build_depend>``, and ``<build_export_depend>``. They specify in what situation each of the dependencies are required in.
fr: Le fichier ``package.xml`` d'un paquet contient un ensemble de dépendances. Les dépendances de ce fichier sont généralement appelées "clés rosdep". Ceux-ci sont représentés dans les balises ``<depend>``, ``<test_depend>``, ``<exec_depend>``, ``<build_depend>`` et ``<build_export_depend>``. Ils précisent dans quelle situation chacune des dépendances est requise.

source: For dependencies only used in testing the code (e.g. ``gtest``), use ``test_depend``.
fr: Pour les dépendances utilisées uniquement pour tester le code (par exemple, ``gtest``), utilisez ``test_depend``.

source: For dependencies only used in building the code, use ``build_depend``.
fr: Pour les dépendances utilisées uniquement dans la construction du code, utilisez ``build_depend``.

source: For dependencies needed by headers the code exports, use ``build_export_depend``.
fr: Pour les dépendances nécessaires aux en-têtes que le code exporte, utilisez ``build_export_depend``.

source: For dependencies only used when running the code, use ``exec_depend``.
fr: Pour les dépendances utilisées uniquement lors de l'exécution du code, utilisez ``exec_depend``.

source: For mixed purposes, use ``depend``, which covers build, export, and execution time dependencies.
fr: À des fins mixtes, utilisez ``depend``, qui couvre les dépendances de temps de construction, d'exportation et d'exécution.

source: These dependencies are manually populated in the ``package.xml`` file by the package's creators and should be an exhaustive list of any non-builtin libraries and packages it requires.
fr: Ces dépendances sont renseignées manuellement dans le fichier ``package.xml`` par les créateurs du package et doivent être une liste exhaustive de toutes les bibliothèques et packages non intégrés dont il a besoin.

source: How does rosdep work?
fr: Comment fonctionne le rosdep ?

source: ``rosdep`` will check for ``package.xml`` files in its path or for a specific package and find the rosdep keys stored within. These keys are then cross-referenced against a central index to find the appropriate ROS package or software library in various package managers. Finally, once the packages are found, they are installed and ready to go!
fr: ``rosdep`` vérifiera les fichiers ``package.xml`` dans son chemin ou pour un paquet spécifique et trouvera les clés rosdep stockées à l'intérieur. Ces clés sont ensuite croisées avec un index central pour trouver le package ROS ou la bibliothèque de logiciels appropriée dans divers gestionnaires de packages. Enfin, une fois les packages trouvés, ils sont installés et prêts à fonctionner !

source: The central index is known as ``rosdistro``, which `may be found here <https://github.com/ros/rosdistro>`_. We'll explore that more in the next section.
fr: L'index central est connu sous le nom de ``rosdistro``, qui `peut être trouvé ici <https://github.com/ros/rosdistro>`_. Nous allons explorer cela plus en détail dans la section suivante.

source: How do I know what keys to put in my package.xml?
fr: Comment savoir quelles clés mettre dans mon package.xml ?

source: Great question, I'm glad you asked!
fr: Excellente question, je suis content que vous l'ayez posée !

source: For ROS packages (e.g. ``nav2_bt_navigator``), you may simply place the name of the package. You can find a list of all released ROS packages in ``rosdistro`` at ``<distro>/distribution.yaml`` for your given ROS distribution.
fr: Pour les packages ROS (par exemple, ``nav2_bt_navigator``), vous pouvez simplement placer le nom du package. Vous pouvez trouver une liste de tous les packages ROS publiés dans ``rosdistro`` à ``<distro>/distribution.yaml`` pour votre distribution ROS donnée.

source: For non-ROS package system dependencies, we will need to find the keys for a particular library. In general, there are two files of interest: ``rosdep/base.yaml`` and ``rosdep/python.yaml``. ``base.yaml`` in general contains the ``apt`` system dependencies. ``python.yaml`` in general contains the ``pip`` python dependencies.
fr: Pour les dépendances système non-ROS, nous devrons trouver les clés d'une bibliothèque particulière. En général, il existe deux fichiers intéressants : ``rosdep/base.yaml`` et ``rosdep/python.yaml``. ``base.yaml`` contient en général les dépendances du système ``apt``. ``python.yaml`` contient en général les dépendances python ``pip``.

source: To find a key, search for your library in this file (preferably ctrl+F, its long) and find the name in ``yaml`` that contains it. This is the key to put in a ``package.xml`` file.
fr: Pour trouver une clé, recherchez votre bibliothèque dans ce fichier (de préférence ctrl+F, c'est long) et trouvez le nom dans ``yaml`` qui la contient. C'est la clé à mettre dans un fichier ``package.xml``.

source: For example, imagine a package had a dependency on ``doxygen`` because it is a great piece of software that cares about quality documentation (hint hint). We would search ``base.yaml`` for ``doxygen`` and come across:
fr: Par exemple, imaginez qu'un paquet ait une dépendance sur ``doxygen`` parce que c'est un excellent logiciel qui se soucie de la qualité de la documentation (indice indice). Nous chercherions ``base.yaml`` pour ``doxygen`` et tomberions sur :

source: That means our rosdep key is ``doxygen``, which would resolve to those various names in different operating system's package managers for installation.
fr: Cela signifie que notre clé rosdep est ``doxygen``, qui résoudrait ces différents noms dans les gestionnaires de packages de différents systèmes d'exploitation pour l'installation.

source: What if my library isn't in rosdistro?
fr: Et si ma bibliothèque n'est pas dans rosdistro ?

source: If your library isn't in ``rosdistro``, you can experience the greatness that is open-source software development: you can add it yourself! Pull requests for rosdistro are typically merged well within a week.
fr: Si votre bibliothèque n'est pas dans ``rosdistro``, vous pouvez découvrir la grandeur du développement de logiciels open source : vous pouvez l'ajouter vous-même ! Les demandes d'extraction pour rosdistro sont généralement fusionnées en une semaine.

source: `Detailed instructions may be found here <https://github.com/ros/rosdistro/blob/master/CONTRIBUTING.md#rosdep-rules-contributions>`_ for how to contribute new rosdep keys. If for some reason these may not be contributed openly, it is possible to fork rosdistro and maintain a alternate index for use.
fr: `Des instructions détaillées peuvent être trouvées ici <https://github.com/ros/rosdistro/blob/master/CONTRIBUTING.md#rosdep-rules-contributions>`_ pour savoir comment contribuer de nouvelles clés rosdep. Si, pour une raison quelconque, ceux-ci ne peuvent pas être contribués ouvertement, il est possible de bifurquer rosdistro et de conserver un index alternatif à utiliser.

source: How do I use the rosdep tool?
fr: Comment utiliser l'outil rosdep ?

source: Now that we have some understanding of ``rosdep``, ``package.xml``, and ``rosdistro``, we're ready to use the utility itself! Firstly, if this is the first time using ``rosdep``, it must be initialized via:
fr: Maintenant que nous avons une certaine compréhension de ``rosdep``, ``package.xml`` et ``rosdistro``, nous sommes prêts à utiliser l'utilitaire lui-même ! Tout d'abord, si c'est la première fois que vous utilisez ``rosdep``, il doit être initialisé via :

source: This will initialize rosdep and ``update`` will update the locally cached rosdistro index. It is a good idea to ``update`` rosdep on occasion to get the latest index.
fr: Cela initialisera rosdep et ``update`` mettra à jour l'index rosdistro mis en cache localement. C'est une bonne idée de ``mettre à jour`` rosdep à l'occasion pour obtenir le dernier index.

source: Finally, we can run ``rosdep install`` to install dependencies. Typically, this is run over a workspace with many packages in a single call to install all dependencies. A call for that would appear as the following, if in the root of the workspace with directory ``src`` containing source code.
fr: Enfin, nous pouvons exécuter ``rosdep install`` pour installer les dépendances. En règle générale, cela est exécuté sur un espace de travail avec de nombreux packages en un seul appel pour installer toutes les dépendances. Un appel pour cela apparaîtrait comme suit, s'il se trouve à la racine de l'espace de travail avec le répertoire ``src`` contenant le code source.

source: Breaking that down:
fr: Décomposer cela :

source: ``--from-paths src`` specifies the path to check for ``package.xml`` files to resolve keys for
fr: ``--from-paths src`` spécifie le chemin pour vérifier les fichiers ``package.xml`` pour résoudre les clés pour

source: ``-y`` means to default yes to all prompts from the package manager to install without prompts
fr: ``-y`` signifie par défaut oui à toutes les invites du gestionnaire de paquets pour installer sans invites

source: ``--ignore-src`` means to ignore installing dependencies, even if a rosdep key exists, if the package itself is also in the workspace.
fr: ``--ignore-src`` signifie ignorer les dépendances d'installation, même si une clé rosdep existe, si le paquet lui-même se trouve également dans l'espace de travail.

source: There are additional arguments and options available. Use ``rosdep -h`` to see them.
fr: Des arguments et des options supplémentaires sont disponibles. Utilisez ``rosdep -h`` pour les voir.
