Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Tutorials/Beginner-CLI-Tools/Understanding-ROS2-Parameters/Understanding-ROS2-Parameters.po
Languages: fr

source: Understanding parameters
fr: Comprendre les paramètres

source: **Goal:** Learn how to get, set, save and reload parameters in ROS 2.
fr: **Objectif :** Apprenez à obtenir, définir, enregistrer et recharger des paramètres dans ROS 2.

source: **Tutorial level:** Beginner
fr: **Niveau du tutoriel :** Débutant

source: **Time:** 5 minutes
fr: **Durée :** 5 minutes

source: Contents
fr: Contenu

source: Background
fr: Arrière-plan

source: A parameter is a configuration value of a node. You can think of parameters as node settings. A node can store parameters as integers, floats, booleans, strings, and lists. In ROS 2, each node maintains its own parameters. For more background on parameters, please see :doc:`the concept document <../../../Concepts/About-ROS-2-Parameters>`.
fr: Un paramètre est une valeur de configuration d'un nœud. Vous pouvez considérer les paramètres comme des paramètres de nœud. Un nœud peut stocker des paramètres sous forme d'entiers, de flottants, de booléens, de chaînes et de listes. Dans ROS 2, chaque nœud gère ses propres paramètres. Pour plus d'informations sur les paramètres, veuillez consulter :doc:`le document conceptuel <../../../Concepts/About-ROS-2-Parameters>`.

source: Prerequisites
fr: Conditions préalables

source: This tutorial uses the :doc:`turtlesim package <../Introducing-Turtlesim/Introducing-Turtlesim>`.
fr: Ce didacticiel utilise le package :doc:`turtlesim <../Introducing-Turtlesim/Introducing-Turtlesim>`.

source: As always, don’t forget to source ROS 2 in :doc:`every new terminal you open <../Configuring-ROS2-Environment>`.
fr: Comme toujours, n'oubliez pas de sourcer ROS 2 dans :doc:`chaque nouveau terminal que vous ouvrez <../Configuring-ROS2-Environment>`.

source: Tasks
fr: Tâches

source: 1 Setup
fr: 1 Configuration

source: Start up the two turtlesim nodes, ``/turtlesim`` and ``/teleop_turtle``.
fr: Démarrez les deux nœuds turtlesim, ``/turtlesim`` et ``/teleop_turtle``.

source: Open a new terminal and run:
fr: Ouvrez un nouveau terminal et exécutez :

source: Open another terminal and run:
fr: Ouvrez un autre terminal et exécutez :

source: 2 ros2 param list
fr: 2 liste de paramètres ros2

source: To see the parameters belonging to your nodes, open a new terminal and enter the command:
fr: Pour voir les paramètres appartenant à vos nœuds, ouvrez un nouveau terminal et saisissez la commande :

source: You will see the node namespaces, ``/teleop_turtle`` and ``/turtlesim``, followed by each node’s parameters:
fr: Vous verrez les espaces de noms des nœuds, ``/teleop_turtle`` et ``/turtlesim``, suivis des paramètres de chaque nœud :

source: Every node has the parameter ``use_sim_time``; it’s not unique to turtlesim.
fr: Chaque nœud a le paramètre ``use_sim_time`` ; ce n'est pas unique à turtlesim.

source: Based on their names, it looks like ``/turtlesim``'s parameters determine the background color of the turtlesim window using RGB color values.
fr: D'après leurs noms, il semble que les paramètres de ``/turtlesim`` déterminent la couleur d'arrière-plan de la fenêtre turtlesim en utilisant les valeurs de couleur RVB.

source: To determine a parameter's type, you can use ``ros2 param get``.
fr: Pour déterminer le type d'un paramètre, vous pouvez utiliser ``ros2 param get``.

source: 3 ros2 param get
fr: 3 paramètres ros2 obtenir

source: To display the type and current value of a parameter, use the command:
fr: Pour afficher le type et la valeur actuelle d'un paramètre, utilisez la commande :

source: Let’s find out the current value of ``/turtlesim``’s parameter ``background_g``:
fr: Découvrons la valeur actuelle du paramètre ``/turtlesim`` ``background_g`` :

source: Which will return the value:
fr: Qui renverra la valeur :

source: Now you know ``background_g`` holds an integer value.
fr: Vous savez maintenant que ``background_g`` contient une valeur entière.

source: If you run the same command on ``background_r`` and ``background_b``, you will get the values ``69`` and ``255``, respectively.
fr: Si vous exécutez la même commande sur ``background_r`` et ``background_b``, vous obtiendrez respectivement les valeurs ``69`` et ``255``.

source: 4 ros2 param set
fr: 4 jeu de paramètres ros2

source: To change a parameter's value at runtime, use the command:
fr: Pour modifier la valeur d'un paramètre lors de l'exécution, utilisez la commande :

source: Let’s change ``/turtlesim``’s background color:
fr: Modifions la couleur de fond de ``/turtlesim`` :

source: Your terminal should return the message:
fr: Votre terminal doit renvoyer le message :

source: And the background of your turtlesim window should change colors:
fr: Et le fond de votre fenêtre turtlesim devrait changer de couleur :

source: Setting parameters with the ``set`` command will only change them in your current session, not permanently. However, you can save your settings and reload them the next time you start a node.
fr: La définition des paramètres avec la commande ``set`` ne les modifiera que dans votre session en cours, pas de façon permanente. Cependant, vous pouvez enregistrer vos paramètres et les recharger la prochaine fois que vous démarrez un nœud.

source: 5 ros2 param dump
fr: 5 vidage des paramètres ros2

source: You can view all of a node’s current parameter values by using the command:
fr: Vous pouvez afficher toutes les valeurs de paramètre actuelles d'un nœud à l'aide de la commande :

source: The command prints to the standard output (stdout) by default but you can also redirect the parameter values into a file to save them for later. To save your current configuration of ``/turtlesim``’s parameters into the file ``turtlesim.yaml``, enter the command:
fr: La commande imprime sur la sortie standard (stdout) par défaut, mais vous pouvez également rediriger les valeurs des paramètres dans un fichier pour les enregistrer pour plus tard. Pour enregistrer votre configuration actuelle des paramètres de ``/turtlesim`` dans le fichier ``turtlesim.yaml``, entrez la commande :

source: You will find a new file in the working directory your shell is running in. If you open this file, you’ll see the following content:
fr: Vous trouverez un nouveau fichier dans le répertoire de travail dans lequel votre shell s'exécute. Si vous ouvrez ce fichier, vous verrez le contenu suivant :

source: Dumping parameters comes in handy if you want to reload the node with the same parameters in the future.
fr: Le vidage des paramètres est pratique si vous souhaitez recharger le nœud avec les mêmes paramètres à l'avenir.

source: 6 ros2 param load
fr: 6 chargement de paramètres ros2

source: You can load parameters from a file to a currently running node using the command:
fr: Vous pouvez charger les paramètres d'un fichier vers un nœud en cours d'exécution à l'aide de la commande :

source: To load the ``turtlesim.yaml`` file generated with ``ros2 param dump`` into ``/turtlesim`` node’s parameters, enter the command:
fr: Pour charger le fichier ``turtlesim.yaml`` généré avec ``ros2 param dump`` dans les paramètres du nœud ``/turtlesim``, entrez la commande :

source: Your terminal will return the message:
fr: Votre terminal renverra le message :

source: Read-only parameters can only be modified at startup and not afterwards, that is why there are some warnings for the "qos_overrides" parameters.
fr: Les paramètres en lecture seule ne peuvent être modifiés qu'au démarrage et pas après, c'est pourquoi il y a des avertissements pour les paramètres "qos_overrides".

source: 7 Load parameter file on node startup
fr: 7 Charger le fichier de paramètres au démarrage du nœud

source: To start the same node using your saved parameter values, use:
fr: Pour démarrer le même nœud en utilisant vos valeurs de paramètre enregistrées, utilisez :

source: This is the same command you always use to start turtlesim, with the added flags ``--ros-args`` and ``--params-file``, followed by the file you want to load.
fr: C'est la même commande que vous utilisez toujours pour démarrer turtlesim, avec les drapeaux ajoutés ``--ros-args`` et ``--params-file``, suivis du fichier que vous voulez charger.

source: Stop your running turtlesim node so you can try reloading it with your saved parameters, using:
fr: Arrêtez votre nœud turtlesim en cours d'exécution afin que vous puissiez essayer de le recharger avec vos paramètres enregistrés, en utilisant :

source: The turtlesim window should appear as usual, but with the purple background you set earlier.
fr: La fenêtre de turtlesim devrait apparaître comme d'habitude, mais avec le fond violet que vous avez défini précédemment.

source: In this case, parameters are being modified at startup so the specified read-only parameters will also take effect.
fr: Dans ce cas, les paramètres sont modifiés au démarrage, de sorte que les paramètres en lecture seule spécifiés prendront également effet.

source: Summary
fr: Résumé

source: Nodes have parameters to define their default configuration values. You can ``get`` and ``set`` parameter values from the command line. You can also save the parameter settings to a file to reload them in a future session.
fr: Les nœuds ont des paramètres pour définir leurs valeurs de configuration par défaut. Vous pouvez ``obtenir`` et ``définir`` les valeurs des paramètres depuis la ligne de commande. Vous pouvez également enregistrer les réglages des paramètres dans un fichier pour les recharger lors d'une prochaine session.

source: Next steps
fr: Prochaines étapes

source: Jumping back to ROS 2 communication methods, in the next tutorial you'll learn about :doc:`actions <../Understanding-ROS2-Actions/Understanding-ROS2-Actions>`.
fr: Pour revenir aux méthodes de communication ROS 2, dans le prochain didacticiel, vous découvrirez :doc:`actions <../Understanding-ROS2-Actions/Understanding-ROS2-Actions>`.
