Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Concepts/About-Topic-Statistics.po
Languages: fr

source: About topic statistics
fr: À propos des statistiques de sujet

source: Table of Contents
fr: Table des matières

source: Overview
fr: Aperçu

source: ROS 2 provides the integrated measurement of statistics for messages received by any subscription. Allowing a user to collect subscription statistics enables them to characterize the performance of their system or aid in diagnosis of any present issues.
fr: ROS 2 fournit la mesure intégrée des statistiques pour les messages reçus par n'importe quel abonnement. Permettre à un utilisateur de collecter des statistiques d'abonnement lui permet de caractériser les performances de son système ou d'aider au diagnostic de tout problème actuel.

source: The measurements provided are the received message age and received message period. For each measurement the statistics provided are the average, maximum, minimum, standard deviation, and sample count. These statistics are calculated in a moving window.
fr: Les mesures fournies sont l'âge du message reçu et la période du message reçu. Pour chaque mesure, les statistiques fournies sont la moyenne, le maximum, le minimum, l'écart type et le nombre d'échantillons. Ces statistiques sont calculées dans une fenêtre mobile.

source: How statistics are calculated
fr: Comment les statistiques sont calculées

source: Each statistic set is calculated in constant time and constant memory by using the utilities implemented in the `libstatistics_collector <https://github.com/ros-tooling/libstatistics_collector>`__ package. When a new message is received by a subscription, this is a new sample for calculation in the current measurement window. The average calculated is simply a `moving average <https://en.wikipedia.org/wiki/Moving_average>`__. The maximum, minimum,and sample count are updated upon receipt of each new sample, whereas the standard deviation is calculated using `Welford's online algorithm <https://en.wikipedia.org/wiki/Algorithms_for_calculating_variance#Welford's_online_algorithm>`__.
fr: Chaque ensemble de statistiques est calculé en temps constant et en mémoire constante à l'aide des utilitaires implémentés dans le package `libstatistics_collector <https://github.com/ros-tooling/libstatistics_collector>`__. Lorsqu'un nouveau message est reçu par un abonnement, il s'agit d'un nouvel échantillon à calculer dans la fenêtre de mesure en cours. La moyenne calculée est simplement une `moyenne mobile <https://en.wikipedia.org/wiki/Moving_average>`__. Le maximum, le minimum et le nombre d'échantillons sont mis à jour à la réception de chaque nouvel échantillon, tandis que l'écart type est calculé à l'aide de l'algorithme en ligne de Welford <https://en.wikipedia.org/wiki/Algorithms_for_calculating_variance#Welford's_online_algorithm>`__.

source: Types of statistics calculated
fr: Types de statistiques calculées

source: Received message period
fr: Période de message reçu

source: Units: milliseconds
fr: Unités : millisecondes

source: Uses the system clock to measure the period between received messages
fr: Utilise l'horloge système pour mesurer la période entre les messages reçus

source: Received message age
fr: Âge du message reçu

source: Requires a message to have a timestamp populated in the header field in order to calculate the age of the message as sent from a publisher.
fr: Nécessite qu'un message ait un horodatage rempli dans le champ d'en-tête afin de calculer l'âge du message tel qu'il a été envoyé par un éditeur.

source: Behavior
fr: Comportement

source: By default, Topic Statistics measurements are not enabled. After enabling this feature for a specific node via the subscription configuration options, both received message age and received message period measurements are enabled for that specific subscription.
fr: Par défaut, les mesures des statistiques de sujet ne sont pas activées. Après avoir activé cette fonctionnalité pour un nœud spécifique via les options de configuration de l'abonnement, les mesures de l'âge des messages reçus et de la période des messages reçus sont activées pour cet abonnement spécifique.

source: The data is published as a `statistics_msg/msg/MetricsMessage <https://github.com/ros2/rcl_interfaces/blob/rolling/statistics_msgs/msg/MetricsMessage.msg>`__ at a configurable period (default 1 second) to a configurable topic (default ``/statistics``). Note that the publishing period also serves as the sample collection window period.
fr: Les données sont publiées sous la forme d'un `statistics_msg/msg/MetricsMessage <https://github.com/ros2/rcl_interfaces/blob/rolling/statistics_msgs/msg/MetricsMessage.msg>`__ à une période configurable (par défaut 1 seconde) à un sujet configurable (par défaut ``/statistiques``). Notez que la période de publication sert également de période de fenêtre de collecte d'échantillons.

source: Since received message period requires a message timestamp in a header field, empty data is published. That is, all statistics values are NaN if no timestamp is found. Publishing NaN values instead of not publishing at all avoids the absence of a signal problem and is meant to explicitly show that a measurement could not be made.
fr: Étant donné que la période de message reçu nécessite un horodatage de message dans un champ d'en-tête, des données vides sont publiées. Autrement dit, toutes les valeurs statistiques sont NaN si aucun horodatage n'est trouvé. La publication des valeurs NaN au lieu de ne pas publier du tout évite l'absence de problème de signal et vise à montrer explicitement qu'une mesure n'a pas pu être effectuée.

source: The first sample of each window for the received message period statistic does not yield a measurement. This is because calculating this statistic requires knowing the time the previous message arrived, so subsequent samples in the window yield measurements.
fr: Le premier échantillon de chaque fenêtre pour la statistique de période de message reçu ne donne pas de mesure. En effet, le calcul de cette statistique nécessite de connaître l'heure à laquelle le message précédent est arrivé, de sorte que les échantillons suivants dans la fenêtre produisent des mesures.

source: Comparison to ROS 1
fr: Comparaison avec ROS 1

source: Similar to ROS 1 `Topic Statistics <https://wiki.ros.org/Topics#Topic_statistics>`__, both message age and message period are calculated, albeit from the subscription side. Other ROS 1 metrics, e.g., the number of dropped messages or traffic volume, are currently not provided.
fr: Semblable à ROS 1 `Topic Statistics <https://wiki.ros.org/Topics#Topic_statistics>`__, l'âge et la période des messages sont calculés, mais du côté de l'abonnement. D'autres mesures ROS 1, par exemple le nombre de messages abandonnés ou le volume de trafic, ne sont actuellement pas fournies.

source: Support
fr: Soutien

source: This feature is currently supported in ROS 2 Foxy for C++ only (rclcpp). Future work and improvements, such as Python support, can be found `here <https://github.com/ros2/ros2/issues/917>`__.
fr: Cette fonctionnalité est actuellement prise en charge dans ROS 2 Foxy pour C++ uniquement (rclcpp). Les travaux et améliorations futurs, tels que la prise en charge de Python, peuvent être trouvés `ici <https://github.com/ros2/ros2/issues/917>`__.
