Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Concepts/About-RQt.po
Languages: fr

source: Overview and usage of RQt
fr: Présentation et utilisation de RQt

source: Table of Contents
fr: Table des matières

source: Overview
fr: Aperçu

source: RQt is a graphical user interface framework that implements various tools and interfaces in the form of plugins. One can run all the existing GUI tools as dockable windows within RQt! The tools can still run in a traditional standalone method, but RQt makes it easier to manage all the various windows in a single screen layout.
fr: RQt est un framework d'interface utilisateur graphique qui implémente divers outils et interfaces sous la forme de plugins. On peut exécuter tous les outils graphiques existants en tant que fenêtres ancrables dans RQt ! Les outils peuvent toujours fonctionner dans une méthode autonome traditionnelle, mais RQt facilite la gestion de toutes les différentes fenêtres dans une disposition d'écran unique.

source: You can run any RQt tools/plugins easily by:
fr: Vous pouvez exécuter facilement tous les outils/plugins RQt en :

source: This GUI allows you to choose any available plugins on your system. You can also run plugins in standalone windows. For example, RQt Python Console:
fr: Cette interface graphique vous permet de choisir tous les plugins disponibles sur votre système. Vous pouvez également exécuter des plugins dans des fenêtres autonomes. Par exemple, la console Python RQt :

source: Users can create their own plugins for RQt with either ``Python`` or ``C++``. To see what RQt plugins are available for your system, run:
fr: Les utilisateurs peuvent créer leurs propres plugins pour RQt avec ``Python`` ou ``C++``. Pour voir quels plugins RQt sont disponibles pour votre système, exécutez :

source: And then look for packages that start with ``rqt_``.
fr: Ensuite, recherchez les packages commençant par ``rqt_``.

source: System setup
fr: Installation du système

source: Installing From Debian
fr: Installation à partir de Debian

source: Building From Source
fr: Construire à partir de la source

source: See :doc:`Building RQt from Source <../How-To-Guides/RQt-Source-Install>`.
fr: Voir :doc:`Building RQt from Source <../How-To-Guides/RQt-Source-Install>`.

source: RQt Components Structure
fr: Structure des composants RQt

source: RQt consists of two metapackages:
fr: RQt se compose de deux métapaquets :

source: *rqt* - core infrastucture modules.
fr: *rqt* - modules d'infrastructure de base.

source: *rqt_common_plugins* - Commonly useful debugging tools.
fr: *rqt_common_plugins* - Outils de débogage couramment utiles.

source: Advantage of RQt framework
fr: Avantage du framework RQt

source: Compared to building your own GUIs from scratch:
fr: Par rapport à la création de vos propres interfaces graphiques à partir de rien :

source: Standardized common procedures for GUI (start-shutdown hook, restore previous states).
fr: Procédures communes standardisées pour l'interface graphique (crochet de démarrage-arrêt, restauration des états précédents).

source: Multiple widgets can be docked in a single window.
fr: Plusieurs widgets peuvent être ancrés dans une seule fenêtre.

source: Easily turn your existing Qt widgets into RQt plugins.
fr: Transformez facilement vos widgets Qt existants en plugins RQt.

source: Expect support at `ROS Answers <https://answers.ros.org>`__ (ROS community website for the questions).
fr: Attendez-vous à une assistance sur `ROS Answers <https://answers.ros.org>`__ (site Web de la communauté ROS pour les questions).

source: From system architecture's perspective:
fr: Du point de vue de l'architecture système :

source: Support multi-platform (basically wherever `QT <http://qt-project.org/>`__ and ROS run) and multi-language (``Python``, ``C++``).
fr: Prise en charge multi-plateforme (essentiellement partout où `QT <http://qt-project.org/>`__ et ROS s'exécutent) et multi-langage (``Python``, ``C++``).

source: Manageable lifecycle: RQt plugins using common API makes maintainance & reuse easier.
fr: Cycle de vie gérable : les plugins RQt utilisant une API commune facilitent la maintenance et la réutilisation.

source: Further Reading
fr: Lectures complémentaires

source: ROS 2 Discourse `announcment of porting to ROS 2 <https://discourse.ros.org/t/rqt-in-ros2/6428>`__).
fr: ROS 2 Discourse `annonce de portage vers ROS 2 <https://discourse.ros.org/t/rqt-in-ros2/6428>`__).

source: `RQt for ROS 1 documentation <https://wiki.ros.org/rqt>`__.
fr: `Documentation RQt pour ROS 1 <https://wiki.ros.org/rqt>`__.

source: Brief overview of RQt (from `a Willow Garage intern blog post <http://web.archive.org/web/20130518142837/http://www.willowgarage.com/blog/2012/10/21/ros-gui>`__).
fr: Bref aperçu de RQt (tiré d'un article de blog d'un stagiaire de Willow Garage <http://web.archive.org/web/20130518142837/http://www.willowgarage.com/blog/2012/10/21/ros-gui> `__).
