Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Concepts/About-Internal-Interfaces.po
Languages: fr

source: The ``rcl`` |API| is located in the `ros2/rcl <https://github.com/ros2/rcl>`_ repository on |GitHub|_ and contains the interface as C headers. The ``rcl`` C implementation is provided by the ``rcl`` |package| in the same repository. This implementation avoids direct contact with the middleware by instead using the ``rmw`` and ``rosidl`` |APIs|.
fr: L'|API| ``rcl`` est situé dans le référentiel `ros2/rcl <https://github.com/ros2/rcl>`_ sur |GitHub|_ et contient l'interface sous forme d'en-têtes C. L'implémentation ``rcl`` C est fournie par le ``rcl`` |package| dans le même référentiel. Cette implémentation évite le contact direct avec le middleware en utilisant à la place les |APIs| ``rmw`` et ``rosidl``.

source: For a complete definition of the ``rcl`` |API|, see its `API documentation <http://docs.ros2.org/foxy/api/rcl/index.html>`_:
fr: Pour une définition complète de ``rcl`` |API|, consultez sa `documentation API <http://docs.ros2.org/foxy/api/rcl/index.html>`_ :

source: The ``rmw`` Repository
fr: Le référentiel ``rmw``

source: The ROS middleware interface (``rmw`` |API|) is the minimal set of primitive middleware capabilities needed to build ROS on top. Providers of different middleware implementations must implement this interface in order to support the entire ROS stack on top. Currently all of the middleware implementations are for different DDS vendors.
fr: L'interface middleware ROS (``rmw`` |API|) est l'ensemble minimal de fonctionnalités middleware primitives nécessaires pour construire ROS par dessus. Les fournisseurs de différentes implémentations de middleware doivent implémenter cette interface afin de prendre en charge l'ensemble de la pile ROS. Actuellement, toutes les implémentations de middleware sont destinées à différents fournisseurs de DDS.

source: The ``rmw`` |API| is located in the `ros2/rmw <https://github.com/ros2/rmw>`_ repository. The ``rmw`` |package| contains the C headers which define the interface, the implementation of which is provided by the various |packages| of rmw implementations for different DDS vendors.
fr: L'|API| ``rmw`` se trouve dans le dépôt `ros2/rmw <https://github.com/ros2/rmw>`_. Le |paquet| ``rmw`` contient les en-têtes C qui définissent l'interface dont l'implémentation est assurée par les différents |packages| d'implémentations rmw pour différents fournisseurs de DDS.

source: For a definition of the ``rmw`` |API|, see the |API| docs:
fr: Pour une définition de l'|API| ``rmw``, voir l'|API| documents :

source: The ``rosidl`` Repository
fr: Le référentiel ``rosidl``

source: The ``rosidl`` |API| consists of a few message related static functions and types along with a definition of what code should be generated by messages in different languages. The generated message code specified in the |API| will be language specific, but may or may not reuse generated code for other languages. The generated message code specified in the |API| contains things like the message data structure, functions for construction, destruction, etc. The |API| will also implement a way to get the type support structure for the message type, which is used when publishing or subscribing to a topic of that message type.
fr: L'|API| ``rosidl`` se compose de quelques fonctions et types statiques liés aux messages, ainsi que d'une définition du code qui doit être généré par les messages dans différentes langues. Le code de message généré spécifié dans l'|API| sera spécifique à la langue, mais peut ou non réutiliser le code généré pour d'autres langues. Le code de message généré spécifié dans l'|API| contient des éléments tels que la structure des données du message, les fonctions de construction, de destruction, etc. L'|API| implémentera également un moyen d'obtenir la structure de support de type pour le type de message, qui est utilisée lors de la publication ou de l'abonnement à un sujet de ce type de message.

source: There are several repositories that play a role in the ``rosidl`` |API| and implementation.
fr: Il existe plusieurs dépôts qui jouent un rôle dans le ``rosidl`` |API| et la mise en œuvre.

source: The ``rosidl`` repository, located on |GitHub|_ at `ros2/rosidl <https://github.com/ros2/rosidl>`_, defines the message IDL syntax, i.e. syntax of ``.msg`` files, ``.srv`` files, etc., and contains |packages| for parsing the files, for providing CMake infrastructure to generate code from the messages, for generating implementation agnostic code (headers and source files), and for establishing the default set of generators. The repository contains these |packages|:
fr: Le référentiel ``rosidl``, situé sur |GitHub|_ à `ros2/rosidl <https://github.com/ros2/rosidl>`_, définit la syntaxe IDL du message, c'est-à-dire la syntaxe de ``.msg`` fichiers, fichiers ``.srv``, etc., et contient des |packages| pour analyser les fichiers, pour fournir une infrastructure CMake pour générer du code à partir des messages, pour générer du code indépendant de l'implémentation (en-têtes et fichiers source) et pour établir l'ensemble de générateurs par défaut. Le dépôt contient ces |packages| :

source: ``rosidl_cmake``: provides CMake functions and CMake Modules for generating code from ``rosidl`` files, e.g. ``.msg`` files, ``.srv`` files, etc.
fr: ``rosidl_cmake`` : fournit des fonctions CMake et des modules CMake pour générer du code à partir de fichiers ``rosidl``, par ex. Fichiers ``.msg``, fichiers ``.srv``, etc.

source: ``rosidl_default_generators``: defines the list of default generators which ensures that they are installed as dependencies, but other injected generators can also be used.
fr: ``rosidl_default_generators`` : définit la liste des générateurs par défaut qui garantit qu'ils sont installés en tant que dépendances, mais d'autres générateurs injectés peuvent également être utilisés.

source: ``rosidl_generator_c``: provides tools to generate C header files (``.h``) for ``rosidl`` files.
fr: ``rosidl_generator_c`` : fournit des outils pour générer des fichiers d'en-tête C (``.h``) pour les fichiers ``rosidl``.

source: ``rosidl_generator_cpp``: provides tools to generate C++ header files (``.hpp``) for ``rosidl`` files.
fr: ``rosidl_generator_cpp`` : fournit des outils pour générer des fichiers d'en-tête C++ (``.hpp``) pour les fichiers ``rosidl``.

source: ``rosidl_generator_py``: provides tools to generate Python modules for ``rosidl`` files.
fr: ``rosidl_generator_py`` : fournit des outils pour générer des modules Python pour les fichiers ``rosidl``.

source: ``rosidl_parser``: provides Python |API| for parsing ``rosidl`` files.
fr: ``rosidl_parser`` : fournit Python |API| pour analyser les fichiers ``rosidl``.

source: Generators for other languages, e.g. ``rosidl_generator_java``, are hosted externally (in different repositories) but would use the same mechanism that the above generators use to "register" themselves as a ``rosidl`` generator.
fr: Générateurs pour d'autres langues, par ex. ``rosidl_generator_java``, sont hébergés en externe (dans différents référentiels) mais utiliseraient le même mécanisme que les générateurs ci-dessus utilisent pour "s'enregistrer" en tant que générateur ``rosidl``.

source: In addition to the aforementioned |packages| for parsing and generating headers for the ``rosidl`` files, the ``rosidl`` repository also contains |packages| concerned with "type support" for the message types defined in the files. Type support refers to the ability to interpret and manipulate the information represented by ROS message instances of particular types (publishing the messages, for example). Type support can either be provided by code that is generated at compile time or it can be done programmatically based on the contents of the ``rosidl`` file, e.g. the ``.msg`` or ``.srv`` file, and the data received, by introspecting the data. In the case of the latter, where type support is done through runtime interpretation of the messages, the message code generated by ROS 2 can be agnostic to the rmw implementation. The packages that provide this type support through introspection of the data are:
fr: En plus des |forfaits| mentionnés ci-dessus pour analyser et générer des en-têtes pour les fichiers ``rosidl``, le référentiel ``rosidl`` contient également des |packages| concerné par le "support de type" pour les types de messages définis dans les fichiers. La prise en charge des types fait référence à la capacité d'interpréter et de manipuler les informations représentées par des instances de messages ROS de types particuliers (publier les messages, par exemple). La prise en charge des types peut être fournie par le code généré au moment de la compilation ou par programmation en fonction du contenu du fichier ``rosidl``, par ex. le fichier ``.msg`` ou ``.srv``, et les données reçues, en introspectant les données. Dans ce dernier cas, où la prise en charge du type se fait par l'interprétation des messages à l'exécution, le code de message généré par ROS 2 peut être indépendant de l'implémentation rmw. Les packages qui fournissent ce type de support via l'introspection des données sont :

source: ``rosidl_typesupport_introspection_c``: provides tools for generating C code for supporting ``rosidl`` message data types.
fr: ``rosidl_typesupport_introspection_c`` : fournit des outils pour générer du code C pour prendre en charge les types de données de message ``rosidl``.

source: ``rosidl_typesupport_introspection_cpp``: provides tools for generating C++ code for supporting ``rosidl`` message data types.
fr: ``rosidl_typesupport_introspection_cpp`` : fournit des outils pour générer du code C++ pour prendre en charge les types de données de message ``rosidl``.

source: In the case where type support is to be generated at compile time instead of being generated programmatically, a package specific to the rmw implementation will need to be used. This is because typically a particular rmw implementation will require data to be stored and manipulated in a manner that is specific to the DDS vendor in order for the DDS implementation to make use of it. See the :ref:`Type Specific Interfaces` section above for more details.
fr: Dans le cas où le support de type doit être généré au moment de la compilation au lieu d'être généré par programme, un package spécifique à l'implémentation rmw devra être utilisé. En effet, une implémentation rmw particulière nécessitera généralement que les données soient stockées et manipulées d'une manière spécifique au fournisseur DDS afin que l'implémentation DDS puisse les utiliser. Voir la section :ref:`Type Specific Interfaces` ci-dessus pour plus de détails.

source: For more information on what exactly is in the ``rosidl`` |API| (static and generated) see this page:
fr: Pour plus d'informations sur le contenu exact de l'|API| ``rosidl`` (statique et généré) voir cette page :

source: TODO: link to definition of ``rosidl`` |APIs|
fr: TODO : lien vers la définition de ``rosidl`` |APIs|

source: The ``rcutils`` Repository
fr: Le référentiel ``rutils``

source: ROS 2 C Utilities (``rcutils``) is a C |API| composed of macros, functions, and data structures used throughout the ROS 2 codebase. These are mainly used for error handling, commandline argument parsing, and logging which are not specific to the client or middleware layers and can be shared by both.
fr: ROS 2 C Utilities (``rcutils``) est un C |API| composé de macros, de fonctions et de structures de données utilisées dans la base de code ROS 2. Ceux-ci sont principalement utilisés pour la gestion des erreurs, l'analyse des arguments de ligne de commande et la journalisation qui ne sont pas spécifiques aux couches client ou middleware et peuvent être partagées par les deux.

source: The ``rcutils`` |API| and implementation are located in the `ros2/rcutils <https://github.com/ros2/rcutils>`_ repository on |GitHub|_ which contains the interface as C headers.
fr: Les ``rutils`` |API| et l'implémentation se trouvent dans le référentiel `ros2/rcutils <https://github.com/ros2/rcutils>`_ sur |GitHub|_ qui contient l'interface sous forme d'en-têtes C.

source: For a complete definition of the ``rcutils`` |API|, see `its API documentation <http://docs.ros2.org/foxy/api/rcutils/index.html>`_
fr: Pour une définition complète de ``rcutils`` |API|, consultez `sa documentation API <http://docs.ros2.org/foxy/api/rcutils/index.html>`_
