Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Concepts/About-Command-Line-Tools.po
Languages: fr

source: Introspection with command line tools
fr: Introspection avec des outils en ligne de commande

source: Table of Contents
fr: Table des matières

source: ROS 2 includes a suite of command-line tools for introspecting a ROS 2 system.
fr: ROS 2 comprend une suite d'outils de ligne de commande pour l'introspection d'un système ROS 2.

source: The main entry point for the tools is the command ``ros2``, which itself has various sub-commands for introspecting and working with nodes, topics, services, and more.
fr: Le point d'entrée principal des outils est la commande ``ros2``, qui elle-même comporte diverses sous-commandes pour l'introspection et le travail avec des nœuds, des sujets, des services, etc.

source: To see all available sub-commands run:
fr: Pour voir toutes les sous-commandes disponibles, exécutez :

source: Examples of sub-commands that are available include:
fr: Voici des exemples de sous-commandes disponibles :

source: action: Introspect/interact with ROS actions
fr: action : Introspecter/interagir avec les actions ROS

source: bag: Record/play a rosbag
fr: bag : Enregistrer/jouer un rosbag

source: component: Manage component containers
fr: composant : gérer les conteneurs de composants

source: daemon: Introspect/configure the ROS 2 daemon
fr: démon : introspecter/configurer le démon ROS 2

source: doctor: Check ROS setup for potential issues
fr: médecin : Vérifiez la configuration du ROS pour les problèmes potentiels

source: interface: Show information about ROS interfaces
fr: interface : affiche des informations sur les interfaces ROS

source: launch: Run/introspect a launch file
fr: launch : exécuter/introspecter un fichier de lancement

source: lifecycle: Introspect/manage nodes with managed lifecycles
fr: cycle de vie : Introspecter/gérer les nœuds avec des cycles de vie gérés

source: node: Introspect ROS nodes
fr: nœud : Introspecter les nœuds ROS

source: param: Introspect/configure parameters on a node
fr: param : introspecter/configurer les paramètres sur un nœud

source: pkg: Introspect ROS packages
fr: pkg : packages Introspect ROS

source: run: Run ROS nodes
fr: run : exécuter les nœuds ROS

source: security: Configure security settings
fr: sécurité : configurer les paramètres de sécurité

source: service: Introspect/call ROS services
fr: service : introspection/appel des services ROS

source: srv: Introspect ``srv`` types
fr: srv : Introspecter les types ``srv``

source: test: Run a ROS launch test
fr: test : exécuter un test de lancement ROS

source: topic: Introspect/publish ROS topics
fr: sujet : Introspecter/publier les sujets ROS

source: trace: Tracing tools to get information on ROS nodes execution (only available on Linux)
fr: trace : outils de traçage pour obtenir des informations sur l'exécution des nœuds ROS (uniquement disponible sur Linux)

source: Example
fr: Exemple

source: To produce the typical talker-listener example using command-line tools, the ``topic`` sub-command can be used to publish and echo messages on a topic.
fr: Pour produire l'exemple typique de locuteur-auditeur à l'aide d'outils de ligne de commande, la sous-commande ``topic`` peut être utilisée pour publier et faire écho à des messages sur un sujet.

source: Publish messages in one terminal with:
fr: Publiez des messages dans un seul terminal avec :

source: Echo messages received in another terminal with:
fr: Echo des messages reçus dans un autre terminal avec :

source: Behind the scenes
fr: Dans les coulisses

source: ROS 2 uses a distributed discovery process for nodes to connect to each other. As this process purposefully does not use a centralized discovery mechanism (like the ROS Master in ROS 1), it can take time for ROS nodes to discover all other participants in the ROS graph. Because of this, there is a long-running daemon in the background that stores information about the ROS graph to provide faster responses to queries, e.g. the list of node names.
fr: ROS 2 utilise un processus de découverte distribué pour que les nœuds se connectent les uns aux autres. Comme ce processus n'utilise délibérément pas de mécanisme de découverte centralisé (comme le maître ROS dans ROS 1), les nœuds ROS peuvent mettre du temps à découvrir tous les autres participants du graphe ROS. Pour cette raison, il existe un démon de longue durée en arrière-plan qui stocke des informations sur le graphique ROS pour fournir des réponses plus rapides aux requêtes, par ex. la liste des noms de nœuds.

source: The daemon is automatically started when the relevant command-line tools are used for the first time. You can run ``ros2 daemon --help`` for more options for interacting with the daemon.
fr: Le démon est automatiquement lancé lorsque les outils de ligne de commande appropriés sont utilisés pour la première fois. Vous pouvez exécuter ``ros2 daemon --help`` pour plus d'options d'interaction avec le démon.

source: Implementation
fr: Mise en œuvre

source: The source code for the ``ros2`` command is available at https://github.com/ros2/ros2cli
fr: Le code source de la commande ``ros2`` est disponible sur https://github.com/ros2/ros2cli

source: The ``ros2`` tool has been implemented as a framework that can be extended via plugins. For example, the `sros2 <https://github.com/ros2/sros2>`__ package provides a ``security`` sub-command that is automatically detected by the ``ros2`` tool if the ``sros2`` package is installed.
fr: L'outil ``ros2`` a été implémenté comme un framework qui peut être étendu via des plugins. Par exemple, le package `sros2 <https://github.com/ros2/sros2>`__ fournit une sous-commande ``security`` qui est automatiquement détectée par l'outil ``ros2`` si le ``sros2` ` le paquet est installé.
