Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Concepts/About-ROS-2-Client-Libraries.po
Languages: fr

source: About ROS 2 client libraries
fr: À propos des bibliothèques clientes ROS 2

source: Table of Contents
fr: Table des matières

source: Overview
fr: Aperçu

source: Client libraries are the APIs that allow users to implement their ROS code. Using client libraries, users gain access to ROS concepts such as nodes, topics, services, etc. Client libraries come in a variety of programming languages so that users may write ROS code in the language that is best-suited for their application. For example, you might prefer to write visualization tools in Python because it makes prototyping iterations faster, while for parts of your system that are concerned with efficiency, the nodes might be better implemented in C++.
fr: Les bibliothèques clientes sont les API qui permettent aux utilisateurs d'implémenter leur code ROS. À l'aide de bibliothèques clientes, les utilisateurs ont accès aux concepts ROS tels que les nœuds, les sujets, les services, etc. Les bibliothèques clientes sont disponibles dans une variété de langages de programmation afin que les utilisateurs puissent écrire du code ROS dans le langage le mieux adapté à leur application. Par exemple, vous préférerez peut-être écrire des outils de visualisation en Python car cela accélère les itérations de prototypage, tandis que pour les parties de votre système qui sont concernées par l'efficacité, les nœuds pourraient être mieux implémentés en C++.

source: Nodes written using different client libraries are able to share messages with each other because all client libraries implement code generators that provide users with the capability to interact with ROS interface files in the respective language.
fr: Les nœuds écrits à l'aide de différentes bibliothèques clientes peuvent partager des messages entre eux car toutes les bibliothèques clientes implémentent des générateurs de code qui permettent aux utilisateurs d'interagir avec les fichiers d'interface ROS dans la langue respective.

source: In addition to the language-specific communication tools, client libraries expose to users the core functionality that makes ROS “ROS”. For example, here is a list of functionality that can typically be accessed through a client library:
fr: En plus des outils de communication spécifiques au langage, les bibliothèques clientes exposent aux utilisateurs les fonctionnalités de base qui font de ROS « ROS ». Par exemple, voici une liste de fonctionnalités généralement accessibles via une bibliothèque client :

source: Names and namespaces
fr: Noms et espaces de noms

source: Time (real or simulated)
fr: Temps (réel ou simulé)

source: Parameters
fr: Paramètres

source: Console logging
fr: Journalisation de la console

source: Threading model
fr: Modèle de filetage

source: Intra-process communication
fr: Communication intra-processus

source: Supported client libraries
fr: Bibliothèques clientes prises en charge

source: The C++ client library (``rclcpp``) and the Python client library (``rclpy``) are both client libraries which utilize common functionality in the RCL.
fr: La bibliothèque cliente C++ (``rclcpp``) et la bibliothèque cliente Python (``rclpy``) sont toutes deux des bibliothèques clientes qui utilisent des fonctionnalités communes dans la RCL.

source: The ``rclcpp`` Package
fr: Le paquet ``rclcpp``

source: The ROS Client Library for C++ (``rclcpp``) is the user facing, C++ idiomatic interface which provides all of the ROS client functionality like creating nodes, publisher, and subscribers. ``rclcpp`` builds on top of ``rcl`` and the ``rosidl`` |API|, and it is designed to be used with the C++ messages generated by ``rosidl_generator_cpp``.
fr: La bibliothèque cliente ROS pour C++ (``rclcpp``) est l'interface idiomatique C++ orientée vers l'utilisateur qui fournit toutes les fonctionnalités du client ROS telles que la création de nœuds, l'éditeur et les abonnés. ``rclcpp`` se construit au-dessus de ``rcl`` et de ``rosidl`` |API|, et il est conçu pour être utilisé avec les messages C++ générés par ``rosidl_generator_cpp``.

source: ``rclcpp`` makes use of all the features of C++ and C++17 to make the interface as easy to use as possible, but since it reuses the implementation in ``rcl`` it is able maintain a consistent behavior with the other client libraries that use the ``rcl`` |API|.
fr: ``rclcpp`` utilise toutes les fonctionnalités de C++ et C++17 pour rendre l'interface aussi facile à utiliser que possible, mais puisqu'il réutilise l'implémentation dans ``rcl``, il est capable de maintenir un comportement cohérent avec le d'autres bibliothèques clientes qui utilisent l'|API| ``rcl``.

source: The ``rclcpp`` repository is located on GitHub at `ros2/rclcpp <https://github.com/ros2/rclcpp>`_ and contains the |package| ``rclcpp``. The generated |API| documentation is here:
fr: Le référentiel ``rclcpp`` est situé sur GitHub à `ros2/rclcpp <https://github.com/ros2/rclcpp>`_ et contient le |package| ``rclcpp``. L'|API| générée la documentation est ici :

source: The ``rclpy`` Package
fr: Le paquet ``rclpy``

source: The ROS Client Library for Python (``rclpy``) is the Python counterpart to the C++ client library. Like the C++ client library, ``rclpy`` also builds on top of the ``rcl`` C API for its implementation. The interface provides an idiomatic Python experience which uses native Python types and patterns like lists and context objects, but by using the ``rcl`` |API| in the implementation it stays consistent with the other client libraries in terms of feature parity and behavior. In addition to providing Python idiomatic bindings around the ``rcl`` |API| and Python classes for each message, the Python client library takes care of the execution model, using ``threading.Thread`` or similar to run the functions in the ``rcl`` |API|.
fr: La bibliothèque cliente ROS pour Python (``rclpy``) est l'équivalent Python de la bibliothèque cliente C++. Comme la bibliothèque cliente C++, ``rclpy`` s'appuie également sur l'API C ``rcl`` pour son implémentation. L'interface fournit une expérience Python idiomatique qui utilise des types et des modèles Python natifs comme des listes et des objets de contexte, mais en utilisant l'API ``rcl`` |API| dans l'implémentation, il reste cohérent avec les autres bibliothèques clientes en termes de parité des fonctionnalités et de comportement. En plus de fournir des liaisons idiomatiques Python autour de ``rcl`` |API| et Python pour chaque message, la bibliothèque cliente Python s'occupe du modèle d'exécution, en utilisant ``threading.Thread`` ou similaire pour exécuter les fonctions dans ``rcl`` |API|.

source: Like C++ it generates custom Python code for each ROS message that the user interacts with, but unlike C++ it eventually converts the native Python message object into the C version of the message. All operations happen on the Python version of the messages until they need to be passed into the ``rcl`` layer, at which point they are converted into the plain C version of the message so it can be passed into the ``rcl`` C |API|. This is avoided if possible when communicating between publishers and subscribers in the same process to cut down on the conversion into and out of Python.
fr: Comme C++, il génère du code Python personnalisé pour chaque message ROS avec lequel l'utilisateur interagit, mais contrairement à C++, il convertit finalement l'objet de message Python natif dans la version C du message. Toutes les opérations se produisent sur la version Python des messages jusqu'à ce qu'elles aient besoin d'être passées dans la couche ``rcl``, à quel point elles sont converties dans la version C ordinaire du message afin qu'elle puisse être passée dans le ``rcl` ` C |API|. Ceci est évité si possible lors de la communication entre les éditeurs et les abonnés dans le même processus pour réduire la conversion vers et depuis Python.

source: The ``rclpy`` repository is located on GitHub at `ros2/rclpy <https://github.com/ros2/rclpy>`_ and contains the |package| ``rclpy``. The generated |API| documentation is here:
fr: Le référentiel ``rclpy`` est situé sur GitHub à `ros2/rclpy <https://github.com/ros2/rclpy>`_ et contient le |package| ``rclpy``. L'|API| générée la documentation est ici :

source: Community-maintained
fr: Maintenu par la communauté

source: While the C++ and Python client libraries are maintained by the core ROS 2 team, members of the ROS 2 community maintain additional client libraries:
fr: Alors que les bibliothèques clientes C++ et Python sont gérées par l'équipe principale de ROS 2, les membres de la communauté ROS 2 maintiennent des bibliothèques clientes supplémentaires :

source: `Ada <https://github.com/ada-ros/ada4ros2>`__ Ada binding and tools for ROS 2 - workspace overlay.
fr: `Ada <https://github.com/ada-ros/ada4ros2>`__ Liaison Ada et outils pour ROS 2 - superposition d'espace de travail.

source: `C <https://github.com/ros2/rclc>`__ ``rclc`` does not put a layer on top of rcl but complements rcl to make rcl+rclc a feature-complete client library in C. See `micro.ros.org <https://micro.ros.org/>`__ for tutorials.
fr: `C <https://github.com/ros2/rclc>`__ ``rclc`` ne place pas de couche au-dessus de rcl mais complète rcl pour faire de rcl+rclc une bibliothèque client complète en C. Voir ` micro.ros.org <https://micro.ros.org/>`__ pour les tutoriels.

source: `JVM and Android <https://github.com/ros2-java>`__ Java and Android bindings for ROS 2.
fr: `JVM et Android <https://github.com/ros2-java>`__ Liaisons Java et Android pour ROS 2.

source: `_.NET Core, UWP and C# <https://github.com/esteve/ros2_dotnet>`__ This is a collection of projects (bindings, code generator, examples and more) for writing ROS 2 applications for .NET Core and .NET Standard.
fr: `_.NET Core, UWP et C# <https://github.com/esteve/ros2_dotnet>`__ Ceci est une collection de projets (liaisons, générateur de code, exemples et plus) pour écrire des applications ROS 2 pour .NET Core et Norme .NET.

source: `Node.js <https://www.npmjs.com/package/rclnodejs>`__ rclnodejs is a Node.js client for the Robot Operating System (ROS 2). It provides a simple and easy JavaScript API for ROS 2 programming.
fr: `Node.js <https://www.npmjs.com/package/rclnodejs>`__ rclnodejs est un client Node.js pour le système d'exploitation Robot (ROS 2). Il fournit une API JavaScript simple et facile pour la programmation ROS 2.

source: `Rust <https://github.com/ros2-rust/ros2_rust>`__ This is a set of projects (the rclrs client library, code generator, examples and more) that enables developers to write ROS 2 applications in Rust.
fr: `Rust <https://github.com/ros2-rust/ros2_rust>`__ Il s'agit d'un ensemble de projets (la bibliothèque cliente rclrs, le générateur de code, des exemples, etc.) qui permet aux développeurs d'écrire des applications ROS 2 dans Rust.

source: Older, unmaintained client libraries are:
fr: Les bibliothèques clientes plus anciennes et non maintenues sont :

source: `Objective C and iOS <https://github.com/esteve/ros2_objc>`__
fr: `Objectif C et iOS <https://github.com/esteve/ros2_objc>`__

source: Common functionality: the RCL
fr: Fonctionnalité commune : la RCL

source: Most of the functionality found in a client library is not specific to the programming language of the client library. For example, the behavior of parameters and the logic of namespaces should ideally be the same across all programming languages. Because of this, rather than implementing the common functionality from scratch, client libraries make use of a common core ROS Client Library (RCL) interface that implements logic and behavior of ROS concepts that is not language-specific. As a result, client libraries only need to wrap the common functionality in the RCL with foreign function interfaces. This keeps client libraries thinner and easier to develop. For this reason the common RCL functionality is exposed with C interfaces as the C language is typically the easiest language for client libraries to wrap.
fr: La plupart des fonctionnalités trouvées dans une bibliothèque cliente ne sont pas spécifiques au langage de programmation de la bibliothèque cliente. Par exemple, le comportement des paramètres et la logique des espaces de noms devraient idéalement être les mêmes dans tous les langages de programmation. Pour cette raison, plutôt que d'implémenter la fonctionnalité commune à partir de zéro, les bibliothèques clientes utilisent une interface de bibliothèque cliente ROS (RCL) de base commune qui implémente la logique et le comportement des concepts ROS qui ne sont pas spécifiques au langage. Par conséquent, les bibliothèques clientes n'ont besoin que d'encapsuler la fonctionnalité commune dans la RCL avec des interfaces de fonctions étrangères. Cela permet de garder les bibliothèques clientes plus fines et plus faciles à développer. Pour cette raison, la fonctionnalité RCL commune est exposée avec les interfaces C car le langage C est généralement le langage le plus facile à envelopper pour les bibliothèques clientes.

source: In addition to making the client libraries light-weight, an advantage of having the common core is that the behavior between languages is more consistent. If any changes are made to the logic/behavior of the functionality in the core RCL -- namespaces, for example -- all client libraries that use the RCL will have these changes reflected. Furthermore, having the common core means that maintaining multiple client libraries becomes less work when it comes to bug fixes.
fr: En plus de rendre les bibliothèques clientes légères, un avantage d'avoir le noyau commun est que le comportement entre les langages est plus cohérent. Si des modifications sont apportées à la logique/au comportement de la fonctionnalité dans la RCL principale - les espaces de noms, par exemple - toutes les bibliothèques clientes qui utilisent la RCL verront ces modifications reflétées. De plus, avoir le noyau commun signifie que la maintenance de plusieurs bibliothèques clientes devient moins de travail lorsqu'il s'agit de corrections de bogues.

source: `The API documentation for the RCL can be found here. <https://docs.ros2.org/latest/api/rcl/>`__
fr: `La documentation de l'API pour la RCL peut être trouvée ici. <https://docs.ros2.org/latest/api/rcl/>`__

source: Language-specific functionality
fr: Fonctionnalité spécifique à la langue

source: Client library concepts that require language-specific features/properties are not implemented in the RCL but instead are implemented in each client library. For example, threading models used by “spin” functions will have implementations that are specific to the language of the client library.
fr: Les concepts de bibliothèque client qui nécessitent des fonctionnalités/propriétés spécifiques à la langue ne sont pas implémentés dans la RCL mais sont implémentés dans chaque bibliothèque client. Par exemple, les modèles de threading utilisés par les fonctions "spin" auront des implémentations spécifiques au langage de la bibliothèque cliente.

source: Demo
fr: Démo

source: For a walkthrough of the message exchange between a publisher using ``rclpy`` and a subscriber using ``rclcpp``\ , we encourage you to watch `this ROSCon talk <https://vimeo.com/187696091>`__ starting at 17:25 `(here are the slides) <https://roscon.ros.org/2016/presentations/ROSCon%202016%20-%20ROS%202%20Update.pdf>`__.
fr: Pour une présentation de l'échange de messages entre un éditeur utilisant ``rclpy`` et un abonné utilisant ``rclcpp``\ , nous vous encourageons à regarder `cette conférence ROSCon <https://vimeo.com/187696091>`__ à partir de à 17h25 `(voici les slides) <https://roscon.ros.org/2016/presentations/ROSCon%202016%20-%20ROS%202%20Update.pdf>`__.

source: Comparison to ROS 1
fr: Comparaison avec ROS 1

source: In ROS 1, all client libraries are developed "from the ground up". This allows for the ROS 1 Python client library to be implemented purely in Python, for example, which brings benefits of such as not needing to compile code. However, naming conventions and behaviors are not always consistent between client libraries, bug fixes have to be done in multiple places, and there is a lot of functionality that has only ever been implemented in one client library (e.g. UDPROS).
fr: Dans ROS 1, toutes les bibliothèques clientes sont développées "à partir de zéro". Cela permet à la bibliothèque client Python ROS 1 d'être implémentée uniquement en Python, par exemple, ce qui présente des avantages tels que l'absence de compilation de code. Cependant, les conventions de dénomination et les comportements ne sont pas toujours cohérents entre les bibliothèques clientes, les corrections de bogues doivent être effectuées à plusieurs endroits et de nombreuses fonctionnalités n'ont jamais été implémentées que dans une seule bibliothèque cliente (par exemple, UDPROS).

source: Summary
fr: Résumé

source: By utilizing the common core ROS client library, client libraries written in a variety of programming languages are easier to write and have more consistent behavior.
fr: En utilisant la bibliothèque client ROS de base commune, les bibliothèques client écrites dans une variété de langages de programmation sont plus faciles à écrire et ont un comportement plus cohérent.
