Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Concepts/About-Logging.po
Languages: fr

source: About logging and logger configuration
fr: À propos de la journalisation et de la configuration de l'enregistreur

source: Table of Contents
fr: Table des matières

source: Overview
fr: Aperçu

source: The logging subsystem in ROS 2 aims to deliver logging messages to a variety of targets, including:
fr: Le sous-système de journalisation dans ROS 2 vise à fournir des messages de journalisation à diverses cibles, notamment :

source: To the console (if one is attached)
fr: À la console (le cas échéant)

source: To log files on disk (if local storage is available)
fr: Pour enregistrer des fichiers sur le disque (si le stockage local est disponible)

source: To the ``/rosout`` topic on the ROS 2 network
fr: Vers le sujet ``/rosout`` sur le réseau ROS 2

source: By default, log messages in ROS 2 nodes will go out to the console (on stderr), to log files on disk, and to the ``/rosout`` topic on the ROS 2 network. All of the targets can be individually enabled or disabled on a per-node basis.
fr: Par défaut, les messages de journalisation des nœuds ROS 2 seront envoyés à la console (sur stderr), aux fichiers de journalisation sur le disque et à la rubrique ``/rosout`` sur le réseau ROS 2. Toutes les cibles peuvent être activées ou désactivées individuellement sur une base par nœud.

source: The rest of this document will go over some of the ideas behind the logging subsystem.
fr: Le reste de ce document passera en revue certaines des idées derrière le sous-système de journalisation.

source: Severity level
fr: Degré de gravité

source: Log messages have a severity level associated with them: ``DEBUG``, ``INFO``, ``WARN``, ``ERROR`` or ``FATAL``, in ascending order.
fr: Les messages de log ont un niveau de sévérité qui leur est associé : ``DEBUG``, ``INFO``, ``WARN``, ``ERROR`` ou ``FATAL``, dans l'ordre croissant.

source: A logger will only process log messages with severity at or higher than a specified level chosen for the logger.
fr: Un enregistreur traitera uniquement les messages de journal dont la gravité est égale ou supérieure à un niveau spécifié choisi pour l'enregistreur.

source: Each node has a logger associated with it that automatically includes the node's name and namespace. If the node's name is externally remapped to something other than what is defined in the source code, it will be reflected in the logger name. Non-node loggers can also be created that use a specific name.
fr: Chaque nœud est associé à un enregistreur qui inclut automatiquement le nom et l'espace de noms du nœud. Si le nom du nœud est remappé en externe sur autre chose que ce qui est défini dans le code source, il sera reflété dans le nom de l'enregistreur. Des enregistreurs non-nœuds peuvent également être créés en utilisant un nom spécifique.

source: Logger names represent a hierarchy. If the level of a logger named "abc.def" is unset, it will defer to the level of its parent named "abc", and if that level is also unset, the default logger level will be used. When the level of logger "abc" is changed, all of its descendants (e.g. "abc.def", "abc.ghi.jkl") will have their level impacted unless their level has been explicitly set.
fr: Les noms des enregistreurs représentent une hiérarchie. Si le niveau d'un enregistreur nommé "abc.def" n'est pas défini, il s'en remettra au niveau de son parent nommé "abc", et si ce niveau est également non défini, le niveau d'enregistrement par défaut sera utilisé. Lorsque le niveau de l'enregistreur "abc" est modifié, tous ses descendants (par exemple "abc.def", "abc.ghi.jkl") verront leur niveau impacté à moins que leur niveau n'ait été explicitement défini.

source: These are the APIs that end users of the ROS 2 logging infrastructure should use, split up by client library.
fr: Ce sont les API que les utilisateurs finaux de l'infrastructure de journalisation ROS 2 doivent utiliser, réparties par bibliothèque cliente.

source: ``RCLCPP_{DEBUG,INFO,WARN,ERROR,FATAL}`` - output the given printf-style message every time this line is hit
fr: ``RCLCPP_{DEBUG,INFO,WARN,ERROR,FATAL}`` - affiche le message de style printf donné chaque fois que cette ligne est atteinte

source: ``RCLCPP_{DEBUG,INFO,WARN,ERROR,FATAL}_ONCE`` - output the given printf-style message only the first time this line is hit
fr: ``RCLCPP_{DEBUG,INFO,WARN,ERROR,FATAL}_ONCE`` - affiche le message de style printf donné uniquement la première fois que cette ligne est atteinte

source: ``RCLCPP_{DEBUG,INFO,WARN,ERROR,FATAL}_EXPRESSION`` - output the given printf-style message only if the given expression is true
fr: ``RCLCPP_{DEBUG,INFO,WARN,ERROR,FATAL}_EXPRESSION`` - affiche le message de style printf donné uniquement si l'expression donnée est vraie

source: ``RCLCPP_{DEBUG,INFO,WARN,ERROR,FATAL}_FUNCTION`` - output the given printf-style message only if the given function returns true
fr: ``RCLCPP_{DEBUG,INFO,WARN,ERROR,FATAL}_FUNCTION`` - affiche le message de style printf donné uniquement si la fonction donnée renvoie true

source: ``RCLCPP_{DEBUG,INFO,WARN,ERROR,FATAL}_SKIPFIRST`` - output the given printf-style message all but the first time this line is hit
fr: ``RCLCPP_{DEBUG,INFO,WARN,ERROR,FATAL}_SKIPFIRST`` - produit le message de style printf donné tous sauf la première fois que cette ligne est atteinte

source: ``RCLCPP_{DEBUG,INFO,WARN,ERROR,FATAL}_THROTTLE`` - output the given printf-style message no more than the given rate in integer milliseconds
fr: ``RCLCPP_{DEBUG,INFO,WARN,ERROR,FATAL}_THROTTLE`` - produit le message de style printf donné pas plus que le taux donné en millisecondes entières

source: ``RCLCPP_{DEBUG,INFO,WARN,ERROR,FATAL}_SKIPFIRST_THROTTLE`` - output the given printf-style message no more than the given rate in integer milliseconds, but skip the first
fr: ``RCLCPP_{DEBUG,INFO,WARN,ERROR,FATAL}_SKIPFIRST_THROTTLE`` - produit le message de style printf donné pas plus que le taux donné en millisecondes entières, mais ignore le premier

source: ``RCLCPP_{DEBUG,INFO,WARN,ERROR,FATAL}_STREAM`` - output the given C++ stream-style message every time this line is hit
fr: ``RCLCPP_{DEBUG,INFO,WARN,ERROR,FATAL}_STREAM`` - affiche le message de style flux C++ donné chaque fois que cette ligne est atteinte

source: ``RCLCPP_{DEBUG,INFO,WARN,ERROR,FATAL}_STREAM_ONCE`` - output the given C++ stream-style message only the first time this line is hit
fr: ``RCLCPP_{DEBUG,INFO,WARN,ERROR,FATAL}_STREAM_ONCE`` - affiche le message de style flux C++ donné uniquement la première fois que cette ligne est atteinte

source: ``RCLCPP_{DEBUG,INFO,WARN,ERROR,FATAL}_STREAM_EXPRESSION`` - output the given C++ stream-style message only if the given expression is true
fr: ``RCLCPP_{DEBUG,INFO,WARN,ERROR,FATAL}_STREAM_EXPRESSION`` - affiche le message de style flux C++ donné uniquement si l'expression donnée est vraie

source: ``RCLCPP_{DEBUG,INFO,WARN,ERROR,FATAL}_STREAM_FUNCTION`` - output the given C++ stream-style message only if the given function returns true
fr: ``RCLCPP_{DEBUG,INFO,WARN,ERROR,FATAL}_STREAM_FUNCTION`` - affiche le message de style flux C++ donné uniquement si la fonction donnée renvoie true

source: ``RCLCPP_{DEBUG,INFO,WARN,ERROR,FATAL}_STREAM_SKIPFIRST`` - output the given C++ stream-style message all but the first time this line is hit
fr: ``RCLCPP_{DEBUG,INFO,WARN,ERROR,FATAL}_STREAM_SKIPFIRST`` - produit le message de style flux C++ donné tous sauf la première fois que cette ligne est atteinte

source: ``RCLCPP_{DEBUG,INFO,WARN,ERROR,FATAL}_STREAM_THROTTLE`` - output the given C++ stream-style message no more than the given rate in integer milliseconds
fr: ``RCLCPP_{DEBUG,INFO,WARN,ERROR,FATAL}_STREAM_THROTTLE`` - produit le message de style flux C++ donné pas plus que le taux donné en millisecondes entières

source: ``RCLCPP_{DEBUG,INFO,WARN,ERROR,FATAL}_STREAM_SKIPFIRST_THROTTLE`` - output the given C++ stream-style message no more than the given rate in integer milliseconds, but skip the first
fr: ``RCLCPP_{DEBUG,INFO,WARN,ERROR,FATAL}_STREAM_SKIPFIRST_THROTTLE`` - produit le message de style flux C++ donné pas plus que le taux donné en millisecondes entières, mais ignore le premier

source: Each of the above APIs takes an ``rclcpp::Logger`` object as the first argument. This can be pulled from the node API by calling ``node->get_logger()`` (recommended), or by constructing a stand-alone ``rclcpp::Logger`` object.
fr: Chacune des API ci-dessus prend un objet ``rclcpp::Logger`` comme premier argument. Cela peut être extrait de l'API du nœud en appelant ``node->get_logger()`` (recommandé), ou en construisant un objet autonome ``rclcpp::Logger``.

source: ``rcutils_logging_set_logger_level`` - Set the logging level for a particular logger name to the given severity level
fr: ``rutils_logging_set_logger_level`` - Définit le niveau de journalisation pour un nom de journalisation particulier au niveau de gravité donné

source: ``rcutils_logging_get_logger_effective_level`` - Given a logger name, return the logger level (which may be unset)
fr: ``rutils_logging_get_logger_effective_level`` - Étant donné un nom d'enregistreur, renvoie le niveau de l'enregistreur (qui peut être désactivé)

source: ``logger.{debug,info,warning,error,fatal}`` - output the given Python string to the logging infrastructure. The calls accept the following keyword args to control behavior:
fr: ``logger.{debug,info,warning,error,fatal}`` - envoie la chaîne Python donnée à l'infrastructure de journalisation. Les appels acceptent les arguments de mot clé suivants pour contrôler le comportement :

source: ``throttle_duration_sec`` - if not None, the duration of the throttle interval in floating-point seconds
fr: ``throttle_duration_sec`` - si ce n'est pas None, la durée de l'intervalle de gaz en secondes à virgule flottante

source: ``skip_first`` - if True, output the message all but the first time this line is hit
fr: ``skip_first`` - si True, affiche le message tous sauf la première fois que cette ligne est atteinte

source: ``once`` - if True, only output the message the first time this line is hit
fr: ``une fois`` - si Vrai, n'affiche le message que la première fois que cette ligne est atteinte

source: ``rclpy.logging.set_logger_level`` - Set the logging level for a particular logger name to the given severity level
fr: ``rclpy.logging.set_logger_level`` - Définit le niveau de journalisation pour un nom d'enregistreur particulier au niveau de gravité donné

source: ``rclpy.logging.get_logger_effective_level`` - Given a logger name, return the logger level (which may be unset)
fr: ``rclpy.logging.get_logger_effective_level`` - Étant donné un nom d'enregistreur, renvoie le niveau d'enregistreur (qui peut être désactivé)

source: Since ``rclcpp`` and ``rclpy`` use the same underlying logging infrastructure, the configuration options are the same.
fr: Étant donné que ``rclcpp`` et ``rclpy`` utilisent la même infrastructure de journalisation sous-jacente, les options de configuration sont les mêmes.

source: Environment variables
fr: Variables d'environnement

source: The following environment variables control some aspects of the ROS 2 loggers. For each of the environment settings, note that this is a process-wide setting, so it applies to all nodes in that process.
fr: Les variables d'environnement suivantes contrôlent certains aspects des enregistreurs ROS 2. Pour chacun des paramètres d'environnement, notez qu'il s'agit d'un paramètre à l'échelle du processus, il s'applique donc à tous les nœuds de ce processus.

source: ``ROS_LOG_DIR`` - Control the logging directory that is used for writing logging messages to disk (if that is enabled). If non-empty, use the exact directory as specified in this variable. If empty, use the contents of the ``ROS_HOME`` environment variable to construct a path of the form ``$ROS_HOME/.log``. In all cases, the ``~`` character is expanded to the user's HOME directory.
fr: ``ROS_LOG_DIR`` - Contrôle le répertoire de journalisation utilisé pour écrire les messages de journalisation sur le disque (s'il est activé). S'il n'est pas vide, utilisez le répertoire exact spécifié dans cette variable. Si vide, utilisez le contenu de la variable d'environnement ``ROS_HOME`` pour construire un chemin de la forme ``$ROS_HOME/.log``. Dans tous les cas, le caractère ``~`` est étendu au répertoire HOME de l'utilisateur.

source: ``ROS_HOME`` - Control the home directory that is used for various ROS files, including logging and config files. In the context of logging, this variable is used to construct a path to a directory for log files. If non-empty, use the contents of this variable for the ROS_HOME path. In all cases, the ``~`` character is expanded to the users's HOME directory.
fr: ``ROS_HOME`` - Contrôle le répertoire personnel utilisé pour divers fichiers ROS, y compris les fichiers de journalisation et de configuration. Dans le contexte de la journalisation, cette variable est utilisée pour construire un chemin vers un répertoire pour les fichiers journaux. Si non vide, utilisez le contenu de cette variable pour le chemin ROS_HOME. Dans tous les cas, le caractère ``~`` est étendu au répertoire HOME des utilisateurs.

source: ``RCUTILS_LOGGING_USE_STDOUT`` - Control what stream output messages go to. If this is unset or 0, use stderr. If this is 1, use stdout.
fr: ``RCUTILS_LOGGING_USE_STDOUT`` - Contrôle vers quel flux les messages de sortie vont. Si ce n'est pas défini ou 0, utilisez stderr. Si c'est 1, utilisez stdout.

source: ``RCUTILS_LOGGING_BUFFERED_STREAM`` - Control whether the logging stream (as configured in ``RCUTILS_LOGGING_USE_STDOUT``) should be line buffered or unbuffered. If this is unset, use the default of the stream (generally line buffered for stdout, and unbuffered for stderr). If this is 0, force the stream to be unbuffered. If this is 1, force the stream to be line buffered.
fr: ``RCUTILS_LOGGING_BUFFERED_STREAM`` - Contrôle si le flux de journalisation (tel que configuré dans ``RCUTILS_LOGGING_USE_STDOUT``) doit être mis en mémoire tampon ou non. S'il n'est pas défini, utilisez la valeur par défaut du flux (généralement en mémoire tampon pour stdout et sans mémoire tampon pour stderr). S'il s'agit de 0, forcez le flux à ne pas être tamponné. Si c'est 1, force le flux à être mis en mémoire tampon.

source: ``RCUTILS_COLORIZED_OUTPUT`` - Control whether colors are used when outputting messages. If unset, automatically determine based on the platform and whether the console is a TTY. If 0, force disable using colors for output. If 1, force enable using colors for output.
fr: ``RCUTILS_COLORIZED_OUTPUT`` - Contrôle si les couleurs sont utilisées lors de la sortie des messages. S'il n'est pas défini, détermine automatiquement en fonction de la plate-forme et si la console est un ATS. Si 0, forcer la désactivation en utilisant des couleurs pour la sortie. Si 1, forcez l'activation en utilisant des couleurs pour la sortie.

source: ``RCUTILS_CONSOLE_OUTPUT_FORMAT`` - Control the fields that are output for each log message. The available fields are:
fr: ``RCUTILS_CONSOLE_OUTPUT_FORMAT`` - Contrôle les champs qui sont sortis pour chaque message de journal. Les champs disponibles sont :

source: ``{severity}`` - The severity level.
fr: ``{severity}`` - Le niveau de gravité.

source: ``{name}`` - The name of the logger (may be empty).
fr: ``{name}`` - Le nom du logger (peut être vide).

source: ``{message}`` - The log message (may be empty).
fr: ``{message}`` - Le message du journal (peut être vide).

source: ``{function_name}`` - The function name this was called from (may be empty).
fr: ``{function_name}`` - Le nom de la fonction à partir de laquelle elle a été appelée (peut être vide).

source: ``{file_name}`` - The file name this was called from (may be empty).
fr: ``{file_name}`` - Le nom du fichier à partir duquel il a été appelé (peut être vide).

source: ``{time}`` - The time in seconds since the epoch.
fr: ``{time}`` - Le temps en secondes depuis l'époque.

source: ``{time_as_nanoseconds}`` - The time in nanoseconds since the epoch.
fr: ``{time_as_nanoseconds}`` - Le temps en nanosecondes depuis l'époque.

source: ``{line_number}`` - The line number this was called from (may be empty).
fr: ``{line_number}`` - Le numéro de ligne à partir duquel il a été appelé (peut être vide).

source: If no format is given, a default of ``[{severity}] [{time}] [{name}]: {message}`` is used.
fr: Si aucun format n'est donné, une valeur par défaut de ``[{severity}] [{time}] [{name}] : {message}`` est utilisée.

source: Node creation
fr: Création de nœud

source: When initializing a ROS 2 node, it is possible to control some aspects of the behavior via node options. Since these are per-node options, they can be set differently for different nodes even when the nodes are composed into a single process.
fr: Lors de l'initialisation d'un nœud ROS 2, il est possible de contrôler certains aspects du comportement via les options de nœud. Comme il s'agit d'options par nœud, elles peuvent être définies différemment pour différents nœuds, même lorsque les nœuds sont composés en un seul processus.

source: ``log_levels`` - The log level to use for a component within this particular node. This can be set with the following: ``ros2 run demo_nodes_cpp talker --ros-args --log-level talker:=DEBUG``
fr: ``log_levels`` - Le niveau de journalisation à utiliser pour un composant dans ce nœud particulier. Cela peut être défini avec ce qui suit : ``ros2 run demo_nodes_cpp talker --ros-args --log-level talker:=DEBUG``

source: ``external_log_config_file`` - The external file to use to configure the backend logger. If it is NULL, the default configuration will be used. Note that the format of this file is backend-specific (and is currently unimplemented for the default backend logger of spdlog). This can be set with the following: ``ros2 run demo_nodes_cpp talker --ros-args --log-config-file log-config.txt``
fr: ``external_log_config_file`` - Le fichier externe à utiliser pour configurer l'enregistreur principal. S'il est NULL, la configuration par défaut sera utilisée. Notez que le format de ce fichier est spécifique au backend (et n'est actuellement pas implémenté pour le logger backend par défaut de spdlog). Cela peut être défini avec ce qui suit : ``ros2 run demo_nodes_cpp talker --ros-args --log-config-file log-config.txt``

source: ``log_stdout_disabled`` - Whether to disable writing log messages to the console. This can be done with the following: ``ros2 run demo_nodes_cpp talker --ros-args --disable-stdout-logs``
fr: ``log_stdout_disabled`` - S'il faut désactiver l'écriture des messages du journal sur la console. Cela peut être fait avec ce qui suit : ``ros2 run demo_nodes_cpp talker --ros-args --disable-stdout-logs``

source: ``log_rosout_disabled`` - Whether to disable writing log messages out to ``/rosout``. This can significantly save on network bandwidth, but external observers will not be able to monitor logging. This can be done with the following: ``ros2 run demo_nodes_cpp talker --ros-args --disable-rosout-logs``
fr: ``log_rosout_disabled`` - S'il faut désactiver l'écriture des messages de journalisation vers ``/rosout``. Cela peut considérablement économiser sur la bande passante du réseau, mais les observateurs externes ne pourront pas surveiller la journalisation. Cela peut être fait avec ce qui suit : ``ros2 run demo_nodes_cpp talker --ros-args --disable-rosout-logs``

source: ``log_ext_lib_disabled`` - Whether to completely disable the use of an external logger. This may be faster in some cases, but means that logs will not be written to disk. This can be done with the following: ``ros2 run demo_nodes_cpp talker --ros-args --disable-external-lib-logs``
fr: ``log_ext_lib_disabled`` - S'il faut complètement désactiver l'utilisation d'un enregistreur externe. Cela peut être plus rapide dans certains cas, mais signifie que les journaux ne seront pas écrits sur le disque. Cela peut être fait avec ce qui suit : ``ros2 run demo_nodes_cpp talker --ros-args --disable-external-lib-logs``

source: Logging subsystem design
fr: Conception du sous-système de journalisation

source: The image below shows the five main pieces to the logging subsystem and how they interact.
fr: L'image ci-dessous montre les cinq éléments principaux du sous-système de journalisation et leur interaction.

source: ROS 2 logging architecture
fr: Architecture de journalisation ROS 2

source: rcutils
fr: rutils

source: ``rcutils`` has a logging implementation that can format log messages according to a certain format (see ``Configuration`` above), and output those log messages to a console. ``rcutils`` implements a complete logging solution, but allows higher-level components to insert themselves into the logging infrastructure in a dependency-injection model. This will become more evident when we talk about the ``rcl`` layer below.
fr: ``rutils`` a une implémentation de journalisation qui peut formater les messages de journalisation selon un certain format (voir ``Configuration`` ci-dessus), et afficher ces messages de journalisation sur une console. ``rutils`` implémente une solution de journalisation complète, mais permet aux composants de niveau supérieur de s'insérer dans l'infrastructure de journalisation dans un modèle d'injection de dépendances. Cela deviendra plus évident lorsque nous parlerons de la couche ``rcl`` ci-dessous.

source: Note that this is a *per-process* logging implementation, so anything that is configured at this level will affect the entire process, not just individual nodes.
fr: Notez qu'il s'agit d'une implémentation de journalisation *par processus*, donc tout ce qui est configuré à ce niveau affectera l'ensemble du processus, pas seulement les nœuds individuels.

source: ``rcl_logging_spdlog`` implements the ``rcl_logging_interface`` API, and thus provides external logging services to the ``rcl`` layer. In particular, the ``rcl_logging_spdlog`` implementation takes formatted log messages and writes them out to log files on disk using the ``spdlog`` library, typically within ``~/.ros/log`` (though this is configurable; see ``Configuration`` above).
fr: ``rcl_logging_spdlog`` implémente l'API ``rcl_logging_interface``, et fournit ainsi des services de journalisation externes à la couche ``rcl``. En particulier, l'implémentation ``rcl_logging_spdlog`` prend des messages de journal formatés et les écrit dans des fichiers journaux sur le disque en utilisant la bibliothèque ``spdlog``, généralement dans ``~/.ros/log`` (bien que cela soit configurable ; voir ``Configuration`` ci-dessus).

source: The logging subsystem in ``rcl`` uses ``rcutils`` and ``rcl_logging_spdlog`` to provide the bulk of the ROS 2 logging services. When log messages come in, ``rcl`` decides where to send them. There are 3 main places that logging messages can be delivered; an individual node may have any combination of them enabled:
fr: Le sous-système de journalisation dans ``rcl`` utilise ``rcutils`` et ``rcl_logging_spdlog`` pour fournir la majeure partie des services de journalisation ROS 2. Lorsque les messages de log arrivent, ``rcl`` décide où les envoyer. Il existe 3 endroits principaux où les messages de journalisation peuvent être livrés ; un nœud individuel peut avoir n'importe quelle combinaison d'entre eux activée :

source: To the console via the ``rcutils`` layer
fr: Vers la console via la couche ``rutils``

source: To disk via the ``rcl_logging_spdlog`` layer
fr: Vers disque via la couche ``rcl_logging_spdlog``

source: To the ``/rosout`` topic on the ROS 2 network via the RMW layer
fr: Vers le sujet ``/rosout`` sur le réseau ROS 2 via la couche RMW

source: rclcpp
fr: RCLCP
