Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Concepts/About-Security.po
Languages: fr

source: About ROS 2 Security
fr: À propos de la sécurité ROS 2

source: Table of Contents
fr: Table des matières

source: Overview
fr: Aperçu

source: Built-in ROS 2 security features enable control over communications throughout the ROS graph. This not only allows for encrypting data in transit between ROS domain participants, but also enables authentication of participants sending data, ensures the integrity of data being sent, and enables domain-wide access controls.
fr: Les fonctionnalités de sécurité ROS 2 intégrées permettent de contrôler les communications dans tout le graphe ROS. Cela permet non seulement de chiffrer les données en transit entre les participants du domaine ROS, mais également d'authentifier les participants qui envoient des données, de garantir l'intégrité des données envoyées et d'activer les contrôles d'accès à l'échelle du domaine.

source: ROS 2 security services are provided by the underlying `Data Distribution Service (DDS) <https://www.omg.org/spec/DDS/>`_ which is used for communications between nodes. DDS vendors provide open source and commercial DDS implementations that work with ROS. However, in order to create a specification-compliant implementation of DDS, all vendors must include security plugins as outlined in the `DDS Security Specification <https://www.omg.org/spec/DDS-SECURITY/About-DDS-SECURITY/>`_. ROS security features take advantage of these DDS security plugins to provide policy-based encryption, authentication and access control. DDS and ROS security is enabled through predefined configuration files and environment variables.
fr: Les services de sécurité ROS 2 sont fournis par le `Data Distribution Service (DDS) <https://www.omg.org/spec/DDS/>`_ sous-jacent qui est utilisé pour les communications entre les nœuds. Les fournisseurs de DDS fournissent des implémentations DDS open source et commerciales qui fonctionnent avec ROS. Cependant, afin de créer une implémentation de DDS conforme aux spécifications, tous les fournisseurs doivent inclure des plugins de sécurité comme indiqué dans la `Spécification de sécurité DDS <https://www.omg.org/spec/DDS-SECURITY/About-DDS-SECURITY />`_. Les fonctionnalités de sécurité ROS tirent parti de ces plugins de sécurité DDS pour fournir un chiffrement, une authentification et un contrôle d'accès basés sur des politiques. La sécurité DDS et ROS est activée via des fichiers de configuration prédéfinis et des variables d'environnement.

source: The Security Enclave
fr: L'enclave de sécurité

source: A security enclave encapsulates a single policy for protecting ROS communications. The enclave may set policy for multiple nodes, for an entire ROS graph, or any combination of protected ROS processes and devices. Security enclaves can be flexibly mapped to processes, users, or devices at deployment. Adjusting this default behavior becomes important for optimizing communications and for complex systems. See the ROS 2 Security Enclaves `design document <https://design.ros2.org/articles/ros2_security_enclaves.html>`_ for additional details.
fr: Une enclave de sécurité encapsule une politique unique pour protéger les communications ROS. L'enclave peut définir une politique pour plusieurs nœuds, pour un graphe ROS entier ou pour toute combinaison de processus et d'appareils ROS protégés. Les enclaves de sécurité peuvent être mappées de manière flexible aux processus, utilisateurs ou appareils lors du déploiement. L'ajustement de ce comportement par défaut devient important pour optimiser les communications et pour les systèmes complexes. Consultez le `document de conception des enclaves de sécurité ROS 2 <https://design.ros2.org/articles/ros2_security_enclaves.html>`_ pour plus de détails.

source: Security Files
fr: Fichiers de sécurité

source: A `ROS 2 security enclave <https://design.ros2.org/articles/ros2_security_enclaves.html>`_ is established with six files as outlined by the DDS specification. Three of these files define an enclave's identity, while three other files define the permissions to be granted to the enclave. All six files reside in a single directory, and nodes launched without a qualified enclave path use files in the default root level enclave.
fr: Une `enclave de sécurité ROS 2 <https://design.ros2.org/articles/ros2_security_enclaves.html>`_ est établie avec six fichiers, comme indiqué par la spécification DDS. Trois de ces fichiers définissent l'identité d'une enclave, tandis que trois autres fichiers définissent les autorisations à accorder à l'enclave. Les six fichiers résident dans un seul répertoire et les nœuds lancés sans chemin d'accès d'enclave qualifié utilisent des fichiers dans l'enclave de niveau racine par défaut.

source: Enclave Identity
fr: Identité de l'enclave

source: The Identity Certificate Authority file ``identity_ca.cert.pem`` acts as the trust anchor used to identify participants. Each enclave also holds its unique identifying certificate in the file ``cert.pem``, and the associated private key in the file ``key.pem``. Because the ``cert.pem`` certificate has been signed by identity certificate, when a participant presents this certificate to other domain members, they are able to validate the participant's identity using their own copy of the identity certificate. This valid certificate exchange allows the enclave to securely establish trusted communications with other participants. The enclave does not not share the ``key.pem`` private key, but only uses it for decryption and message signing.
fr: Le fichier Identity Certificate Authority ``identity_ca.cert.pem`` agit comme l'ancre de confiance utilisée pour identifier les participants. Chaque enclave détient également son certificat d'identification unique dans le fichier ``cert.pem``, et la clé privée associée dans le fichier ``key.pem``. Étant donné que le certificat ``cert.pem`` a été signé par un certificat d'identité, lorsqu'un participant présente ce certificat à d'autres membres du domaine, il est en mesure de valider l'identité du participant en utilisant sa propre copie du certificat d'identité. Cet échange de certificat valide permet à l'enclave d'établir en toute sécurité des communications de confiance avec d'autres participants. L'enclave ne partage pas la clé privée ``key.pem``, mais l'utilise uniquement pour le déchiffrement et la signature des messages.

source: Enclave Permissions
fr: Autorisations d'enclave

source: The Permissions Certificate Authority file ``permissions_ca.cert.pem`` serves as the trust anchor to grant permissions to security enclaves. This certificate is used to create the signed file ``governance.p7s``, an XML document which defines domain-wide protection policies. Similarly the XML file ``permissions.p7s`` outlines permissions of this particular enclave and has been signed by the Permissions CA. Domain members use a copy of the permissions CA to validate these signed files and grant the requested access.
fr: Le fichier Permissions Certificate Authority ``permissions_ca.cert.pem`` sert d'ancre de confiance pour accorder des autorisations aux enclaves de sécurité. Ce certificat est utilisé pour créer le fichier signé ``governance.p7s``, un document XML qui définit les politiques de protection à l'échelle du domaine. De même, le fichier XML ``permissions.p7s`` décrit les autorisations de cette enclave particulière et a été signé par l'autorité de certification des autorisations. Les membres du domaine utilisent une copie des autorisations CA pour valider ces fichiers signés et accorder l'accès demandé.

source: Although these two certificate authorities enable separate workflows for identity and permissions, often the same certificate serves as both the identity and the permissions authority.
fr: Bien que ces deux autorités de certification permettent des workflows distincts pour l'identité et les autorisations, le même certificat sert souvent à la fois d'identité et d'autorité d'autorisation.

source: Private Keys
fr: Clés privées

source: The identity and permissions certificates also have associated private key files. Add new enclaves to the domain by signing their Certificate Signing Request (CSR) with the identity certificate's private key. Similarly, grant permissions for a new enclave by signing a permissions XML document with the permission certificate's private key.
fr: Les certificats d'identité et d'autorisations sont également associés à des fichiers de clé privée. Ajoutez de nouvelles enclaves au domaine en signant leur demande de signature de certificat (CSR) avec la clé privée du certificat d'identité. De même, accordez des autorisations pour une nouvelle enclave en signant un document XML d'autorisations avec la clé privée du certificat d'autorisation.

source: Security Environment Variables
fr: Variables d'environnement de sécurité

source: The environment variable ``ROS_SECURITY_ENABLE`` acts as the enclave's master "on/off" switch for ROS 2 security features. Security has been turned off by default, so security features will not be enabled even when the proper security files are present. In order to enable ROS 2 security, set this environment variable to ``true`` (case sensitive).
fr: La variable d'environnement ``ROS_SECURITY_ENABLE`` agit comme l'interrupteur principal "marche/arrêt" de l'enclave pour les fonctionnalités de sécurité ROS 2. La sécurité a été désactivée par défaut, de sorte que les fonctionnalités de sécurité ne seront pas activées même si les fichiers de sécurité appropriés sont présents. Afin d'activer la sécurité ROS 2, définissez cette variable d'environnement sur ``true`` (sensible à la casse).

source: Once security has been enabled, the environment variable ``ROS_SECURITY_STRATEGY`` defines how domain participants handle problems when launching participants. Security features depend on certificates and properly signed configuration files, yet by default, an improperly configured participant will still launch successfully but without security features. In order to enforce strict compliance with security settings and fail to launch non-compliant enclaves, set this environment variable to ``Enforce`` (case sensitive).
fr: Une fois la sécurité activée, la variable d'environnement ``ROS_SECURITY_STRATEGY`` définit comment les participants du domaine gèrent les problèmes lors du lancement des participants. Les fonctionnalités de sécurité dépendent des certificats et des fichiers de configuration correctement signés, mais par défaut, un participant mal configuré se lancera toujours avec succès, mais sans fonctionnalités de sécurité. Afin d'appliquer une stricte conformité avec les paramètres de sécurité et de ne pas lancer d'enclaves non conformes, définissez cette variable d'environnement sur ``Enforce`` (sensible à la casse).

source: Additional security-related environment variables can be found in the `ROS 2 DDS-Security Integration design document <https://design.ros2.org/articles/ros2_dds_security.html>`_. These variables generally assist ROS in managing enclaves and locating the security files.
fr: Des variables d'environnement supplémentaires liées à la sécurité peuvent être trouvées dans le `document de conception de l'intégration de sécurité ROS 2 DDS <https://design.ros2.org/articles/ros2_dds_security.html>`_. Ces variables aident généralement ROS à gérer les enclaves et à localiser les fichiers de sécurité.

source: Learn More
fr: Apprendre encore plus

source: For more information and hands-on exercises enabling ROS 2 communications security, see the :doc:`../Tutorials/Advanced/Security/Introducing-ros2-security`.
fr: Pour plus d'informations et des exercices pratiques permettant la sécurité des communications ROS 2, consultez le :doc:`../Tutorials/Advanced/Security/Introducing-ros2-security`.
