Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Concepts/About-Logging.po
Languages: fr

source: This is the main ROS 2 C++ API which sits atop the ``rcl`` API. In the context of logging, ``rclcpp`` provides the ``RCLCPP_`` logging macros; see ``APIs`` above for a complete list. When one of the ``RCLCPP_`` macros runs, it checks the current severity level of the node against the severity level of the macro. If the severity level of the macro is greater than or equal to the node severity level, the message will be formatted and output to all of the places that are currently configured. Note that ``rclcpp`` uses a global mutex for log calls, so all logging calls within the same process end up being single-threaded.
fr: Il s'agit de l'API principale de ROS 2 C++ qui se trouve au-dessus de l'API ``rcl``. Dans le contexte de la journalisation, ``rclcpp`` fournit les macros de journalisation ``RCLCPP_`` ; voir ``APIs`` ci-dessus pour une liste complète. Lorsqu'une des macros ``RCLCPP_`` s'exécute, elle vérifie le niveau de gravité actuel du nœud par rapport au niveau de gravité de la macro. Si le niveau de gravité de la macro est supérieur ou égal au niveau de gravité du nœud, le message sera formaté et envoyé à tous les emplacements actuellement configurés. Notez que ``rclcpp`` utilise un mutex global pour les appels de journalisation, de sorte que tous les appels de journalisation dans le même processus finissent par être monothread.

source: This is the main ROS 2 Python API which sits atop the ``rcl`` API. In the context of logging, ``rclpy`` provides the ``logger.debug``-style functions; see ``APIs`` above for a complete list. When one of the ``logger.debug`` functions runs, it checks the current severity level of the node against the severity level of the macro. If the severity level of the macro is greater than or equal to the node severity level, the message will be formatted and output to all of the places that are currently configured.
fr: Il s'agit de l'API Python principale de ROS 2 qui se trouve au-dessus de l'API ``rcl``. Dans le contexte de la journalisation, ``rclpy`` fournit les fonctions de style ``logger.debug`` ; voir ``APIs`` ci-dessus pour une liste complète. Lorsqu'une des fonctions ``logger.debug`` s'exécute, elle vérifie le niveau de gravité actuel du nœud par rapport au niveau de gravité de la macro. Si le niveau de gravité de la macro est supérieur ou égal au niveau de gravité du nœud, le message sera formaté et envoyé à tous les emplacements actuellement configurés.

source: Logging usage
fr: Utilisation de la journalisation

source: See the `rclcpp logging demo <https://github.com/ros2/demos/tree/rolling/logging_demo>`_ for some simple examples.
fr: Voir la `rclcpp logging demo <https://github.com/ros2/demos/tree/rolling/logging_demo>`_ pour quelques exemples simples.

source: See the :doc:`logging demo <../Tutorials/Demos/Logging-and-logger-configuration>` for example usage.
fr: Voir la :doc:`démo de journalisation <../Tutorials/Demos/Logging-and-logger-configuration>` pour un exemple d'utilisation.

source: See the `rclcpp documentation <https://docs.ros2.org/latest/api/rclcpp/logging_8hpp.html>`__ for an extensive list of functionality.
fr: Voir la `documentation rclcpp <https://docs.ros2.org/latest/api/rclcpp/logging_8hpp.html>`__ pour une liste complète des fonctionnalités.

source: See the `rclpy examples <https://github.com/ros2/examples/blob/rolling/rclpy/services/minimal_client/examples_rclpy_minimal_client/client.py>`__ for example usage of a node's logger.
fr: Voir les `exemples rclpy <https://github.com/ros2/examples/blob/rolling/rclpy/services/minimal_client/examples_rclpy_minimal_client/client.py>`__ pour un exemple d'utilisation de l'enregistreur d'un nœud.

source: See the `rclpy tests <https://github.com/ros2/rclpy/blob/rolling/rclpy/test/test_logging.py>`__ for example usage of keyword arguments (e.g. ``skip_first``, ``once``).
fr: Voir les `tests rclpy <https://github.com/ros2/rclpy/blob/rolling/rclpy/test/test_logging.py>`__ pour un exemple d'utilisation d'arguments de mots-clés (par exemple ``skip_first``, ``once` `).
