Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Concepts/About-Internal-Interfaces.po
Languages: fr

source: About internal ROS 2 interfaces
fr: À propos des interfaces ROS 2 internes

source: The internal ROS interfaces are public C |APIs| that are intended for use by developers who are creating |client libraries| or adding a new underlying middleware, but are not intended for use by typical ROS users. The ROS |client libraries| provide the user facing |APIs| that most ROS users are familiar with, and may come in a variety of programming languages.
fr: Les interfaces ROS internes sont des C publics |APIs| destinés à être utilisés par les développeurs qui créent des |bibliothèques clientes| ou l'ajout d'un nouveau middleware sous-jacent, mais ne sont pas destinés à être utilisés par les utilisateurs ROS typiques. Le ROS |bibliothèques clientes| fournir à l'utilisateur face aux |APIs| que la plupart des utilisateurs de ROS connaissent et peuvent être disponibles dans une variété de langages de programmation.

source: Internal API Architecture Overview
fr: Présentation de l'architecture de l'API interne

source: There are two main internal interfaces:
fr: Il existe deux interfaces internes principales :

source: the ROS middleware interface (``rmw`` |API|)
fr: l'interface du middleware ROS (``rmw`` |API|)

source: the ROS client library interface (``rcl`` |API|)
fr: l'interface de la bibliothèque cliente ROS (``rcl`` |API|)

source: The ``rmw`` |API| is the interface between the ROS 2 software stack and the underlying middleware implementation. The underlying middleware used for ROS 2 is either a DDS or RTPS implementation, and is responsible for discovery, publish and subscribe mechanics, request-reply mechanics for services, and serialization of message types.
fr: L'|API| ``rmw`` est l'interface entre la pile logicielle ROS 2 et l'implémentation middleware sous-jacente. Le middleware sous-jacent utilisé pour ROS 2 est une implémentation DDS ou RTPS et est responsable des mécanismes de découverte, de publication et d'abonnement, des mécanismes de demande-réponse pour les services et de la sérialisation des types de messages.

source: The ``rcl`` |API| is a slightly higher level |API| which is used to implement the |client libraries| and does not touch the middleware implementation directly, but rather does so through the ROS middleware interface (``rmw`` |API|) abstraction.
fr: L'|API| ``rcl`` est un niveau légèrement supérieur |API| qui est utilisé pour implémenter les |bibliothèques clientes| et ne touche pas directement l'implémentation du middleware, mais le fait plutôt via l'abstraction de l'interface du middleware ROS (``rmw`` |API|).

source: ros2 software stack
fr: pile logicielle ros2

source: As the diagram shows, these |APIs| are stacked such that the typical ROS user will use the |client library| |API|, e.g. ``rclcpp``, to implement their code (executable or library). The implementation of the |client libraries|, e.g. ``rclcpp``, use the ``rcl`` interface which provides access to the ROS graph and graph events. The ``rcl`` implementation in turn uses the ``rmw`` |API| to access the ROS graph. The purpose of the ``rcl`` implementation is to provide a common implementation for more complex ROS concepts and utilities that may be used by various |client libraries|, while remaining agnostic to the underlying middleware being used. The purpose of the ``rmw`` interface is to capture the absolute minimum middleware functionality needed to support ROS's client libraries. Finally, the implementation of the ``rmw`` |API| is provided by a middleware implementation specific |package|, e.g. ``rmw_fastrtps_cpp``, the library of which is compiled against vendor specific DDS interfaces and types.
fr: Comme le montre le diagramme, ces |APIs| sont empilés de telle sorte que l'utilisateur ROS typique utilisera la |bibliothèque client| |API|, par ex. ``rclcpp``, pour implémenter leur code (exécutable ou bibliothèque). L'implémentation des |bibliothèques clientes|, par ex. ``rclcpp``, utilisez l'interface ``rcl`` qui donne accès au graphe ROS et aux événements de graphe. L'implémentation ``rcl`` utilise à son tour l'API| ``rmw`` | pour accéder au graphique ROS. Le but de l'implémentation ``rcl`` est de fournir une implémentation commune pour des concepts et des utilitaires ROS plus complexes qui peuvent être utilisés par diverses |bibliothèques clientes|, tout en restant indépendant du middleware sous-jacent utilisé. Le but de l'interface ``rmw`` est de capturer la fonctionnalité minimale absolue du middleware nécessaire pour prendre en charge les bibliothèques clientes de ROS. Enfin, l'implémentation de l'|API| ``rmw`` est fourni par un |package| spécifique à l'implémentation du middleware, par ex. ``rmw_fastrtps_cpp``, dont la bibliothèque est compilée avec les interfaces et les types DDS spécifiques au fournisseur.

source: In the diagram above there is also a box labeled ``ros_to_dds``, and the purpose of this box is to represent a category of possible packages which allow the user to access DDS vendor specific objects and settings using the ROS equivalents. One of the goals of this abstraction interface is to completely insulate the ROS user space code from the middleware being used, so that changing DDS vendors or even middleware technology has a minimal impact on the users code. However, we recognize that on occasion it is useful to reach into the implementation and manually adjust settings despite the consequences that might have. By requiring the use of one of these packages in order to access the underlying DDS vendor's objects, we can avoid exposing vendor specific symbols and headers in the normal interface. It also makes it easy to see what code is potentially violating the vendor portability by inspecting the package's dependencies to see if one of these ``ros_to_dds`` packages are being used.
fr: Dans le diagramme ci-dessus, il y a aussi une boîte intitulée ``ros_to_dds``, et le but de cette boîte est de représenter une catégorie de packages possibles qui permettent à l'utilisateur d'accéder aux objets et paramètres spécifiques au fournisseur DDS en utilisant les équivalents ROS. L'un des objectifs de cette interface d'abstraction est d'isoler complètement le code de l'espace utilisateur ROS du middleware utilisé, de sorte que le changement de fournisseur DDS ou même de technologie middleware ait un impact minimal sur le code des utilisateurs. Cependant, nous reconnaissons qu'il est parfois utile d'accéder à la mise en œuvre et d'ajuster manuellement les paramètres malgré les conséquences que cela pourrait avoir. En exigeant l'utilisation de l'un de ces packages pour accéder aux objets du fournisseur DDS sous-jacent, nous pouvons éviter d'exposer des symboles et des en-têtes spécifiques au fournisseur dans l'interface normale. Cela permet également de voir facilement quel code viole potentiellement la portabilité du fournisseur en inspectant les dépendances du paquet pour voir si l'un de ces paquets ``ros_to_dds`` est utilisé.

source: Type Specific Interfaces
fr: Interfaces spécifiques au type

source: All along the way there are some parts of the |APIs| that are necessarily specific to the message types being exchanged, e.g. publishing a message or subscribing to a topic, and therefore require generated code for each message type. The following diagram layouts the path from user defined ``rosidl`` files, e.g. ``.msg`` files, to the type specific code used by the user and system to perform type specific functions:
fr: Tout au long du chemin, il y a certaines parties des |APIs| qui sont nécessairement spécifiques aux types de messages échangés, par ex. publier un message ou s'abonner à un sujet, et nécessitent donc un code généré pour chaque type de message. Le diagramme suivant présente le chemin à partir des fichiers ``rosidl`` définis par l'utilisateur, par ex. Fichiers ``.msg``, au code spécifique au type utilisé par l'utilisateur et le système pour exécuter des fonctions spécifiques au type :

source: ros2 idl static type support stack
fr: pile de support de type statique ros2 idl

source: Figure: flow chart of "static" type support generation, from ``rosidl`` files to user facing code.
fr: Figure : organigramme de la génération de support de type "statique", des fichiers ``rosidl`` au code utilisateur.

source: The right hand side of the diagram shows how the ``.msg`` files are passed directly to language specific code generators, e.g. ``rosidl_generator_cpp`` or ``rosidl_generator_py``. These generators are responsible for creating the code that the user will include (or import) and use as the in-memory representation of the messages that were defined in the ``.msg`` files. For example, consider the message ``std_msgs/String``, a user might use this file in C++ with the statement ``#include <std_msgs/msg/string.hpp>``, or they might use the statement ``from std_msgs.msg import String`` in Python. These statements work because of the files generated by these language specific (but middleware agnostic) generator packages.
fr: Le côté droit du diagramme montre comment les fichiers ``.msg`` sont transmis directement aux générateurs de code spécifiques à la langue, par ex. ``rosidl_generator_cpp`` ou ``rosidl_generator_py``. Ces générateurs sont chargés de créer le code que l'utilisateur inclura (ou importera) et utilisera comme représentation en mémoire des messages qui ont été définis dans les fichiers ``.msg``. Par exemple, considérez le message ``std_msgs/String``, un utilisateur peut utiliser ce fichier en C++ avec l'instruction ``#include <std_msgs/msg/string.hpp>``, ou il peut utiliser l'instruction ``from std_msgs.msg import String`` en Python. Ces instructions fonctionnent grâce aux fichiers générés par ces packages générateurs spécifiques au langage (mais indépendants du middleware).

source: Separately, the ``.msg`` files are used to generate type support code for each type. In this context, type support means: meta data or functions that are specific to a given type and that are used by the system to perform particular tasks for the given type. The type support for a given message might include things like a list of the names and types for each field in the message. It might also contain a reference to code that can perform particular tasks for that type, e.g. publish a message.
fr: Séparément, les fichiers ``.msg`` sont utilisés pour générer le code de support de type pour chaque type. Dans ce contexte, le support de type signifie : des métadonnées ou des fonctions qui sont spécifiques à un type donné et qui sont utilisées par le système pour effectuer des tâches particulières pour le type donné. La prise en charge du type pour un message donné peut inclure des éléments tels qu'une liste des noms et des types pour chaque champ du message. Il peut également contenir une référence au code qui peut effectuer des tâches particulières pour ce type, par ex. publier un message.

source: Static Type Support
fr: Prise en charge du type statique

source: When the type support references code to do particular functions for a specific message type, that code sometimes needs to do middleware specific work. For example, consider the type specific publish function, when using "vendor A" the function will need to call some of "vendor A"'s |API|, but when using "vendor B" it will need to call "vendor B"'s |API|. To allow for middleware vendor specific code, the user defined ``.msg`` files may result in the generation of vendor specific code. This vendor specific code is still hidden from the user through the type support abstraction, which is similar to how the "Private Implementation" (or Pimpl) pattern works.
fr: Lorsque la prise en charge du type fait référence à du code pour effectuer des fonctions particulières pour un type de message spécifique, ce code doit parfois effectuer un travail spécifique au middleware. Par exemple, considérez la fonction de publication spécifique au type, lors de l'utilisation du "fournisseur A", la fonction devra appeler certaines des |API| du "fournisseur A", mais lors de l'utilisation du "fournisseur B", elle devra appeler le "fournisseur B" l'|API|. Pour autoriser le code spécifique au fournisseur du middleware, les fichiers ``.msg`` définis par l'utilisateur peuvent entraîner la génération d'un code spécifique au fournisseur. Ce code spécifique au fournisseur est toujours caché à l'utilisateur via l'abstraction de prise en charge de type, qui est similaire au fonctionnement du modèle "Private Implementation" (ou Pimpl).

source: Static Type Support with DDS
fr: Prise en charge du type statique avec DDS

source: For middleware vendors based on DDS, and specifically those which generate code based on the OMG IDL files (``.idl`` files), the user defined ``rosidl`` files (``.msg`` files) are converted into equivalent OMG IDL files (``.idl`` files). From these OMG IDL files, vendor specific code is created and then used within the type specific functions which are referenced by the type support for a given type. The above diagram shows this on the left hand side, where the ``.msg`` files are consumed by the ``rosidl_dds`` package to produce ``.idl`` files, and then those ``.idl`` files are given to language specific and DDS vendor specific type support generation packages.
fr: Pour les fournisseurs de middleware basés sur DDS, et plus particulièrement ceux qui génèrent du code basé sur les fichiers OMG IDL (fichiers ``.idl``), les fichiers ``rosidl`` définis par l'utilisateur (fichiers ``.msg``) sont convertis en fichiers OMG IDL équivalents (fichiers ``.idl``). À partir de ces fichiers OMG IDL, un code spécifique au fournisseur est créé puis utilisé dans les fonctions spécifiques au type qui sont référencées par la prise en charge du type pour un type donné. Le diagramme ci-dessus le montre sur le côté gauche, où les fichiers ``.msg`` sont consommés par le package ``rosidl_dds`` pour produire des fichiers ``.idl``, puis ces fichiers ``.idl`` sont donnés aux packages de génération de prise en charge spécifiques à la langue et au fournisseur DDS.

source: For example, consider the Fast DDS implementation, which has a package called ``rosidl_typesupport_fastrtps_cpp``. This package is responsible for generating code to handle things like converting a C++ message object into a serialized octet buffer to be written over the network. This code, while specific to Fast DDS, is still not exposed to the user because of the abstraction in the type support code.
fr: Par exemple, considérez l'implémentation Fast DDS, qui a un package appelé ``rosidl_typesupport_fastrtps_cpp``. Ce package est chargé de générer du code pour gérer des choses comme la conversion d'un objet de message C++ en un tampon d'octets sérialisé à écrire sur le réseau. Ce code, bien que spécifique à Fast DDS, n'est toujours pas exposé à l'utilisateur en raison de l'abstraction dans le code de prise en charge du type.

source: Dynamic Type Support
fr: Prise en charge des types dynamiques

source: Another way to implement type support is to have generic functions for things like publishing to a topic, rather than generating a version of the function for each message type. In order to accomplish this, this generic function needs some meta information about the message type being published, things like a list of field names and types in the order in which they appear in the message type. Then to publish a message, you call a generic publish function and pass a message to be published along with a structure which contains the necessary meta data about the message type. This is referred to as "dynamic" type support, as opposed to "static" type support which requires generated versions of a function for each type.
fr: Une autre façon d'implémenter la prise en charge des types est d'avoir des fonctions génériques pour des choses comme la publication dans un sujet, plutôt que de générer une version de la fonction pour chaque type de message. Pour ce faire, cette fonction générique a besoin de certaines méta-informations sur le type de message publié, comme une liste de noms de champs et de types dans l'ordre dans lequel ils apparaissent dans le type de message. Ensuite, pour publier un message, vous appelez une fonction de publication générique et transmettez un message à publier avec une structure qui contient les métadonnées nécessaires sur le type de message. C'est ce qu'on appelle la prise en charge de type "dynamique", par opposition à la prise en charge de type "statique" qui nécessite des versions générées d'une fonction pour chaque type.

source: ros2 idl dynamic type support stack
fr: pile de support de type dynamique ros2 idl

source: Figure: flow chart of "dynamic" type support generation, from ``rosidl`` files to user facing code.
fr: Figure : organigramme de la génération de support de type "dynamique", des fichiers ``rosidl`` au code utilisateur.

source: The above diagram shows the flow from user defined ``rosidl`` files to generated user facing code. It is very similar to the diagram for static type support, and differs only in how the type support is generated which is represented by the left hand side of the diagram. In dynamic type support the ``.msg`` files are converted directly into user facing code.
fr: Le diagramme ci-dessus montre le flux depuis les fichiers ``rosidl`` définis par l'utilisateur jusqu'au code utilisateur généré. Il est très similaire au diagramme de prise en charge de type statique et ne diffère que par la manière dont la prise en charge de type est générée, représentée par le côté gauche du diagramme. Dans le support de type dynamique, les fichiers ``.msg`` sont convertis directement en code utilisateur.

source: This code is also middleware agnostic, because it only contains meta information about the messages. The function to actually do the work, e.g. publishing to a topic, is generic to the message type and will make any necessary calls to the middleware specific |APIs|. Note that rather than dds vendor specific packages providing the type support code, which is the case in static type support, this method has middleware agnostic package for each language, e.g. ``rosidl_typesupport_introspection_c`` and ``rosidl_typesupport_introspection_cpp``. The ``introspection`` part of the package name refers to the ability to introspect any message instance with the generated meta data for the message type. This is the fundamental capability that allows for generic implementations of functions like "publish to a topic".
fr: Ce code est également indépendant du middleware, car il ne contient que des méta-informations sur les messages. La fonction pour effectuer réellement le travail, par ex. la publication dans un sujet, est générique pour le type de message et effectuera tous les appels nécessaires aux |API| spécifiques au middleware. Notez que plutôt que des packages spécifiques au fournisseur dds fournissant le code de prise en charge de type, ce qui est le cas dans la prise en charge de type statique, cette méthode a un package indépendant du middleware pour chaque langue, par ex. ``rosidl_typesupport_introspection_c`` et ``rosidl_typesupport_introspection_cpp``. La partie ``introspection`` du nom du package fait référence à la possibilité d'introspecter n'importe quelle instance de message avec les métadonnées générées pour le type de message. Il s'agit de la capacité fondamentale qui permet des implémentations génériques de fonctions telles que "publier dans un sujet".

source: This approach has the advantage that all generated code is middleware agnostic, which means it can be reused for different middleware implementations, so long as they allow for dynamic type support. It also results in less generated code, which reduces compile time and code size.
fr: Cette approche présente l'avantage que tout le code généré est indépendant du middleware, ce qui signifie qu'il peut être réutilisé pour différentes implémentations de middleware, tant qu'elles permettent la prise en charge de type dynamique. Il en résulte également moins de code généré, ce qui réduit le temps de compilation et la taille du code.

source: However, dynamic type support requires that the underlying middleware support a similar form of dynamic type support. In the case of DDS the DDS-XTypes standard allows for publishing of messages using meta information rather than generated code. DDS-XTypes, or something like it, is required in the underlying middleware in order to support dynamic type support. Also, this approach to type support is normally slower than the static type support alternative. The type specific generated code in static type support can be written to be more efficient as it does not need to iterate over the message type's meta data to perform things like serialization.
fr: Cependant, la prise en charge de type dynamique nécessite que le middleware sous-jacent prenne en charge une forme similaire de prise en charge de type dynamique. Dans le cas de DDS, la norme DDS-XTypes permet la publication de messages à l'aide de méta-informations plutôt que de code généré. DDS-XTypes, ou quelque chose de similaire, est requis dans le middleware sous-jacent afin de prendre en charge la prise en charge de type dynamique. De plus, cette approche de la prise en charge des types est normalement plus lente que l'alternative de prise en charge des types statiques. Le code généré spécifique au type dans la prise en charge du type statique peut être écrit pour être plus efficace car il n'a pas besoin d'itérer sur les métadonnées du type de message pour effectuer des opérations telles que la sérialisation.

source: The ``rcl`` Repository
fr: Le référentiel ``rcl``

source: The ROS Client Library interface (``rcl`` |API|) can be used by |client libraries| (e.g. ``rclc``, ``rclcpp``, ``rclpy``, etc.) in order to avoid duplicating logic and features. By reusing the ``rcl`` |API|, client libraries can be smaller and more consistent with each other. Some parts of the client library are intentionally left out of the ``rcl`` |API| because the language idiomatic method should be used to implement those parts of the system. A good example of this is the execution model, which ``rcl`` does not address at all. Instead the client library should provide a language idiomatic solution like ``pthreads`` in C, ``std::thread`` in C++11, and ``threading.Thread`` in Python. Generally the ``rcl`` interface provides functions that are not specific to a language pattern and are not specific to a particular message type.
fr: L'interface de la bibliothèque cliente ROS (``rcl`` |API|) peut être utilisée par les |bibliothèques clientes| (par exemple ``rclc``, ``rclcpp``, ``rclpy``, etc.) afin d'éviter la duplication de la logique et des fonctionnalités. En réutilisant l'|API| ``rcl``, les bibliothèques clientes peuvent être plus petites et plus cohérentes les unes avec les autres. Certaines parties de la bibliothèque cliente sont intentionnellement laissées de côté par ``rcl`` |API| parce que la méthode idiomatique du langage doit être utilisée pour mettre en œuvre ces parties du système. Un bon exemple de ceci est le modèle d'exécution, que ``rcl`` ne traite pas du tout. Au lieu de cela, la bibliothèque cliente devrait fournir une solution idiomatique de langage comme ``pthreads`` en C, ``std::thread`` en C++11 et ``threading.Thread`` en Python. Généralement, l'interface ``rcl`` fournit des fonctions qui ne sont pas spécifiques à un modèle de langage et ne sont pas spécifiques à un type de message particulier.
