Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Concepts/About-ROS-Interfaces.po
Languages: fr

source: About ROS 2 interfaces
fr: À propos des interfaces ROS 2

source: Table of Contents
fr: Table des matières

source: 1. Background
fr: 1. Origines

source: ROS applications typically communicate through interfaces of one of three types: messages, services and actions. ROS 2 uses a simplified description language, the interface definition language (IDL), to describe these interfaces. This description makes it easy for ROS tools to automatically generate source code for the interface type in several target languages.
fr: Les applications ROS communiquent généralement via des interfaces de l'un des trois types suivants : messages, services et actions. ROS 2 utilise un langage de description simplifié, le langage de définition d'interface (IDL), pour décrire ces interfaces. Cette description permet aux outils ROS de générer automatiquement le code source pour le type d'interface dans plusieurs langages cibles.

source: In this document we will describe the supported types.
fr: Dans ce document, nous décrirons les types pris en charge.

source: msg: ``.msg`` files are simple text files that describe the fields of a ROS message. They are used to generate source code for messages in different languages.
fr: msg : les fichiers ``.msg`` sont de simples fichiers texte qui décrivent les champs d'un message ROS. Ils sont utilisés pour générer le code source des messages dans différentes langues.

source: srv: ``.srv`` files describe a service. They are composed of two parts: a request and a response. The request and response are message declarations.
fr: srv : les fichiers ``.srv`` décrivent un service. Ils sont composés de deux parties : une requête et une réponse. La requête et la réponse sont des déclarations de message.

source: action: ``.action`` files describe actions. They are composed of three parts: a goal, a result, and feedback. Each part is a message declaration itself.
fr: action : les fichiers ``.action`` décrivent les actions. Ils sont composés de trois parties : un objectif, un résultat et des commentaires. Chaque partie est une déclaration de message elle-même.

source: 2. Message description specification
fr: 2. Spécification de la description des messages

source: Messages are described and defined in ``.msg`` files in the ``msg/`` directory of a ROS package. ``.msg`` files are composed of two parts: fields and constants.
fr: Les messages sont décrits et définis dans des fichiers ``.msg`` dans le répertoire ``msg/`` d'un package ROS. Les fichiers ``.msg`` sont composés de deux parties : des champs et des constantes.

source: 2.1 Fields
fr: 2.1 Champs

source: Each field consists of a type and a name, separated by a space, i.e:
fr: Chaque champ est composé d'un type et d'un nom, séparés par un espace, c'est-à-dire :

source: For example:
fr: Par example:

source: 2.1.1 Field types
fr: 2.1.1 Types de champs

source: Field types can be:
fr: Les types de champs peuvent être :

source: a built-in-type
fr: un type intégré

source: names of Message descriptions defined on their own, such as "geometry_msgs/PoseStamped"
fr: noms des descriptions de message définis par eux-mêmes, tels que "geometry_msgs/PoseStamped"

source: *Built-in-types currently supported:*
fr: *Types intégrés actuellement pris en charge :*

source: Type name
fr: Tapez le nom

source: `DDS type <https://design.ros2.org/articles/mapping_dds_types.html>`__
fr: `Type DDS <https://design.ros2.org/articles/mapping_dds_types.html>`__

source: bool
fr: bourdonner

source: boolean
fr: booléen

source: byte
fr: octet

source: builtins.bytes*
fr: builtins.octets*

source: octet
fr: octuor

source: char
fr: carboniser

source: float
fr: flotter

source: int8
fr: vous8

source: uint8
fr: win8

source: short
fr: court

source: unsigned short
fr: court non signé

source: int32
fr: Se remettre

source: long
fr: longue

source: uint32
fr: se remettre

source: unsigned long
fr: long non signé

source: long long
fr: longtemps longtemps

source: uint64
fr: gagner t64

source: unsigned long long
fr: non signé long long

source: string
fr: chaîne

source: std::string
fr: std ::chaîne

source: wstring
fr: ficelle

source: std::u16string
fr: std :: chaîne u16

source: *Every built-in-type can be used to define arrays:*
fr: *Chaque type intégré peut être utilisé pour définir des tableaux :*

source: static array
fr: tableau statique

source: unbounded dynamic array
fr: tableau dynamique illimité

source: std::vector
fr: std :: vecteur

source: sequence
fr: séquence

source: bounded dynamic array
fr: tableau dynamique borné

source: custom_class<T, N>
fr: classe_personnalisée<T, N>

source: sequence<T, N>
fr: séquence<T, N>

source: bounded string
fr: chaîne délimitée

source: All types that are more permissive than their ROS definition enforce the ROS constraints in range and length by software
fr: Tous les types qui sont plus permissifs que leur définition ROS appliquent les contraintes ROS de plage et de longueur par logiciel

source: *Example of message definition using arrays and bounded types:*
fr: *Exemple de définition de message utilisant des tableaux et des types bornés :*

source: 2.1.2 Field names
fr: 2.1.2 Noms de champs

source: Field names must be lowercase alphanumeric characters with underscores for separating words. They must start with an alphabetic character, they must not end with an underscore and never have two consecutive underscores.
fr: Les noms de champ doivent être des caractères alphanumériques minuscules avec des traits de soulignement pour séparer les mots. Ils doivent commencer par un caractère alphabétique, ils ne doivent pas se terminer par un trait de soulignement et ne doivent jamais avoir deux traits de soulignement consécutifs.

source: 2.1.3 Field default value
fr: 2.1.3 Valeur par défaut du champ

source: Default values can be set to any field in the message type. Currently default values are not supported for string arrays and complex types (i.e. types not present in the built-in-types table above, that applies to all nested messages)
fr: Les valeurs par défaut peuvent être définies sur n'importe quel champ du type de message. Actuellement, les valeurs par défaut ne sont pas prises en charge pour les tableaux de chaînes et les types complexes (c'est-à-dire les types non présents dans le tableau des types intégrés ci-dessus, qui s'applique à tous les messages imbriqués)

source: Defining a default value is done by adding a third element to the field definition line, i.e:
fr: La définition d'une valeur par défaut se fait en ajoutant un troisième élément à la ligne de définition du champ, à savoir :

source: string values must be defined in single ``'`` or double quotes ``"``
fr: les valeurs de chaîne doivent être définies entre des ``'`` simples ou des guillemets doubles ``"``

source: currently string values are not escaped
fr: actuellement les valeurs de chaîne ne sont pas échappées

source: 2.2 Constants
fr: 2.2 Constantes

source: Each constant definition is like a field description with a default value, except that this value can never be changed programatically. This value assignment is indicated by use of an equal '=' sign, e.g.
fr: Chaque définition de constante est comme une description de champ avec une valeur par défaut, sauf que cette valeur ne peut jamais être modifiée par programmation. Cette affectation de valeur est indiquée par l'utilisation d'un signe égal '=', par ex.

source: Constants names have to be UPPERCASE
fr: Les noms des constantes doivent être en MAJUSCULES

source: 3. Service description specification
fr: 3. Spécification de description de service

source: Services are described and defined in ``.srv`` files in the ``srv/`` directory of a ROS package.
fr: Les services sont décrits et définis dans les fichiers ``.srv`` du répertoire ``srv/`` d'un package ROS.

source: A service description file consists of a request and a response msg type, separated by '---'. Any two ``.msg`` files concatenated with a '---' are a legal service description.
fr: Un fichier de description de service se compose d'une demande et d'un type de message de réponse, séparés par '---'. Deux fichiers ``.msg`` concaténés avec un '---' sont une description de service légale.

source: Here is a very simple example of a service that takes in a string and returns a string:
fr: Voici un exemple très simple d'un service qui prend une chaîne et renvoie une chaîne :

source: We can of course get much more complicated (if you want to refer to a message from the same package you must not mention the package name):
fr: On peut bien sûr faire beaucoup plus compliqué (si vous voulez faire référence à un message du même paquet vous ne devez pas mentionner le nom du paquet) :

source: You cannot embed another service inside of a service.
fr: Vous ne pouvez pas intégrer un autre service à l'intérieur d'un service.

source: 4. New features in ROS 2 interfaces
fr: 4. Nouvelles fonctionnalités dans les interfaces ROS 2

source: The ROS 2 IDL is closely related to the `ROS 1 IDL <https://wiki.ros.org/msg>`__. Most existing ROS 1 ``.msg`` and ``.srv`` files should be usable as-is with ROS 2. Atop ROS 1's existing feature set, the ROS 2 IDL introduces some new features, namely:
fr: Le ROS 2 IDL est étroitement lié au `ROS 1 IDL <https://wiki.ros.org/msg>`__. La plupart des fichiers ``.msg`` et ``.srv`` de ROS 1 existants devraient être utilisables tels quels avec ROS 2. Au-dessus de l'ensemble de fonctionnalités existant de ROS 1, le ROS 2 IDL introduit de nouvelles fonctionnalités, à savoir :

source: **bounded arrays**: Whereas the ROS 1 IDL allows unbounded arrays (e.g., ``int32[] foo``) and fixed-size arrays (e.g., ``int32[5] bar``), the ROS 2 IDL further allows bounded arrays (e.g., ``int32[<=5] bat``). There are use cases in which it's important to be able to place an upper bound on the size of an array without committing to always using that much space (e.g., in a real-time system in which you need to preallocate all memory that will be used during execution).
fr: **tableaux délimités** : alors que l'IDL ROS 1 autorise les tableaux illimités (par exemple, ``int32[] foo``) et les tableaux de taille fixe (par exemple, ``int32[5] bar``), l'IDL ROS 2 autorise en outre les tableaux délimités (par exemple, ``int32[<=5] bat``). Il existe des cas d'utilisation dans lesquels il est important de pouvoir placer une limite supérieure sur la taille d'un tableau sans s'engager à toujours utiliser autant d'espace (par exemple, dans un système en temps réel dans lequel vous devez préallouer toute la mémoire qui sera utilisé lors de l'exécution).

source: **bounded strings**: Whereas the ROS 1 IDL allows unbounded strings (e.g., ``string foo``), the ROS 2 IDL further allows bounded strings (e.g., ``string<=5 bar``).
fr: **chaînes délimitées** : alors que l'IDL ROS 1 autorise les chaînes illimitées (par exemple, ``string foo``), l'IDL ROS 2 autorise également les chaînes délimitées (par exemple, ``string<=5 bar``).

source: **default values**: Whereas the ROS 1 IDL allows constant fields (e.g., ``int32 X=123``), the ROS 2 IDL further allows default values to be specified (e.g., ``int32 X 123``). The default value is used when constructing a message/service object and can be subsequently overridden by assigning to the field. You can also specify default values for action parts.
fr: **valeurs par défaut** : alors que l'IDL ROS 1 autorise des champs constants (par exemple, ``int32 X=123``), l'IDL ROS 2 permet en outre de spécifier des valeurs par défaut (par exemple, ``int32 X 123``) . La valeur par défaut est utilisée lors de la construction d'un objet message/service et peut être remplacée par la suite en l'attribuant au champ. Vous pouvez également spécifier des valeurs par défaut pour les parties d'action.
