Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Concepts/About-Tf2.po
Languages: fr

source: About tf2
fr: À propos de TF2

source: Table of Contents
fr: Table des matières

source: Overview
fr: Aperçu

source: tf2 is the transform library, which lets the user keep track of multiple coordinate frames over time. tf2 maintains the relationship between coordinate frames in a tree structure buffered in time and lets the user transform points, vectors, etc. between any two coordinate frames at any desired point in time.
fr: tf2 est la bibliothèque de transformation, qui permet à l'utilisateur de suivre plusieurs cadres de coordonnées au fil du temps. tf2 maintient la relation entre les cadres de coordonnées dans une structure arborescente tamponnée dans le temps et permet à l'utilisateur de transformer des points, des vecteurs, etc. entre deux cadres de coordonnées à n'importe quel moment souhaité.

source: Properties of tf2
fr: Propriétés de TF2

source: A robotic system typically has many 3D coordinate frames that change over time, such as a world frame, base frame, gripper frame, head frame, etc. tf2 keeps track of all these frames over time, and allows you to ask questions like:
fr: Un système robotique possède généralement de nombreux cadres de coordonnées 3D qui changent au fil du temps, tels qu'un cadre universel, un cadre de base, un cadre de préhension, un cadre de tête, etc. tf2 garde une trace de tous ces cadres au fil du temps et vous permet de poser des questions telles que :

source: Where was the head frame relative to the world frame 5 seconds ago?
fr: Où était l'image principale par rapport à l'image mondiale il y a 5 secondes ?

source: What is the pose of the object in my gripper relative to my base?
fr: Quelle est la pose de l'objet dans ma pince par rapport à ma base ?

source: What is the current pose of the base frame in the map frame?
fr: Quelle est la pose actuelle du cadre de base dans le cadre cartographique ?

source: tf2 can operate in a distributed system. This means all the information about the coordinate frames of a robot is available to all ROS 2 components on any computer in the system. tf2 can have every component in your distributed system build its own transform information database or have a central node that gathers and stores all transform information.
fr: tf2 peut fonctionner dans un système distribué. Cela signifie que toutes les informations sur les cadres de coordonnées d'un robot sont disponibles pour tous les composants ROS 2 sur n'importe quel ordinateur du système. tf2 peut faire en sorte que chaque composant de votre système distribué crée sa propre base de données d'informations de transformation ou ait un nœud central qui rassemble et stocke toutes les informations de transformation.

source: Tutorials
fr: Tutoriels

source: We created a set of :doc:`tutorials <../Tutorials/Intermediate/Tf2/Tf2-Main>` that walks you through using tf2, step by step. You can get started on the :doc:`introduction to tf2 <../Tutorials/Intermediate/Tf2/Introduction-To-Tf2>` tutorial. For a complete list of all tf2 and tf2-related tutorials check out the :doc:`tutorials <../Tutorials/Intermediate/Tf2/Tf2-Main>` page.
fr: Nous avons créé un ensemble de :doc:`tutoriels <../Tutorials/Intermediate/Tf2/Tf2-Main>` qui vous guide pas à pas dans l'utilisation de tf2. Vous pouvez commencer avec le didacticiel :doc:`introduction to tf2 <../Tutorials/Intermediate/Tf2/Introduction-To-Tf2>`. Pour une liste complète de tous les tutoriels liés à tf2 et tf2, consultez la page :doc:`tutorials <../Tutorials/Intermediate/Tf2/Tf2-Main>`.

source: There are essentially two main tasks that any user would use tf2 for, listening for transforms and broadcasting transforms.
fr: Il y a essentiellement deux tâches principales pour lesquelles tout utilisateur utiliserait tf2, écouter les transformations et diffuser les transformations.

source: If you want to use tf2 to transform between coordinate frames, your nodes will need to listen for transforms. What you will do is to receive and buffer all coordinate frames that are broadcasted in the system, and query for specific transforms between frames. Check out the writing a tf2 listener tutorial :doc:`(Python) <../Tutorials/Intermediate/Tf2/Writing-A-Tf2-Listener-Py>` :doc:`(C++) <../Tutorials/Intermediate/Tf2/Writing-A-Tf2-Listener-Cpp>` to learn more.
fr: Si vous souhaitez utiliser tf2 pour transformer entre les cadres de coordonnées, vos nœuds devront écouter les transformations. Ce que vous allez faire est de recevoir et de mettre en mémoire tampon toutes les trames de coordonnées diffusées dans le système, et de rechercher des transformations spécifiques entre les trames. Consultez le tutoriel d'écriture d'un écouteur tf2 :doc:`(Python) <../Tutorials/Intermediate/Tf2/Writing-A-Tf2-Listener-Py>` :doc:`(C++) <../Tutorials/Intermediate /Tf2/Writing-A-Tf2-Listener-Cpp>` pour en savoir plus.

source: To extend the capabilities of a robot you will need to start broadcasting transforms. Broadcasting transforms means to send out the relative pose of coordinate frames to the rest of the system. A system can have many broadcasters that each provide information about a different part of the robot. Check out the writing a tf2 broadcaster tutorial :doc:`(Python) <../Tutorials/Intermediate/Tf2/Writing-A-Tf2-Broadcaster-Py>` :doc:`(C++) <../Tutorials/Intermediate/Tf2/Writing-A-Tf2-Broadcaster-Cpp>` to learn more.
fr: Pour étendre les capacités d'un robot, vous devrez commencer à diffuser des transformations. La diffusion des transformations signifie envoyer la pose relative des trames de coordonnées au reste du système. Un système peut avoir de nombreux diffuseurs qui fournissent chacun des informations sur une partie différente du robot. Découvrez le tutoriel d'écriture d'un diffuseur tf2 :doc:`(Python) <../Tutorials/Intermediate/Tf2/Writing-A-Tf2-Broadcaster-Py>` :doc:`(C++) <../Tutorials/Intermediate /Tf2/Writing-A-Tf2-Broadcaster-Cpp>` pour en savoir plus.

source: In addition to that, tf2 can broadcast static transforms that do not change over time. This mainly saves storage and lookup time, though the publishing overhead is also improved. You should note that static transforms are published once and assumed to be not changing and therefore no time history stored. If you want to define static transforms in your tf2 tree, take a look at the writing static tf2 broadcaster :doc:`(Python) <../Tutorials/Intermediate/Tf2/Writing-A-Tf2-Static-Broadcaster-Py>` :doc:`(C++) <../Tutorials/Intermediate/Tf2/Writing-A-Tf2-Static-Broadcaster-Cpp>` tutorial.
fr: En plus de cela, tf2 peut diffuser des transformations statiques qui ne changent pas dans le temps. Cela permet principalement d'économiser du temps de stockage et de recherche, bien que la surcharge de publication soit également améliorée. Vous devez noter que les transformations statiques sont publiées une seule fois et supposées ne pas changer et donc aucun historique de temps n'est stocké. Si vous souhaitez définir des transformations statiques dans votre arborescence tf2, jetez un œil à l'écriture statique tf2 broadcaster :doc:`(Python) <../Tutorials/Intermediate/Tf2/Writing-A-Tf2-Static-Broadcaster-Py> ` :doc:`(C++) <../Tutorials/Intermediate/Tf2/Writing-A-Tf2-Static-Broadcaster-Cpp>` tutoriel.

source: You can also learn how to add fixed and dynamic frames to your tf2 tree in adding a frame :doc:`(Python) <../Tutorials/Intermediate/Tf2/Adding-A-Frame-Py>` :doc:`(C++) <../Tutorials/Intermediate/Tf2/Adding-A-Frame-Cpp>` tutorial.
fr: Vous pouvez également apprendre à ajouter des cadres fixes et dynamiques à votre arbre tf2 en ajoutant un cadre :doc:`(Python) <../Tutorials/Intermediate/Tf2/Adding-A-Frame-Py>` :doc:`( C++) <../Tutorials/Intermediate/Tf2/Adding-A-Frame-Cpp>` tutoriel.

source: Once you are finished with the basic tutorials, you can move on to learn about tf2 and time. The tf2 and time tutorial :doc:`(Python) <../Tutorials/Intermediate/Tf2/Learning-About-Tf2-And-Time-Py>` :doc:`(C++) <../Tutorials/Intermediate/Tf2/Learning-About-Tf2-And-Time-Cpp>` teaches the basic principles of tf2 and time. The advanced tutorial about tf2 and time :doc:`(Python) <../Tutorials/Intermediate/Tf2/Time-Travel-With-Tf2-Py>` :doc:`(C++) <../Tutorials/Intermediate/Tf2/Time-Travel-With-Tf2-Cpp>` teaches the principles of time traveling with tf2.
fr: Une fois que vous avez terminé avec les didacticiels de base, vous pouvez passer à l'apprentissage de tf2 et du temps. Le tutoriel tf2 et time :doc:`(Python) <../Tutorials/Intermediate/Tf2/Learning-About-Tf2-And-Time-Py>` :doc:`(C++) <../Tutorials/Intermediate/ Tf2/Learning-About-Tf2-And-Time-Cpp>` enseigne les principes de base de tf2 et du temps. Le tutoriel avancé sur tf2 et le temps :doc:`(Python) <../Tutorials/Intermediate/Tf2/Time-Travel-With-Tf2-Py>` :doc:`(C++) <../Tutorials/Intermediate/ Tf2/Time-Travel-With-Tf2-Cpp>` enseigne les principes du voyage dans le temps avec tf2.

source: Paper
fr: Papier

source: There is a paper on tf2 presented at TePRA 2013: `tf: The transform library <https://ieeexplore.ieee.org/abstract/document/6556373>`_.
fr: Il existe un article sur tf2 présenté à TePRA 2013 : `tf: The transform library <https://ieeexplore.ieee.org/abstract/document/6556373>`_.
