Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Concepts/About-Catment.po
Languages: fr

source: Message generation. ROS and ROS 2 have different message generation steps, the output of which might or not might conflict. Something sort of sophisticated needs to be done to allow generation of all the right artifacts from a single message package (or, as indicated above, the new message packages need different name).
fr: Génération de messages. ROS et ROS 2 ont des étapes de génération de message différentes, dont la sortie peut ou non entrer en conflit. Quelque chose de sophistiqué doit être fait pour permettre la génération de tous les bons artefacts à partir d'un seul paquet de messages (ou, comme indiqué ci-dessus, les nouveaux paquets de messages ont besoin d'un nom différent).

source: Using ``bloom`` to release ``ament`` packages (TODO)
fr: Utiliser ``bloom`` pour publier les packages ``ament`` (TODO)

source: It seems like ``bloom`` ought be able to release packages that use the ``ament`` CMake API, and that the resulting releases should be able to be built on the farm. We can make changes to ``bloom`` and ``ros_buildfarm`` as needed to enable this use case.
fr: Il semble que ``bloom`` devrait pouvoir publier des packages qui utilisent l'API CMake ``ament``, et que les versions résultantes devraient pouvoir être construites sur la ferme. Nous pouvons apporter des modifications à ``bloom`` et ``ros_buildfarm`` selon les besoins pour activer ce cas d'utilisation.
