Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Concepts/About-Domain-*.po
Languages: id

source: The ROS_DOMAIN_ID
id: Le ROS_DOMAIN_ID

source: Overview
id: Aperçu

source: As explained elsewhere, the default middleware that ROS 2 uses for communication is DDS. In DDS, the primary mechanism for having different logical networks share a physical network is known as the Domain ID. ROS 2 nodes on the same domain can freely discover and send messages to each other, while ROS 2 nodes on different domains cannot. All ROS 2 nodes use domain ID 0 by default. To avoid interference between different groups of computers running ROS 2 on the same network, a different domain ID should be set for each group.
id: Comme expliqué ailleurs, le middleware par défaut utilisé par ROS 2 pour la communication est DDS. Dans DDS, le principal mécanisme permettant à différents réseaux logiques de partager un réseau physique est appelé ID de domaine. Les nœuds ROS 2 sur le même domaine peuvent librement se découvrir et s'envoyer des messages, contrairement aux nœuds ROS 2 sur différents domaines. Tous les nœuds ROS 2 utilisent l'ID de domaine 0 par défaut. Pour éviter les interférences entre différents groupes d'ordinateurs exécutant ROS 2 sur le même réseau, un ID de domaine différent doit être défini pour chaque groupe.

source: Choosing a domain ID (short version)
id: Choisir un ID de domaine (version courte)

source: The text below explains the derivation of the range of domain IDs that should be used in ROS 2. To skip that background and just choose a safe number, simply choose a domain ID between 0 and 101, inclusive.
id: Le texte ci-dessous explique la dérivation de la plage d'ID de domaine à utiliser dans ROS 2. Pour ignorer cet arrière-plan et choisir un numéro sûr, choisissez simplement un ID de domaine compris entre 0 et 101 inclus.

source: Choosing a domain ID (long version)
id: Choisir un ID de domaine (version longue)

source: The domain ID is used by DDS to compute the UDP ports that will be used for discovery and communication. See `this article <https://community.rti.com/content/forum-topic/statically-configure-firewall-let-omg-dds-traffic-through>`__ for details on how the ports are computed. Remembering our basic networking, the UDP port is an `unsigned 16-bit integer <https://en.wikipedia.org/wiki/User_Datagram_Protocol#Ports>`__. Thus, the highest port number that can be allocated is 65535. Doing some math with the formula in the article above, this means that the highest domain ID that can possibly be assigned is 232, while the lowest that can be assigned is 0.
id: L'ID de domaine est utilisé par DDS pour calculer les ports UDP qui seront utilisés pour la découverte et la communication. Voir `cet article <https://community.rti.com/content/forum-topic/statically-configure-firewall-let-omg-dds-traffic-through>`__ pour plus de détails sur la façon dont les ports sont calculés. En se souvenant de notre réseau de base, le port UDP est un `entier 16 bits non signé <https://en.wikipedia.org/wiki/User_Datagram_Protocol#Ports>`__. Ainsi, le numéro de port le plus élevé pouvant être attribué est 65535. En faisant quelques calculs avec la formule de l'article ci-dessus, cela signifie que l'ID de domaine le plus élevé pouvant être attribué est 232, tandis que le plus bas pouvant être attribué est 0.

source: Platform-specific constraints
id: Contraintes spécifiques à la plateforme

source: For maximum compatibility, some additional platform-specific constraints should be followed when choosing a domain ID. In particular, it is best to avoid allocating domain IDs in the operating system's `ephemeral port range <https://en.wikipedia.org/wiki/Ephemeral_port>`__. This avoids possible conflicts between the ports used by the ROS 2 nodes and other networking services on the computers.
id: Pour une compatibilité maximale, certaines contraintes supplémentaires spécifiques à la plate-forme doivent être respectées lors du choix d'un ID de domaine. En particulier, il est préférable d'éviter d'allouer des ID de domaine dans la `plage de ports éphémères <https://en.wikipedia.org/wiki/Ephemeral_port>`__ du système d'exploitation. Cela évite d'éventuels conflits entre les ports utilisés par les nœuds ROS 2 et d'autres services réseau sur les ordinateurs.

source: Here are some platform-specific notes about ephemeral ports.
id: Voici quelques notes spécifiques à la plate-forme sur les ports éphémères.

source: By default, the Linux kernel uses ports 32768-60999 for ephemeral ports. This means that domain IDs 0-101 and 215-232 can be safely used without colliding with ephemeral ports. The ephemeral port range is configurable in Linux by setting custom values in ``/proc/sys/net/ipv4/ip_local_port_range``. If a custom ephemeral port range is used, the above numbers may have to be adjusted accordingly.
id: Par défaut, le noyau Linux utilise les ports 32768-60999 pour les ports éphémères. Cela signifie que les ID de domaine 0-101 et 215-232 peuvent être utilisés en toute sécurité sans entrer en collision avec des ports éphémères. La plage de ports éphémères est configurable sous Linux en définissant des valeurs personnalisées dans ``/proc/sys/net/ipv4/ip_local_port_range``. Si une plage de ports éphémères personnalisée est utilisée, les nombres ci-dessus peuvent devoir être ajustés en conséquence.

source: By default, the ephemeral port range on macOS is 49152-65535. This means that domain IDs 0-166 can be safely used without colliding with ephemeral ports. The ephemeral port range is configurable in macOS by setting custom sysctl values for ``net.inet.ip.portrange.first`` and ``net.inet.ip.portrange.last``. If a custom ephemeral port range is used, the above numbers may have to be adjusted accordingly.
id: Par défaut, la plage de ports éphémères sur macOS est 49152-65535. Cela signifie que les ID de domaine 0-166 peuvent être utilisés en toute sécurité sans entrer en collision avec des ports éphémères. La plage de ports éphémères est configurable dans macOS en définissant des valeurs sysctl personnalisées pour ``net.inet.ip.portrange.first`` et ``net.inet.ip.portrange.last``. Si une plage de ports éphémères personnalisée est utilisée, les nombres ci-dessus peuvent devoir être ajustés en conséquence.

source: Windows
id: les fenêtres

source: By default, the ephemeral port range on Windows is 49152-65535. This means that domain IDs 0-166 can be safely used without colliding with ephemeral ports. The ephemeral port range is configurable in Windows by `using netsh <https://docs.microsoft.com/en-us/troubleshoot/windows-server/networking/default-dynamic-port-range-tcpip-chang>`__. If a custom ephemeral port range is used, the above numbers may have to be adjusted accordingly.
id: Par défaut, la plage de ports éphémères sous Windows est 49152-65535. Cela signifie que les ID de domaine 0-166 peuvent être utilisés en toute sécurité sans entrer en collision avec des ports éphémères. La plage de ports éphémères est configurable dans Windows en `utilisant netsh <https://docs.microsoft.com/en-us/troubleshoot/windows-server/networking/default-dynamic-port-range-tcpip-chang>`__. Si une plage de ports éphémères personnalisée est utilisée, les nombres ci-dessus peuvent devoir être ajustés en conséquence.

source: Participant constraints
id: Contraintes des participants

source: For each ROS 2 process running on a computer, one DDS "participant" is created. Since each DDS participant takes up two ports on the computer, running more than 120 ROS 2 processes on one computer may spill over into other domain IDs or the ephemeral ports.
id: Pour chaque processus ROS 2 exécuté sur un ordinateur, un "participant" DDS est créé. Étant donné que chaque participant DDS occupe deux ports sur l'ordinateur, l'exécution de plus de 120 processus ROS 2 sur un ordinateur peut se répercuter sur d'autres ID de domaine ou sur les ports éphémères.

source: To see why, consider the domain IDs 1 and 2.
id: Pour comprendre pourquoi, considérez les ID de domaine 1 et 2.

source: Domain ID 1 uses port 7650 and 7651 for multicast.
id: L'ID de domaine 1 utilise les ports 7650 et 7651 pour la multidiffusion.

source: Domain ID 2 uses port 7900 and 7901 for multicast.
id: L'ID de domaine 2 utilise les ports 7900 et 7901 pour la multidiffusion.

source: When creating the 1st process (zeroth participant) in domain ID 1, the ports 7660 and 7661 are used for unicast.
id: Lors de la création du 1er processus (participant zéro) dans l'ID de domaine 1, les ports 7660 et 7661 sont utilisés pour l'unicast.

source: When creating the 120th process (119th participant) in domain ID 1, the ports 7898 and 7899 are used for unicast.
id: Lors de la création du 120e processus (119e participant) dans l'ID de domaine 1, les ports 7898 et 7899 sont utilisés pour la monodiffusion.

source: When creating the 121st process (120th participant) in domain ID 1, the ports 7900 and 7901 are used for unicast and overlap with domain ID 2.
id: Lors de la création du 121e processus (120e participant) dans l'ID de domaine 1, les ports 7900 et 7901 sont utilisés pour la monodiffusion et chevauchent l'ID de domaine 2.

source: If it is known that the computer will only ever be on a single domain ID at a time, and the domain ID is low enough, it is safe to create more ROS 2 processes than this.
id: Si l'on sait que l'ordinateur ne sera jamais que sur un seul ID de domaine à la fois et que l'ID de domaine est suffisamment bas, il est prudent de créer plus de processus ROS 2 que cela.

source: When choosing a domain ID that is near the top of the range of platform-specific domain IDs, one additional constraint should be considered.
id: Lorsque vous choisissez un ID de domaine proche du haut de la plage des ID de domaine spécifiques à la plate-forme, une contrainte supplémentaire doit être prise en compte.

source: For instance, assume a Linux computer with a domain ID of 101:
id: Par exemple, supposons un ordinateur Linux avec un ID de domaine de 101 :

source: The zero'th ROS 2 process on the computer will connect to ports 32650, 32651, 32660, and 32661.
id: Le processus zéro ROS 2 sur l'ordinateur se connectera aux ports 32650, 32651, 32660 et 32661.

source: The first ROS 2 process on the computer will connect to ports 32650, 32651, 32662, and 32663.
id: Le premier processus ROS 2 sur l'ordinateur se connectera aux ports 32650, 32651, 32662 et 32663.

source: The 53rd ROS 2 process on the computer will connect to ports 32650, 32651, 32766, and 32767.
id: Le 53e processus ROS 2 sur l'ordinateur se connectera aux ports 32650, 32651, 32766 et 32767.

source: The 54th ROS 2 process on the computer will connect to ports 32650, 32651, 32768, and 32769, running into the ephemeral port range.
id: Le 54e processus ROS 2 sur l'ordinateur se connectera aux ports 32650, 32651, 32768 et 32769, s'exécutant dans la plage de ports éphémères.

source: Thus the maximum number of processes that should be created when using domain ID 101 on Linux is 54. Similarly, the maximum number of processes that should be created when using domain ID 232 on Linux is 63, as the maximum port number is 65535.
id: Ainsi, le nombre maximum de processus qui doivent être créés lors de l'utilisation de l'ID de domaine 101 sous Linux est de 54. De même, le nombre maximum de processus qui doivent être créés lors de l'utilisation de l'ID de domaine 232 sous Linux est de 63, car le numéro de port maximum est 65535.

source: The situation is similar on macOS and Windows, though the numbers are different. On macOS and Windows, when choosing a domain ID of 166 (the top of the range), the maximum number of ROS 2 processes that can be created on a computer before running into the ephemeral port range is 120.
id: La situation est similaire sur macOS et Windows, bien que les chiffres soient différents. Sur macOS et Windows, lorsque vous choisissez un ID de domaine de 166 (le haut de gamme), le nombre maximum de processus ROS 2 pouvant être créés sur un ordinateur avant de s'exécuter dans la plage de ports éphémères est de 120.

source: Domain ID to UDP Port Calculator
id: ID de domaine au calculateur de port UDP
