Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Tutorials/Advanced/Security/Examine-Traffic.po
Languages: fr

source: Examining network traffic
fr: Examen du trafic réseau

source: **Goal:** Capture and examine raw ROS 2 network traffic.
fr: **Objectif :** Capturez et examinez le trafic réseau brut ROS 2.

source: **Tutorial level:** Advanced
fr: **Niveau du didacticiel :** Avancé

source: **Time:** 20 minutes
fr: **Durée :** 20 minutes

source: Contents
fr: Contenu

source: Background
fr: Arrière-plan

source: ROS 2 communications security is all about protecting communications between nodes. Prior tutorials enabled security, but how can you **really** tell if traffic is being encrypted? In this tutorial we'll take a look at capturing live network traffic to show the difference between encrypted and unencrypted traffic.
fr: La sécurité des communications ROS 2 consiste à protéger les communications entre les nœuds. Les tutoriels précédents activaient la sécurité, mais comment pouvez-vous **vraiment** savoir si le trafic est chiffré ? Dans ce didacticiel, nous examinerons la capture du trafic réseau en direct pour montrer la différence entre le trafic chiffré et non chiffré.

source: Run the demo
fr: Exécutez la démo

source: Install ``tcpdump``
fr: Installer ``tcpdump``

source: Begin in a new terminal window by installing `tcpdump <https://www.tcpdump.org/manpages/tcpdump.1.html>`_, a command-line tool for capturing and displaying network traffic. Although this tutorial describes ``tcpdump`` commands, you can also use `Wireshark <https://www.wireshark.org/>`_, a similar graphical tool for capturing and analyzing traffic.
fr: Commencez dans une nouvelle fenêtre de terminal en installant `tcpdump <https://www.tcpdump.org/manpages/tcpdump.1.html>`_, un outil de ligne de commande pour capturer et afficher le trafic réseau. Bien que ce didacticiel décrive les commandes ``tcpdump``, vous pouvez également utiliser `Wireshark <https://www.wireshark.org/>`_, un outil graphique similaire pour capturer et analyser le trafic.

source: Run following commands on a single machine through multiple ``ssh`` sessions.
fr: Exécutez les commandes suivantes sur une seule machine via plusieurs sessions ``ssh``.

source: Start the talker and listener
fr: Démarrer le locuteur et l'auditeur

source: Start both the talker and the listener again, each in its own terminal. The security environment variables are not set so security is not enabled for these sessions.
fr: Redémarrez à la fois le locuteur et l'auditeur, chacun dans son propre terminal. Les variables d'environnement de sécurité ne sont pas définies, la sécurité n'est donc pas activée pour ces sessions.

source: Display unencrypted discovery packets
fr: Afficher les paquets de découverte non chiffrés

source: With the talker and listener running, open another terminal and start ``tcpdump`` to look at the network traffic. You need to use ``sudo`` since reading raw network traffic is a privileged operation.
fr: Avec le talker et le listener en cours d'exécution, ouvrez un autre terminal et lancez ``tcpdump`` pour examiner le trafic réseau. Vous devez utiliser ``sudo`` car la lecture du trafic réseau brut est une opération privilégiée.

source: The command below uses the ``-X`` option to print packet contents, the ``-i`` option to listen for packets on any interface, and captures only `UDP <https://en.wikipedia.org/wiki/User_Datagram_Protocol>`_ port 7400 traffic.
fr: La commande ci-dessous utilise l'option ``-X`` pour imprimer le contenu des paquets, l'option ``-i`` pour écouter les paquets sur n'importe quelle interface et ne capture que `UDP <https://en.wikipedia.org/wiki /User_Datagram_Protocol>`_ trafic du port 7400.

source: You should see packets like the following::
fr: Vous devriez voir des paquets comme celui-ci ::

source: This is a discovery datagram--the talker looking for subscribers. As you can see, the node name (``/talker_listener/talker``) and the enclave (also ``/talker_listener/talker``) are passed in plain text. You should also see similar discovery datagrams from the ``listener`` node. Some other features of a typical discovery packet:
fr: Il s'agit d'un datagramme de découverte - le locuteur à la recherche d'abonnés. Comme vous pouvez le voir, le nom du nœud (``/talker_listener/talker``) et l'enclave (également ``/talker_listener/talker``) sont passés en texte brut. Vous devriez également voir des datagrammes de découverte similaires du nœud ``listener``. Quelques autres fonctionnalités d'un paquet de découverte typique :

source: The destination address is 239.255.0.1, which is a multicast IP address; ROS 2 uses multicast traffic for discovery by default.
fr: L'adresse de destination est 239.255.0.1, qui est une adresse IP multidiffusion ; ROS 2 utilise le trafic multidiffusion pour la découverte par défaut.

source: UDP 7400 is the destination port, as per the `DDS-RTPS specification <https://www.omg.org/spec/DDSI-RTPS/About-DDSI-RTPS/>`_.
fr: UDP 7400 est le port de destination, conformément à la `spécification DDS-RTPS <https://www.omg.org/spec/DDSI-RTPS/About-DDSI-RTPS/>`_.

source: The packet contains the "RTPS" tag, also as defined to the DDS-RTPS specification.
fr: Le paquet contient la balise "RTPS", également telle que définie dans la spécification DDS-RTPS.

source: Display unencrypted data packets
fr: Afficher les paquets de données non chiffrés

source: Use ``tcpdump`` to capture non-discovery RTPS packets by filtering on UDP ports above 7400:
fr: Utilisez ``tcpdump`` pour capturer les paquets RTPS sans découverte en filtrant sur les ports UDP supérieurs à 7400 :

source: You will see few different types of packets, but watch for something like the following which is obviously data being sent from a talker to a listener::
fr: Vous verrez peu de types de paquets différents, mais faites attention à quelque chose comme ce qui suit qui est évidemment des données envoyées d'un locuteur à un auditeur :

source: Some features to note about this packet:
fr: Quelques fonctionnalités à noter à propos de ce paquet :

source: The message contents, "Hello World: 2135", are sent in clear text
fr: Le contenu du message, "Hello World: 2135", est envoyé en texte clair

source: The source and destination IP address is ``localhost``: since both nodes are running on the same machine, the nodes discovered each other on the ``localhost`` interface
fr: L'adresse IP source et destination est ``localhost`` : étant donné que les deux nœuds s'exécutent sur la même machine, les nœuds se sont découverts sur l'interface ``localhost``

source: Enable encryption
fr: Activer le chiffrement

source: Stop both the talker and the listener nodes. Enable encryption for both by setting the security environment variables and run them again.
fr: Arrêtez à la fois le locuteur et les nœuds d'écoute. Activez le chiffrement pour les deux en définissant les variables d'environnement de sécurité et exécutez-les à nouveau.

source: Display encrypted discovery packets
fr: Afficher les paquets de découverte chiffrés

source: Run the same ``tcpdump`` command used earlier to examine the output of discovery traffic with encryption enabled:
fr: Exécutez la même commande ``tcpdump`` utilisée précédemment pour examiner la sortie du trafic de découverte avec le chiffrement activé :

source: The typical discovery packet looks somewhat like the following::
fr: Le paquet de découverte typique ressemble un peu à ce qui suit : :

source: This packet is much larger and includes information which can be used to set up encryption among ROS nodes. As we will see shortly, this actually includes some of the security configuration files that were created when we enabled security. Interested in learning more? Take a look at the excellent paper `Network Reconnaissance and Vulnerability Excavation of Secure DDS Systems <https://arxiv.org/abs/1908.05310>`_ to understand why this matters.
fr: Ce paquet est beaucoup plus volumineux et comprend des informations qui peuvent être utilisées pour configurer le chiffrement entre les nœuds ROS. Comme nous le verrons bientôt, cela inclut en fait certains des fichiers de configuration de sécurité qui ont été créés lorsque nous avons activé la sécurité. Intéressé à en savoir plus? Jetez un œil à l'excellent article `Network Reconnaissance and Vulnerability Excavation of Secure DDS Systems <https://arxiv.org/abs/1908.05310>`_ pour comprendre pourquoi cela est important.

source: Display encrypted data packets
fr: Afficher les paquets de données chiffrés

source: Now use ``tcpdump`` to capture data packets:
fr: Utilisez maintenant ``tcpdump`` pour capturer les paquets de données :

source: A typical data packet looks like the following::
fr: Un paquet de données typique ressemble à ce qui suit : :

source: The data in this RTPS packet is all encrpyted.
fr: Les données de ce paquet RTPS sont toutes cryptées.

source: In addition to this data packet, you should see additional packets with node and enclave names; these support other ROS features such as parameters and services. Encryption options for these packets can also be controlled by security policy.
fr: En plus de ce paquet de données, vous devriez voir des paquets supplémentaires avec des noms de nœud et d'enclave ; ceux-ci prennent en charge d'autres fonctionnalités ROS telles que les paramètres et les services. Les options de chiffrement de ces paquets peuvent également être contrôlées par la politique de sécurité.
