Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Tutorials/Advanced/Security/Security-on-Two.po
Languages: fr

source: Ensuring security across machines
fr: Garantir la sécurité sur toutes les machines

source: **Goal:** Make two different machines communicate securely.
fr: **Objectif :** Faire en sorte que deux machines différentes communiquent en toute sécurité.

source: **Tutorial level:** Advanced
fr: **Niveau du didacticiel :** Avancé

source: **Time:** 5 minutes
fr: **Durée :** 5 minutes

source: Contents
fr: Contenu

source: Background
fr: Arrière-plan

source: The previous tutorials have used two ROS nodes on the same machine sending all network communications over the localhost interface. Let's extend that scenario to involve multiple machines, since the benefits of authentication and encryption then become more obvious.
fr: Les tutoriels précédents ont utilisé deux nœuds ROS sur la même machine envoyant toutes les communications réseau via l'interface localhost. Étendons ce scénario pour impliquer plusieurs machines, car les avantages de l'authentification et du chiffrement deviennent alors plus évidents.

source: Suppose that the machine with the keystore created in the previous demo has a hostname ``Alice``, and that we want to also use another machine with hostname ``Bob`` for our multi-machine ``talker/listener`` demo. We need to move some keys from ``Alice`` to ``Bob`` to allow SROS 2 to authenticate and encrypt the transmissions.
fr: Supposons que la machine avec le keystore créé dans la démo précédente ait un nom d'hôte ``Alice``, et que nous voulions également utiliser une autre machine avec le nom d'hôte ``Bob`` pour notre démo multi-machine ``talker/listener`` . Nous devons déplacer certaines clés de ``Alice`` à ``Bob`` pour permettre à SROS 2 d'authentifier et de crypter les transmissions.

source: Create the second keystore
fr: Créer le deuxième magasin de clés

source: Begin by creating an empty keystore on ``Bob``; the keystore is actually just an empty directory:
fr: Commencez par créer un keystore vide sur ``Bob`` ; le keystore n'est en fait qu'un répertoire vide :

source: Windows
fr: les fenêtres

source: Copy files
fr: Copier des fichiers

source: Next copy the keys and certificates for the ``talker`` program from ``Alice`` to ``Bob``. Since the keys are just text files, we can use ``scp`` to copy them.
fr: Copiez ensuite les clés et les certificats du programme ``talker`` de ``Alice`` à ``Bob``. Comme les clés ne sont que des fichiers texte, nous pouvons utiliser ``scp`` pour les copier.

source: That will be very quick, since it's just copying some very small text files. Now, we're ready to run a multi-machine talker/listener demo!
fr: Ce sera très rapide, car il ne s'agit que de copier de très petits fichiers texte. Maintenant, nous sommes prêts à exécuter une démo de locuteur/auditeur multi-machine !

source: Launch the nodes
fr: Lancer les nœuds

source: Once the environment is set up, run the talker on ``Bob``:
fr: Une fois l'environnement configuré, lancez le talker sur ``Bob`` :

source: and launch the listener on ``Alice``:
fr: et lancez l'écouteur sur ``Alice`` :

source: Alice will now be receiving encrypted messages from Bob.
fr: Alice va maintenant recevoir des messages cryptés de Bob.

source: With two machines successfully communicating using both encryption and authentication, you can use the same procedure to add more machines to your ROS graph.
fr: Avec deux machines communiquant avec succès en utilisant à la fois le cryptage et l'authentification, vous pouvez utiliser la même procédure pour ajouter plus de machines à votre graphique ROS.
