Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Tutorials/Advanced/Security/The-Keystore.po
Languages: fr

source: Understanding the security keystore
fr: Comprendre le magasin de clés de sécurité

source: **Goal:** Explore files located in the ROS 2 security keystore.
fr: **Objectif :** Explorer les fichiers situés dans le magasin de clés de sécurité ROS 2.

source: **Tutorial level:** Advanced
fr: **Niveau du didacticiel :** Avancé

source: **Time:** 15 minutes
fr: **Durée :** 15 minutes

source: Contents
fr: Contenu

source: Background
fr: Arrière-plan

source: The ``sros2`` package can be used to create keys, certificates and policies necessary to enable ROS 2 security. However, the security configuration is extrememly flexible. A basic understanding of the ROS 2 Security Keystore will allow integration with an existing PKI (Public Key Infrastructure) and managment of sensitive key materials consistent with organizational policies.
fr: Le package ``sros2`` peut être utilisé pour créer des clés, des certificats et des politiques nécessaires pour activer la sécurité ROS 2. Cependant, la configuration de la sécurité est extrêmement flexible. Une compréhension de base du magasin de clés de sécurité ROS 2 permettra l'intégration avec une PKI (infrastructure de clé publique) existante et la gestion des éléments clés sensibles conformément aux politiques organisationnelles.

source: Security Artifact Locations
fr: Emplacements des artefacts de sécurité

source: With communications security enabled in the prior tutorial, let's take a look at the files which were created when security was enabled. These are the files which make encryption possible.
fr: Avec la sécurité des communications activée dans le didacticiel précédent, examinons les fichiers qui ont été créés lorsque la sécurité a été activée. Ce sont les fichiers qui rendent le cryptage possible.

source: The ``sros2`` utilities (``ros2 security ...``) separate files into public, private and enclave key materials.
fr: Les utilitaires ``sros2`` (``ros2 security ...``) séparent les fichiers en clés publiques, privées et enclavées.

source: ROS uses the directory defined by the environmental variable ``ROS_SECURITY_KEYSTORE`` as the keystore. For this tutorial, we use the directory ``~/sros2_demo/demo_keystore``.
fr: ROS utilise le répertoire défini par la variable d'environnement ``ROS_SECURITY_KEYSTORE`` comme keystore. Pour ce tutoriel, nous utilisons le répertoire ``~/sros2_demo/demo_keystore``.

source: Public Key Materials
fr: Matériel de clé publique

source: You will find three encryption certificates in the public directory at ``~/sros2_demo/demo_keys/public``; however, the identity and permissions certificates are actually just a link to the Certificate Authority (CA) certificate.
fr: Vous trouverez trois certificats de chiffrement dans le répertoire public à ``~/sros2_demo/demo_keys/public`` ; cependant, les certificats d'identité et d'autorisations ne sont en fait qu'un lien vers le certificat de l'autorité de certification (CA).

source: In a public key infrastructure, the `Certificate Authority <https://en.wikipedia.org/wiki/Certificate_authority>`_ acts as a trust anchor: it validates the identities and permissions of participants. For ROS, that means all the nodes that participate in the ROS graph (which may extend to an entire fleet of individual robots). By placing the Certificate Authority's certificate (``ca.cert.pem``) in the proper location on the robot, all ROS nodes can establish mutual trust with other nodes using the same Certificate Authority.
fr: Dans une infrastructure à clé publique, l'`autorité de certification <https://en.wikipedia.org/wiki/Certificate_authority>`_ agit comme une ancre de confiance : elle valide les identités et les autorisations des participants. Pour ROS, cela signifie tous les nœuds qui participent au graphe ROS (qui peut s'étendre à toute une flotte de robots individuels). En plaçant le certificat de l'autorité de certification (``ca.cert.pem``) à l'emplacement approprié sur le robot, tous les nœuds ROS peuvent établir une confiance mutuelle avec d'autres nœuds utilisant la même autorité de certification.

source: Although in our tutorials we create a Certificate Authority on-the-fly, in a production system this should be done according to a pre-defined security plan. Typically the Certificate Authority for a production system will be created off-line, and placed on the robot during initial setup. It may be unique for each robot, or shared across a fleet of robots all intended to trust each other.
fr: Bien que dans nos didacticiels, nous créons une autorité de certification à la volée, dans un système de production, cela doit être fait selon un plan de sécurité prédéfini. Généralement, l'autorité de certification d'un système de production est créée hors ligne et placée sur le robot lors de la configuration initiale. Il peut être unique pour chaque robot, ou partagé par une flotte de robots tous destinés à se faire confiance.

source: DDS (and ROS, by extension) supports separation of identity and permission trust chains, so each function has its own certificate authority. In most cases a ROS system security plan does not require a separation between these duties, so the security utilities generate a single Certificate Authority which is used for both identity and permissions.
fr: DDS (et ROS, par extension) prend en charge la séparation des chaînes de confiance d'identité et d'autorisation, de sorte que chaque fonction a sa propre autorité de certification. Dans la plupart des cas, un plan de sécurité du système ROS ne nécessite pas de séparation entre ces tâches, de sorte que les utilitaires de sécurité génèrent une seule autorité de certification qui est utilisée à la fois pour l'identité et les autorisations.

source: Use ``openssl`` to view this x509 certificate and display it as text:
fr: Utilisez ``openssl`` pour afficher ce certificat x509 et l'afficher sous forme de texte :

source: The output should look similar to the following::
fr: La sortie doit ressembler à ce qui suit : :

source: Some things to note about this CA certificate:
fr: Quelques points à noter à propos de ce certificat CA :

source: The certificate subject name ``sros2testCA`` is the default provided by the ``sros2`` utilities.
fr: Le nom du sujet du certificat ``sros2testCA`` est la valeur par défaut fournie par les utilitaires ``sros2``.

source: This certificate is valid for ten years from time of creation
fr: Ce certificat est valable dix ans à compter de sa création

source: Like all certificates, this contains a public key used for public-private key encryption
fr: Comme tous les certificats, celui-ci contient une clé publique utilisée pour le chiffrement à clé publique-privée

source: As a Root Certificate Authority, this is a `self-signed certificate <https://en.wikipedia.org/wiki/Self-signed_certificate>`_; i.e., it is signed using its own private key.
fr: En tant qu'autorité de certification racine, il s'agit d'un `certificat auto-signé <https://en.wikipedia.org/wiki/Self-signed_certificate>`_ ; c'est-à-dire qu'il est signé à l'aide de sa propre clé privée.

source: Since this is a public certificate, it can be freely copied as needed to establish trust throughout your ROS system.
fr: Comme il s'agit d'un certificat public, il peut être librement copié selon les besoins pour établir la confiance dans l'ensemble de votre système ROS.

source: Private Key Materials
fr: Matériel de clé privée

source: Private key materials can be found in the keystore directory ``~/sros2_demo/demo_keys/private``. Similar to the ``public`` directory, this contains one certificate authority key ``ca.key.pem`` and symbolic links to it to be used as both an Identity and a Permissions CA private key.
fr: Les éléments de clé privée peuvent être trouvés dans le répertoire keystore ``~/sros2_demo/demo_keys/private``. Semblable au répertoire ``public``, celui-ci contient une clé d'autorité de certification ``ca.key.pem`` et des liens symboliques vers celle-ci à utiliser à la fois comme clé privée d'identité et de permission de l'autorité de certification.

source: Protect this private key and create a secure backup of it!
fr: Protégez cette clé privée et créez-en une sauvegarde sécurisée !

source: This is the private key associated with the public Certificate Authority which serves as the anchor for all security in your ROS system. You will use it to modify encryption policies for the ROS graph and to add new ROS participants. Depending upon your robot's security needs, the key can be protected with access permissions and locked down to another account, or it can be moved off the robot entirely and onto another system or device. If the file is lost, you will be unable to change access permissions and add new participants to the system. Similarly, any user or process with access to the file has the ability to modify system policies and participants.
fr: Il s'agit de la clé privée associée à l'autorité de certification publique qui sert de point d'ancrage pour toute la sécurité de votre système ROS. Vous l'utiliserez pour modifier les politiques de chiffrement du graphe ROS et pour ajouter de nouveaux participants ROS. En fonction des besoins de sécurité de votre robot, la clé peut être protégée par des autorisations d'accès et verrouillée sur un autre compte, ou elle peut être entièrement déplacée du robot vers un autre système ou appareil. Si le fichier est perdu, vous ne pourrez pas modifier les autorisations d'accès et ajouter de nouveaux participants au système. De même, tout utilisateur ou processus ayant accès au fichier a la possibilité de modifier les politiques système et les participants.

source: This file is only required for configuring the robot, but is not needed for the robot to run. It can safely be stored offline in another system or removable media.
fr: Ce fichier n'est requis que pour configurer le robot, mais n'est pas nécessaire pour que le robot fonctionne. Il peut être stocké en toute sécurité hors ligne dans un autre système ou sur un support amovible.

source: The ``sros2`` utilities use `elliptic curve cryptograpy <https://en.wikipedia.org/wiki/Elliptic-curve_cryptography>`_ rather than RSA for improved security and reduced key size. Use the following command to show details about this elliptic curve private key:
fr: Les utilitaires ``sros2`` utilisent la `cryptographie à courbe elliptique <https://en.wikipedia.org/wiki/Elliptic-curve_cryptography>`_ plutôt que RSA pour une sécurité améliorée et une taille de clé réduite. Utilisez la commande suivante pour afficher les détails de cette clé privée de courbe elliptique :

source: Your output should look similar to the following::
fr: Votre sortie devrait ressembler à ce qui suit : :

source: In addition to the private key itself, note that the public key is listed, and it matches the public key listed in the Certificate Authority ``ca.cert.pem``.
fr: En plus de la clé privée elle-même, notez que la clé publique est répertoriée et qu'elle correspond à la clé publique répertoriée dans l'autorité de certification ``ca.cert.pem``.

source: Domain Governance Policy
fr: Politique de gouvernance de domaine

source: Find the domain governance policy in the enclave directory within the keystore, ``~/sros2_demo/demo_keys/enclaves``. The ``enclave`` directory contains XML governance policy document ``governance.xml``, as well as a copy of the document which has been signed by the Permissions CA as ``governance.p7s``.
fr: Recherchez la politique de gouvernance du domaine dans le répertoire enclave du magasin de clés, ``~/sros2_demo/demo_keys/enclaves``. Le répertoire ``enclave`` contient le document de politique de gouvernance XML ``governance.xml``, ainsi qu'une copie du document qui a été signé par l'autorité de certification des autorisations en tant que ``governance.p7s``.

source: The ``governance.p7s`` file contains domain-wide settings such as how to handle unauthenticated participants, whether to encrypt discovery, and default rules for access to topics.
fr: Le fichier ``governance.p7s`` contient des paramètres à l'échelle du domaine tels que la façon de gérer les participants non authentifiés, de crypter ou non la découverte et les règles par défaut pour l'accès aux rubriques.

source: Use the following command to validate the `S/MIME signature <https://en.wikipedia.org/wiki/S/MIME>`_ of the governance file:
fr: Utilisez la commande suivante pour valider la `signature S/MIME <https://en.wikipedia.org/wiki/S/MIME>`_ du fichier de gouvernance :

source: This command will print out the XML document, and the last line will be ``Verification successful`` to show that the document was properly signed by the Permissions CA.
fr: Cette commande imprimera le document XML et la dernière ligne sera ``Verification réussie`` pour montrer que le document a été correctement signé par l'autorité de certification des autorisations.

source: Security Enclaves
fr: Enclaves de sécurité

source: Secure processes (typically ROS nodes) run within a security enclave. In the simplest case, all the processes can be consolidated into the same enclave, and all processes will then use the same security policy. However, to apply different policies to different processes, the processes can use different security enclaves when starting. For more details about security enclaves, see the `design document <https://design.ros2.org/articles/ros2_security_enclaves.html>`_. The security enclave is specifed by using the ROS argument ``--enclave`` when running a node.
fr: Les processus sécurisés (généralement des nœuds ROS) s'exécutent dans une enclave de sécurité. Dans le cas le plus simple, tous les processus peuvent être regroupés dans la même enclave, et tous les processus utiliseront alors la même politique de sécurité. Cependant, pour appliquer différentes politiques à différents processus, les processus peuvent utiliser différentes enclaves de sécurité lors du démarrage. Pour plus de détails sur les enclaves de sécurité, consultez le `document de conception <https://design.ros2.org/articles/ros2_security_enclaves.html>`_. L'enclave de sécurité est spécifiée en utilisant l'argument ROS ``--enclave`` lors de l'exécution d'un nœud.

source: **Each security enclave requires six files** in order to enable security. Each file **must** be named as defined below, and as outlined in the `DDS Security standard <https://www.omg.org/spec/DDS-SECURITY/1.1/About-DDS-SECURITY/>`_. In order to avoid having mulitple copies of the same files, the ``sros2`` utilities create links for each enclave to the single governance policy, the Identity CA and Permissions CA descibed above.
fr: **Chaque enclave de sécurité nécessite six fichiers** pour activer la sécurité. Chaque fichier **doit** être nommé comme défini ci-dessous et comme indiqué dans la `norme de sécurité DDS <https://www.omg.org/spec/DDS-SECURITY/1.1/About-DDS-SECURITY/>`_ . Afin d'éviter d'avoir plusieurs copies des mêmes fichiers, les utilitaires ``sros2`` créent des liens pour chaque enclave vers la politique de gouvernance unique, l'AC d'Identité et l'AC de Permissions décrites ci-dessus.

source: See the following six files within the ``listener`` enclave. Three are specific to this enclave, while three are generic to this ROS system:
fr: Voir les six fichiers suivants dans l'enclave ``listener``. Trois sont spécifiques à cette enclave, tandis que trois sont génériques à ce système ROS :

source: ``key.pem``, the private key used to encrypt and decrypt within this enclave
fr: ``key.pem``, la clé privée utilisée pour chiffrer et déchiffrer dans cette enclave

source: ``cert.pem``, the public certificate for this enclave; this certificate has been signed by the Identity CA
fr: ``cert.pem``, le certificat public pour cette enclave ; ce certificat a été signé par l'Identity CA

source: ``permissions.p7s``, the permissions for this enclave; this file has been signed with the Permissions CA
fr: ``permissions.p7s``, les permissions pour cette enclave ; ce fichier a été signé avec le Permissions CA

source: ``governance.p7s``, a link to the signed security policy file for this domain
fr: ``governance.p7s``, un lien vers le fichier de politique de sécurité signé pour ce domaine

source: ``identity_ca.cert.pem``, a link to the Identity CA for this domain
fr: ``identity_ca.cert.pem``, un lien vers l'Identity CA pour ce domaine

source: ``permissions_ca.cert.pem``, a link to the Permissions CA for this domain
fr: ``permissions_ca.cert.pem``, un lien vers l'autorité de certification des autorisations pour ce domaine

source: The private encryption key ``key.pem`` should be protected according to your security plan. This key encrypts, decrypts and validates communications within this specific enclave. Should the key be lost or stolen, revoke the key and create a new identity for this enclave.
fr: La clé de chiffrement privée ``key.pem`` doit être protégée conformément à votre plan de sécurité. Cette clé chiffre, déchiffre et valide les communications au sein de cette enclave spécifique. En cas de perte ou de vol de la clé, révoquez la clé et créez une nouvelle identité pour cette enclave.

source: The file ``permissions.xml`` has also been created in this directory and can be used to recreate the signed permissions file. However, this file is not required to enable security since DDS uses the signed version of the file instead.
fr: Le fichier ``permissions.xml`` a également été créé dans ce répertoire et peut être utilisé pour recréer le fichier des permissions signées. Cependant, ce fichier n'est pas requis pour activer la sécurité car DDS utilise à la place la version signée du fichier.

source: Take the quiz!
fr: Fais le quiz!

source: See if you can answer these questions about the ROS security keystore. Begin with a new terminal session and enable security with the keystore created in the prior tutorial:
fr: Voyez si vous pouvez répondre à ces questions sur le magasin de clés de sécurité ROS. Commencez par une nouvelle session de terminal et activez la sécurité avec le keystore créé dans le tutoriel précédent :

source: Make a backup copy of ``permissions.p7s`` before beginning.
fr: Faites une copie de sauvegarde de ``permissions.p7s`` avant de commencer.

source: Open ``permissions.p7s`` in a text editor. Make a negligible change to the XML content (e.g., add a space or a blank line) and save the file. Launch the listener node:
fr: Ouvrez ``permissions.p7s`` dans un éditeur de texte. Apportez une modification négligeable au contenu XML (par exemple, ajoutez un espace ou une ligne vide) et enregistrez le fichier. Lancez le nœud d'écoute :

source: What do you expect to happen?
fr: Qu'attendez-vous qu'il se passe ?

source: Can you launch the talker node?
fr: Pouvez-vous lancer le nœud de locuteur ?

source: What is the difference between launching the listener and launching the talker?
fr: Quelle est la différence entre lancer le listener et lancer le talker ?

source: Answer 1
fr: Réponse 1

source: The listener fails to launch and throws an error. When the ``permissions.p7s`` file was modified--however minor--the file's signature became invalid. A node will not launch with security enabled and enforced when the permissions file is invalid.
fr: L'écouteur ne parvient pas à se lancer et renvoie une erreur. Lorsque le fichier ``permissions.p7s`` a été modifié--même mineur--la signature du fichier est devenue invalide. Un nœud ne se lancera pas avec la sécurité activée et appliquée lorsque le fichier d'autorisations n'est pas valide.

source: The talker will start as expected. It uses the ``permissions.p7s`` file in a different enclave, and the file is still valid.
fr: Le locuteur commencera comme prévu. Il utilise le fichier ``permissions.p7s`` dans une autre enclave, et le fichier est toujours valide.

source: What command lets you check to see if the signature on the modified ``permissions.p7s`` file is valid?
fr: Quelle commande vous permet de vérifier si la signature du fichier ``permissions.p7s`` modifié est valide ?

source: Answer 2
fr: Réponse 2

source: Check that ``permissions.p7s`` has been properly signed by the Permissions CA using the ``openssl smime`` command:
fr: Vérifiez que ``permissions.p7s`` a été correctement signé par l'autorité de certification des autorisations à l'aide de la commande ``openssl smime`` :

source: Restore your original, properly signed ``permissions.p7s`` file before proceeding to the next tutorial.
fr: Restaurez votre fichier ``permissions.p7s`` d'origine correctement signé avant de passer au didacticiel suivant.
