Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/The-ROS2-Project/Contributing/Code-Style-Language-Versions.po
Languages: fr

source: Code style and language versions
fr: Style de code et versions linguistiques

source: Table of Contents
fr: Table des matières

source: In order to achieve a consistent looking product we will all follow externally (if possible) defined style guidelines for each language. For other things like package layout or documentation layout we will need to come up with our own guidelines, drawing on current, popular styles in use now.
fr: Afin d'obtenir un produit cohérent, nous suivrons tous (si possible) des directives de style définies en externe pour chaque langue. Pour d'autres choses comme la mise en page du package ou la mise en page de la documentation, nous devrons proposer nos propres directives, en nous appuyant sur les styles actuels et populaires actuellement utilisés.

source: Additionally, wherever possible, developers should use integrated tools to allow them to check that these guidelines are followed in their editors. For example, everyone should have a PEP8 checker built into their editor to cut down on review iterations related to style.
fr: De plus, dans la mesure du possible, les développeurs doivent utiliser des outils intégrés pour leur permettre de vérifier que ces directives sont suivies dans leurs éditeurs. Par exemple, tout le monde devrait avoir un vérificateur PEP8 intégré à son éditeur pour réduire les itérations de révision liées au style.

source: Also where possible, packages should check style as part of their unit tests to help with the automated detection of style issues (see `ament_lint_auto <https://github.com/ament/ament_lint/blob/rolling/ament_lint_auto/doc/index.rst>`__).
fr: Aussi, dans la mesure du possible, les packages doivent vérifier le style dans le cadre de leurs tests unitaires pour aider à la détection automatisée des problèmes de style (voir `ament_lint_auto <https://github.com/ament/ament_lint/blob/rolling/ament_lint_auto/doc/index. premier>`__).

source: We will target C99.
fr: Nous ciblerons C99.

source: We will use `Python's PEP7 <https://www.python.org/dev/peps/pep-0007/>`__ for our C style guide, with some modifications and additions:
fr: Nous utiliserons `Python's PEP7 <https://www.python.org/dev/peps/pep-0007/>`__ pour notre guide de style C, avec quelques modifications et ajouts :

source: We will target C99, as we do not need to support C89 (as PEP7 recommends)
fr: Nous ciblerons C99, car nous n'avons pas besoin de prendre en charge C89 (comme le recommande PEP7)

source: rationale: among other things it allows us to use both ``//`` and ``/* */`` style comments
fr: justification : entre autres choses, cela nous permet d'utiliser à la fois les commentaires de style ``//`` et ``/* */``

source: rationale: C99 is pretty much ubiquitous now
fr: justification: C99 est à peu près omniprésent maintenant

source: C++ style ``//`` comments are allowed
fr: Les commentaires ``//`` de style C++ sont autorisés

source: (optional) Always place literals on the left-hand side of comparison operators, e.g. ``0 == ret`` instead of ``ret == 0``
fr: (facultatif) Placez toujours les littéraux à gauche des opérateurs de comparaison, par ex. ``0 == ret`` au lieu de ``ret == 0``

source: rationale: ``ret == 0`` too easily turns into ``ret = 0`` by accident
fr: raisonnement : ``ret == 0`` se transforme trop facilement en ``ret = 0`` par accident

source: optional because when using ``-Wall`` (or equivalent) modern compilers will warn you when this happens
fr: facultatif car lors de l'utilisation de ``-Wall`` (ou équivalent), les compilateurs modernes vous avertiront lorsque cela se produira

source: All of the following modifications only apply if we are not writing Python modules:
fr: Toutes les modifications suivantes ne s'appliquent que si nous n'écrivons pas de modules Python :

source: Do not use ``Py_`` as a prefix for everything
fr: N'utilisez pas ``Py_`` comme préfixe pour tout

source: instead use a CamelCase version of the package name or other appropriate prefix
fr: utilisez plutôt une version CamelCase du nom du package ou un autre préfixe approprié

source: The stuff about documentation strings doesn't apply
fr: Les trucs sur les chaînes de documentation ne s'appliquent pas

source: We can use the `pep7 <https://github.com/mike-perdide/pep7>`__ python module for style checking. The editor integration seems slim, we may need to look into automated checking for C in more detail.
fr: Nous pouvons utiliser le module python `pep7 <https://github.com/mike-perdide/pep7>`__ pour la vérification du style. L'intégration de l'éditeur semble mince, nous devrons peut-être examiner plus en détail la vérification automatisée du C.

source: Rolling targets C++17.
fr: Cibles roulantes C++17.

source: We will use the `Google C++ Style Guide <https://google.github.io/styleguide/cppguide.html>`__, with some modifications:
fr: Nous utiliserons le `Google C++ Style Guide <https://google.github.io/styleguide/cppguide.html>`__, avec quelques modifications :

source: Line Length
fr: Longueur de la ligne

source: Our maximum line length is 100 characters.
fr: Notre longueur de ligne maximale est de 100 caractères.

source: File Extensions
fr: Extensions de fichiers

source: Header files should use the .hpp extension.
fr: Les fichiers d'en-tête doivent utiliser l'extension .hpp.

source: rationale: Allow tools to determine content of files, C++ or C.
fr: justification : Autoriser les outils à déterminer le contenu des fichiers, C++ ou C.

source: Implementation files should use the .cpp extension.
fr: Les fichiers d'implémentation doivent utiliser l'extension .cpp.

source: Variable Naming
fr: Dénomination des variables

source: For global variables use lowercase with underscores prefixed with ``g_``
fr: Pour les variables globales, utilisez des minuscules avec des traits de soulignement préfixés par ``g_``

source: rationale: keep variable naming case consistent across the project
fr: justification : conserver la cohérence de la casse des noms de variables tout au long du projet

source: rationale: easy to tell the scope of a variable at a glance
fr: justification : facile à déterminer la portée d'une variable en un coup d'œil

source: consistency across languages
fr: cohérence entre les langues

source: Function and Method Naming
fr: Dénomination des fonctions et des méthodes

source: Google style guide says ``CamelCase``, but the C++ std library's style of ``snake_case`` is also allowed
fr: Le guide de style de Google indique ``CamelCase``, mais le style de ``snake_case`` de la bibliothèque C++ std est également autorisé

source: rationale: ROS 2 core packages currently use ``snake_case``
fr: justification : les packages de base ROS 2 utilisent actuellement ``snake_case``

source: reason: either an historical oversight or a personal preference that didn't get checked by the linter
fr: raison : soit un oubli historique, soit une préférence personnelle qui n'a pas été vérifiée par le linter

source: reason for not changing: retroactively changing would be too disruptive
fr: raison de ne pas changer : changer rétroactivement serait trop perturbateur

source: other considerations:
fr: autres considérations:

source: ``cpplint.py`` does not check this case (hard to enforce other than with review)
fr: ``cpplint.py`` ne vérifie pas ce cas (difficile à appliquer autrement qu'avec révision)

source: ``snake_case`` can result in more consistency across languages
fr: ``snake_case`` peut entraîner une plus grande cohérence entre les langues

source: specific guidance:
fr: conseils spécifiques :

source: for existing projects, prefer the existing style
fr: pour les projets existants, préférez le style existant

source: for new projects, either is acceptable, but a preference for matching related existing projects is advised
fr: pour les nouveaux projets, l'un ou l'autre est acceptable, mais une préférence pour les projets existants connexes est conseillée

source: final decision is always developer discretion
fr: la décision finale est toujours à la discrétion du développeur

source: special cases like function pointers, callable types, etc. may require bending the rules
fr: des cas particuliers comme les pointeurs de fonction, les types appelables, etc. peuvent nécessiter de contourner les règles

source: Note that classes should still use ``CamelCase`` by default
fr: Notez que les classes doivent toujours utiliser ``CamelCase`` par défaut

source: Access Control
fr: Contrôle d'accès

source: Drop requirement for all class members to be private and therefore require accessors
fr: Abandonnez l'exigence que tous les membres de la classe soient privés et nécessitent donc des accesseurs

source: rationale: this is overly constraining for user API design
fr: justification : cela est trop contraignant pour la conception de l'API utilisateur

source: we should prefer private members, only making them public when they are needed
fr: nous devrions préférer les membres privés, ne les rendant publics que lorsqu'ils sont nécessaires

source: we should consider using accessors before choosing to allow direct member access
fr: nous devrions envisager d'utiliser des accesseurs avant de choisir d'autoriser l'accès direct aux membres

source: we should have a good reason for allowing direct member access, other than because it is convenient for us
fr: nous devrions avoir une bonne raison d'autoriser l'accès direct aux membres, autre que parce que c'est pratique pour nous

source: Exceptions
fr: Des exceptions

source: Exceptions are allowed
fr: Les exceptions sont autorisées

source: rationale: this is a new code base, so the legacy argument doesn't apply to us
fr: justification : il s'agit d'une nouvelle base de code, donc l'argument hérité ne s'applique pas à nous

source: rationale: for user-facing API's it is more idiomatic C++ to have exceptions
fr: justification : pour les API orientées utilisateur, il est plus idiomatique de C++ d'avoir des exceptions

source: Exceptions in destructors should be explicitly avoided
fr: Les exceptions dans les destructeurs doivent être explicitement évitées

source: We should consider avoiding Exceptions if we intend to wrap the resulting API in C
fr: Nous devrions envisager d'éviter les exceptions si nous avons l'intention d'envelopper l'API résultante en C

source: rationale: it will make it easier to wrap in C
fr: logique : cela facilitera l'encapsulation en C

source: rationale: most of our dependencies in code we intend to wrap in C do not use exceptions anyways
fr: justification : la plupart de nos dépendances dans le code que nous avons l'intention d'envelopper en C n'utilisent pas d'exceptions de toute façon

source: Function-like Objects
fr: Objets de type fonction

source: No restrictions on Lambda's or ``std::function`` or ``std::bind``
fr: Aucune restriction sur Lambda ou ``std::function`` ou ``std::bind``

source: Boost
fr: Augmenter

source: Boost should be avoided unless absolutely required.
fr: Le boost doit être évité à moins qu'il ne soit absolument nécessaire.

source: Comments and Doc Comments
fr: Commentaires et commentaires de documentation

source: Use ``///`` and ``/** */`` comments for *documentation* purposes and ``//`` style comments for notes and general comments
fr: Utilisez les commentaires ``///`` et ``/** */`` à des fins de *documentation* et les commentaires de style ``//`` pour les notes et les commentaires généraux

source: Class and Function comments should use ``///`` and ``/** */`` style comments
fr: Les commentaires de classe et de fonction doivent utiliser les commentaires de style ``///`` et ``/** */``

source: rationale: these are recommended for Doxygen and Sphinx in C/C++
fr: justification : ceux-ci sont recommandés pour Doxygen et Sphinx en C/C++

source: rationale: mixing ``/* */`` and ``//`` is convenient for block commenting out code which contains comments
fr: logique : mélanger ``/* */`` et ``//`` est pratique pour bloquer le code qui contient des commentaires

source: Descriptions of how the code works or notes within classes and functions should use ``//`` style comments
fr: Les descriptions du fonctionnement du code ou les notes dans les classes et les fonctions doivent utiliser des commentaires de style ``//``

source: Pointer Syntax Alignment
fr: Alignement de la syntaxe du pointeur

source: Use ``char * c;`` instead of ``char* c;`` or ``char *c;`` because of this scenario ``char* c, *d, *e;``
fr: Utilisez ``char * c;`` au lieu de ``char* c;`` ou ``char *c;`` à cause de ce scénario ``char* c, *d, *e;``

source: Class Privacy Keywords
fr: Mots-clés de confidentialité de classe

source: Do not put 1 space before ``public:``, ``private:``, or ``protected:``, it is more consistent for all indentions to be a multiple of 2
fr: Ne mettez pas 1 espace avant ``public:``, ``private:`` ou ``protected:``, il est plus cohérent que toutes les indentations soient un multiple de 2

source: rationale: most editors don't like indentions which are not a multiple of the (soft) tab size
fr: justification : la plupart des éditeurs n'aiment pas les indentations qui ne sont pas un multiple de la taille de l'onglet (soft)

source: Use zero spaces before ``public:``, ``private:``, or ``protected:``, or 2 spaces
fr: Utilisez zéro espace avant ``public:``, ``private:``, ou ``protected:``, ou 2 espaces

source: If you use 2 spaces before, indent other class statements by 2 additional spaces
fr: Si vous utilisez 2 espaces avant, indentez les autres instructions de classe de 2 espaces supplémentaires

source: Prefer zero spaces, i.e. ``public:``, ``private:``, or ``protected:`` in the same column as the class
fr: Préférez zéro espace, c'est-à-dire ``public:``, ``private:`` ou ``protected:`` dans la même colonne que la classe

source: Nested Templates
fr: Modèles imbriqués

source: Never add whitespace to nested templates
fr: Ne jamais ajouter d'espace aux modèles imbriqués

source: Prefer ``set<list<string>>`` (C++11 feature) to ``set<list<string> >`` or ``set< list<string> >``
fr: Préférez ``set<list<string>>`` (fonctionnalité C++11) à ``set<list<string> >`` ou ``set< list<string> >``

source: Always Use Braces
fr: Utilisez toujours des accolades

source: Always use braces following ``if``, ``else``, ``do``, ``while``, and ``for``, even when the body is a single line.
fr: Utilisez toujours des accolades après ``if``, ``else``, ``do``, ``while`` et ``for``, même lorsque le corps est une seule ligne.

source: rationale: less opportunity for visual ambiguity and for complications due to use of macros in the body
fr: justification : moins de possibilités d'ambiguïté visuelle et de complications dues à l'utilisation de macros dans le corps

source: Open Versus Cuddled Braces
fr: Bretelles ouvertes ou douillettes

source: Use open braces for ``function``, ``class``, ``enum``, and ``struct`` definitions, but cuddle braces on ``if``, ``else``, ``while``, ``for``, etc...
fr: Utilisez des accolades ouvertes pour les définitions de ``function``, ``class``, ``enum`` et ``struct``, mais mettez des accolades sur ``if``, ``else``, ``while` `, ``pour``, etc...

source: Exception: when an ``if`` (or ``while``, etc.) condition is long enough to require line-wrapping, then use an open brace (i.e., don't cuddle).
fr: Exception : lorsqu'une condition ``if`` (ou ``while``, etc.) est suffisamment longue pour nécessiter un retour à la ligne, utilisez une accolade ouverte (c'est-à-dire, ne vous blottissez pas).

source: When a function call cannot fit on one line, wrap at the open parenthesis (not in between arguments) and start them on the next line with a 2-space indent. Continue with the 2-space indent on subsequent lines for more arguments. (Note that the `Google style guide <https://google.github.io/styleguide/cppguide.html#Function_Calls>`__ is internally contradictory on this point.)
fr: Lorsqu'un appel de fonction ne peut pas tenir sur une ligne, placez-le à la parenthèse ouverte (pas entre les arguments) et commencez-les sur la ligne suivante avec un retrait de 2 espaces. Continuez avec le retrait de 2 espaces sur les lignes suivantes pour plus d'arguments. (Notez que le `Google style guide <https://google.github.io/styleguide/cppguide.html#Function_Calls>`__ est contradictoire en interne sur ce point.)

source: Same goes for ``if`` (and ``while``, etc.) conditions that are too long to fit on one line.
fr: Il en va de même pour les conditions ``if`` (et ``while``, etc.) qui sont trop longues pour tenir sur une seule ligne.

source: Examples
fr: Exemples

source: This is OK:
fr: C'est acceptable:

source: This is **not** OK:
fr: Ce n'est **pas** OK :

source: Use open braces rather than excessive indention, e.g. for distinguishing constructor code from constructor initializer lists
fr: Utilisez des accolades ouvertes plutôt qu'une indentation excessive, par ex. pour distinguer le code du constructeur des listes d'initialisation du constructeur

source: This is **not** OK, even weird (the google way?):
fr: Ce n'est **pas** OK, même bizarre (à la manière de Google ?) :

source: We check these styles with a combination of Google's `cpplint.py <https://github.com/google/styleguide>`__ and `uncrustify <https://github.com/uncrustify/uncrustify>`__.
fr: Nous vérifions ces styles avec une combinaison de `cpplint.py <https://github.com/google/styleguide>`__ et `uncrustify <https://github.com/uncrustify/uncrustify>`__ de Google.

source: We provide command line tools with custom configurations:
fr: Nous fournissons des outils de ligne de commande avec des configurations personnalisées :

source: Some formatters such as ament_uncrustify and ament_clang_format support ``--reformat`` options to apply changes in place.
fr: Certains formateurs tels que ament_uncrustify et ament_clang_format prennent en charge les options ``--reformat`` pour appliquer les modifications sur place.

source: We also run other tools to detect and eliminate as many warnings as possible. Here's a non-exhaustive list of additional things we try to do on all of our packages:
fr: Nous exécutons également d'autres outils pour détecter et éliminer autant d'avertissements que possible. Voici une liste non exhaustive des choses supplémentaires que nous essayons de faire sur tous nos forfaits :

source: use compiler flags like ``-Wall -Wextra -Wpedantic``
fr: utiliser des drapeaux de compilateur comme ``-Wall -Wextra -Wpedantic``

source: run static code analysis like ``cppcheck``, which we have integrated in `ament_cppcheck <https://github.com/ament/ament_lint/blob/rolling/ament_cppcheck/doc/index.rst>`__.
fr: exécuter une analyse de code statique comme ``cppcheck``, que nous avons intégré dans `ament_cppcheck <https://github.com/ament/ament_lint/blob/rolling/ament_cppcheck/doc/index.rst>`__.

source: We will target Python 3 for our development.
fr: Nous ciblerons Python 3 pour notre développement.

source: We will use the `PEP8 guidelines <https://www.python.org/dev/peps/pep-0008/>`_ for code format.
fr: Nous utiliserons les `directives PEP8 <https://www.python.org/dev/peps/pep-0008/>`_ pour le format du code.

source: We chose the following more precise rule where PEP 8 leaves some freedom:
fr: Nous avons choisi la règle plus précise suivante où PEP 8 laisse une certaine liberté :

source: `We allow up to 100 characters per line (fifth paragraph) <https://www.python.org/dev/peps/pep-0008/#maximum-line-length>`_.
fr: `Nous autorisons jusqu'à 100 caractères par ligne (cinquième paragraphe) <https://www.python.org/dev/peps/pep-0008/#maximum-line-length>`_.

source: `We pick single quotes over double quotes as long as no escaping is necessary <https://www.python.org/dev/peps/pep-0008/#string-quotes>`_.
fr: `Nous choisissons des guillemets simples plutôt que des guillemets doubles tant qu'aucun échappement n'est nécessaire <https://www.python.org/dev/peps/pep-0008/#string-quotes>`_.

source: `We prefer hanging indents for continuation lines <https://www.python.org/dev/peps/pep-0008/#indentation>`_.
fr: `Nous préférons les retraits suspendus pour les lignes de continuation <https://www.python.org/dev/peps/pep-0008/#indentation>`_.

source: Tools like the ``(ament_)pycodestyle`` Python package should be used in unit-test and/or editor integration for checking Python code style.
fr: Des outils tels que le package Python ``(ament_)pycodestyle`` doivent être utilisés dans les tests unitaires et/ou l'intégration de l'éditeur pour vérifier le style de code Python.

source: The pycodestyle configuration used in the linter is `here <https://github.com/ament/ament_lint/blob/rolling/ament_pycodestyle/ament_pycodestyle/configuration/ament_pycodestyle.ini>`__.
fr: La configuration pycodestyle utilisée dans le linter est `ici <https://github.com/ament/ament_lint/blob/rolling/ament_pycodestyle/ament_pycodestyle/configuration/ament_pycodestyle.ini>`__.

source: Integration with editors:
fr: Intégration avec les éditeurs :

source: atom: https://atom.io/packages/linter-pycodestyle
fr: atome : https://atom.io/packages/linter-pycodestyle

source: We will target CMake 3.8.
fr: Nous ciblerons CMake 3.8.

source: Since there is not an existing CMake style guide we will define our own:
fr: Puisqu'il n'y a pas de guide de style CMake existant, nous définirons le nôtre :

source: Use lowercase command names (``find_package``, not ``FIND_PACKAGE``).
fr: Utilisez des noms de commande en minuscules (``find_package``, et non ``FIND_PACKAGE``).

source: Use ``snake_case`` identifiers (variables, functions, macros).
fr: Utilisez les identifiants ``snake_case`` (variables, fonctions, macros).

source: Use empty ``else()`` and ``end...()`` commands.
fr: Utilisez les commandes vides ``else()`` et ``end...()``.

source: No whitespace before ``(``\ 's.
fr: Pas d'espace avant ``(``\ 's.

source: Use two spaces of indention, do not use tabs.
fr: Utilisez deux espaces d'indentation, n'utilisez pas de tabulations.

source: Do not use aligned indentation for parameters of multi-line macro invocations. Use two spaces only.
fr: N'utilisez pas d'indentation alignée pour les paramètres d'invocations de macros multilignes. N'utilisez que deux espaces.

source: Prefer functions with ``set(PARENT_SCOPE)`` to macros.
fr: Préférez les fonctions avec ``set(PARENT_SCOPE)`` aux macros.

source: When using macros prefix local variables with ``_`` or a reasonable prefix.
fr: Lorsque vous utilisez des macros, préfixez les variables locales avec ``_`` ou un préfixe raisonnable.

source: Markdown / reStructured Text / docblocks
fr: Markdown / Texte restructuré / docblocks

source: The following rules to format text is intended to increase readability as well as versioning.
fr: Les règles suivantes pour formater le texte sont destinées à augmenter la lisibilité ainsi que la gestion des versions.

source: *[.md, .rst only]* Each section title should be preceded by one empty line and succeeded by one empty line.
fr: *[.md, .rst uniquement]* Chaque titre de section doit être précédé d'une ligne vide et suivi d'une ligne vide.

source: Rationale: It expedites to get an overview about the structure when screening the document.
fr: Justification : Il est plus rapide d'avoir une vue d'ensemble de la structure lors de la sélection du document.

source: *[.rst only]* In reStructured Text the headings should follow the hierarchy described in the `Sphinx style guide <https://documentation-style-guide-sphinx.readthedocs.io/en/latest/style-guide.html#headings>`__:
fr: *[.rst uniquement]* Dans le texte restructuré, les titres doivent suivre la hiérarchie décrite dans le `guide de style Sphinx <https://documentation-style-guide-sphinx.readthedocs.io/en/latest/style-guide.html# rubriques>`__ :

source: ``#`` with overline (only once, used for the document title)
fr: ``#`` avec surlignement (une seule fois, utilisé pour le titre du document)
