Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/The-ROS2-Project/Contributing/Code-Style-Language-Versions.po
Languages: fr

source: ``*`` with overline
fr: ``*`` avec surlignement

source: Rationale: A consistent hierarchy expedites getting an idea about the nesting level when screening the document.
fr: Justification : Une hiérarchie cohérente permet d'avoir une idée du niveau d'imbrication lors du filtrage du document.

source: *[.md only]* In Markdown the headings should follow the ATX-style described in the `Markdown syntax documentation <https://daringfireball.net/projects/markdown/syntax#header>`__
fr: *[.md uniquement]* Dans Markdown, les en-têtes doivent suivre le style ATX décrit dans la `documentation de la syntaxe Markdown <https://daringfireball.net/projects/markdown/syntax#header>`__

source: ATX-style headers use 1-6 hash characters (``#``) at the start of the line to denote header levels 1-6.
fr: Les en-têtes de style ATX utilisent 1 à 6 caractères de hachage (``#``) au début de la ligne pour indiquer les niveaux d'en-tête 1 à 6.

source: A space between the hashes and the header title should be used (such as ``# Heading 1``) to make it easier to visually separate them.
fr: Un espace entre les hachages et le titre de l'en-tête doit être utilisé (comme ``# Titre 1``) pour faciliter leur séparation visuelle.

source: Justification for the ATX-style preference comes from the `Google Markdown style guide <https://github.com/google/styleguide/blob/gh-pages/docguide/style.md#atx-style-headings>`__
fr: La justification de la préférence de style ATX provient du `guide de style Google Markdown <https://github.com/google/styleguide/blob/gh-pages/docguide/style.md#atx-style-headings>`__

source: Rationale: ATX-style headers are easier to search and maintain, and make the first two header levels consistent with the other levels.
fr: Justification : les en-têtes de style ATX sont plus faciles à rechercher et à gérer, et rendent les deux premiers niveaux d'en-tête cohérents avec les autres niveaux.

source: *[any]* Each sentence must start on a new line.
fr: *[any]* Chaque phrase doit commencer sur une nouvelle ligne.

source: Rationale: For longer paragraphs a single change in the beginning makes the diff unreadable since it carries forward through the whole paragraph.
fr: Justification : Pour les paragraphes plus longs, un seul changement au début rend le diff illisible car il se poursuit dans tout le paragraphe.

source: *[any]* Each sentence can optionally be wrapped to keep each line short.
fr: *[any]* Chaque phrase peut éventuellement être enveloppée pour garder chaque ligne courte.

source: *[any]* The lines should not have any trailing white spaces.
fr: *[any]* Les lignes ne doivent pas avoir d'espaces blancs à la fin.

source: *[.md, .rst only]* A code block must be preceded and succeeded by an empty line.
fr: *[.md, .rst uniquement]* Un bloc de code doit être précédé et suivi d'une ligne vide.

source: Rationale: Whitespace is significant only directly before and directly after fenced code blocks. Following these instructions will ensure that highlighting works properly and consistently.
fr: Justification : Les espaces blancs ne sont significatifs que directement avant et directement après les blocs de code clôturés. Le respect de ces instructions garantira que la mise en surbrillance fonctionne correctement et de manière cohérente.

source: *[.md, .rst only]* A code block should specify a syntax (e.g. ``bash``).
fr: *[.md, .rst uniquement]* Un bloc de code doit spécifier une syntaxe (par exemple, ``bash``).
