Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/The-ROS2-Project/Contributing/Contributing-To-ROS-2-Documentation.po
Languages: fr

source: Contributing to ROS 2 Documentation
fr: Contribuer à la documentation ROS 2

source: Table of Contents
fr: Table des matières

source: Contributions to this site are most welcome. This page explains how to contribute to ROS 2 Documentation. Please be sure to read the below sections carefully before contributing.
fr: Les contributions à ce site sont les bienvenues. Cette page explique comment contribuer à la documentation ROS 2. Assurez-vous de lire attentivement les sections ci-dessous avant de contribuer.

source: The site is built using `Sphinx <https://www.sphinx-doc.org/en/master/>`_, and more particularly using `Sphinx multiversion <https://holzhaus.github.io/sphinx-multiversion/master/index.html>`_.
fr: Le site est construit en utilisant `Sphinx <https://www.sphinx-doc.org/en/master/>`_, et plus particulièrement en utilisant `Sphinx multiversion <https://holzhaus.github.io/sphinx-multiversion/ maître/index.html>`_.

source: Branch structure
fr: Structure de la succursale

source: The source code of documentation is located in the `ROS 2 Documentation GitHub repository <https://github.com/ros2/ros2_documentation>`_. This repository is set up with one branch per ROS 2 distribution to handle differences between the distributions. If a change is common to all ROS 2 distributions, it should be made to the ``rolling`` branch (and then will be backported as appropriate). If a change is specific to a particular ROS 2 distribution, it should be made to the respective branch.
fr: Le code source de la documentation se trouve dans le référentiel `ROS 2 Documentation GitHub <https://github.com/ros2/ros2_documentation>`_. Ce référentiel est configuré avec une branche par distribution ROS 2 pour gérer les différences entre les distributions. Si une modification est commune à toutes les distributions ROS 2, elle doit être apportée à la branche ``rolling`` (et sera ensuite rétroportée le cas échéant). Si une modification est spécifique à une distribution ROS 2 particulière, elle doit être apportée à la branche correspondante.

source: Source structure
fr: Structure source

source: The source files for the site are all located under the ``source`` subdirectory. Templates for various sphinx plugins are located under ``source/_templates``. The root directory contains configuration and files required to locally build the site for testing.
fr: Les fichiers source du site sont tous situés dans le sous-répertoire ``source``. Les modèles pour divers plugins sphinx sont situés sous ``source/_templates``. Le répertoire racine contient la configuration et les fichiers requis pour créer localement le site à des fins de test.

source: Building the site locally
fr: Construire le site localement

source: Start by installing requirements located in the ``requirements.txt`` file:
fr: Commencez par installer les exigences situées dans le fichier ``requirements.txt`` :

source: The next command does a user-specific install, which requires ``~/.local/bin/`` to be added to ``$PATH``:
fr: La commande suivante effectue une installation spécifique à l'utilisateur, qui nécessite l'ajout de ``~/.local/bin/`` à ``$PATH`` :

source: Windows
fr: les fenêtres

source: In order for Sphinx to be able to generate diagrams, the ``dot`` command must be available.
fr: Pour que Sphinx puisse générer des diagrammes, la commande ``dot`` doit être disponible.

source: Download an installer from `the Graphviz Download page <https://graphviz.gitlab.io/_pages/Download/Download_windows.html>`__ and install it. Make sure to allow the installer to add it to the Windows ``%PATH%``, otherwise Sphinx will not be able to find it.
fr: Téléchargez un programme d'installation à partir de la page de téléchargement de Graphviz <https://graphviz.gitlab.io/_pages/Download/Download_windows.html>`__ et installez-le. Assurez-vous d'autoriser le programme d'installation à l'ajouter au ``%PATH%`` de Windows, sinon Sphinx ne pourra pas le trouver.

source: Building the site for one branch
fr: Construire le site pour une succursale

source: To build the site for just this branch, type ``make html`` at the top-level of the repository. This is the recommended way to test out local changes.
fr: Pour créer le site uniquement pour cette branche, tapez ``make html`` au niveau supérieur du référentiel. Il s'agit de la méthode recommandée pour tester les modifications locales.

source: The build process can take some time. To see the output, open ``build/html/index.html`` in your browser.
fr: Le processus de construction peut prendre un certain temps. Pour voir la sortie, ouvrez ``build/html/index.html`` dans votre navigateur.

source: You can also run the documentation tests locally (using `doc8 <https://github.com/PyCQA/doc8>`_) with the following command:
fr: Vous pouvez également exécuter les tests de documentation localement (en utilisant `doc8 <https://github.com/PyCQA/doc8>`_) avec la commande suivante :

source: Building the site for all branches
fr: Création du site pour toutes les succursales

source: To build the site for all branches, type ``make multiversion`` from the ``rolling`` branch. This has two drawbacks:
fr: Pour construire le site pour toutes les branches, tapez ``make multiversion`` depuis la branche ``rolling``. Cela a deux inconvénients :

source: The multiversion plugin doesn't understand how to do incremental builds, so it always rebuilds everything. This can be slow.
fr: Le plugin multiversion ne comprend pas comment faire des builds incrémentiels, donc il reconstruit toujours tout. Cela peut être lent.

source: When typing ``make multiversion``, it will always check out exactly the branches listed in the ``conf.py`` file. That means that local changes will not be shown.
fr: Lorsque vous tapez ``make multiversion``, il vérifiera toujours exactement les branches répertoriées dans le fichier ``conf.py``. Cela signifie que les modifications locales ne seront pas affichées.

source: To show local changes in the multiversion output, you must first commit the changes to a local branch. Then you must edit the `conf.py <https://github.com/ros2/ros2_documentation/blob/rolling/conf.py>`_ file and change the ``smv_branch_whitelist`` variable to point to your branch.
fr: Pour afficher les modifications locales dans la sortie multiversion, vous devez d'abord valider les modifications dans une branche locale. Ensuite, vous devez éditer le fichier `conf.py <https://github.com/ros2/ros2_documentation/blob/rolling/conf.py>`_ et changer la variable ``smv_branch_whitelist`` pour pointer vers votre branche.

source: Checking for broken links
fr: Vérification des liens brisés

source: To check for broken links on the site, run:
fr: Pour vérifier les liens brisés sur le site, exécutez :

source: This will check the entire site for broken links, and output the results to the screen and ``build/linkcheck``.
fr: Cela vérifiera l'ensemble du site pour les liens brisés et affichera les résultats à l'écran et ``build/linkcheck``.

source: Writing pages
fr: Pages d'écriture

source: The ROS 2 documentation website uses the ``reStructuredText`` format, which is the default plaintext markup language used by Sphinx. This section is a brief introduction to ``reStructuredText`` concepts, syntax, and best practices.
fr: Le site Web de documentation de ROS 2 utilise le format ``reStructuredText``, qui est le langage de balisage en clair par défaut utilisé par Sphinx. Cette section est une brève introduction aux concepts, à la syntaxe et aux meilleures pratiques de ``reStructuredText``.

source: You can refer to `reStructuredText User Documentation <https://docutils.sourceforge.io/rst.html>`_ for a detailed technical specification.
fr: Vous pouvez vous référer à la `ReStructuredText User Documentation <https://docutils.sourceforge.io/rst.html>`_ pour une spécification technique détaillée.

source: There are two types of directives used for the generation of a table of contents, ``.. toctree::`` and ``.. contents::``. The ``.. toctree::`` is used in top-level pages like ``Tutorials.rst`` to set ordering and visibility of its child pages. This directive creates both left navigation panel and in-page navigation links to the child pages listed. It helps readers to understand the structure of separate documentation sections and navigate between pages.
fr: Il existe deux types de directives utilisées pour la génération d'une table des matières, ``.. toctree::`` et ``.. contents::``. Le ``.. toctree ::`` est utilisé dans les pages de niveau supérieur comme ``Tutorials.rst`` pour définir l'ordre et la visibilité de ses pages enfants. Cette directive crée à la fois un panneau de navigation de gauche et des liens de navigation dans la page vers les pages enfants répertoriées. Il aide les lecteurs à comprendre la structure des sections de documentation distinctes et à naviguer entre les pages.

source: The ``.. contents::`` directive is used for the generation of a table of contents for that particular page. It parses all present headings in a page and builds an in-page nested table of contents. It helps readers to see an overview of the content and navigate inside a page.
fr: La directive ``.. contents::`` est utilisée pour la génération d'une table des matières pour cette page particulière. Il analyse tous les titres présents dans une page et construit une table des matières imbriquée dans la page. Il aide les lecteurs à avoir un aperçu du contenu et à naviguer à l'intérieur d'une page.

source: The ``.. contents::`` directive supports the definition of maximum depth of nested sections. Using ``:depth: 2`` will only show Sections and Subsections in the table of contents.
fr: La directive ``.. contents::`` prend en charge la définition de la profondeur maximale des sections imbriquées. L'utilisation de ``:depth: 2`` n'affichera que les sections et les sous-sections dans la table des matières.

source: Headings
fr: Rubriques

source: There are four main Heading types used in the documentation. Note that the number of symbols has to match the length of the title.
fr: Il existe quatre principaux types de titres utilisés dans la documentation. Notez que le nombre de symboles doit correspondre à la longueur du titre.

source: We usually use one digit for numbering subsections and two digits (dot separated) for numbering subsubsections in Tutorials and How-To-Guides.
fr: Nous utilisons généralement un chiffre pour numéroter les sous-sections et deux chiffres (séparés par des points) pour numéroter les sous-sous-sections dans les didacticiels et les guides pratiques.

source: Lists
fr: Listes

source: Stars ``*`` are used for listing unordered items with bullet points and number sign ``#.`` is used for listing numbered items. Both of them support nested definitions and will render accordingly.
fr: Les étoiles ``*`` sont utilisées pour répertorier les éléments non ordonnés avec des puces et le signe dièse ``#.`` est utilisé pour répertorier les éléments numérotés. Les deux prennent en charge les définitions imbriquées et s'afficheront en conséquence.

source: Code Formatting
fr: Formatage des codes

source: In-text code can be formatted using ``backticks`` for showing ``highlighted`` code.
fr: Le code dans le texte peut être formaté à l'aide de ``backticks`` pour afficher le code ``surligné``.

source: Code blocks inside a page need to be captured using ``.. code-block::`` directive. ``.. code-block::`` supports code highlighting for syntaxes like ``C++``, ``YAML``, ``console``, ``bash``, and more. Code inside the directive needs to be indented.
fr: Les blocs de code à l'intérieur d'une page doivent être capturés à l'aide de la directive ``.. code-block::``. ``.. code-block::`` prend en charge la coloration du code pour des syntaxes telles que ``C++``, ``YAML``, ``console``, ``bash``, etc. Le code à l'intérieur de la directive doit être indenté.

source: Images can be inserted using the ``.. image::`` directive.
fr: Les images peuvent être insérées en utilisant la directive ``.. image::``.

source: References and Links
fr: Références et liens

source: External links
fr: Liens externes

source: The syntax of creating links to external web pages is shown below.
fr: La syntaxe de création de liens vers des pages Web externes est illustrée ci-dessous.

source: The above link will appear as `ROS Docs <https://docs.ros.org>`_. Note the underscore after the final single quote.
fr: Le lien ci-dessus apparaîtra sous la forme `ROS Docs <https://docs.ros.org>`_. Notez le trait de soulignement après le guillemet simple final.

source: Internal links
fr: Liens internes

source: The ``:doc:`` directive is used to create in-text links to other pages.
fr: La directive ``:doc:`` est utilisée pour créer des liens dans le texte vers d'autres pages.

source: Note that the relative path to the file is used.
fr: Notez que le chemin relatif au fichier est utilisé.

source: The ``ref`` directive is used to make links to specific parts of a page. These could be headings, images or code sections inside the current or different page.
fr: La directive ``ref`` est utilisée pour créer des liens vers des parties spécifiques d'une page. Il peut s'agir d'en-têtes, d'images ou de sections de code à l'intérieur de la page actuelle ou différente.

source: Definition of explicit target right before the desired object is required. In the example below, the target is defined as ``_talker-listener`` one line before the heading ``Try some examples``.
fr: Définition de la cible explicite juste avant que l'objet souhaité ne soit requis. Dans l'exemple ci-dessous, la cible est définie comme ``_talker-listener`` une ligne avant le titre ``Try some examples``.

source: Now the link from any page in the documentation to that header can be created.
fr: Maintenant, le lien de n'importe quelle page de la documentation vers cet en-tête peut être créé.

source: This link will navigate a reader to the target page with an HTML anchor link ``#talker-listener``.
fr: Ce lien dirigera un lecteur vers la page cible avec un lien d'ancrage HTML ``#talker-listener``.

source: Macros can be used to simplify writing documentation that targets multiple distributions.
fr: Les macros peuvent être utilisées pour simplifier la rédaction de documentation qui cible plusieurs distributions.

source: Use a macro by including the macro name in curly braces. For example, when generating the docs for Rolling on the ``rolling`` branch:
fr: Utilisez une macro en incluant le nom de la macro entre accolades. Par exemple, lors de la génération des docs pour Rolling sur la branche ``rolling`` :

source: Use
fr: Utiliser

source: Becomes (for Rolling)
fr: Devient (pour Rolling)

source: Example
fr: Exemple

source: rolling
fr: roulant

source: Rolling
fr: Roulant

source: Rolling Ridley
fr: Rouler Ridley

source: The same file can be used on multiple branches (i.e., for multiple distros) and the generated content will be distro-specific.
fr: Le même fichier peut être utilisé sur plusieurs branches (c'est-à-dire pour plusieurs distributions) et le contenu généré sera spécifique à la distribution.
