Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/The-ROS2-Project/Contributing/Developer-Guide.po
Languages: fr

source: When updating `RMW API <https://github.com/ros2/rmw>`__, it is required that RMW implementations for the Tier 1 middleware libraries are updated as well. For example, a new function ``rmw_foo()`` introduced to the RMW API must be implemented in the following packages (as of ROS Galactic):
fr: Lors de la mise à jour de `RMW API <https://github.com/ros2/rmw>`__, il est nécessaire que les implémentations RMW pour les bibliothèques middleware de niveau 1 soient également mises à jour. Par exemple, une nouvelle fonction ``rmw_foo()`` introduite dans l'API RMW doit être implémentée dans les packages suivants (à partir de ROS Galactic) :

source: Updates for non-Tier 1 middleware libraries should also be considered if feasible (e.g. depending on the size of the change). See `REP-2000 <https://www.ros.org/reps/rep-2000.html>`__ for the list of middleware libraries and their tiers.
fr: Les mises à jour pour les bibliothèques middleware non de niveau 1 doivent également être envisagées si possible (par exemple, en fonction de la taille du changement). Voir `REP-2000 <https://www.ros.org/reps/rep-2000.html>`__ pour la liste des bibliothèques middleware et leurs niveaux.

source: Tracking tasks
fr: Suivi des tâches

source: To help organize work on ROS 2, the core ROS 2 development team uses kanban-style `GitHub project boards <https://github.com/orgs/ros2/projects>`_.
fr: Pour aider à organiser le travail sur ROS 2, l'équipe de développement principale de ROS 2 utilise des tableaux de projet GitHub de style kanban <https://github.com/orgs/ros2/projects>`_.

source: Not all issues and pull requests are tracked on the project boards, however. A board usually represents an upcoming release or specific project. Tickets can be browsed on a per-repo basis by browsing the `ROS 2 repositories' <https://github.com/ros2>`_ individual issue pages.
fr: Cependant, tous les problèmes et demandes d'extraction ne sont pas suivis sur les tableaux de projet. Un tableau représente généralement une version à venir ou un projet spécifique. Les tickets peuvent être consultés sur une base par dépôt en parcourant les `référentiels ROS 2' <https://github.com/ros2>`_ pages de problèmes individuels.

source: The names and purposes of columns in any given ROS 2 project board vary, but typically follow the same general structure:
fr: Les noms et les objectifs des colonnes dans un tableau de projet ROS 2 donné varient, mais suivent généralement la même structure générale :

source: **To do**: Issues that are relevant to the project, ready to be assigned
fr: **À faire** : problèmes pertinents pour le projet, prêts à être attribués

source: **In progress**: Active pull requests on which work is currently in progress
fr: **En cours** : demandes d'extraction actives sur lesquelles des travaux sont actuellement en cours

source: **In review**: Pull requests where work is complete and ready for review, and for those currently under active review
fr: **En cours d'examen** : demandes d'extraction pour lesquelles le travail est terminé et prêt à être examiné, et pour celles qui sont actuellement en cours d'examen

source: **Done**: Pull requests and related issues are merged/closed (for informational purposes)
fr: **Terminé** : les demandes d'extraction et les problèmes associés sont fusionnés/fermés (à titre informatif)

source: To request permission to make changes, simply comment on the tickets you're interested in. Depending on the complexity, it might be useful to describe how you plan to address it. We will update the status (if you don't have the permission) and you can start working on a pull request. If you contribute regularly we will likely just grant you permission to manage the labels etc. yourself.
fr: Pour demander l'autorisation d'apporter des modifications, il vous suffit de commenter les tickets qui vous intéressent. En fonction de la complexité, il peut être utile de décrire comment vous envisagez de le résoudre. Nous mettrons à jour le statut (si vous n'en avez pas l'autorisation) et vous pourrez commencer à travailler sur une pull request. Si vous contribuez régulièrement, nous vous accorderons probablement simplement la permission de gérer vous-même les étiquettes, etc.

source: Programming conventions
fr: Conventions de programmation

source: Defensive programming: ensure that assumptions are held as early as possible. E.g. check every return code and make sure to at least throw an exception until the case is handled more gracefully.
fr: Programmation défensive : assurez-vous que les hypothèses sont maintenues le plus tôt possible. Par exemple. vérifiez chaque code de retour et assurez-vous de lever au moins une exception jusqu'à ce que le cas soit traité avec plus de grâce.

source: All error messages must be directed to ``stderr``.
fr: Tous les messages d'erreur doivent être dirigés vers ``stderr``.

source: Declare variables in the narrowest scope possible.
fr: Déclarez les variables dans la portée la plus étroite possible.

source: Keep group of items (dependencies, imports, includes, etc.) ordered alphabetically.
fr: Gardez le groupe d'éléments (dépendances, importations, inclusions, etc.) classés par ordre alphabétique.

source: C++ specific
fr: Spécifique C++

source: Avoid using direct streaming (``<<``) to ``stdout`` / ``stderr`` to prevent interleaving between multiple threads.
fr: Évitez d'utiliser le streaming direct (``<<``) vers ``stdout`` / ``stderr`` pour empêcher l'entrelacement entre plusieurs threads.

source: Avoid using references for ``std::shared_ptr`` since that subverts the reference counting. If the original instance goes out of scope and the reference is being used it accesses freed memory.
fr: Évitez d'utiliser des références pour ``std::shared_ptr`` car cela perturbe le comptage des références. Si l'instance d'origine sort de la portée et que la référence est utilisée, elle accède à la mémoire libérée.

source: Filesystem layout
fr: Disposition du système de fichiers

source: The filesystem layout of packages and repositories should follow the same conventions in order to provide a consistent experience for users browsing our source code.
fr: La disposition du système de fichiers des packages et des référentiels doit suivre les mêmes conventions afin de fournir une expérience cohérente aux utilisateurs parcourant notre code source.

source: Package layout
fr: Disposition de l'emballage

source: ``src``: contains all C and C++ code
fr: ``src`` : contient tout le code C et C++

source: Also contains C/C++ headers which are not installed
fr: Contient également des en-têtes C/C++ qui ne sont pas installés

source: ``include``: contains all C and C++ headers which are installed
fr: ``include`` : contient tous les en-têtes C et C++ qui sont installés

source: ``<package name>``: for all C and C++ installed headers they should be folder namespaced by the package name
fr: ``<nom du package>`` : pour tous les en-têtes installés en C et C++, ils doivent être placés dans un espace de nom de dossier par le nom du package

source: ``<package_name>``: contains all Python code
fr: ``<package_name>`` : contient tout le code Python

source: ``test``: contains all automated tests and test data
fr: ``test`` : contient tous les tests automatisés et les données de test

source: ``config``: contains configuration files, e.g. YAML parameters files and RViz config files
fr: ``config`` : contient les fichiers de configuration, par ex. Fichiers de paramètres YAML et fichiers de configuration RViz

source: ``doc``: contains all the documentation
fr: ``doc`` : contient toute la documentation

source: ``launch``: contains all launch files
fr: ``launch`` : contient tous les fichiers de lancement

source: ``package.xml``: as defined by `REP-0140 <https://www.ros.org/reps/rep-0140.html>`_ (may be updated for prototyping)
fr: ``package.xml`` : tel que défini par `REP-0140 <https://www.ros.org/reps/rep-0140.html>`_ (peut être mis à jour pour le prototypage)

source: ``CMakeLists.txt``: only ROS packages which use CMake
fr: ``CMakeLists.txt`` : seuls les packages ROS qui utilisent CMake

source: ``setup.py``: only ROS packages which use Python code only
fr: ``setup.py`` : uniquement les packages ROS qui utilisent uniquement du code Python

source: ``README``: can be rendered on GitHub as a landing page for the project
fr: ``README`` : peut être rendu sur GitHub en tant que page de destination pour le projet

source: This can be as short or detailed as is convenient, but it should at least link to project documentation
fr: Cela peut être aussi court ou détaillé que possible, mais il doit au moins être lié à la documentation du projet

source: Consider putting a CI or code coverage tag in this README
fr: Envisagez de mettre un CI ou une balise de couverture de code dans ce README

source: It can also be ``.rst`` or anything else that GitHub supports
fr: Il peut également s'agir de ``.rst`` ou de tout autre élément pris en charge par GitHub

source: ``CONTRIBUTING``: describes the contribution guidelines
fr: ``CONTRIBUTING`` : décrit les directives de contribution

source: This might include license implication, e.g. when using the Apache 2 License.
fr: Cela peut inclure l'implication de la licence, par ex. lors de l'utilisation de la licence Apache 2.

source: ``LICENSE``: a copy of the license or licenses for this package
fr: ``LICENSE`` : une copie de la licence ou des licences pour ce package

source: ``CHANGELOG.rst``: `REP-0132 <https://www.ros.org/reps/rep-0132.html>`_ compliant changelog
fr: ``CHANGELOG.rst`` : `REP-0132 <https://www.ros.org/reps/rep-0132.html>`_ journal des modifications conforme

source: Repository layout
fr: Disposition du référentiel

source: Each package should be in a subfolder which has the same name as the package. If a repository contains only a single package it can optionally be in the root of the repository.
fr: Chaque package doit se trouver dans un sous-dossier portant le même nom que le package. Si un référentiel ne contient qu'un seul package, il peut éventuellement se trouver à la racine du référentiel.

source: Developer Workflow
fr: Flux de travail du développeur

source: We track open tickets and active PRs related to upcoming releases and larger projects using `GitHub project boards <https://github.com/orgs/ros2/projects>`_.
fr: Nous suivons les tickets ouverts et les relations publiques actives liées aux versions à venir et aux projets plus importants à l'aide de `tableaux de projets GitHub <https://github.com/orgs/ros2/projects>`_.

source: The usual workflow is:
fr: Le flux de travail habituel est :

source: Discuss design (GitHub ticket on the appropriate repository, and a design PR to https://github.com/ros2/design if needed)
fr: Discutez de la conception (ticket GitHub sur le référentiel approprié et un PR de conception à https://github.com/ros2/design si nécessaire)

source: Write implementation on a feature branch on a fork
fr: Écrire l'implémentation sur une branche de fonctionnalité sur un fork

source: Please check out the `developer guide <Developer-Guide>` for guidelines and best practices
fr: Veuillez consulter le `guide du développeur <Developer-Guide>` pour les directives et les meilleures pratiques

source: Write tests
fr: Rédiger des tests

source: Enable and run linters
fr: Activer et exécuter les linters

source: Run tests locally using ``colcon test`` (see the :doc:`colcon tutorial <../../Tutorials/Beginner-Client-Libraries/Colcon-Tutorial>`)
fr: Exécutez les tests localement en utilisant ``colcon test`` (voir le :doc:`colcon tutorial <../../Tutorials/Beginner-Client-Libraries/Colcon-Tutorial>`)

source: Once everything builds locally without warnings and all tests are passing, run CI on your feature branch:
fr: Une fois que tout se construit localement sans avertissement et que tous les tests réussissent, exécutez CI sur votre branche de fonctionnalité :

source: Go to ci.ros2.org
fr: Allez sur ci.ros2.org

source: Log in (top right corner)
fr: Connectez-vous (coin supérieur droit)

source: Click on the ``ci_launcher`` job
fr: Cliquez sur la tâche ``ci_launcher``

source: Click "Build with Parameters" (left column)
fr: Cliquez sur "Construire avec des paramètres" (colonne de gauche)

source: In the first box "CI_BRANCH_TO_TEST" enter your feature branch name
fr: Dans la première case "CI_BRANCH_TO_TEST" entrez le nom de votre branche de fonctionnalité

source: Hit the ``build`` button
fr: Appuyez sur le bouton ``construire``

source: (if you are not a ROS 2 committer, you don't have access to the CI farm. In that case, ping the reviewer of your PR to run CI for you)
fr: (si vous n'êtes pas un committer ROS 2, vous n'avez pas accès à la ferme CI. Dans ce cas, envoyez un ping au réviseur de votre PR pour qu'il exécute CI pour vous)

source: If your use case requires running code coverage:
fr: Si votre cas d'utilisation nécessite une couverture de code en cours d'exécution :

source: Click on the ``ci_linux_coverage`` job
fr: Cliquez sur le travail ``ci_linux_coverage``

source: Be sure of leaving "CI_BUILD_ARGS" and "CI_TEST_ARGS" with the default values
fr: Assurez-vous de laisser "CI_BUILD_ARGS" et "CI_TEST_ARGS" avec les valeurs par défaut

source: At the end of the document there are instructions on how to :ref:`interpret the result of the report <read-coverage-report>` and :ref:`calculate the coverage rate <calculate-coverage-rate>`
fr: À la fin du document, il y a des instructions sur la façon de :ref:`interpréter le résultat du rapport <read-coverage-report>` et :ref:`calculer le taux de couverture <calculate-coverage-rate>`

source: If the CI job built without warnings, errors and test failures, post the links of your jobs on your PR or high-level ticket aggregating all your PRs (see example `here <https://github.com/ros2/rcl/pull/106#issuecomment-271119200>`__)
fr: Si le travail CI construit sans avertissements, erreurs et échecs de test, postez les liens de vos travaux sur votre PR ou ticket de haut niveau regroupant tous vos PRs (voir exemple `ici <https://github.com/ros2/rcl/pull /106#issuecomment-271119200>`__)

source: Note that the markdown for these badges is in the console output of the ``ci_launcher`` job
fr: Notez que la démarque de ces badges se trouve dans la sortie console du travail ``ci_launcher``

source: When the PR has been approved:
fr: Lorsque le PR a été approuvé :

source: the person who submitted the PR merges it using "Squash and Merge" option so that we keep a clean history
fr: la personne qui a soumis le PR le fusionne en utilisant l'option "Squash and Merge" afin que nous gardions un historique propre

source: If the commits deserve to keep separated: squash all the nitpick/linters/typo ones together and merge the remaining set
fr: Si les commits méritent d'être séparés : écrasez tous les nitpick/linters/typo ensemble et fusionnez l'ensemble restant

source: Note: each PR should target a specific feature so Squash and Merge should make sense 99% of the time
fr: Remarque : chaque PR doit cibler une fonctionnalité spécifique afin que Squash et Merge aient du sens 99 % du temps

source: Delete the branch once merged
fr: Supprimer la branche une fois fusionnée

source: Architectural Development Practices
fr: Pratiques de développement architectural

source: This section describes the ideal lifecycle that should be employed when making large architectural changes to ROS 2.
fr: Cette section décrit le cycle de vie idéal qui doit être utilisé lors de modifications architecturales importantes de ROS 2.

source: Software Development Lifecycle
fr: Cycle de vie du développement logiciel

source: This section describes step-by-step how to plan, design, and implement a new feature:
fr: Cette section décrit étape par étape comment planifier, concevoir et implémenter une nouvelle fonctionnalité :

source: Task Creation
fr: Création de tâche

source: Creating the Design Document
fr: Création du document de conception

source: Design Review
fr: Examen de la conception

source: Implementation
fr: Mise en œuvre

source: Code Review
fr: Révision des codes

source: Task creation
fr: Création de tâche

source: Tasks requiring changes to critical parts of ROS 2 should have design reviews during early stages of the release cycle. If a design review is happening in the later stages, the changes will be part of a future release.
fr: Les tâches nécessitant des modifications des parties critiques de ROS 2 doivent faire l'objet de revues de conception au cours des premières étapes du cycle de publication. Si une révision de la conception a lieu dans les étapes ultérieures, les modifications feront partie d'une future version.

source: An issue should be created in the appropriate `ros2 repository <https://github.com/ros2/>`__, clearly describing the task being worked on.
fr: Un problème doit être créé dans le `dépôt ros2 <https://github.com/ros2/>`__ approprié, décrivant clairement la tâche en cours.

source: It should have a clear success criteria and highlight the concrete improvements expected from it.
fr: Il doit avoir des critères de réussite clairs et mettre en évidence les améliorations concrètes attendues de celui-ci.

source: If the feature is targeting a ROS release, ensure this is tracked in the ROS release ticket (`example <https://github.com/ros2/ros2/issues/607>`__).
fr: Si la fonctionnalité cible une version ROS, assurez-vous que cela est suivi dans le ticket de version ROS (`exemple <https://github.com/ros2/ros2/issues/607>`__).

source: Writing the design document
fr: Rédaction du document de conception

source: Design docs must never include confidential information. Whether or not a design document is required for your change depends on how big the task is.
fr: Les documents de conception ne doivent jamais inclure d'informations confidentielles. La nécessité ou non d'un document de conception pour votre modification dépend de l'ampleur de la tâche.

source: You are making a small change or fixing a bug:
fr: Vous apportez une petite modification ou corrigez un bogue :

source: A design document is not required, but an issue should be opened in the appropriate repository to track the work and avoid duplication of efforts.
fr: Un document de conception n'est pas requis, mais un problème doit être ouvert dans le référentiel approprié pour suivre le travail et éviter la duplication des efforts.

source: You are implementing a new feature or would like to contribute to OSRF-owned infrastructure (like Jenkins CI):
fr: Vous implémentez une nouvelle fonctionnalité ou souhaitez contribuer à l'infrastructure appartenant à OSRF (comme Jenkins CI):

source: Design doc is required and should be contributed to `ros2/design <https://github.com/ros2/design/>`__ to be made accessible on https://design.ros2.org/.
fr: La documentation de conception est requise et doit être ajoutée à `ros2/design <https://github.com/ros2/design/>`__ pour être rendue accessible sur https://design.ros2.org/.

source: You should fork the repository and submit a pull request detailing the design.
fr: Vous devez bifurquer le référentiel et soumettre une demande d'extraction détaillant la conception.

source: Mention the related ros2 issue (for example, ``Design doc for task ros2/ros2#<issue id>``) in the pull request or the commit message. Detailed instructions are on the `ROS 2 Contribute <https://design.ros2.org/contribute.html>`__ page. Design comments will be made directly on the pull request.
fr: Mentionnez le problème ros2 associé (par exemple, ``Design doc for task ros2/ros2#<issue id>``) dans la demande d'extraction ou le message de validation. Des instructions détaillées se trouvent sur la page `ROS 2 Contribute <https://design.ros2.org/contribute.html>`__. Les commentaires de conception seront faits directement sur la demande d'extraction.

source: If the task is planned to be released with a specific version of ROS, this information should be included in the pull request.
fr: S'il est prévu que la tâche soit publiée avec une version spécifique de ROS, ces informations doivent être incluses dans la demande d'extraction.

source: Design document review
fr: Examen des documents de conception

source: Once the design is ready for review, a pull request should be opened and appropriate reviewers should be assigned. It is recommended to include project owner(s) - maintainers of all impacted packages (as defined by ``package.xml`` maintainer field, see `REP-140 <https://www.ros.org/reps/rep-0140.html#maintainer-multiple-but-at-least-one>`__) - as reviewers.
fr: Une fois que la conception est prête à être examinée, une demande d'extraction doit être ouverte et des examinateurs appropriés doivent être affectés. Il est recommandé d'inclure le(s) propriétaire(s) du projet - responsables de tous les packages impactés (tel que défini par le champ responsable ``package.xml``, voir `REP-140 <https://www.ros.org/reps/rep- 0140.html#maintainer-multiple-but-at-least-one>`__) - en tant que réviseurs.

source: If the design doc is complex or reviewers have conflicting schedules, an optional design review meeting can be set up. In this case,
fr: Si le document de conception est complexe ou si les réviseurs ont des horaires contradictoires, une réunion facultative de révision de la conception peut être organisée. Dans ce cas,

source: **Before the meeting**
fr: **Avant la réunion**

source: Send a meeting invite at least one week in advance
fr: Envoyer une invitation à une réunion au moins une semaine à l'avance

source: Meeting duration of one hour is recommended
fr: Une durée de réunion d'une heure est recommandée

source: Meeting invite should list all decisions to be made during the review (decisions requiring package maintainer approval)
fr: L'invitation à la réunion doit répertorier toutes les décisions à prendre lors de l'examen (décisions nécessitant l'approbation du responsable du paquet)

source: Meeting required attendees: design pull request reviewers
fr: Réunion des participants requis : réviseurs de demandes d'extraction de conception

source: Meeting optional attendees: all OSRF engineers, if applicable
fr: Réunion des participants facultatifs : tous les ingénieurs OSRF, le cas échéant

source: **During the meeting**
fr: **Pendant la réunion**

source: The task owner drives the meeting, presents their ideas and manages discussions to ensure an agreement is reached on time
fr: Le propriétaire de la tâche dirige la réunion, présente ses idées et gère les discussions pour s'assurer qu'un accord est atteint à temps

source: **After the meeting**
fr: **Après la réunion**

source: The task owner should send back meeting notes to all attendees
fr: Le propriétaire de la tâche doit renvoyer les notes de réunion à tous les participants

source: If minor issues have been raised about the design:
fr: Si des problèmes mineurs ont été soulevés concernant la conception :

source: The task owner should update the design doc pull request based on the feedback
fr: Le propriétaire de la tâche doit mettre à jour la demande d'extraction de document de conception en fonction des commentaires

source: Additional review is not required
fr: Un examen supplémentaire n'est pas nécessaire

source: If major issues have been raised about the design:
fr: Si des problèmes majeurs ont été soulevés concernant la conception :

source: It is acceptable to remove sections for which there is no clear agreement
fr: Il est acceptable de supprimer les sections pour lesquelles il n'y a pas d'accord clair

source: The debatable parts of the design can be resubmitted as a separate task in the future
fr: Les parties discutables de la conception peuvent être soumises à nouveau en tant que tâche distincte à l'avenir
