Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/The-ROS2-Project/Contributing/Developer-Guide.po
Languages: fr

source: It should be easy to take any package and from that package's documentation understand how to build, run, build and run tests, and build the documentation. Obviously we should avoid repeating ourselves for common workflows, like building a package in a workspace, but the basic workflows should be either described or referenced.
fr: Il devrait être facile de prendre n'importe quel package et à partir de la documentation de ce package, comprendre comment construire, exécuter, construire et exécuter des tests, et construire la documentation. Évidemment, nous devons éviter de nous répéter pour les flux de travail courants, comme la création d'un package dans un espace de travail, mais les flux de travail de base doivent être décrits ou référencés.

source: Finally, it should include any documentation for developers. This might include workflows for testing the code using something like ``python setup.py develop``, or it might mean describing how to make use of extension points provided by your package.
fr: Enfin, il devrait inclure toute documentation destinée aux développeurs. Cela peut inclure des flux de travail pour tester le code en utilisant quelque chose comme ``python setup.py develop``, ou cela peut signifier décrire comment utiliser les points d'extension fournis par votre package.

source: Examples:
fr: Exemples:

source: capabilities: https://docs.ros.org/hydro/api/capabilities/html/
fr: capacités : https://docs.ros.org/hydro/api/capabilities/html/

source: This one gives an example of docs which describe the public API
fr: Celui-ci donne un exemple de docs décrivant l'API publique

source: This is an example of describing an extension point for a package
fr: Ceci est un exemple de description d'un point d'extension pour un package

source: *(API docs are not yet being automatically generated)*
fr: *(Les documents API ne sont pas encore générés automatiquement)*

source: Testing
fr: Essai

source: All packages should have some level of :ref:`system, integration, and/or unit tests.<TestingMain>`
fr: Tous les packages doivent avoir un certain niveau de :ref:`tests système, d'intégration et/ou unitaires.<TestingMain>`

source: **Unit tests** should always be in the package which is being tested and should make use of tools like ``Mock`` to try and test narrow parts of the code base in constructed scenarios. Unit tests should not bring in test dependencies that are not testing tools, e.g. gtest, nosetest, pytest, mock, etc...
fr: **Les tests unitaires** doivent toujours se trouver dans le package en cours de test et doivent utiliser des outils tels que ``Mock`` pour essayer de tester des parties étroites de la base de code dans des scénarios construits. Les tests unitaires ne doivent pas introduire de dépendances de test qui ne sont pas des outils de test, par ex. gtest, nosetest, pytest, mock, etc...

source: **Integration tests** can test interactions between parts of the code or between parts of the code and the system. They often test software interfaces in ways that we expect the user to use them. Like Unit tests, Integration tests should be in the package which is being tested and should not bring in non-tool test dependencies unless absolutely necessary, i.e. all non-tool dependencies should only be allowed under extreme scrutiny so they should be avoided if possible.
fr: Les **tests d'intégration** peuvent tester les interactions entre des parties du code ou entre des parties du code et le système. Ils testent souvent les interfaces logicielles de manière à ce que nous attendions de l'utilisateur qu'il les utilise. Comme les tests unitaires, les tests d'intégration doivent être dans le package qui est testé et ne doivent pas introduire de dépendances de test non liées à l'outil, sauf en cas d'absolue nécessité, c'est-à-dire que toutes les dépendances non liées à l'outil ne doivent être autorisées que sous un examen minutieux, elles doivent donc être évitées si possible.

source: **System tests** are designed to test end-to-end situations between packages and should be in their own packages to avoid bloating or coupling packages and to avoid circular dependencies.
fr: Les **tests système** sont conçus pour tester des situations de bout en bout entre les packages et doivent être dans leurs propres packages pour éviter les packages gonflés ou couplés et pour éviter les dépendances circulaires.

source: In general minimizing external or cross package test dependencies should be avoided to prevent circular dependencies and tightly coupled test packages.
fr: En général, il convient d'éviter de minimiser les dépendances de test externes ou entre packages pour éviter les dépendances circulaires et les packages de test étroitement couplés.

source: All packages should have some unit tests and possibly integration tests, but the degree to which they should have them is based on the package's quality category. The following subsections apply to 'Level 1' packages:
fr: Tous les packages doivent avoir des tests unitaires et éventuellement des tests d'intégration, mais le degré auquel ils doivent les avoir est basé sur la catégorie de qualité du package. Les sous-sections suivantes s'appliquent aux forfaits de « niveau 1 » :

source: Code coverage
fr: Couverture de code

source: We will provide line coverage, and achieve line coverage above 95%. If a lower percentage target is justifiable, it must be prominently documented. We may provide branch coverage, or exclude code from coverage (test code, debug code, etc.). We require that coverage increase or stay the same before merging a change, but it may be acceptable to make a change that decreases code coverage with proper justification (e.g. deleting code that was previously covered can cause the percentage to drop).
fr: Nous fournirons une couverture de ligne et atteindrons une couverture de ligne supérieure à 95 %. Si un objectif de pourcentage inférieur est justifiable, il doit être clairement documenté. Nous pouvons fournir une couverture de branche ou exclure du code de la couverture (code de test, code de débogage, etc.). Nous exigeons que la couverture augmente ou reste la même avant de fusionner une modification, mais il peut être acceptable d'apporter une modification qui diminue la couverture du code avec une justification appropriée (par exemple, la suppression du code qui était précédemment couvert peut entraîner une baisse du pourcentage).

source: We strongly recommend performance tests, but recognize they don't make sense for some packages. If there are performance tests, we will choose to either check each change or before each release or both. We will also require justification for merging a change or making a release that lowers performance.
fr: Nous recommandons fortement les tests de performances, mais reconnaissons qu'ils n'ont pas de sens pour certains packages. S'il y a des tests de performance, nous choisirons de vérifier chaque changement ou avant chaque version ou les deux. Nous aurons également besoin d'une justification pour fusionner un changement ou faire une version qui réduit les performances.

source: Linters and static analysis
fr: Linters et analyse statique

source: We will use :doc:`ROS code style <Code-Style-Language-Versions>` and enforce it with linters from `ament_lint_common <https://github.com/ament/ament_lint/tree/rolling/ament_lint_common/doc/index.rst>`_. All linters/static analysis that are part of ``ament_lint_common`` must be used.
fr: Nous allons utiliser :doc:`style de code ROS <Code-Style-Language-Versions>` et l'appliquer avec les linters de `ament_lint_common <https://github.com/ament/ament_lint/tree/rolling/ament_lint_common/doc/index .rst>`_. Tous les linters/analyses statiques qui font partie de ``ament_lint_common`` doivent être utilisés.

source: The `ament_lint_auto <https://github.com/ament/ament_lint/blob/rolling/ament_lint_auto/doc/index.rst>`_ documentation provides information on running ``ament_lint_common``.
fr: La documentation `ament_lint_auto <https://github.com/ament/ament_lint/blob/rolling/ament_lint_auto/doc/index.rst>`_ fournit des informations sur l'exécution de ``ament_lint_common``.

source: General Practices
fr: Pratiques générales

source: Some practices are common to all ROS 2 development.
fr: Certaines pratiques sont communes à tous les développements ROS 2.

source: These practices don't affect package quality level as described in `REP 2004 <https://www.ros.org/reps/rep-2004.html>`_, but are still highly recommended for the development process.
fr: Ces pratiques n'affectent pas le niveau de qualité du package tel que décrit dans `REP 2004 <https://www.ros.org/reps/rep-2004.html>`_, mais sont toujours fortement recommandées pour le processus de développement.

source: Issues
fr: Questions

source: When filing an issue please make sure to:
fr: Lorsque vous signalez un problème, assurez-vous de :

source: Include enough information for another person to understand the issue. In ROS 2, the following points are needed for narrowing down the cause of an issue. Testing with as many alternatives in each category as feasible will be especially helpful.
fr: Incluez suffisamment d'informations pour qu'une autre personne comprenne le problème. Dans ROS 2, les points suivants sont nécessaires pour déterminer la cause d'un problème. Tester avec autant d'alternatives dans chaque catégorie que possible sera particulièrement utile.

source: **The operating system and version.** Reasoning: ROS 2 supports multiple platforms, and some bugs are specific to particular versions of operating systems/compilers.
fr: **Le système d'exploitation et la version.** Raisonnement : ROS 2 prend en charge plusieurs plates-formes, et certains bogues sont spécifiques à des versions particulières de systèmes d'exploitation/compilateurs.

source: **The installation method.** Reasoning: Some issues only manifest if ROS 2 has been installed from "fat archives" or from Debians. This can help us determine if the issue is with the packaging process.
fr: **La méthode d'installation.** Raisonnement : Certains problèmes ne se manifestent que si ROS 2 a été installé à partir de « fat archives » ou de Debians. Cela peut nous aider à déterminer si le problème vient du processus d'emballage.

source: **The specific version of ROS 2.** Reasoning: Some bugs may be present in a particular ROS 2 release and later fixed. It is important to know if your installation includes these fixes.
fr: **La version spécifique de ROS 2.** Raisonnement : Certains bogues peuvent être présents dans une version particulière de ROS 2 et corrigés ultérieurement. Il est important de savoir si votre installation inclut ces correctifs.

source: **The DDS/RMW implementation being used** (see `this page <../../Concepts/About-Different-Middleware-Vendors>` for how to determine which one). Reasoning: Communication issues may be specific to the underlying ROS middleware being used.
fr: **L'implémentation DDS/RMW utilisée** (voir `cette page <../../Concepts/About-Different-Middleware-Vendors>` pour savoir comment déterminer lequel). Raisonnement : les problèmes de communication peuvent être spécifiques au middleware ROS sous-jacent utilisé.

source: **The ROS 2 client library being used.** Reasoning: This helps us narrow down the layer in the stack at which the issue might be.
fr: **La bibliothèque cliente ROS 2 utilisée.** Raisonnement : Cela nous aide à réduire la couche de la pile à laquelle le problème pourrait survenir.

source: Include a list of steps to reproduce the issue.
fr: Incluez une liste d'étapes pour reproduire le problème.

source: In case of a bug consider to provide a `short, self contained, correct (compilable), example <http://sscce.org/>`__. Issues are much more likely to be resolved if others can reproduce them easily.
fr: En cas de bogue, envisagez de fournir un exemple court, autonome et correct (compilable) <http://sscce.org/>`__. Les problèmes sont beaucoup plus susceptibles d'être résolus si d'autres peuvent les reproduire facilement.

source: Mention troubleshooting steps that have been tried already, including:
fr: Mentionnez les étapes de dépannage qui ont déjà été essayées, notamment :

source: Upgrading to the latest version of the code, which may include bug fixes that have not been released yet. See `this section <building-from-source>` and follow the instructions to get the "rolling" branches.
fr: Mise à niveau vers la dernière version du code, qui peut inclure des correctifs de bogues qui n'ont pas encore été publiés. Voir `cette section <building-from-source>` et suivez les instructions pour obtenir les branches "rolling".

source: Trying with a different RMW implementation. See `this page <../../How-To-Guides/Working-with-multiple-RMW-implementations>` for how to do that.
fr: Essayer avec une autre implémentation RMW. Voir `cette page <../../How-To-Guides/Working-with-multiple-RMW-implementations>` pour savoir comment procéder.

source: These are just guidelines. It is up to the package maintainer to choose branch names that match their own workflow.
fr: Ce ne sont que des lignes directrices. Il appartient au responsable du paquet de choisir des noms de branche qui correspondent à son propre flux de travail.

source: It is good practice to have **separate branches** in a package's source repository for each ROS distribution it is targeting. These branches are typically named after the distribution they target. For example, a ``humble`` branch for development targeted specifically at the Humble distribution.
fr: Il est recommandé d'avoir des **branches séparées** dans le référentiel source d'un package pour chaque distribution ROS qu'il cible. Ces branches portent généralement le nom de la distribution qu'elles ciblent. Par exemple, une branche ``humble`` pour le développement ciblant spécifiquement la distribution Humble.

source: Releases are also made from these branches, targeting the appropriate distribution. Development targeted at a specific ROS distribution can happen on the appropriate branch. For example: Development commits targeting ``foxy`` are made to the ``foxy`` branch, and package releases for ``foxy`` are made from that same branch.
fr: Des sorties sont également faites à partir de ces branches, en ciblant la distribution appropriée. Le développement ciblé sur une distribution ROS spécifique peut se produire sur la branche appropriée. Par exemple : les commits de développement ciblant ``foxy`` sont créés dans la branche ``foxy``, et les versions de package pour ``foxy`` sont créées à partir de cette même branche.

source: This requires the package maintainers to perform backports or forwardports as appropriate to keep all branches up to date with features. The maintainers must also perform general maintenance (bug fixes, etc.) on all branches from which package releases are still made.
fr: Cela nécessite que les responsables du paquet effectuent des backports ou des forwardports selon les besoins pour maintenir toutes les branches à jour avec les fonctionnalités. Les mainteneurs doivent également effectuer une maintenance générale (corrections de bogues, etc.) sur toutes les branches à partir desquelles des versions de paquets sont encore créées.

source: For example, if a feature is merged into the Rolling-specific branch (e.g. ``rolling`` or ``main``), and that feature is also appropriate to the Humble distribution (does not break API, etc.), then it is good practice to backport the feature to the Humble-specific branch.
fr: Par exemple, si une fonctionnalité est fusionnée dans la branche spécifique à Rolling (par exemple, ``rolling`` ou ``main``), et que cette fonctionnalité est également appropriée à la distribution Humble (ne casse pas l'API, etc.), alors il est recommandé de rétroporter la fonctionnalité sur la branche spécifique à Humble.

source: The maintainers may make releases for those older distributions if there are new features or bug fixes available.
fr: Les responsables peuvent créer des versions pour ces distributions plus anciennes si de nouvelles fonctionnalités ou des corrections de bogues sont disponibles.

source: **What about** ``main`` **and** ``rolling`` **?**
fr: **Qu'en est-il de** ``main`` **et** ``rolling`` ** ?**

source: ``main`` typically targets :doc:`Rolling <../../Releases/Release-Rolling-Ridley>` (and so, the next unreleased ROS distribution), though the maintainers may decide to develop and release from a ``rolling`` branch instead.
fr: ``main`` cible généralement :doc:`Rolling <../../Releases/Release-Rolling-Ridley>` (et donc, la prochaine distribution ROS inédite), bien que les mainteneurs puissent décider de développer et de publier à partir d'un branche ``rolling`` à la place.

source: Pull requests
fr: Demandes d'extraction

source: A pull request should only focus on one change. Separate changes should go into separate pull requests. See `GitHub's guide to writing the perfect pull request <https://github.com/blog/1943-how-to-write-the-perfect-pull-request>`__.
fr: Une demande d'extraction ne doit se concentrer que sur un seul changement. Les modifications distinctes doivent être placées dans des demandes d'extraction distinctes. Voir `GitHub's guide to writing the perfect pull request <https://github.com/blog/1943-how-to-write-the-perfect-pull-request>`__.

source: A patch should be minimal in size and avoid any kind of unnecessary changes.
fr: Un patch doit être de taille minimale et éviter tout type de modifications inutiles.

source: A pull request must contain minimum number of meaningful commits.
fr: Une demande d'extraction doit contenir un nombre minimum de commits significatifs.

source: You can create new commits while the pull request is under review.
fr: Vous pouvez créer de nouveaux commits pendant que la demande d'extraction est en cours d'examen.

source: Before merging a pull request all changes should be squashed into a small number of semantic commits to keep the history clear.
fr: Avant de fusionner une demande d'extraction, toutes les modifications doivent être écrasées dans un petit nombre de commits sémantiques pour garder l'historique clair.

source: But avoid squashing commits while a pull request is under review. Your reviewers might not notice that you made the change, thereby introducing potential for confusion. Plus, you're going to squash before merging anyway; there's no benefit to doing it early.
fr: Mais évitez d'écraser les commits pendant qu'une pull request est en cours d'examen. Vos examinateurs pourraient ne pas remarquer que vous avez apporté la modification, introduisant ainsi un risque de confusion. De plus, vous allez écraser avant de fusionner de toute façon ; il n'y a aucun avantage à le faire tôt.

source: Any developer is welcome to review and approve a pull request (see `General Principles`_).
fr: Tout développeur est invité à examiner et à approuver une demande d'extraction (voir `Principes généraux`_).

source: When you start reviewing a pull request, comment on the pull request so that other developers know that you're reviewing it.
fr: Lorsque vous commencez à examiner une demande d'extraction, commentez la demande d'extraction afin que les autres développeurs sachent que vous l'examinez.

source: Pull-request review is not read-only, with the reviewer making comments and then waiting for the author to address them. As a reviewer, feel free to make minor improvements (typos, style issues, etc.) in-place. As the opener of a pull-request, if you are working in a fork, checking the box to `allow edits from upstream contributors <https://github.com/blog/2247-improving-collaboration-with-forks>`__ will assist with the aforementioned. As a reviewer, also feel free to make more substantial improvements, but consider putting them in a separate branch (either mention the new branch in a comment, or open another pull request from the new branch to the original branch).
fr: La révision de la demande d'extraction n'est pas en lecture seule, le réviseur faisant des commentaires et attendant ensuite que l'auteur y réponde. En tant que réviseur, n'hésitez pas à apporter des améliorations mineures (fautes de frappe, problèmes de style, etc.) sur place. En tant qu'ouvreur d'une pull-request, si vous travaillez dans un fork, cochez la case pour `autoriser les modifications des contributeurs en amont <https://github.com/blog/2247-improving-collaboration-with-forks>`__ aidera avec ce qui précède. En tant que réviseur, n'hésitez pas non plus à apporter des améliorations plus substantielles, mais envisagez de les mettre dans une branche distincte (soit mentionner la nouvelle branche dans un commentaire, soit ouvrir une autre pull request de la nouvelle branche vers la branche d'origine).

source: Any developer (the author, the reviewer, or somebody else) can merge any approved pull request.
fr: N'importe quel développeur (l'auteur, le réviseur ou quelqu'un d'autre) peut fusionner n'importe quelle demande d'extraction approuvée.

source: Library versioning
fr: Gestion des versions de la bibliothèque

source: We will version all libraries within a package together. This means that libraries inherit their version from the package. This keeps library and package versions from diverging and shares reasoning with the policy of releasing packages which share a repository together. If you need libraries to have different versions then consider splitting them into different packages.
fr: Nous versionnerons toutes les bibliothèques d'un package ensemble. Cela signifie que les bibliothèques héritent de leur version du package. Cela empêche les versions de bibliothèque et de package de diverger et partage le raisonnement avec la politique de publication de packages qui partagent un référentiel ensemble. Si vous avez besoin de bibliothèques pour différentes versions, envisagez de les diviser en différents packages.

source: Development process
fr: Processus de développement

source: The default branch (in most cases the rolling branch) must always build, pass all tests and compile without warnings. If at any time there is a regression it is the top priority to restore at least the previous state.
fr: La branche par défaut (dans la plupart des cas la branche roulante) doit toujours se construire, réussir tous les tests et compiler sans avertissement. Si à tout moment il y a une régression, la priorité absolue est de restaurer au moins l'état précédent.

source: Always build with tests enabled.
fr: Compilez toujours avec les tests activés.

source: Always run tests locally after changes and before proposing them in a pull request. Besides using automated tests, also run the modified code path manually to ensure that the patch works as intended.
fr: Exécutez toujours les tests localement après les modifications et avant de les proposer dans une demande d'extraction. En plus d'utiliser des tests automatisés, exécutez également le chemin de code modifié manuellement pour vous assurer que le correctif fonctionne comme prévu.

source: Always run CI jobs for all platforms for every pull request and include links to the jobs in the pull request.
fr: Exécutez toujours les travaux CI pour toutes les plates-formes pour chaque demande d'extraction et incluez des liens vers les travaux dans la demande d'extraction.

source: For more details on recommended software development workflow, see `Software Development Lifecycle`_ section.
fr: Pour plus de détails sur le workflow de développement logiciel recommandé, consultez la section `Cycle de vie du développement logiciel`_.

source: Changes to RMW API
fr: Modifications de l'API RMW
