Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/The-ROS2-Project/Contributing/Developer-Guide.po
Languages: fr

source: If removing the debatable parts is not an option, work directly with package owners to reach an agreement
fr: Si la suppression des parties discutables n'est pas une option, travaillez directement avec les propriétaires de packages pour parvenir à un accord

source: Once consensus is reached:
fr: Une fois le consensus atteint :

source: Ensure the `ros2/design <https://github.com/ros2/design/>`__ pull request has been merged, if applicable
fr: Assurez-vous que la demande d'extraction `ros2/design <https://github.com/ros2/design/>`__ a été fusionnée, le cas échéant

source: Update and close the GitHub issue associated with this design task
fr: Mettre à jour et fermer le problème GitHub associé à cette tâche de conception

source: Before starting, go through the `Pull requests`_ section for best practices.
fr: Avant de commencer, consultez la section "Demandes d'extraction"_ pour connaître les meilleures pratiques.

source: For each repo to be modified:
fr: Pour chaque dépôt à modifier :

source: Modify the code, go to the next step if finished or at regular intervals to backup your work.
fr: Modifiez le code, passez à l'étape suivante si vous avez terminé ou à intervalles réguliers pour sauvegarder votre travail.

source: `Self-review <https://git-scm.com/book/en/v2/Git-Tools-Interactive-Staging>`__ your changes using ``git add -i``.
fr: `Auto-examen <https://git-scm.com/book/en/v2/Git-Tools-Interactive-Staging>`__ vos modifications en utilisant ``git add -i``.

source: Create a new signed commit using ``git commit -s``.
fr: Créez un nouveau commit signé en utilisant ``git commit -s``.

source: A pull request should contain minimal semantically meaningful commits (for instance, a large number of 1-line commits is not acceptable). Create new fixup commits while iterating on feedback, or optionally, amend existing commits using ``git commit --amend`` if you don't want to create a new commit every time.
fr: Une demande d'extraction doit contenir un minimum de commits sémantiquement significatifs (par exemple, un grand nombre de commits d'une ligne n'est pas acceptable). Créez de nouveaux commits de correction tout en itérant sur les commentaires, ou éventuellement, modifiez les commits existants en utilisant ``git commit --amend`` si vous ne voulez pas créer un nouveau commit à chaque fois.

source: Each commit must have a properly written, meaningful, commit message. More instructions `here <https://chris.beams.io/posts/git-commit/>`__.
fr: Chaque commit doit avoir un message de commit correctement écrit et significatif. Plus d'instructions `ici <https://chris.beams.io/posts/git-commit/>`__.

source: Moving files must be done in a separate commit, otherwise git may fail to accurately track the file history.
fr: Le déplacement des fichiers doit être effectué dans un commit séparé, sinon git risque de ne pas suivre avec précision l'historique des fichiers.

source: Either the pull request description or the commit message must contain a reference to the related ros2 issue, so it gets automatically closed when the pull request is merged. See this `doc <https://help.github.com/articles/closing-issues-using-keywords/>`__ for more details.
fr: Soit la description de la demande d'extraction, soit le message de validation doit contenir une référence au problème ros2 associé, de sorte qu'il est automatiquement fermé lorsque la demande d'extraction est fusionnée. Voir ce `doc <https://help.github.com/articles/closing-issues-using-keywords/>`__ pour plus de détails.

source: Push the new commits.
fr: Poussez les nouveaux commits.

source: Code review
fr: Revue de code

source: Once the change is ready for code review:
fr: Une fois que le changement est prêt pour la révision du code :

source: Open a pull request for each modified repository.
fr: Ouvrez une demande d'extraction pour chaque référentiel modifié.

source: Remember to follow `Pull requests`_ best practices.
fr: N'oubliez pas de suivre les meilleures pratiques relatives aux "demandes d'extraction".

source: `GitHub <https://hub.github.com/>`__ can be used to create pull requests from the command-line.
fr: `GitHub <https://hub.github.com/>`__ peut être utilisé pour créer des demandes d'extraction à partir de la ligne de commande.

source: If the task is planned to be released with a specific version of ROS, this information should be included in each pull request.
fr: S'il est prévu que la tâche soit publiée avec une version spécifique de ROS, ces informations doivent être incluses dans chaque demande d'extraction.

source: Package owners who reviewed the design document should be mentioned in the pull request.
fr: Les propriétaires de packages qui ont examiné le document de conception doivent être mentionnés dans la demande d'extraction.

source: Code review SLO: although reviewing pull requests is best-effort, it is helpful to have reviewers comment on pull requests within a week and code authors to reply back to comments within a week, so there is no loss of context.
fr: SLO de révision du code : bien que la révision des demandes d'extraction soit un effort optimal, il est utile que les réviseurs commentent les demandes d'extraction dans un délai d'une semaine et que les auteurs de code répondent aux commentaires dans un délai d'une semaine, afin qu'il n'y ait pas de perte de contexte.

source: Iterate on feedback as usual, amend and update the development branch as needed.
fr: Itérer sur les commentaires comme d'habitude, modifier et mettre à jour la branche de développement si nécessaire.

source: Once the PR is approved, package maintainers will merge the changes in.
fr: Une fois le PR approuvé, les mainteneurs de paquets fusionneront les changements dans.

source: Build Farm Introduction
fr: Construire une introduction à la ferme

source: The build farm is located at `ci.ros2.org <https://ci.ros2.org/>`__.
fr: La ferme de construction est située sur `ci.ros2.org <https://ci.ros2.org/>`__.

source: Every night we run nightly jobs which build and run all the tests in various scenarios on various platforms. Additionally, we test all pull requests against these platforms before merging.
fr: Chaque nuit, nous exécutons des tâches nocturnes qui construisent et exécutent tous les tests dans différents scénarios sur différentes plates-formes. De plus, nous testons toutes les demandes d'extraction sur ces plates-formes avant de les fusionner.

source: This is the current set of target platforms and architectures, though it evolves overtime:
fr: Il s'agit de l'ensemble actuel de plates-formes et d'architectures cibles, bien qu'il évolue au fil du temps :

source: amd64
fr: amdshch

source: There are several categories of jobs on the buildfarm:
fr: Il existe plusieurs catégories d'emplois sur le buildfarm :

source: manual jobs (triggered manually by developers):
fr: tâches manuelles (déclenchées manuellement par les développeurs) :

source: ci_linux: build + test the code on Ubuntu Xenial
fr: ci_linux : compiler + tester le code sur Ubuntu Xenial

source: ci_linux-aarch64: build + test the code on Ubuntu Xenial on an ARM 64-bit machine (aarch64)
fr: ci_linux-aarch64 : compilez + testez le code sur Ubuntu Xenial sur une machine ARM 64 bits (aarch64) ;

source: ci_linux_coverage: build + test + generation of test coverage
fr: ci_linux_coverage : build + test + génération de couverture de test

source: ci_windows: build + test the code on Windows 10
fr: ci_windows : compiler + tester le code sur Windows 10

source: ci_launcher: trigger all the jobs listed above
fr: ci_launcher : déclenche toutes les tâches répertoriées ci-dessus

source: nightly (run every night):
fr: nightly (courir tous les soirs):

source: Debug: build + test the code with CMAKE_BUILD_TYPE=Debug
fr: Debug : compilez + testez le code avec CMAKE_BUILD_TYPE=Debug

source: Release: build + test the code with CMAKE_BUILD_TYPE=Release
fr: Release : compiler + tester le code avec CMAKE_BUILD_TYPE=Release

source: Repeated: build then run each test up to 20 times or until failed (aka flakiness hunter)
fr: Répété : construisez puis exécutez chaque test jusqu'à 20 fois ou jusqu'à l'échec (aka flakiness hunter)

source: Coverage:
fr: Couverture:

source: nightly_linux_coverage: build + test the code + analyses coverage for c/c++ and python
fr: nightly_linux_coverage : construit + teste le code + analyse la couverture pour c/c++ et python

source: results are exported as a cobertura report
fr: les résultats sont exportés sous forme de rapport cobertura

source: packaging (run every night; result is bundled into an archive):
fr: packaging (exécuté toutes les nuits ; le résultat est regroupé dans une archive) :

source: Two additional build farms support the ROS / ROS 2 ecosystem by providing building of source and binary packages, continuous integration, testing, and analysis.
fr: Deux fermes de construction supplémentaires prennent en charge l'écosystème ROS / ROS 2 en fournissant la construction de packages source et binaires, l'intégration continue, les tests et l'analyse.

source: For details, frequently asked questions, and troubleshooting see :doc:`build farms <Build-Farms>`.
fr: Pour plus de détails, les questions fréquemment posées et le dépannage, consultez :doc:`build farms <Build-Farms>`.

source: Note on Coverage runs
fr: Remarque sur les courses de couverture

source: ROS 2 packages are organized in a way that the testing code for a given package is not only contained within the package, but could also be present in a different package. In other words: packages can exercise code belonging to other packages during the testing phase.
fr: Les packages ROS 2 sont organisés de manière à ce que le code de test d'un package donné soit non seulement contenu dans le package, mais puisse également être présent dans un package différent. En d'autres termes : les packages peuvent exercer du code appartenant à d'autres packages pendant la phase de test.

source: To achieve the coverage rate reached by all code available in the ROS 2 core packages it is recommended to run builds using a fixed set of proposed repositories. That set is defined in the default parameters of coverage jobs in Jenkins.
fr: Pour atteindre le taux de couverture atteint par tout le code disponible dans les packages de base ROS 2, il est recommandé d'exécuter les builds à l'aide d'un ensemble fixe de référentiels proposés. Cet ensemble est défini dans les paramètres par défaut des tâches de couverture dans Jenkins.

source: How to read the coverage rate from the buildfarm report
fr: Comment lire le taux de couverture à partir du rapport buildfarm

source: To see the coverage report for a given package:
fr: Pour voir le rapport de couverture pour un package donné :

source: When the ``ci_linux_coverage`` build finishes, click on ``Coverage Report``
fr: Lorsque la construction de ``ci_linux_coverage`` se termine, cliquez sur ``Rapport de couverture``

source: Scroll down to the ``Coverage Breakdown by Package`` table
fr: Faites défiler jusqu'au tableau ``Répartition de la couverture par forfait``

source: In the table, look at the first column called "Name"
fr: Dans le tableau, regardez la première colonne intitulée "Nom"

source: The coverage reports in the buildfarm include all the packages that were used in the ROS workspace. The coverage report includes different paths corresponding to the same package:
fr: Les rapports de couverture dans la buildfarm incluent tous les packages qui ont été utilisés dans l'espace de travail ROS. Le rapport de couverture comprend différents chemins correspondant à un même forfait :

source: Name entries with the form: ``src.*.<repository_name>.<package_name>.*`` These correspond to the unit test runs available in a package against its own source code
fr: Nommez les entrées sous la forme : ``src.*.<repository_name>.<package_name>.*`` Celles-ci correspondent aux exécutions de tests unitaires disponibles dans un package par rapport à son propre code source

source: Name entries with the form: ``build.<repository_name>.<package_name>.*`` These correspond to the unit test runs available in a package against its files generated at building or configuring time
fr: Nommez les entrées sous la forme : ``build.<repository_name>.<package_name>.*`` Celles-ci correspondent aux exécutions de tests unitaires disponibles dans un package par rapport à ses fichiers générés au moment de la construction ou de la configuration

source: Name entries with the form: ``install.<package_name>.*`` These correspond to the system/integration tests coming from testing runs of other packages
fr: Nommer les entrées sous la forme : ``install.<package_name>.*`` Elles correspondent aux tests système/d'intégration provenant des séries de tests d'autres packages

source: How to calculate the coverage rate from the buildfarm report
fr: Comment calculer le taux de couverture à partir du rapport buildfarm

source: Get the combined unit coverage rate using the automatic script:
fr: Obtenez le taux de couverture unitaire combiné à l'aide du script automatique :

source: From the ci_linux_coverage Jenkins build copy the URL of the build
fr: Depuis le build ci_linux_coverage Jenkins, copiez l'URL du build

source: Download the `get_coverage_ros2_pkg <https://raw.githubusercontent.com/ros2/ci/master/tools/get_coverage_ros2_pkg.py>`__ script
fr: Téléchargez le script `get_coverage_ros2_pkg <https://raw.githubusercontent.com/ros2/ci/master/tools/get_coverage_ros2_pkg.py>`__

source: Execute the script: ``./get_coverage_ros2_pkg.py <jenkins_build_url> <ros2_package_name>`` (`README <https://github.com/ros2/ci/blob/master/tools/README.md>`__)
fr: Exécutez le script : ``./get_coverage_ros2_pkg.py <jenkins_build_url> <ros2_package_name>`` (`README <https://github.com/ros2/ci/blob/master/tools/README.md>`__)

source: Grab the results from the "Combined unit testing" final line in the output of the script
fr: Récupérez les résultats de la dernière ligne "Combined unit testing" dans la sortie du script

source: Alternative: get the combined unit coverage rate from coverage report (require manual calculation):
fr: Alternative : obtenir le taux de couverture unitaire combiné à partir du rapport de couverture (nécessite un calcul manuel) :

source: When the ci_linux_coverage build finishes, click on ``Cobertura Coverage Report``
fr: Lorsque la construction de ci_linux_coverage est terminée, cliquez sur ``Cobertura Coverage Report``

source: In the table, under the first column "Name", look for (where <package_name> is your package under testing):
fr: Dans le tableau, sous la première colonne "Name", recherchez (où <package_name> est votre package en cours de test) :

source: all the directories under the pattern ``src.*.<repository_name>.<package_name>.*`` grab the two absolute values in the column "Lines".
fr: tous les répertoires sous le modèle ``src.*.<repository_name>.<package_name>.*`` saisissez les deux valeurs absolues dans la colonne "Lines".

source: all the directories under the pattern ``build/.<repository_name>.*`` grab the two absolute values in the column "Lines".
fr: tous les répertoires sous le modèle ``build/.<repository_name>.*`` récupèrent les deux valeurs absolues dans la colonne "Lines".

source: With the previous selection: for each cell, the first value is the lines tested and the second is the total lines of code. Aggregate all rows for getting the total of the lines tested and the total of lines of code under test. Divide to get the coverage rate.
fr: Avec la sélection précédente : pour chaque cellule, la première valeur correspond aux lignes testées et la seconde au total des lignes de code. Agrégez toutes les lignes pour obtenir le total des lignes testées et le total des lignes de code testées. Diviser pour obtenir le taux de couverture.

source: How to measure coverage locally using lcov (Ubuntu)
fr: Comment mesurer la couverture localement à l'aide de lcov (Ubuntu)

source: To measure coverage on your own machine, install ``lcov``.
fr: Pour mesurer la couverture sur votre propre machine, installez ``lcov``.

source: The rest of this section assumes you are working from your colcon workspace. Compile in debug with coverage flags. Feel free to use colcon flags to target specific packages.
fr: Le reste de cette section suppose que vous travaillez depuis votre espace de travail colcon. Compiler en débogage avec des drapeaux de couverture. N'hésitez pas à utiliser les drapeaux colcon pour cibler des packages spécifiques.

source: ``lcov`` requires an initial baseline, which you can produce with the following command. Update the output file location for your needs.
fr: ``lcov`` nécessite une ligne de base initiale, que vous pouvez produire avec la commande suivante. Mettez à jour l'emplacement du fichier de sortie selon vos besoins.

source: Run tests for the packages that matter for your coverage measurements. For example, if measuring ``rclcpp`` also with ``test_rclcpp``
fr: Exécutez des tests pour les packages qui comptent pour vos mesures de couverture. Par exemple, si vous mesurez ``rclcpp`` également avec ``test_rclcpp``

source: Capture the lcov results with a similar command this time dropping the ``--initial`` flag.
fr: Capturez les résultats lcov avec une commande similaire, cette fois en supprimant le drapeau ``--initial``.

source: Combine the trace .info files:
fr: Combinez les fichiers de trace .info :

source: Generate html for easy visualization and annotation of covered lines.
fr: Générez du HTML pour une visualisation et une annotation faciles des lignes couvertes.
