Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/The-ROS2-Project/Contributing/Developer-Guide.po
Languages: fr

source: ROS 2 developer guide
fr: Guide du développeur ROS 2

source: Table of Contents
fr: Table des matières

source: This page defines the practices and policies we employ when developing ROS 2.
fr: Cette page définit les pratiques et politiques que nous employons lors du développement de ROS 2.

source: General Principles
fr: Principes généraux

source: Some principles are common to all ROS 2 development:
fr: Certains principes sont communs à tous les développements ROS 2 :

source: **Shared ownership**: Everybody working on ROS 2 should feel ownership over all parts of the system. The original author of a chunk of code does not have any special permission or obligation to control or maintain that chunk of code. Everyone is free to propose changes anywhere, to handle any type of ticket, and to review any pull request.
fr: **Propriété partagée** : toute personne travaillant sur ROS 2 doit se sentir propriétaire de toutes les parties du système. L'auteur original d'un morceau de code n'a aucune permission ou obligation spéciale de contrôler ou de maintenir ce morceau de code. Chacun est libre de proposer des modifications n'importe où, de gérer n'importe quel type de ticket et d'examiner n'importe quelle pull request.

source: **Be willing to work on anything**: As a corollary to shared ownership, everybody should be willing to take on any available task and contribute to any aspect of the system.
fr: **Être prêt à travailler sur n'importe quoi** : en corollaire de la propriété partagée, tout le monde doit être prêt à assumer n'importe quelle tâche disponible et à contribuer à n'importe quel aspect du système.

source: **Ask for help**: If you run into trouble on something, ask your fellow developers for help, via tickets, comments, or email, as appropriate.
fr: **Demandez de l'aide** : si vous rencontrez des problèmes avec quelque chose, demandez de l'aide à vos collègues développeurs, via des tickets, des commentaires ou des e-mails, selon le cas.

source: Quality Practices
fr: Pratiques de qualité

source: Packages can ascribe to different levels of quality based on the development practices they adhere to, as per the guidelines in `REP 2004: Package Quality Categories <https://www.ros.org/reps/rep-2004.html>`_. The categories are differentiated by their policies on versioning, testing, documentation, and more.
fr: Les packages peuvent être attribués à différents niveaux de qualité en fonction des pratiques de développement auxquelles ils adhèrent, conformément aux directives de `REP 2004 : Package Quality Categories <https://www.ros.org/reps/rep-2004.html>`_ . Les catégories se différencient par leurs politiques en matière de gestion des versions, de test, de documentation, etc.

source: The following sections are the specific development rules we follow to ensure core packages are of the highest quality ('Level 1'). We recommend all ROS developers strive to adhere to the following policies to ensure quality across the ROS ecosystem.
fr: Les sections suivantes sont les règles de développement spécifiques que nous suivons pour garantir que les packages de base sont de la plus haute qualité ("Niveau 1"). Nous recommandons à tous les développeurs ROS de s'efforcer de respecter les politiques suivantes pour garantir la qualité dans l'ensemble de l'écosystème ROS.

source: Versioning
fr: Gestion des versions

source: We will use the `Semantic Versioning guidelines <http://semver.org/>`__ (``semver``) for versioning.
fr: Nous utiliserons les `Semantic Versioning guidelines <http://semver.org/>`__ (``semver``) pour la gestion des versions.

source: We will also adhere to some ROS-specific rules built on top of ``semver's`` full meaning:
fr: Nous respecterons également certaines règles spécifiques à ROS construites au-dessus de la signification complète de ``semver`` :

source: Major version increments (i.e. breaking changes) should not be made within a released ROS distribution.
fr: Les incréments de version majeurs (c'est-à-dire les changements de rupture) ne doivent pas être effectués dans une distribution ROS publiée.

source: Patch (interface-preserving) and minor (non-breaking) version increments do not break compatibility, so these sorts of changes *are* allowed within a release.
fr: Les correctifs (préservant l'interface) et les incréments de version mineurs (sans rupture) ne rompent pas la compatibilité, donc ces types de modifications *sont* autorisées dans une version.

source: Major ROS releases are the best time to release breaking changes. If a core package needs multiple breaking changes, they should be merged into their integration branch (e.g. rolling) to allow catching problems in CI quickly, but released together to reduce the number of major releases for ROS users.
fr: Les versions majeures de ROS sont le meilleur moment pour publier des changements de rupture. Si un package de base nécessite plusieurs changements avec rupture, ils doivent être fusionnés dans leur branche d'intégration (par exemple, roulement) pour permettre de détecter rapidement les problèmes dans CI, mais publiés ensemble pour réduire le nombre de versions majeures pour les utilisateurs de ROS.

source: Though major increments require a new distribution, a new distribution does not necessarily require a major bump (if development and release can happen without breaking API).
fr: Bien que les incréments majeurs nécessitent une nouvelle distribution, une nouvelle distribution ne nécessite pas nécessairement une bosse majeure (si le développement et la publication peuvent se produire sans casser l'API).

source: For compiled code, the ABI is considered part of the public interface. Any change that requires recompiling dependent code is considered major (breaking).
fr: Pour le code compilé, l'ABI est considérée comme faisant partie de l'interface publique. Toute modification nécessitant la recompilation du code dépendant est considérée comme majeure (rupture).

source: ABI breaking changes *can* be made in a minor version bump *before* a distribution release (getting added to the rolling release).
fr: Les changements de rupture d'ABI * peuvent * être apportés dans une version mineure * avant * une version de distribution (ajoutée à la version continue).

source: We enforce API stability for core packages in Dashing and Eloquent even though their major version components are ``0``, despite `SemVer's specification <https://semver.org/#spec-item-4>`_ regarding initial development.
fr: Nous appliquons la stabilité de l'API pour les packages de base dans Dashing et Eloquent même si leurs principaux composants de version sont ``0``, malgré la spécification de `SemVer <https://semver.org/#spec-item-4>`_ concernant le développement initial.

source: Subsequently, packages should strive to reach a mature state and increase to version ``1.0.0`` so to match ``semver's`` specifications.
fr: Par la suite, les paquets doivent s'efforcer d'atteindre un état mature et passer à la version ``1.0.0`` afin de correspondre aux spécifications de ``semver``.

source: Caveats
fr: Mises en garde

source: These rules are *best-effort*. In unlikely, extreme cases, it may be necessary to break API within a major version/distribution. Whether an unplanned break increments the major or minor version will be assessed on a case-by-case basis.
fr: Ces règles sont * au mieux *. Dans des cas extrêmes peu probables, il peut être nécessaire de casser l'API dans une version/distribution majeure. Le fait qu'une pause imprévue incrémente la version majeure ou mineure sera évalué au cas par cas.

source: For example, consider a situation involving released X-turtle, corresponding to major version ``1.0.0``, and released Y-turtle, corresponding to major version ``2.0.0``.
fr: Par exemple, considérons une situation impliquant une tortue X publiée, correspondant à la version majeure ``1.0.0``, et une tortue Y publiée, correspondant à la version majeure ``2.0.0``.

source: If an API-breaking fix is identified to be absolutely necessary in X-turtle, bumping to ``2.0.0`` is obviously not an option because ``2.0.0`` already exists.
fr: Si un correctif de rupture d'API est identifié comme étant absolument nécessaire dans X-turtle, le passage à ``2.0.0`` n'est évidemment pas une option car ``2.0.0`` existe déjà.

source: The solutions for handling X-turtle's version in such a case, both non-ideal, are:
fr: Les solutions pour gérer la version de X-turtle dans un tel cas, toutes deux non idéales, sont :

source: Bumping X-turtle's minor version: non-ideal because it violates SemVer's principle that breaking changes must bump the major version.
fr: Version mineure de Bumping X-turtle : non idéale car elle viole le principe de SemVer selon lequel les changements de rupture doivent remplacer la version majeure.

source: Bumping X-turtle's major version past Y-turtle (to ``3.0.0``): non-ideal because the older distro's version would become higher than the already-available version of a newer distro, which would invalidate/break version-specific conditional code.
fr: Faire passer la version majeure de X-turtle au-delà de Y-turtle (à `` 3.0.0``): non idéal car la version de l'ancienne distribution deviendrait supérieure à la version déjà disponible d'une distribution plus récente, ce qui invaliderait / casserait la version- code conditionnel spécifique.

source: The developer will have to decide which solution to use, or more importantly, which principle they are willing to break. We cannot suggest one or the other, but in either case we do require that explicit measures be taken to communicate the disruption and its explanation to users manually (beyond just the version increment).
fr: Le développeur devra décider quelle solution utiliser ou, plus important encore, quel principe il est prêt à enfreindre. Nous ne pouvons pas suggérer l'un ou l'autre, mais dans les deux cas, nous exigeons que des mesures explicites soient prises pour communiquer manuellement la perturbation et son explication aux utilisateurs (au-delà de l'incrément de version).

source: If there were no Y-turtle, even though the fix would technically just be a patch, X-turtle would have to bump to ``2.0.0``. This case adheres to SemVer, but breaks from our own rule that major increments should not be introduced in a released distribution.
fr: S'il n'y avait pas de Y-turtle, même si le correctif ne serait techniquement qu'un patch, X-turtle devrait passer à ``2.0.0``. Ce cas adhère à SemVer, mais enfreint notre propre règle selon laquelle les incréments majeurs ne doivent pas être introduits dans une distribution publiée.

source: This is why we consider the versioning rules *best-effort*. As unlikely as the examples above are, it is important to accurately define our versioning system.
fr: C'est pourquoi nous considérons les règles de versioning *best-effort*. Aussi improbables que soient les exemples ci-dessus, il est important de définir avec précision notre système de gestion des versions.

source: Public API declaration
fr: Déclaration d'API publique

source: According to ``semver``, every package must clearly declare a public API. We will use the "Public API Declaration" section of the quality declaration of a package to declare what symbols are part of the public API.
fr: Selon ``semver``, chaque paquet doit clairement déclarer une API publique. Nous utiliserons la section "Public API Declaration" de la déclaration de qualité d'un package pour déclarer quels symboles font partie de l'API publique.

source: For most C and C++ packages the declaration is any header that it installs. However, it is acceptable to define a set of symbols which are considered private. Avoiding private symbols in headers can help with ABI stability, but is not required.
fr: Pour la plupart des packages C et C++, la déclaration est n'importe quel en-tête qu'il installe. Cependant, il est acceptable de définir un ensemble de symboles considérés comme privés. Éviter les symboles privés dans les en-têtes peut aider à la stabilité de l'ABI, mais n'est pas obligatoire.

source: For other languages like Python, a public API must be explicitly defined, so that it is clear what symbols can be relied on with respect to the versioning guidelines. The public API can also be extended to build artifacts like configuration variables, CMake config files, etc. as well as executables and command-line options and output. Any elements of the public API should be clearly stated in the package's documentation. If something you are using is not explicitly listed as part of the public API in the package's documentation, then you cannot depend on it not changing between minor or patch versions.
fr: Pour d'autres langages comme Python, une API publique doit être explicitement définie, de sorte qu'il soit clair sur quels symboles on peut s'appuyer en ce qui concerne les directives de version. L'API publique peut également être étendue pour créer des artefacts tels que des variables de configuration, des fichiers de configuration CMake, etc., ainsi que des exécutables, des options et des sorties de ligne de commande. Tous les éléments de l'API publique doivent être clairement indiqués dans la documentation du package. Si quelque chose que vous utilisez n'est pas explicitement répertorié dans le cadre de l'API publique dans la documentation du package, vous ne pouvez pas vous attendre à ce qu'il ne change pas entre les versions mineures ou correctives.

source: Deprecation strategy
fr: Stratégie d'abandon

source: Where possible, we will also use the tick-tock deprecation and migration strategy for major version increments. New deprecations will come in a new distribution release, accompanied by compiler warnings expressing that the functionality is being deprecated. In the next release, the functionality will be completely removed (no warnings).
fr: Dans la mesure du possible, nous utiliserons également la stratégie de dépréciation et de migration tic-tac pour les incréments de version majeurs. De nouvelles dépréciations viendront dans une nouvelle version de distribution, accompagnées d'avertissements du compilateur indiquant que la fonctionnalité est obsolète. Dans la prochaine version, la fonctionnalité sera complètement supprimée (pas d'avertissement).

source: Example of function ``foo`` deprecated and replaced by function ``bar``:
fr: Exemple de fonction ``foo`` obsolète et remplacée par la fonction ``bar`` :

source: X-turtle
fr: X-tortue

source: Y-turtle
fr: Y-tortue

source: Z-turtle
fr: Z-tortue

source: void bar();
fr: barre vide();

source: We must not add deprecations after a distribution is released. Deprecations do not necessarily require a major version bump, though. A deprecation can be introduced in a minor version bump if the bump happens before the distro is released (similar to ABI breaking changes).
fr: Nous ne devons pas ajouter de dépréciations après la sortie d'une distribution. Cependant, les dépréciations ne nécessitent pas nécessairement un changement de version majeur. Une dépréciation peut être introduite dans un bump de version mineure si le bump se produit avant la sortie de la distribution (similaire aux changements de rupture d'ABI).

source: For example, if X-turtle begins development as ``2.0.0``, a deprecation can be added in ``2.1.0`` before X-turtle is released.
fr: Par exemple, si X-turtle commence son développement en tant que ``2.0.0``, une dépréciation peut être ajoutée dans ``2.1.0`` avant la sortie de X-turtle.

source: We will attempt to maintain compatibility across distros as much as possible. However, like the caveats associated with SemVer, tick-tock or even deprecation in general may be impossible to completely adhere to in certain cases.
fr: Nous essaierons de maintenir autant que possible la compatibilité entre les distributions. Cependant, comme les mises en garde associées à SemVer, le tic-tac ou même la dépréciation en général peuvent être impossibles à respecter complètement dans certains cas.

source: Change control process
fr: Changer le processus de contrôle

source: All changes must go through a pull request.
fr: Toutes les modifications doivent passer par une pull request.

source: We will enforce the `Developer Certificate of Origin (DCO) <https://developercertificate.org/>`_ on pull requests in ROSCore repositories.
fr: Nous appliquerons le `Certificat d'origine du développeur (DCO) <https://developercertificate.org/>`_ sur les demandes d'extraction dans les référentiels ROSSore.

source: It requires all commit messages to contain the ``Signed-off-by`` line with an email address that matches the commit author.
fr: Il exige que tous les messages de commit contiennent la ligne ``Signed-off-by`` avec une adresse e-mail qui correspond à l'auteur du commit.

source: You can pass ``-s`` / ``--signoff`` to the ``git commit`` invocation or write the expected message manually (e.g. ``Signed-off-by: Your Name Developer <your.name@example.com>``).
fr: Vous pouvez passer ``-s`` / ``--signoff`` à l'invocation ``git commit`` ou écrire le message attendu manuellement (par exemple ``Signed-off-by: Your Name Developer <your.name@ exemple.com>``).

source: DCO is *not* required for pull requests that only address whitespace removal, typo correction, and other `trivial changes <http://cr.openjdk.java.net/~jrose/draft/trivial-fixes.html>`_.
fr: DCO n'est *pas* requis pour les demandes d'extraction qui traitent uniquement de la suppression des espaces blancs, de la correction des fautes de frappe et d'autres `modifications triviales <http://cr.openjdk.java.net/~jrose/draft/trivial-fixes.html>`_.

source: Always run CI jobs for all `tier 1 platforms <https://www.ros.org/reps/rep-2000.html#support-tiers>`_ for every pull request and include links to jobs in the pull request. (If you don't have access to the Jenkins jobs someone will trigger the jobs for you.)
fr: Exécutez toujours les travaux CI pour toutes les `plates-formes de niveau 1 <https://www.ros.org/reps/rep-2000.html#support-tiers>`_ pour chaque demande d'extraction et incluez des liens vers les travaux dans la demande d'extraction. (Si vous n'avez pas accès aux travaux Jenkins, quelqu'un les déclenchera pour vous.)

source: A minimum of 1 approval from a fellow developer who did not author the pull request is required to consider it approved. Approval is required before merging.
fr: Un minimum d'une approbation d'un autre développeur qui n'est pas l'auteur de la demande d'extraction est nécessaire pour la considérer comme approuvée. L'approbation est requise avant la fusion.

source: Packages may choose to increase this number.
fr: Les forfaits peuvent choisir d'augmenter ce nombre.

source: Any required changes to documentation (API documentation, feature documentation, release notes, etc.) must be proposed before merging related changes.
fr: Toute modification requise de la documentation (documentation de l'API, documentation des fonctionnalités, notes de version, etc.) doit être proposée avant de fusionner les modifications associées.

source: Guidelines for backporting PRs
fr: Lignes directrices pour le rétroportage des PR

source: When changing an older version of ROS:
fr: Lors de la modification d'une ancienne version de ROS :

source: Make sure the features or fixes are accepted and merged in the rolling branch before opening a PR to backport the changes to older versions.
fr: Assurez-vous que les fonctionnalités ou les correctifs sont acceptés et fusionnés dans la branche roulante avant d'ouvrir un PR pour rétroporter les modifications vers les anciennes versions.

source: When backporting to older versions, also consider backporting to any other :doc:`still supported versions <../../Releases>`, even non-LTS versions.
fr: Lors de la rétroportation vers des versions plus anciennes, envisagez également de rétroporter vers toute autre :doc:`versions encore prises en charge <../../Releases>`, même les versions non-LTS.

source: If you are backporting a single PR in its entirety, title the backport PR "[Distro] <name of original PR>". If backporting a subset of changes from one or multiple PRs, the title should be "[Distro] <description of changes>".
fr: Si vous rétroportez un seul PR dans son intégralité, intitulez le PR rétroporté "[Distro] <nom du PR d'origine>". Si vous rétroportez un sous-ensemble de modifications d'un ou de plusieurs PR, le titre doit être "[Distro] <description des modifications>".

source: Link to all PRs whose changes you're backporting from the description of your backport PR. In a Dashing backport of a Foxy change, you do not need to link to the Eloquent backport of the same change.
fr: Lien vers tous les PR dont vous rétroportez les modifications à partir de la description de votre PR de rétroportage. Dans un rétroportage Dashing d'un changement Foxy, vous n'avez pas besoin de créer un lien vers le rétroportage Eloquent du même changement.

source: All packages should have these documentation elements present in their README or linked to from their README:
fr: Tous les packages doivent avoir ces éléments de documentation présents dans leur README ou liés à partir de leur README :

source: Description and purpose
fr: Description et objectif

source: Definition and description of the public API
fr: Définition et description de l'API publique

source: Examples
fr: Exemples

source: How to build and install (should reference external tools/workflows)
fr: Comment créer et installer (doit faire référence à des outils/flux de travail externes)

source: How to build and run tests
fr: Comment créer et exécuter des tests

source: How to build documentation
fr: Comment construire une documentation

source: How to develop (useful for describing things like ``python setup.py develop``)
fr: Comment développer (utile pour décrire des choses comme ``python setup.py develop``)

source: License and copyright statements
fr: Déclarations de licence et de copyright

source: Each source file must have a license and copyright statement, checked with an automated linter.
fr: Chaque fichier source doit avoir une licence et une déclaration de copyright, vérifiée avec un linter automatisé.

source: Each package must have a LICENSE file, typically the Apache 2.0 license, unless the package has an existing permissive license (e.g. rviz uses three-clause BSD).
fr: Chaque paquet doit avoir un fichier LICENSE, généralement la licence Apache 2.0, à moins que le paquet n'ait une licence permissive existante (par exemple, rviz utilise un BSD à trois clauses).

source: Each package should describe itself and its purpose assuming, as much as possible, that the reader has stumbled onto it without previous knowledge of ROS or other related projects.
fr: Chaque package doit se décrire lui-même et son objectif en supposant, autant que possible, que le lecteur est tombé dessus sans connaissance préalable de ROS ou d'autres projets connexes.

source: Each package should define and describe its public API so that there is a reasonable expectation for users about what is covered by the semantic versioning policy. Even in C and C++, where the public API can be enforced by API and ABI checking, it is a good opportunity to describe the layout of the code and the function of each part of the code.
fr: Chaque package doit définir et décrire son API publique afin que les utilisateurs s'attendent raisonnablement à ce qui est couvert par la politique de version sémantique. Même en C et C++, où l'API publique peut être appliquée par la vérification de l'API et de l'ABI, c'est une bonne occasion de décrire la disposition du code et la fonction de chaque partie du code.
