Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/The-ROS2-Project/Contributing/Migration-Guide.po
Languages: fr

source: Migration guide from ROS 1
fr: Guide de migration depuis ROS 1

source: Table of Contents
fr: Table des matières

source: There are two different kinds of package migrations:
fr: Il existe deux types différents de migrations de packages :

source: Migrating the source code of an existing package from ROS 1 to ROS 2 with the intent that a significant part of the source code will stay the same or at least similar. An example for this could be `pluginlib <https://github.com/ros/pluginlib>`_ where the source code is maintained in different branches within the same repository and commonly patches can be ported between those branches when necessary.
fr: Migrer le code source d'un package existant de ROS 1 vers ROS 2 avec l'intention qu'une partie importante du code source reste identique ou au moins similaire. Un exemple pour cela pourrait être `pluginlib <https://github.com/ros/pluginlib>`_ où le code source est conservé dans différentes branches au sein du même référentiel et généralement des correctifs peuvent être portés entre ces branches si nécessaire.

source: Implementing the same or similar functionality of a ROS 1 package for ROS 2 but with the assumption that the source code will be significantly different. An example for this could be `roscpp <https://github.com/ros/ros_comm/tree/melodic-devel/clients/roscpp>`_ in ROS 1 and `rclcpp <https://github.com/ros2/rclcpp/tree/rolling/rclcpp>`_ in ROS 2 which are separate repositories and don't share any code.
fr: Implémentation de la même fonctionnalité ou d'une fonctionnalité similaire d'un package ROS 1 pour ROS 2, mais en supposant que le code source sera significativement différent. Un exemple pour cela pourrait être `roscpp <https://github.com/ros/ros_comm/tree/melodic-devel/clients/roscpp>`_ dans ROS 1 et `rclcpp <https://github.com/ros2/ rclcpp/tree/rolling/rclcpp>`_ dans ROS 2 qui sont des référentiels séparés et ne partagent aucun code.

source: This article focuses on the former case and describes the high-level steps to migrate a ROS 1 package to ROS 2. It does not aim to be a step-by-step migration instruction and is not considered the *final* "solution". Future versions will aim to make migration smoother and less effort up to the point of maintaining a single package from the same branch for ROS 1 as well as ROS 2.
fr: Cet article se concentre sur le premier cas et décrit les étapes de haut niveau pour migrer un package ROS 1 vers ROS 2. Il ne vise pas à être une instruction de migration étape par étape et n'est pas considéré comme la "solution" * finale *. Les futures versions viseront à rendre la migration plus fluide et moins d'effort jusqu'au point de maintenir un seul paquet de la même branche pour ROS 1 ainsi que ROS 2.

source: Prerequisites
fr: Conditions préalables

source: Before being able to migrate a ROS 1 package to ROS 2 all of its dependencies must be available in ROS 2.
fr: Avant de pouvoir migrer un package ROS 1 vers ROS 2, toutes ses dépendances doivent être disponibles dans ROS 2.

source: Migration steps
fr: Étapes de migration

source: Package manifests
fr: Manifestes de package

source: ROS 2 doesn't support format 1 of the package specification but only newer format versions (2 and higher). Therefore the ``package.xml`` file must be updated to at least format 2 if it uses format 1. Since ROS 1 supports all formats it is safe to perform that conversion in the ROS 1 package.
fr: ROS 2 ne prend pas en charge le format 1 de la spécification du package, mais uniquement les versions de format plus récentes (2 et supérieures). Par conséquent, le fichier ``package.xml`` doit être mis à jour au moins au format 2 s'il utilise le format 1. Étant donné que ROS 1 prend en charge tous les formats, il est sûr d'effectuer cette conversion dans le package ROS 1.

source: Some packages might have different names in ROS 2 so the dependencies might need to be updated accordingly.
fr: Certains packages peuvent avoir des noms différents dans ROS 2, il peut donc être nécessaire de mettre à jour les dépendances en conséquence.

source: Metapackages
fr: Métapaquets

source: ROS 2 doesn't have a special package type for metapackages. Metapackages can still exist as regular packages that only contain runtime dependencies. When migrating metapackages from ROS 1, simply remove the ``<metapackage />`` tag in your package manifest.
fr: ROS 2 n'a pas de type de package spécial pour les métapackages. Les métapackages peuvent toujours exister en tant que packages réguliers qui ne contiennent que des dépendances d'exécution. Lors de la migration de métapaquets depuis ROS 1, supprimez simplement la balise ``<metapackage />`` dans le manifeste de votre paquet.

source: Message, service, and action definitions
fr: Définitions des messages, des services et des actions

source: Message files must end in ``.msg`` and must be located in the subfolder ``msg``. Service files must end in ``.srv`` and must be located in the subfolder ``srv``. Actions files must end in ``.action`` and must be located in the subfolder ``action``.
fr: Les fichiers de messages doivent se terminer par ``.msg`` et doivent être situés dans le sous-dossier ``msg``. Les fichiers de service doivent se terminer par ``.srv`` et doivent être situés dans le sous-dossier ``srv``. Les fichiers d'actions doivent se terminer par ``.action`` et doivent être situés dans le sous-dossier ``action``.

source: These files might need to be updated to comply with the `ROS Interface definition <https://design.ros2.org/articles/interface_definition.html>`__. Some primitive types have been removed and the types ``duration`` and ``time`` which were builtin types in ROS 1 have been replaced with normal message definitions and must be used from the `builtin_interfaces <https://github.com/ros2/rcl_interfaces/tree/rolling/builtin_interfaces>`__ package. Also some naming conventions are stricter than in ROS 1.
fr: Ces fichiers devront peut-être être mis à jour pour se conformer à la `définition de l'interface ROS <https://design.ros2.org/articles/interface_definition.html>`__. Certains types primitifs ont été supprimés et les types ``duration`` et ``time`` qui étaient des types intégrés dans ROS 1 ont été remplacés par des définitions de message normales et doivent être utilisés à partir des `builtin_interfaces <https://github.com /ros2/rcl_interfaces/tree/rolling/builtin_interfaces>`__ package. De plus, certaines conventions de nommage sont plus strictes que dans ROS 1.

source: In your ``package.xml``:
fr: Dans votre ``package.xml`` :

source: Add ``<buildtool_depend>rosidl_default_generators</buildtool_depend>``.
fr: Ajoutez ``<buildtool_depend>rosidl_default_generators</buildtool_depend>``.

source: Add ``<exec_depend>rosidl_default_runtime</exec_depend>``.
fr: Ajoutez ``<exec_depend>rosidl_default_runtime</exec_depend>``.

source: For each dependent message package, add ``<depend>message_package</depend>``.
fr: Pour chaque package de message dépendant, ajoutez ``<depend>message_package</depend>``.

source: In your ``CMakeLists.txt``:
fr: Dans votre ``CMakeLists.txt`` :

source: Start by enabling C++14
fr: Commencez par activer C++14

source: Add ``find_package(rosidl_default_generators REQUIRED)``
fr: Ajouter ``find_package(rosidl_default_generators OBLIGATOIRE)``

source: For each dependent message package, add ``find_package(message_package REQUIRED)`` and replace the CMake function call to ``generate_messages`` with ``rosidl_generate_interfaces``.
fr: Pour chaque paquet de message dépendant, ajoutez ``find_package(message_package REQUIRED)`` et remplacez l'appel de la fonction CMake à ``generate_messages`` par ``rosidl_generate_interfaces``.

source: This will replace ``add_message_files`` and ``add_service_files`` listing of all the message and service files, which can be removed.
fr: Cela remplacera la liste ``add_message_files`` et ``add_service_files`` de tous les fichiers de messages et de services, qui peuvent être supprimés.

source: Build system
fr: Système de construction

source: The build system in ROS 2 is called `ament <https://design.ros2.org/articles/ament.html>`__ and the build tool is :doc:`colcon <../../Tutorials/Beginner-Client-Libraries/Colcon-Tutorial>`. Ament is built on CMake: ``ament_cmake`` provides CMake functions to make writing ``CMakeLists.txt`` files easier.
fr: Le système de construction dans ROS 2 s'appelle `ament <https://design.ros2.org/articles/ament.html>`__ et l'outil de construction est :doc:`colcon <../../Tutorials/Beginner- Client-Bibliothèques/Colcon-Tutoriel>`. Ament est construit sur CMake : ``ament_cmake`` fournit des fonctions CMake pour faciliter l'écriture des fichiers ``CMakeLists.txt``.

source: Build tool
fr: Outil de construction

source: Instead of using ``catkin_make``, ``catkin_make_isolated`` or ``catkin build`` ROS 2 uses the command line tool `colcon <https://design.ros2.org/articles/build_tool.html>`__ to build and install a set of packages.
fr: Au lieu d'utiliser ``catkin_make``, ``catkin_make_isolated`` ou ``catkin build`` ROS 2 utilise l'outil de ligne de commande `colcon <https://design.ros2.org/articles/build_tool.html>`__ pour construire et installer un ensemble de packages.

source: Pure Python package
fr: Paquet Python pur

source: If the ROS 1 package uses CMake only to invoke the ``setup.py`` file and does not contain anything beside Python code (e.g. also no messages, services, etc.) it should be converted into a pure Python package in ROS 2:
fr: Si le package ROS 1 utilise CMake uniquement pour appeler le fichier ``setup.py`` et ne contient rien à côté du code Python (par exemple, aucun message, service, etc.), il doit être converti en un package Python pur dans ROS 2 :

source: Update or add the build type in the ``package.xml`` file:
fr: Mettez à jour ou ajoutez le type de build dans le fichier ``package.xml`` :

source: Remove the ``CMakeLists.txt`` file
fr: Supprimez le fichier ``CMakeLists.txt``

source: Update the ``setup.py`` file to be a standard Python setup script
fr: Mettez à jour le fichier ``setup.py`` pour qu'il devienne un script d'installation Python standard

source: ROS 2 supports Python 3 only. While each package can choose to also support Python 2 it must invoke executables with Python 3 if it uses any API provided by other ROS 2 packages.
fr: ROS 2 ne prend en charge que Python 3. Bien que chaque package puisse choisir de prendre également en charge Python 2, il doit appeler des exécutables avec Python 3 s'il utilise une API fournie par d'autres packages ROS 2.

source: Update the *CMakeLists.txt* to use *ament_cmake*
fr: Mettez à jour le *CMakeLists.txt* pour utiliser *ament_cmake*

source: Apply the following changes to use ``ament_cmake`` instead of ``catkin``:
fr: Appliquez les modifications suivantes pour utiliser ``ament_cmake`` au lieu de ``catkin`` :

source: Set the build type in the ``package.xml`` file export section:
fr: Définissez le type de construction dans la section d'exportation du fichier ``package.xml`` :

source: Replace the ``find_package`` invocation with ``catkin`` and the ``COMPONENTS`` with:
fr: Remplacez l'invocation ``find_package`` par ``catkin`` et les ``COMPONENTS`` par :

source: Move and update the ``catkin_package`` invocation with:
fr: Déplacez et mettez à jour l'invocation ``catkin_package`` avec :

source: Invoke ``ament_package`` instead but **after** all targets have been registered.
fr: Invoquez ``ament_package`` à la place, mais **après** que toutes les cibles aient été enregistrées.

source: The only valid argument for `ament_package <https://github.com/ament/ament_cmake/blob/rolling/ament_cmake_core/cmake/core/ament_package.cmake>`__ is ``CONFIG_EXTRAS``. All other arguments are covered by separate functions which all need to be invoked *before* ``ament_package``:
fr: Le seul argument valide pour `ament_package <https://github.com/ament/ament_cmake/blob/rolling/ament_cmake_core/cmake/core/ament_package.cmake>`__ est ``CONFIG_EXTRAS``. Tous les autres arguments sont couverts par des fonctions séparées qui doivent toutes être invoquées *avant* ``ament_package`` :

source: Instead of passing ``CATKIN_DEPENDS ...`` call ``ament_export_dependencies(...)`` before.
fr: Au lieu de passer ``CATKIN_DEPENDS ...`` appelez ``ament_export_dependencies(...)`` avant.

source: Instead of passing ``INCLUDE_DIRS ...`` call ``ament_export_include_directories(...)`` before.
fr: Au lieu de passer ``INCLUDE_DIRS ...`` appelez ``ament_export_include_directories(...)`` avant.

source: Instead of passing ``LIBRARIES ...`` call ``ament_export_libraries(...)`` before.
fr: Au lieu de passer ``LIBRARIES ...``, appelez ``ament_export_libraries(...)`` avant.

source: **TODO document ament_export_targets (``ament_export_interfaces`` in Eloquent and older)?**
fr: **TODO document ament_export_targets (``ament_export_interfaces`` dans Eloquent et versions antérieures) ?**

source: Replace the invocation of ``add_message_files``, ``add_service_files`` and ``generate_messages`` with `rosidl_generate_interfaces <https://github.com/ros2/rosidl/blob/rolling/rosidl_cmake/cmake/rosidl_generate_interfaces.cmake>`__.
fr: Remplacez l'invocation de ``add_message_files``, ``add_service_files`` et ``generate_messages`` par `rosidl_generate_interfaces <https://github.com/ros2/rosidl/blob/rolling/rosidl_cmake/cmake/rosidl_generate_interfaces.cmake>` __.

source: The first argument is the ``target_name``. If you're building just one library it's ``${PROJECT_NAME}``
fr: Le premier argument est le ``target_name``. Si vous construisez une seule bibliothèque, c'est ``${PROJECT_NAME}``

source: Followed by the list of message filenames, relative to the package root.
fr: Suivi de la liste des noms de fichiers de messages, par rapport à la racine du package.

source: If you will be using the list of filenames multiple times, it is recommended to compose a list of message files and pass the list to the function for clarity.
fr: Si vous utilisez la liste des noms de fichiers plusieurs fois, il est recommandé de composer une liste de fichiers de messages et de transmettre la liste à la fonction pour plus de clarté.

source: The final multi-value-keyword argument fpr ``generate_messages`` is ``DEPENDENCIES`` which requires the list of dependent message packages.
fr: L'argument final du mot-clé à valeurs multiples fpr ``generate_messages`` est ``DEPENDENCIES`` qui nécessite la liste des packages de messages dépendants.

source: Remove any occurrences of the *devel space*. Related CMake variables like ``CATKIN_DEVEL_PREFIX`` do not exist anymore.
fr: Supprimez toutes les occurrences de l'*espace de développement*. Les variables CMake associées comme ``CATKIN_DEVEL_PREFIX`` n'existent plus.

source: The ``CATKIN_DEPENDS`` and ``DEPENDS`` arguments are passed to the new function `ament_export_dependencies <https://github.com/ament/ament_cmake/blob/rolling/ament_cmake_export_dependencies/cmake/ament_export_dependencies.cmake>`__.
fr: Les arguments ``CATKIN_DEPENDS`` et ``DEPENDS`` sont passés à la nouvelle fonction `ament_export_dependencies <https://github.com/ament/ament_cmake/blob/rolling/ament_cmake_export_dependencies/cmake/ament_export_dependencies.cmake>`__.

source: ``CATKIN_GLOBAL_INCLUDE_DESTINATION``: ``include``
fr: ``CATKIN_GLOBAL_INCLUDE_DESTINATION`` : ``inclure``

source: ``CATKIN_GLOBAL_SHARE_DESTINATION``: ``share``
fr: ``CATKIN_GLOBAL_SHARE_DESTINATION`` : ``partager``

source: ``CATKIN_PACKAGE_SHARE_DESTINATION``: ``share/${PROJECT_NAME}``
fr: ``CATKIN_PACKAGE_SHARE_DESTINATION`` : ``partager/${PROJECT_NAME}``

source: Unit tests
fr: Tests unitaires

source: If you are using gtest:
fr: Si vous utilisez gtest :

source: Replace ``CATKIN_ENABLE_TESTING`` with ``BUILD_TESTING``. Replace ``catkin_add_gtest`` with ``ament_add_gtest``.
fr: Remplacez ``CATKIN_ENABLE_TESTING`` par ``BUILD_TESTING``. Remplacez ``catkin_add_gtest`` par ``ament_add_gtest``.

source: Add ``<test_depend>ament_cmake_gtest</test_depend>`` to your ``package.xml``.
fr: Ajoutez ``<test_depend>ament_cmake_gtest</test_depend>`` à votre ``package.xml``.

source: In ROS 2 we are working to maintain clean code using linters. The styles for different languages are defined in our `Developer Guide <Developer-Guide>`.
fr: Dans ROS 2, nous travaillons pour maintenir un code propre en utilisant des linters. Les styles pour les différentes langues sont définis dans notre `Guide du développeur <Guide du développeur>`.

source: If you are starting a project from scratch it is recommended to follow the style guide and turn on the automatic linter unit tests by adding these lines just below ``if(BUILD_TESTING)`` (until alpha 5 this was ``AMENT_ENABLE_TESTING``).
fr: Si vous démarrez un projet à partir de zéro, il est recommandé de suivre le guide de style et d'activer les tests unitaires automatiques de linter en ajoutant ces lignes juste en dessous de ``if(BUILD_TESTING)`` (jusqu'à l'alpha 5, c'était ``AMENT_ENABLE_TESTING``) .

source: You will also need to add the following dependencies to your ``package.xml``:
fr: Vous devrez également ajouter les dépendances suivantes à votre ``package.xml`` :

source: Continue to use ``catkin`` in CMake
fr: Continuez à utiliser ``catkin`` dans CMake

source: ROS 2 uses ament as the build system but for backward compatibility ROS 2 has a package called ``catkin`` which provides almost the same API as catkin in ROS 1. In order to use this backward compatibility API the ``CMakeLists.txt`` must only be updated to call the function ``catkin_ament_package()`` *after* all targets.
fr: ROS 2 utilise ament comme système de construction mais pour la rétrocompatibilité, ROS 2 a un paquet appelé ``catkin`` qui fournit presque la même API que catkin dans ROS 1. Afin d'utiliser cette API de rétrocompatibilité, le ``CMakeLists.txt` ` ne doit être mis à jour que pour appeler la fonction ``catkin_ament_package()`` *après* toutes les cibles.

source: **NOTE: This has not been implemented yet and is only an idea at the moment. Due to the number of changes related to dependencies it has not yet been decided if this compatibility API is useful enough to justify the effort.**
fr: **REMARQUE : Ceci n'a pas encore été implémenté et n'est qu'une idée pour le moment. En raison du nombre de modifications liées aux dépendances, il n'a pas encore été décidé si cette API de compatibilité est suffisamment utile pour justifier l'effort.**

source: Update source code
fr: Mettre à jour le code source

source: Messages, services, and actions
fr: Messages, services et actions

source: The namespace of ROS 2 messages, services, and actions use a subnamespace (``msg``, ``srv``, or ``action``, respectively) after the package name. Therefore an include looks like: ``#include <my_interfaces/msg/my_message.hpp>``. The C++ type is then named: ``my_interfaces::msg::MyMessage``.
fr: L'espace de noms des messages, services et actions ROS 2 utilise un sous-espace de noms (``msg``, ``srv`` ou ``action``, respectivement) après le nom du package. Par conséquent, une inclusion ressemble à : ``#include <my_interfaces/msg/my_message.hpp>``. Le type C++ est alors nommé : ``my_interfaces::msg::MyMessage``.

source: Shared pointer types are provided as typedefs within the message structs: ``my_interfaces::msg::MyMessage::SharedPtr`` as well as ``my_interfaces::msg::MyMessage::ConstSharedPtr``.
fr: Les types de pointeurs partagés sont fournis en tant que typedefs dans les structures de message : ``my_interfaces::msg::MyMessage::SharedPtr`` ainsi que ``my_interfaces::msg::MyMessage::ConstSharedPtr``.

source: For more details please see the article about the `generated C++ interfaces <https://design.ros2.org/articles/generated_interfaces_cpp.html>`__.
fr: Pour plus de détails, veuillez consulter l'article sur les `interfaces C++ générées <https://design.ros2.org/articles/generated_interfaces_cpp.html>`__.

source: The migration requires includes to change by:
fr: La migration nécessite la modification d'includes par :

source: inserting the subfolder ``msg`` between the package name and message datatype
fr: insertion du sous-dossier ``msg`` entre le nom du package et le type de données du message

source: changing the included filename from CamelCase to underscore separation
fr: changer le nom de fichier inclus de CamelCase pour souligner la séparation

source: changing from ``*.h`` to ``*.hpp``
fr: passage de ``*.h`` à ``*.hpp``

source: The migration requires code to insert the ``msg`` namespace into all instances.
fr: La migration nécessite du code pour insérer l'espace de noms ``msg`` dans toutes les instances.

source: Use of service objects
fr: Utilisation des objets de service

source: Service callbacks in ROS 2 do not have boolean return values. Instead of returning false on failures, throwing exceptions is recommended.
fr: Les rappels de service dans ROS 2 n'ont pas de valeurs de retour booléennes. Au lieu de renvoyer false en cas d'échec, il est recommandé de lever des exceptions.

source: Usages of ros::Time
fr: Usages de ros::Time

source: For usages of ``ros::Time``:
fr: Pour les utilisations de ``ros::Time`` :

source: Replace all instances of ``ros::Time`` with ``rclcpp::Time``
fr: Remplacez toutes les instances de ``ros::Time`` par ``rclcpp::Time``

source: If your messages or code makes use of std_msgs::Time:
fr: Si vos messages ou votre code utilisent std_msgs::Time :

source: Convert all instances of std_msgs::Time to builtin_interfaces::msg::Time
fr: Convertir toutes les instances de std_msgs::Time en builtin_interfaces::msg::Time

source: Convert all ``#include "std_msgs/time.h`` to ``#include "builtin_interfaces/msg/time.hpp"``
fr: Convertissez tous les ``#include "std_msgs/time.h`` en ``#include "builtin_interfaces/msg/time.hpp"``

source: Convert all instances using the std_msgs::Time field ``nsec`` to the builtin_interfaces::msg::Time field ``nanosec``
fr: Convertissez toutes les instances utilisant le champ std_msgs::Time ``nsec`` en builtin_interfaces::msg::Time field ``nanosec``

source: Usages of ros::Rate
fr: Usages de ros :: Rate

source: There is an equivalent type ``rclcpp::Rate`` object which is basically a drop in replacement for ``ros::Rate``.
fr: Il existe un objet équivalent de type ``rclcpp::Rate`` qui est essentiellement un remplacement de ``ros::Rate``.

source: ROS client library
fr: bibliothèque cliente ROS

source: **NOTE: Others to be written**
fr: **REMARQUE : Autres à écrire**

source: Boost
fr: Augmenter

source: Much of the functionality previously provided by Boost has been integrated into the C++ standard library. As such we would like to take advantage of the new core features and avoid the dependency on boost where possible.
fr: Une grande partie des fonctionnalités précédemment fournies par Boost ont été intégrées dans la bibliothèque standard C++. En tant que tel, nous aimerions tirer parti des nouvelles fonctionnalités de base et éviter la dépendance au boost dans la mesure du possible.

source: Shared Pointers
fr: Pointeurs partagés

source: To switch shared pointers from boost to standard C++ replace instances of:
fr: Pour basculer les pointeurs partagés de boost vers le C++ standard, remplacez les instances de :

source: ``#include <boost/shared_ptr.hpp>`` with ``#include <memory>``
fr: ``#include <boost/shared_ptr.hpp>`` avec ``#include <mémoire>``

source: ``boost::shared_ptr`` with ``std::shared_ptr``
fr: ``boost::shared_ptr`` avec ``std::shared_ptr``

source: There may also be variants such as ``weak_ptr`` which you want to convert as well.
fr: Il peut également y avoir des variantes telles que ``weak_ptr`` que vous souhaitez également convertir.
