Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/The-ROS2-Project/Contributing/Migration-Guide.po
Languages: fr

source: Launch File migrator that converts a ROS 1 XML launch file to a ROS 2 Python launch file: https://github.com/aws-robotics/ros2-launch-file-migrator
fr: Migrateur de fichiers de lancement qui convertit un fichier de lancement XML ROS 1 en un fichier de lancement Python ROS 2 : https://github.com/aws-robotics/ros2-launch-file-migrator

source: Amazon has exposed their tools for porting ROS 1 robots to ROS 2 https://github.com/awslabs/ros2-migration-tools/tree/master/porting\_tools
fr: Amazon a exposé ses outils de portage des robots ROS 1 vers ROS 2 https://github.com/awslabs/ros2-migration-tools/tree/master/porting\_tools

source: Licensing
fr: Licence

source: In ROS 2 our recommended license is the `Apache 2.0 License <https://www.apache.org/licenses/LICENSE-2.0>`__. In ROS 1 our recommended license was the `3-Clause BSD License <https://opensource.org/licenses/BSD-3-Clause>`__.
fr: Dans ROS 2, notre licence recommandée est la `Licence Apache 2.0 <https://www.apache.org/licenses/LICENSE-2.0>`__. Dans ROS 1, notre licence recommandée était la `3-Clause BSD License <https://opensource.org/licenses/BSD-3-Clause>`__.

source: For any new project we recommend using the Apache 2.0 License, whether ROS 1 or ROS 2.
fr: Pour tout nouveau projet, nous vous recommandons d'utiliser la licence Apache 2.0, que ce soit ROS 1 ou ROS 2.

source: However, when migrating code from ROS 1 to ROS 2 we cannot simply change the license. The existing license must be preserved for any preexisting contributions.
fr: Cependant, lors de la migration du code de ROS 1 vers ROS 2, nous ne pouvons pas simplement changer la licence. La licence existante doit être conservée pour toute contribution préexistante.

source: To that end if a package is being migrated we recommend keeping the existing license and continuing to contribute to that package under the existing OSI license, which we expect to be the BSD license for core elements.
fr: À cette fin, si un package est en cours de migration, nous vous recommandons de conserver la licence existante et de continuer à contribuer à ce package sous la licence OSI existante, qui devrait être la licence BSD pour les éléments principaux.

source: This will keep things clear and easy to understand.
fr: Cela gardera les choses claires et faciles à comprendre.

source: Changing the License
fr: Modification de la licence

source: It is possible to change the license, however you will need to contact all the contributors and get permission. For most packages this is likely to be a significant effort and not worth considering. If the package has a small set of contributors then this may be feasible.
fr: Il est possible de modifier la licence, mais vous devrez contacter tous les contributeurs et obtenir leur autorisation. Pour la plupart des packages, cela représente probablement un effort important et ne vaut pas la peine d'être pris en compte. Si le paquet a un petit ensemble de contributeurs, cela peut être faisable.
