Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/The-ROS2-Project/Contributing/Migration-Guide.po
Languages: fr

source: Also it is recommended practice to use ``using`` instead of ``typedef``. ``using`` has the ability to work better in templated logic. For details `see here <https://stackoverflow.com/questions/10747810/what-is-the-difference-between-typedef-and-using-in-c11>`__
fr: Il est également recommandé d'utiliser ``using`` au lieu de ``typedef``. ``using`` a la capacité de mieux fonctionner dans la logique basée sur des modèles. Pour plus de détails `voir ici <https://stackoverflow.com/questions/10747810/what-is-the-difference-between-typedef-and-using-in-c11>`__

source: Thread/Mutexes
fr: Thread/Mutex

source: Another common part of boost used in ROS codebases are mutexes in ``boost::thread``.
fr: Une autre partie courante de boost utilisée dans les bases de code ROS sont les mutex dans ``boost::thread``.

source: Replace ``boost::mutex::scoped_lock`` with ``std::unique_lock<std::mutex>``
fr: Remplacez ``boost::mutex::scoped_lock`` par ``std::unique_lock<std::mutex>``

source: Replace ``boost::mutex`` with ``std::mutex``
fr: Remplacez ``boost::mutex`` par ``std::mutex``

source: Replace ``#include <boost/thread/mutex.hpp>`` with ``#include <mutex>``
fr: Remplacez ``#include <boost/thread/mutex.hpp>`` par ``#include <mutex>``

source: Unordered Map
fr: Carte non ordonnée

source: Replace:
fr: Remplacer:

source: ``#include <boost/unordered_map.hpp>`` with ``#include <unordered_map>``
fr: ``#include <boost/unordered_map.hpp>`` avec ``#include <unordered_map>``

source: ``boost::unordered_map`` with ``std::unordered_map``
fr: ``boost::unordered_map`` avec ``std::unordered_map``

source: function
fr: fonction

source: ``#include <boost/function.hpp>`` with ``#include <functional>``
fr: ``#include <boost/function.hpp>`` avec ``#include <fonctionnel>``

source: ``boost::function`` with ``std::function``
fr: ``boost::fonction`` avec ``std::fonction``

source: Parameters
fr: Paramètres

source: In ROS 1, parameters are associated with a central server that allowed retrieving parameters at runtime through the use of the network APIs. In ROS 2, parameters are associated per node and are configurable at runtime with ROS services.
fr: Dans ROS 1, les paramètres sont associés à un serveur central qui permettait de récupérer les paramètres au moment de l'exécution grâce à l'utilisation des API réseau. Dans ROS 2, les paramètres sont associés par nœud et sont configurables lors de l'exécution avec les services ROS.

source: See `ROS 2 Parameter design document <https://design.ros2.org/articles/ros_parameters.html>`_ for more details about the system model.
fr: Voir `Document de conception de paramètres ROS 2 <https://design.ros2.org/articles/ros_parameters.html>`_ pour plus de détails sur le modèle de système.

source: See :doc:`ROS 2 CLI usage <../../Tutorials/Beginner-CLI-Tools/Understanding-ROS2-Parameters/Understanding-ROS2-Parameters>` for a better understanding of how the CLI tools work and its differences with ROS 1 tooling.
fr: Voir :doc:`Utilisation de la CLI ROS 2 <../../Tutorials/Beginner-CLI-Tools/Understanding-ROS2-Parameters/Understanding-ROS2-Parameters>` pour une meilleure compréhension du fonctionnement des outils CLI et de ses différences avec l'outillage ROS 1.

source: See :doc:`../../How-To-Guides/Parameters-YAML-files-migration-guide` to see how YAML parameter files are parsed in ROS 2 and their differences with ROS implementation.
fr: Voir :doc:`../../How-To-Guides/Parameters-YAML-files-migration-guide` pour voir comment les fichiers de paramètres YAML sont analysés dans ROS 2 et leurs différences avec l'implémentation de ROS.

source: Launch files
fr: Lancer des fichiers

source: While launch files in ROS 1 are always specified using `.xml <https://wiki.ros.org/roslaunch/XML>`__ files, ROS 2 supports Python scripts to enable more flexibility (see `launch package <https://github.com/ros2/launch/tree/rolling/launch>`__) as well as XML and YAML files. See `separate tutorial <../../How-To-Guides/Launch-files-migration-guide>` on migrating launch files from ROS 1 to ROS 2.
fr: Alors que les fichiers de lancement dans ROS 1 sont toujours spécifiés à l'aide de fichiers `.xml <https://wiki.ros.org/roslaunch/XML>`__, ROS 2 prend en charge les scripts Python pour permettre plus de flexibilité (voir `package de lancement <https:/ /github.com/ros2/launch/tree/rolling/launch>`__) ainsi que des fichiers XML et YAML. Voir `tutoriel séparé <../../How-To-Guides/Launch-files-migration-guide>` sur la migration des fichiers de lancement de ROS 1 vers ROS 2.

source: Example: Converting an existing ROS 1 package to use ROS 2
fr: Exemple : conversion d'un package ROS 1 existant pour utiliser ROS 2

source: Let's say that we have simple ROS 1 package called ``talker`` that uses ``roscpp`` in one node, called ``talker``. This package is in a catkin workspace, located at ``~/ros1_talker``.
fr: Disons que nous avons un package ROS 1 simple appelé ``talker`` qui utilise ``roscpp`` dans un nœud, appelé ``talker``. Ce paquet se trouve dans un espace de travail catkin, situé dans ``~/ros1_talker``.

source: The ROS 1 code
fr: Le code ROS 1

source: Here's the directory layout of our catkin workspace:
fr: Voici la disposition du répertoire de notre espace de travail catkin :

source: Here is the content of those three files:
fr: Voici le contenu de ces trois fichiers :

source: ``src/talker/package.xml``:
fr: ``src/talker/paquet.xml`` :

source: Building the ROS 1 code
fr: Construire le code ROS 1

source: We source an environment setup file (in this case for Jade using bash), then we build our package using ``catkin_make install``:
fr: Nous créons un fichier de configuration d'environnement (dans ce cas pour Jade en utilisant bash), puis nous construisons notre paquet en utilisant ``catkin_make install`` :

source: Running the ROS 1 node
fr: Exécution du nœud ROS 1

source: If there's not already one running, we start a ``roscore``, first sourcing the setup file from our ``catkin`` install tree (the system setup file at ``/opt/ros/jade/setup.bash`` would also work here):
fr: S'il n'y en a pas déjà un en cours d'exécution, nous lançons un ``roscore``, en commençant par rechercher le fichier de configuration à partir de notre arbre d'installation ``catkin`` (le fichier de configuration du système à ``/opt/ros/jade/setup.bash`` fonctionnerait aussi ici):

source: In another shell, we run the node from the ``catkin`` install space using ``rosrun``, again sourcing the setup file first (in this case it must be the one from our workspace):
fr: Dans un autre shell, nous exécutons le nœud à partir de l'espace d'installation ``catkin`` en utilisant ``rosrun``, en recherchant d'abord le fichier de configuration (dans ce cas, il doit s'agir de celui de notre espace de travail) :

source: Migrating to ROS 2
fr: Migration vers ROS 2

source: Let's start by creating a new workspace in which to work:
fr: Commençons par créer un nouvel espace de travail dans lequel travailler :

source: We'll copy the source tree from our ROS 1 package into that workspace, where we can modify it:
fr: Nous allons copier l'arborescence source de notre package ROS 1 dans cet espace de travail, où nous pourrons le modifier :

source: Now we'll modify the C++ code in the node. The ROS 2 C++ library, called ``rclcpp``, provides a different API from that provided by ``roscpp``. The concepts are very similar between the two libraries, which makes the changes reasonably straightforward to make.
fr: Nous allons maintenant modifier le code C++ dans le nœud. La bibliothèque ROS 2 C++, appelée ``rclcpp``, fournit une API différente de celle fournie par ``roscpp``. Les concepts sont très similaires entre les deux bibliothèques, ce qui rend les modifications raisonnablement simples à effectuer.

source: Included headers
fr: En-têtes inclus

source: In place of ``ros/ros.h``, which gave us access to the ``roscpp`` library API, we need to include ``rclcpp/rclcpp.hpp``, which gives us access to the ``rclcpp`` library API:
fr: Au lieu de ``ros/ros.h``, qui nous a donné accès à l'API de la bibliothèque ``roscpp``, nous devons inclure ``rclcpp/rclcpp.hpp``, qui nous donne accès à la ``rclcpp `` API de la bibliothèque :

source: To get the ``std_msgs/String`` message definition, in place of ``std_msgs/String.h``, we need to include ``std_msgs/msg/string.hpp``:
fr: Pour obtenir la définition de message ``std_msgs/String``, à la place de ``std_msgs/String.h``, nous devons inclure ``std_msgs/msg/string.hpp`` :

source: Changing C++ library calls
fr: Modification des appels de bibliothèque C++

source: Instead of passing the node's name to the library initialization call, we do the initialization, then pass the node name to the creation of the node object (we can use the ``auto`` keyword because now we're requiring a C++14 compiler):
fr: Au lieu de passer le nom du nœud à l'appel d'initialisation de la bibliothèque, nous effectuons l'initialisation, puis passons le nom du nœud à la création de l'objet nœud (nous pouvons utiliser le mot-clé ``auto`` car nous avons maintenant besoin d'un C++ 14 compilateur):

source: The creation of the publisher and rate objects looks pretty similar, with some changes to the names of namespace and methods.
fr: La création des objets d'éditeur et de taux semble assez similaire, avec quelques changements dans les noms de l'espace de noms et des méthodes.

source: To further control how message delivery is handled, a quality of service (``QoS``) profile could be passed in. The default profile is ``rmw_qos_profile_default``. For more details, see the `design document <https://design.ros2.org/articles/qos.html>`__ and `concept overview <../../Concepts/About-Quality-of-Service-Settings>`.
fr: Pour mieux contrôler la manière dont la livraison des messages est gérée, un profil de qualité de service (``QoS``) peut être transmis. Le profil par défaut est ``rmw_qos_profile_default``. Pour plus de détails, consultez le `document de conception <https://design.ros2.org/articles/qos.html>`__ et la `vue d'ensemble du concept <../../Concepts/About-Quality-of-Service-Settings >`.

source: The creation of the outgoing message is different in the namespace:
fr: La création du message sortant est différente dans l'espace de noms :

source: In place of ``ros::ok()``, we call ``rclcpp::ok()``:
fr: Au lieu de ``ros::ok()``, nous appelons ``rclcpp::ok()`` :

source: Inside the publishing loop, we access the ``data`` field as before:
fr: Dans la boucle de publication, nous accédons au champ ``data`` comme précédemment :

source: To print a console message, instead of using ``ROS_INFO()``, we use ``RCLCPP_INFO()`` and its various cousins. The key difference is that ``RCLCPP_INFO()`` takes a Logger object as the first argument.
fr: Pour imprimer un message console, au lieu d'utiliser ``ROS_INFO()``, nous utilisons ``RCLCPP_INFO()`` et ses différents cousins. La principale différence est que ``RCLCPP_INFO()`` prend un objet Logger comme premier argument.

source: Publishing the message is the same as before:
fr: La publication du message est la même qu'avant :

source: Spinning (i.e., letting the communications system process any pending incoming/outgoing messages) is different in that the call now takes the node as an argument:
fr: La rotation (c'est-à-dire laisser le système de communication traiter tous les messages entrants/sortants en attente) est différente en ce sens que l'appel prend désormais le nœud comme argument :

source: Sleeping using the rate object is unchanged.
fr: Dormir à l'aide de l'objet tarif reste inchangé.

source: Putting it all together, the new ``talker.cpp`` looks like this:
fr: En mettant tout cela ensemble, le nouveau ``talker.cpp`` ressemble à ceci :

source: Changing the ``package.xml``
fr: Changer le ``package.xml``

source: ROS 2 doesn't support format 1 of the package specification but only newer format versions (2 and higher). We start by specifying the format version in the ``package`` tag:
fr: ROS 2 ne prend pas en charge le format 1 de la spécification du package, mais uniquement les versions de format plus récentes (2 et supérieures). Nous commençons par spécifier la version du format dans la balise ``package`` :

source: ROS 2 uses a newer version of ``catkin``, called ``ament_cmake``, which we specify in the ``buildtool_depend`` tag:
fr: ROS 2 utilise une version plus récente de ``catkin``, appelée ``ament_cmake``, que nous spécifions dans la balise ``buildtool_depend`` :

source: In our build dependencies, instead of ``roscpp`` we use ``rclcpp``, which provides the C++ API that we use.
fr: Dans nos dépendances de construction, au lieu de ``roscpp``, nous utilisons ``rclcpp``, qui fournit l'API C++ que nous utilisons.

source: We make the same addition in the run dependencies and also update from the ``run_depend`` tag to the ``exec_depend`` tag (part of the upgrade to version 2 of the package format):
fr: Nous faisons le même ajout dans les dépendances d'exécution et mettons également à jour la balise ``run_depend`` vers la balise ``exec_depend`` (partie de la mise à niveau vers la version 2 du format de package) :

source: In ROS 1, we use ``<depend>`` to simplify specifying dependencies for both compile-time and runtime. We can do the same in ROS 2:
fr: Dans ROS 1, nous utilisons ``<depend>`` pour simplifier la spécification des dépendances à la fois pour la compilation et l'exécution. Nous pouvons faire la même chose dans ROS 2 :

source: We also need to tell the build tool what *kind* of package we are, so that it knows how to build us. Because we're using ``ament`` and CMake, we add the following lines to declare our build type to be ``ament_cmake``:
fr: Nous devons également dire à l'outil de construction quel *type* de paquet nous sommes, afin qu'il sache comment nous construire. Parce que nous utilisons ``ament`` et CMake, nous ajoutons les lignes suivantes pour déclarer notre type de construction comme étant ``ament_cmake`` :

source: Putting it all together, our ``package.xml`` now looks like this:
fr: En mettant tout cela ensemble, notre ``package.xml`` ressemble maintenant à ceci :

source: **TODO: show simpler version of this file just using the ``<depend>`` tag, which is enabled by version 2 of the package format (also supported in ``catkin`` so, strictly speaking, orthogonal to ROS 2).**
fr: **TODO : affiche une version plus simple de ce fichier en utilisant simplement la balise ``<depend>``, qui est activée par la version 2 du format de package (également prise en charge dans ``catkin`` donc, à proprement parler, orthogonale à ROS 2 ).**

source: Changing the CMake code
fr: Changer le code CMake

source: ROS 2 relies on a higher version of CMake:
fr: ROS 2 s'appuie sur une version supérieure de CMake :

source: ROS 2 relies on the C++14 standard. Depending on what compiler you're using, support for C++14 might not be enabled by default. Using ``gcc`` 5.3 (which is what is used on Ubuntu Xenial), we need to enable it explicitly, which we do by adding this line near the top of the file:
fr: ROS 2 s'appuie sur la norme C++14. Selon le compilateur que vous utilisez, la prise en charge de C++14 peut ne pas être activée par défaut. En utilisant ``gcc`` 5.3 (ce qui est utilisé sur Ubuntu Xenial), nous devons l'activer explicitement, ce que nous faisons en ajoutant cette ligne en haut du fichier :

source: The preferred way to work on all platforms is this:
fr: La façon préférée de travailler sur toutes les plateformes est la suivante :

source: Using ``catkin``, we specify the packages we want to build against by passing them as ``COMPONENTS`` arguments when initially finding ``catkin`` itself. With ``ament_cmake``, we find each package individually, starting with ``ament_cmake``:
fr: En utilisant ``catkin``, nous spécifions les packages avec lesquels nous voulons construire en les passant comme arguments ``COMPONENTS`` lors de la recherche initiale de ``catkin`` lui-même. Avec ``ament_cmake``, nous trouvons chaque paquet individuellement, en commençant par ``ament_cmake`` :

source: System dependencies can be found as before:
fr: Les dépendances du système peuvent être trouvées comme avant :

source: We call ``catkin_package()`` to auto-generate things like CMake configuration files for other packages that use our package. Whereas that call happens *before* specifying targets to build, we now call the analogous ``ament_package()`` *after* the targets:
fr: Nous appelons ``catkin_package()`` pour générer automatiquement des choses comme les fichiers de configuration CMake pour d'autres packages qui utilisent notre package. Alors que cet appel se produit *avant* de spécifier les cibles à construire, nous appelons maintenant l'analogue ``ament_package()`` *après* les cibles :

source: The only directories that need to be manually included are local directories and dependencies that are not ament packages:
fr: Les seuls répertoires qui doivent être inclus manuellement sont les répertoires locaux et les dépendances qui ne sont pas des packages d'ament :

source: A better alternative is to specify include directories for each target individually, rather than including all the directories for all targets:
fr: Une meilleure alternative consiste à spécifier les répertoires d'inclusion pour chaque cible individuellement, plutôt que d'inclure tous les répertoires pour toutes les cibles :

source: Similar to how we found each dependent package separately, we need to link each one to the build target. To link with dependent packages that are ament packages, instead of using ``target_link_libraries()``, ``ament_target_dependencies()`` is a more concise and more thorough way of handling build flags. It automatically handles both the include directories defined in ``_INCLUDE_DIRS`` and linking libraries defined in ``_LIBRARIES``.
fr: De la même manière que nous avons trouvé chaque package dépendant séparément, nous devons lier chacun à la cible de construction. Pour créer un lien avec des packages dépendants qui sont des packages ament, au lieu d'utiliser ``target_link_libraries()``, ``ament_target_dependencies()`` est une manière plus concise et plus approfondie de gérer les drapeaux de construction. Il gère automatiquement à la fois les répertoires d'inclusion définis dans ``_INCLUDE_DIRS`` et les bibliothèques de liens définies dans ``_LIBRARIES``.

source: To link with packages that are not ament packages, such as system dependencies like ``Boost``, or a library being built in the same ``CMakeLists.txt``, use ``target_link_libraries()``:
fr: Pour créer un lien avec des packages qui ne sont pas des packages ament, tels que des dépendances système comme ``Boost``, ou une bibliothèque construite dans le même ``CMakeLists.txt``, utilisez ``target_link_libraries()`` :

source: For installation, ``catkin`` defines variables like ``CATKIN_PACKAGE_BIN_DESTINATION``. With ``ament_cmake``, we just give a path relative to the installation root, like ``bin`` for executables:
fr: Pour l'installation, ``catkin`` définit des variables comme ``CATKIN_PACKAGE_BIN_DESTINATION``. Avec ``ament_cmake``, on donne juste un chemin relatif à la racine d'installation, comme ``bin`` pour les exécutables :

source: Optionally, we can install and export the included directories for downstream packages:
fr: En option, nous pouvons installer et exporter les répertoires inclus pour les packages en aval :

source: Optionally, we can export dependencies for downstream packages:
fr: En option, nous pouvons exporter les dépendances pour les packages en aval :

source: Putting it all together, the new ``CMakeLists.txt`` looks like this:
fr: En mettant tout cela ensemble, le nouveau ``CMakeLists.txt`` ressemble à ceci :

source: **TODO: Show what this would look like with ``ament_auto``.**
fr: **TODO : Montrez à quoi cela ressemblerait avec ``ament_auto``.**

source: Building the ROS 2 code
fr: Construire le code ROS 2

source: We source an environment setup file (in this case the one generated by following the ROS 2 installation tutorial, which builds in ``~/ros2_ws``, then we build our package using ``colcon build``:
fr: Nous créons un fichier de configuration d'environnement (dans ce cas, celui généré en suivant le tutoriel d'installation de ROS 2, qui se construit dans ``~/ros2_ws``, puis nous construisons notre paquet en utilisant ``colcon build`` :

source: Running the ROS 2 node
fr: Exécution du nœud ROS 2

source: Because we installed the ``talker`` executable into ``bin``, after sourcing the setup file, from our install tree, we can invoke it by name directly (also, there is not yet a ROS 2 equivalent for ``rosrun``):
fr: Parce que nous avons installé l'exécutable ``talker`` dans ``bin``, après avoir récupéré le fichier d'installation, à partir de notre arbre d'installation, nous pouvons l'invoquer directement par son nom (de plus, il n'y a pas encore d'équivalent ROS 2 pour ``rosrun ``):

source: Update scripts
fr: Mettre à jour les scripts

source: ROS CLI arguments
fr: Arguments de la CLI ROS

source: Since `ROS Eloquent <../../Releases/Release-Eloquent-Elusor>`, ROS arguments should be scoped with ``--ros-args`` and a trailing ``--`` (the trailing double dash may be elided if no arguments follow it).
fr: Depuis `ROS Eloquent <../../Releases/Release-Eloquent-Elusor>`, les arguments ROS doivent être définis avec ``--ros-args`` et un ``--`` final (le double tiret final peut être élidé si aucun argument ne le suit).

source: Remapping names is similar to ROS 1, taking on the form ``from:=to``, except that it must be preceded by a ``--remap`` (or ``-r``) flag. For example:
fr: Le remappage des noms est similaire à ROS 1, prenant la forme ``from:=to``, sauf qu'il doit être précédé d'un drapeau ``--remap`` (ou ``-r``). Par exemple:

source: We use a similar syntax for parameters, using the ``--param`` (or ``-p``) flag:
fr: Nous utilisons une syntaxe similaire pour les paramètres, en utilisant le drapeau ``--param`` (ou ``-p``) :

source: Note, this is different than using a leading underscore in ROS 1.
fr: Notez que ceci est différent de l'utilisation d'un trait de soulignement initial dans ROS 1.

source: To change a node name use ``__node`` (the ROS 1 equivalent is ``__name``):
fr: Pour changer un nom de nœud, utilisez ``__node`` (l'équivalent ROS 1 est ``__name``) :

source: Note the use of the ``-r`` flag. The same remap flag is needed for changing the namespace ``__ns``:
fr: Notez l'utilisation du drapeau ``-r``. Le même drapeau de remappage est nécessaire pour changer l'espace de noms ``__ns`` :

source: There is no equivalent in ROS 2 for the following ROS 1 keys:
fr: Il n'y a pas d'équivalent dans ROS 2 pour les clés ROS 1 suivantes :

source: ``__log`` (but ``--log-config-file`` can be used to provide a logger configuration file)
fr: ``__log`` (mais ``--log-config-file`` peut être utilisé pour fournir un fichier de configuration de l'enregistreur)

source: ``__master``
fr: ``__maître``

source: For more information, see the `design document <https://design.ros2.org/articles/ros_command_line_arguments.html>`_.
fr: Pour plus d'informations, consultez le `document de conception <https://design.ros2.org/articles/ros_command_line_arguments.html>`_.

source: Quick reference
fr: Référence rapide

source: Feature
fr: Fonctionnalité

source: ROS 1
fr: RSO 1

source: ROS 2
fr: RSO 2

source: remapping
fr: remappage

source: foo:=bar
fr: toto:=bar

source: -r foo:=bar
fr: -r toto:=bar

source: parameters
fr: paramètres

source: _foo:=bar
fr: _foo :=barre

source: -p foo:=bar
fr: -p toto:=bar

source: node name
fr: nom du nœud

source: namespace
fr: espace de noms

source: More examples and tools
fr: Plus d'exemples et d'outils
