Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Tutorials/Advanced/Discovery-Server/Discovery-Server.po
Languages: fr

source: These scripts' features are references for advanced purposes and their study is left to the user.
fr: Les fonctionnalités de ces scripts sont des références à des fins avancées et leur étude est laissée à l'utilisateur.

source: :download:`bash network traffic generator <scripts/generate_discovery_packages.bash>`
fr: :download:`générateur de trafic réseau bash <scripts/generate_discovery_packages.bash>`

source: :download:`python3 graph generator <scripts/discovery_packets.py>`
fr: :download:`générateur de graphes python3 <scripts/discovery_packets.py>`

source: :download:`XML configuration <scripts/no_intraprocess_configuration.xml>`
fr: :download:`Configuration XML <scripts/no_intraprocess_configuration.xml>`

source: Run the bash script with the path to ``setup.bash`` file to source ROS 2 as an argument. This will generate the traffic trace for simple discovery. Execute the same script with second argument ``SERVER``. It will generate the trace for using the discovery server.
fr: Exécutez le script bash avec le chemin du fichier ``setup.bash`` vers la source ROS 2 comme argument. Cela générera la trace du trafic pour une découverte simple. Exécutez le même script avec le second argument ``SERVER``. Il générera la trace pour l'utilisation du serveur de découverte.

source: Depending on your configuration of ``tcpdump``, this script may require ``sudo`` privileges to read traffic across your network device.
fr: Selon votre configuration de ``tcpdump``, ce script peut nécessiter des privilèges ``sudo`` pour lire le trafic sur votre périphérique réseau.

source: After both executions are done, run the Python script to generate a graph similar to the one below.
fr: Une fois les deux exécutions terminées, exécutez le script Python pour générer un graphique similaire à celui ci-dessous.

source: This graph is the result of a specific run of the experiment. The reader can execute the scripts and generate their own results for comparison. It can easily be seen that network traffic is reduced when using discovery service.
fr: Ce graphique est le résultat d'une exécution spécifique de l'expérience. Le lecteur peut exécuter les scripts et générer ses propres résultats à des fins de comparaison. On peut facilement voir que le trafic réseau est réduit lors de l'utilisation du service de découverte.

source: The reduction in traffic is a result of avoiding every node announcing itself and waiting a response from every other node on the network. This creates a huge amount of traffic in large architectures. The reduction from this method increases with the number of nodes, making this architecture more scalable than the Simple Discovery Protocol approach.
fr: La réduction du trafic résulte du fait que chaque nœud ne s'annonce pas et attend une réponse de tous les autres nœuds du réseau. Cela crée une énorme quantité de trafic dans les grandes architectures. La réduction de cette méthode augmente avec le nombre de nœuds, ce qui rend cette architecture plus évolutive que l'approche du protocole de découverte simple.

source: The new Fast DDS Discovery Server v2 is available since *Fast DDS* v2.0.2, replacing the old discovery server. In this new version, those nodes that do not share topics will automatically not discover each other, saving the whole discovery data required to connect them and their endpoints. The experiment above does not show this case, but even so the massive reduction in traffic can be appreciated due to the hidden infrastructure topics of ROS 2 nodes.
fr: Le nouveau Fast DDS Discovery Server v2 est disponible depuis *Fast DDS* v2.0.2, en remplacement de l'ancien serveur de découverte. Dans cette nouvelle version, les nœuds qui ne partagent pas de sujets ne se découvriront automatiquement pas, enregistrant toutes les données de découverte nécessaires pour les connecter et leurs points de terminaison. L'expérience ci-dessus ne montre pas ce cas, mais même ainsi, la réduction massive du trafic peut être appréciée en raison des sujets d'infrastructure cachés des nœuds ROS 2.
