Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Tutorials/Advanced/Discovery-Server/Discovery-Server.po
Languages: fr

source: Using Fast DDS Discovery Server as discovery protocol [community-contributed]
fr: Utilisation de Fast DDS Discovery Server comme protocole de découverte [contribution de la communauté]

source: **Goal:** This tutorial will show how to launch ROS 2 Nodes using the **Fast DDS Discovery Server** discovery protocol.
fr: **Objectif :** Ce didacticiel montre comment lancer les nœuds ROS 2 à l'aide du protocole de découverte **Fast DDS Discovery Server**.

source: **Tutorial level:** Advanced
fr: **Niveau du didacticiel :** Avancé

source: **Time:** 20 minutes
fr: **Durée :** 20 minutes

source: Table of Contents
fr: Table des matières

source: Background
fr: Arrière-plan

source: Starting from ROS 2 Eloquent Elusor, the **Fast DDS Discovery Server** protocol is a feature that offers a centralized dynamic discovery mechanism, as opposed to the distributed mechanism used in DDS by default. This tutorial explains how to run some ROS 2 examples using the Fast DDS Discovery Server feature as discovery communication.
fr: À partir de ROS 2 Eloquent Elusor, le protocole **Fast DDS Discovery Server** est une fonctionnalité qui offre un mécanisme de découverte dynamique centralisé, par opposition au mécanisme distribué utilisé par défaut dans DDS. Ce didacticiel explique comment exécuter certains exemples ROS 2 à l'aide de la fonctionnalité Fast DDS Discovery Server en tant que communication de découverte.

source: In order to get more information about the available discovery configuration, please check the `following documentation <https://fast-dds.docs.eprosima.com/en/v2.1.0/fastdds/discovery/discovery.html>`_ or read the `Fast DDS Discovery Server specific documentation <https://fast-dds.docs.eprosima.com/en/v2.1.0/fastdds/discovery/discovery_server.html#discovery-server>`__.
fr: Afin d'obtenir plus d'informations sur la configuration de découverte disponible, veuillez consulter la `documentation suivante <https://fast-dds.docs.eprosima.com/en/v2.1.0/fastdds/discovery/discovery.html>`_ ou lisez la `Documentation spécifique au serveur Fast DDS Discovery <https://fast-dds.docs.eprosima.com/en/v2.1.0/fastdds/discovery/discovery_server.html#discovery-server>`__.

source: The `Simple Discovery Protocol <https://fast-dds.docs.eprosima.com/en/v2.1.0/fastdds/discovery/simple.html>`__ is the standard protocol defined in the `DDS standard <https://www.omg.org/omg-dds-portal/>`__. However, it has known disadvantages in some scenarios.
fr: Le `Simple Discovery Protocol <https://fast-dds.docs.eprosima.com/en/v2.1.0/fastdds/discovery/simple.html>`__ est le protocole standard défini dans le `standard DDS <https:/ /www.omg.org/omg-dds-portal/>`__. Cependant, il présente des inconvénients connus dans certains scénarios.

source: It does not **Scale** efficiently, as the number of exchanged packets increases significantly as new nodes are added.
fr: Il ne **s'adapte pas** efficacement, car le nombre de paquets échangés augmente considérablement à mesure que de nouveaux nœuds sont ajoutés.

source: It requires **multicasting** capabilities that may not work reliably in some scenarios, e.g. WiFi.
fr: Il nécessite des capacités de **multidiffusion** qui peuvent ne pas fonctionner de manière fiable dans certains scénarios, par ex. Wifi.

source: The **Fast DDS Discovery Server** provides a Client-Server Architecture that allows nodes to connect with each other using an intermediate server. Each node functions as a *discovery client*, sharing its info with one or more *discovery servers* and receiving discovery information from it. This reduces discovery-related network traffic and it does not require multicasting capabilities.
fr: Le **Fast DDS Discovery Server** fournit une architecture client-serveur qui permet aux nœuds de se connecter les uns aux autres à l'aide d'un serveur intermédiaire. Chaque nœud fonctionne comme un * client de découverte *, partageant ses informations avec un ou plusieurs * serveurs de découverte * et recevant des informations de découverte de celui-ci. Cela réduit le trafic réseau lié à la découverte et ne nécessite pas de capacités de multidiffusion.

source: These discovery servers can be independent, duplicated or connected with each other in order to create redundancy over the network and avoid having a single point of failure.
fr: Ces serveurs de découverte peuvent être indépendants, dupliqués ou connectés entre eux afin de créer une redondance sur le réseau et éviter d'avoir un point de défaillance unique.

source: Fast DDS Discovery Server v2
fr: Serveur de découverte DDS rapide v2

source: The latest ROS 2 Foxy Fitzroy release (December 2020) included a new version, version 2 of the Fast DDS Discovery Server. This version includes a new filter feature that further reduces the number of discovery messages sent. This version uses the topic of the different nodes to decide if two nodes wish to communicate, or if they can be left unmatched (i.e. not discovering each other). The following figure shows the decrease in discovery messages:
fr: La dernière version de ROS 2 Foxy Fitzroy (décembre 2020) comprenait une nouvelle version, la version 2 du Fast DDS Discovery Server. Cette version inclut une nouvelle fonctionnalité de filtrage qui réduit davantage le nombre de messages de découverte envoyés. Cette version utilise le sujet des différents nœuds pour décider si deux nœuds souhaitent communiquer, ou s'ils peuvent être laissés sans correspondance (c'est-à-dire ne pas se découvrir). La figure suivante montre la diminution des messages de découverte :

source: This architecture reduces the number of messages sent between the server and clients dramatically. In the following graph, the reduction in network traffic over the discovery phase for the `RMF Clinic demonstration <https://github.com/osrf/rmf_demos>`__ is shown:
fr: Cette architecture réduit considérablement le nombre de messages envoyés entre le serveur et les clients. Dans le graphique suivant, la réduction du trafic réseau au cours de la phase de découverte pour la `démonstration RMF Clinic <https://github.com/osrf/rmf_demos>`__ est indiquée :

source: In order to use this functionality, the discovery server can be configured using the `XML configuration for Participants <https://fast-dds.docs.eprosima.com/en/v2.1.0/fastdds/discovery/discovery_server.html#discovery-server>`__. It is also possible to configure the discovery server using the ``fastdds`` `tool <https://fast-dds.docs.eprosima.com/en/v2.1.0/fastddscli/cli/cli.html#discovery>`__ and an `environment variable <https://fast-dds.docs.eprosima.com/en/v2.1.0/fastdds/env_vars/env_vars.html>`__, which is the approach used in this tutorial. For a more detailed explanation about the configuration of the discovery server, visit `the Fast DDS Discovery Server documentation <https://fast-dds.docs.eprosima.com/en/v2.1.0/fastdds/discovery/discovery_server.html#discovery-server>`__.
fr: Afin d'utiliser cette fonctionnalité, le serveur de découverte peut être configuré à l'aide de la `Configuration XML pour les participants <https://fast-dds.docs.eprosima.com/en/v2.1.0/fastdds/discovery/discovery_server.html#discovery -serveur>`__. Il est également possible de configurer le serveur de découverte à l'aide de l'outil ``fastdds`` `<https://fast-dds.docs.eprosima.com/en/v2.1.0/fastddscli/cli/cli.html#discovery>` __ et une `variable d'environnement <https://fast-dds.docs.eprosima.com/en/v2.1.0/fastdds/env_vars/env_vars.html>`__, qui est l'approche utilisée dans ce tutoriel. Pour une explication plus détaillée sur la configuration du serveur de découverte, consultez la documentation du serveur Fast DDS Discovery <https://fast-dds.docs.eprosima.com/en/v2.1.0/fastdds/discovery/discovery_server.html# découverte-serveur>`__.

source: Prerequisites
fr: Conditions préalables

source: This tutorial assumes you have a ROS 2 Foxy (or newer) :doc:`installation <../../../Installation>`. If your installation is using a ROS 2 version lower than Foxy, you cannot use the ``fastdds`` tool. Thus, in order to use the Discovery Server, you can update your repository to use a different Fast DDS version, or configure the discovery server using the `Fast DDS XML QoS configuration <https://fast-dds.docs.eprosima.com/en/v2.1.0/fastdds/discovery/discovery_server.html#discovery-server>`__.
fr: Ce tutoriel suppose que vous avez un ROS 2 Foxy (ou plus récent) :doc:`installation <../../../Installation>`. Si votre installation utilise une version de ROS 2 inférieure à Foxy, vous ne pouvez pas utiliser l'outil ``fastdds``. Ainsi, afin d'utiliser le serveur de découverte, vous pouvez mettre à jour votre référentiel pour utiliser une version différente de Fast DDS, ou configurer le serveur de découverte à l'aide de la configuration `Fast DDS XML QoS <https://fast-dds.docs.eprosima.com /en/v2.1.0/fastdds/discovery/discovery_server.html#discovery-server>`__.

source: Run this tutorial
fr: Exécutez ce didacticiel

source: The ``talker-listener`` ROS 2 demo creates a ``talker`` node that publishes a "hello world" message every second, and a ``listener`` node that listens to these messages.
fr: La démo ``talker-listener`` ROS 2 crée un nœud ``talker`` qui publie un message "hello world" toutes les secondes, et un nœud ``listener`` qui écoute ces messages.

source: By :doc:`sourcing ROS 2 <../../Beginner-CLI-Tools/Configuring-ROS2-Environment>` you will get access to the CLI tool ``fastdds``. This tool gives access to the `discovery tool <https://fast-dds.docs.eprosima.com/en/v2.1.0/fastddscli/cli/cli.html#discovery>`__, which can be used to launch a discovery server. This server will manage the discovery process for the nodes that connect to it.
fr: En :doc:`sourcing ROS 2 <../../Beginner-CLI-Tools/Configuring-ROS2-Environment>` vous aurez accès à l'outil CLI ``fastdds``. Cet outil donne accès à l'`outil de découverte <https://fast-dds.docs.eprosima.com/en/v2.1.0/fastddscli/cli/cli.html#discovery>`__, qui peut être utilisé pour lancer un serveur de découverte. Ce serveur gérera le processus de découverte pour les nœuds qui s'y connectent.

source: Do not forget to :doc:`source ROS 2 <../../Beginner-CLI-Tools/Configuring-ROS2-Environment>` in every new terminal opened.
fr: N'oubliez pas de :doc:`source ROS 2 <../../Beginner-CLI-Tools/Configuring-ROS2-Environment>` dans chaque nouveau terminal ouvert.

source: Setup Discovery Server
fr: Configurer le serveur de découverte

source: Start by launching a discovery server with id 0, port 11811 (default port) and listening on all available interfaces.
fr: Commencez par lancer un serveur de découverte avec l'id 0, le port 11811 (port par défaut) et en écoutant sur toutes les interfaces disponibles.

source: Open a new terminal and run:
fr: Ouvrez un nouveau terminal et exécutez :

source: Launch listener node
fr: Lancer le nœud d'écoute

source: Execute the listener demo, to listen to the ``/chatter`` topic.
fr: Exécutez la démo de l'écouteur, pour écouter le sujet ``/chatter``.

source: In a new terminal, set the environment variable ``ROS_DISCOVERY_SERVER`` to the location of the discovery server. (Do not forget to source ROS 2 in every new terminal)
fr: Dans un nouveau terminal, définissez la variable d'environnement ``ROS_DISCOVERY_SERVER`` sur l'emplacement du serveur de découverte. (N'oubliez pas de sourcer ROS 2 dans chaque nouveau terminal)

source: Launch the listener node. Use the argument ``--remap __node:=listener_discovery_server`` to change the node's name for this tutorial.
fr: Lancez le nœud d'écoute. Utilisez l'argument ``--remap __node:=listener_discovery_server`` pour changer le nom du nœud pour ce tutoriel.

source: This will create a ROS 2 node, that will automatically create a client for the discovery server and connect to the server created previously to perform discovery, rather than using multicast.
fr: Cela créera un nœud ROS 2, qui créera automatiquement un client pour le serveur de découverte et se connectera au serveur créé précédemment pour effectuer la découverte, plutôt que d'utiliser la multidiffusion.

source: Launch talker node
fr: Lancer le nœud de locuteur

source: Open a new terminal and set the ``ROS_DISCOVERY_SERVER`` environment variable as before so that the node starts a discovery client.
fr: Ouvrez un nouveau terminal et définissez la variable d'environnement ``ROS_DISCOVERY_SERVER`` comme précédemment afin que le nœud démarre un client de découverte.

source: You should now see the talker publishing "hello world" messages, and the listener receiving these messages.
fr: Vous devriez maintenant voir le locuteur publier des messages "hello world", et l'auditeur recevoir ces messages.

source: Demonstrate Discovery Server execution
fr: Démontrer l'exécution de Discovery Server

source: So far, there is no evidence that this example and the standard talker-listener example are running differently. To clearly demonstrate this, run another node that is not connected to the discovery server. Run a new listener (listening in ``/chatter`` topic by default) in a new terminal and check that it is not connected to the talker already running.
fr: Jusqu'à présent, rien ne prouve que cet exemple et l'exemple standard de locuteur-auditeur fonctionnent différemment. Pour le démontrer clairement, exécutez un autre nœud qui n'est pas connecté au serveur de découverte. Exécutez un nouvel écouteur (écoute dans le sujet ``/chatter`` par défaut) dans un nouveau terminal et vérifiez qu'il n'est pas connecté au talker déjà en cours d'exécution.

source: The new listener node should not be receiving the "hello world" messages.
fr: Le nouveau nœud d'écoute ne devrait pas recevoir les messages "hello world".

source: To finally verify that everything is running correctly, a new talker can be created using the simple discovery protocol (the default DDS distributed discovery mechanism) for discovery.
fr: Pour enfin vérifier que tout fonctionne correctement, un nouveau locuteur peut être créé à l'aide du protocole de découverte simple (le mécanisme de découverte distribuée par défaut de DDS) pour la découverte.

source: Now you should see the ``simple_listener`` node receiving the "hello world" messages from ``simple_talker`` but not the other messages from ``talker_discovery_server``.
fr: Vous devriez maintenant voir le nœud ``simple_listener`` recevoir les messages "hello world" de ``simple_talker`` mais pas les autres messages de ``talker_discovery_server``.

source: Visualization tool ``rqt_graph``
fr: Outil de visualisation ``rqt_graph``

source: The ``rqt_graph`` tool can be used to verify the nodes and structure of this example. Remember, in order to use ``rqt_graph`` with the discovery server protocol (i.e., to see the ``listener_discovery_server`` and ``talker_discovery_server`` nodes) the ``ROS_DISCOVERY_SERVER`` environment variable must be set before launching it.
fr: L'outil ``rqt_graph`` peut être utilisé pour vérifier les nœuds et la structure de cet exemple. N'oubliez pas que pour utiliser ``rqt_graph`` avec le protocole de serveur de découverte (c'est-à-dire pour voir les nœuds ``listener_discovery_server`` et ``talker_discovery_server``), la variable d'environnement ``ROS_DISCOVERY_SERVER`` doit être définie avant de la lancer.

source: Advance use cases
fr: Cas d'utilisation avancés

source: The following sections show different features of the discovery server that allow you to build a robust discovery server over the network.
fr: Les sections suivantes présentent différentes fonctionnalités du serveur de découverte qui vous permettent de créer un serveur de découverte robuste sur le réseau.

source: Server Redundancy
fr: Redondance de serveur

source: By using ``fastdds`` tool, multiple discovery servers can be created. Discovery clients (ROS nodes) can connect to as many servers as desired. This allows to have a redundant network that will work even if some servers or nodes shut down unexpectedly. The figure below shows a simple architecture that provides server redundancy.
fr: En utilisant l'outil ``fastdds``, plusieurs serveurs de découverte peuvent être créés. Les clients de découverte (nœuds ROS) peuvent se connecter à autant de serveurs que vous le souhaitez. Cela permet d'avoir un réseau redondant qui fonctionnera même si certains serveurs ou nœuds s'arrêtent de manière inattendue. La figure ci-dessous montre une architecture simple qui assure la redondance des serveurs.

source: In several terminals, run the following code to establish a communication with redundant servers.
fr: Dans plusieurs terminaux, exécutez le code suivant pour établir une communication avec des serveurs redondants.

source: ``--server-id N`` means server with id N. When referencing the servers with ``ROS_DISCOVERY_SERVER``, server ``0`` must be in first place and server ``1`` in second place.
fr: ``--server-id N`` signifie serveur avec id N. Lorsque vous référencez les serveurs avec ``ROS_DISCOVERY_SERVER``, le serveur ``0`` doit être en première place et le serveur ``1`` en deuxième place.

source: Now, if one of these servers fails, there will still be discovery capability available and nodes will still discover each other.
fr: Maintenant, si l'un de ces serveurs tombe en panne, il y aura toujours une capacité de découverte disponible et les nœuds continueront à se découvrir.

source: Backup Server
fr: Serveur de sauvegarde

source: The Fast DDS Discovery Server allows creating a server with backup functionality. This allows the server to restore the last state it saved in case of a shutdown.
fr: Le serveur Fast DDS Discovery permet de créer un serveur avec une fonctionnalité de sauvegarde. Cela permet au serveur de restaurer le dernier état qu'il a enregistré en cas d'arrêt.

source: In different terminals, run the following code to establish a communication with a backed-up server.
fr: Dans différents terminaux, exécutez le code suivant pour établir une communication avec un serveur sauvegardé.

source: Several backup files are created in the discovery server's working directory (the directory it was launched in). The two ``SQLite`` files and two ``json`` files contain the information required to start a new server and restore the failed server's state in case of failure, avoiding the need for the discovery process to happen again, and without losing information.
fr: Plusieurs fichiers de sauvegarde sont créés dans le répertoire de travail du serveur de découverte (le répertoire dans lequel il a été lancé). Les deux fichiers ``SQLite`` et les deux fichiers ``json`` contiennent les informations nécessaires pour démarrer un nouveau serveur et restaurer l'état du serveur défaillant en cas de panne, évitant ainsi que le processus de découverte ne se reproduise, et sans perdre information.

source: Discovery partitions
fr: Cloisons de découverte

source: Communication with discovery servers can be split to create virtual partitions in the discovery information. This means that two endpoints will only know about each other if there is a shared discovery server or a network of discovery servers between them. We are going to execute an example with two independent servers. The following figure shows the architecture.
fr: La communication avec les serveurs de découverte peut être divisée pour créer des partitions virtuelles dans les informations de découverte. Cela signifie que deux points de terminaison ne se connaîtront que s'il existe un serveur de découverte partagé ou un réseau de serveurs de découverte entre eux. Nous allons exécuter un exemple avec deux serveurs indépendants. La figure suivante montre l'architecture.

source: With this schema ``Listener 1`` will be connected to ``Talker 1`` and ``Talker 2``, as they share ``Server 1``. ``Listener 2`` will connect with ``Talker 1`` as they share ``Server 2``. But ``Listener 2`` will not hear the messages from ``Talker 2`` because they do not share any discovery server or discovery servers, including indirectly via connections between redundant discovery servers.
fr: Avec ce schéma ``Listener 1`` sera connecté à ``Talker 1`` et ``Talker 2``, car ils partagent ``Server 1``. ``Listener 2`` se connectera avec ``Talker 1`` car ils partagent ``Server 2``. Mais ``Listener 2`` n'entendra pas les messages de ``Talker 2`` car ils ne partagent aucun serveur de découverte ou serveurs de découverte, y compris indirectement via des connexions entre serveurs de découverte redondants.

source: Run the first server listening on localhost with the default port of 11811.
fr: Exécutez le premier serveur à l'écoute sur localhost avec le port par défaut de 11811.

source: In another terminal run the second server listening on localhost using another port, in this case port 11888.
fr: Dans un autre terminal, exécutez le deuxième serveur en écoutant sur localhost en utilisant un autre port, dans ce cas le port 11888.

source: Now, run each node in a different terminal. Use ``ROS_DISCOVERY_SERVER`` environment variable to decide which server they are connected to. Be aware that the `ids must match <https://fast-dds.docs.eprosima.com/en/v2.1.0/fastdds/env_vars/env_vars.html>`__.
fr: Maintenant, exécutez chaque nœud dans un terminal différent. Utilisez la variable d'environnement ``ROS_DISCOVERY_SERVER`` pour décider à quel serveur ils sont connectés. Sachez que les `ids doivent correspondre à <https://fast-dds.docs.eprosima.com/en/v2.1.0/fastdds/env_vars/env_vars.html>`__.

source: We should see how ``Listener 1`` is receiving messages from both talker nodes, while ``Listener 2`` is in a different partition from ``Talker 2`` and so does not receive messages from it.
fr: Nous devrions voir comment ``Listener 1`` reçoit des messages des deux nœuds locuteurs, tandis que ``Listener 2`` est dans une partition différente de ``Talker 2`` et ne reçoit donc pas de messages de celui-ci.

source: Once two endpoints (ROS nodes) have discovered each other, they do not need the discovery server network between them to listen to each other's messages.
fr: Une fois que deux points de terminaison (nœuds ROS) se sont découverts, ils n'ont pas besoin du réseau de serveurs de découverte entre eux pour écouter les messages de l'autre.

source: Compare Fast DDS Discovery Server with Simple Discovery Protocol
fr: Comparez Fast DDS Discovery Server avec Simple Discovery Protocol

source: In order to compare executing nodes using the Simple Discovery Protocol (the default DDS mechanism for distributed discovery) or the discovery server, two scripts that execute a talker and many listeners and analyze the network traffic during this time are provided. For this experiment, ``tshark`` is required to be installed on your system. The configuration file is mandatory in order to avoid using intraprocess mode.
fr: Afin de comparer les nœuds en cours d'exécution à l'aide du protocole de découverte simple (le mécanisme DDS par défaut pour la découverte distribuée) ou du serveur de découverte, deux scripts qui exécutent un locuteur et de nombreux écouteurs et analysent le trafic réseau pendant ce temps sont fournis. Pour cette expérience, ``tshark`` doit être installé sur votre système. Le fichier de configuration est obligatoire pour éviter d'utiliser le mode intraprocess.

source: These scripts require a discovery server closure feature that is only available from versions newer than the version provided in ROS 2 Foxy. In order to use this functionality, compile ROS 2 with Fast DDS v2.1.0 or higher.
fr: Ces scripts nécessitent une fonctionnalité de fermeture de serveur de découverte qui n'est disponible qu'à partir de versions plus récentes que la version fournie dans ROS 2 Foxy. Pour utiliser cette fonctionnalité, compilez ROS 2 avec Fast DDS v2.1.0 ou supérieur.
