Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/The-ROS2-Project/Governance/ROS2-TSC-Charter.po
Languages: fr

source: TSC membership does not influence the handling of code contributions, which continues to follow the established federated development model in which contributions are made by pull request and reviewed and approved by the appropriate maintainer(s) prior to merging. Commit rights and maintainer status are earned through code contributions to the relevant package(s).
fr: L'adhésion au TSC n'influence pas le traitement des contributions au code, qui continue de suivre le modèle de développement fédéré établi dans lequel les contributions sont apportées par demande d'extraction et examinées et approuvées par le ou les responsables appropriés avant la fusion. Les droits d'engagement et le statut de responsable sont obtenus grâce aux contributions de code au(x) package(s) concerné(s).

source: Confidentiality
fr: Confidentialité

source: The TSC is set up to transparently guide the community. However, to facilitate effective communication, the ability to have some confidential discussions is important. TSC members should share confidential information within the TSC and other members are expected to respect that confidentiality. The following are rules regarding confidentiality in TSC communications, events, and meetings. All other communications may be made freely available to the broader community for transparency. Breaking the rules in this section is sufficient, but not necessary, causality for expulsion of the representative or member company, depending on the nature of the infraction, from the TSC by a standard motion and vote.
fr: Le TSC est mis en place pour guider la communauté de manière transparente. Cependant, pour faciliter une communication efficace, la possibilité d'avoir des discussions confidentielles est importante. Les membres du TSC doivent partager des informations confidentielles au sein du TSC et les autres membres doivent respecter cette confidentialité. Les règles suivantes concernent la confidentialité des communications, des événements et des réunions du TSC. Toutes les autres communications peuvent être mises gratuitement à la disposition de la communauté au sens large à des fins de transparence. Enfreindre les règles de cette section est une cause suffisante, mais pas nécessaire, pour l'expulsion du représentant ou de la société membre, selon la nature de l'infraction, du TSC par une motion et un vote standard.

source: Statements made by individuals in discussions surrounding a vote or topic of contention which are not reflected in the publicly posted minutes should be considered confidential.
fr: Les déclarations faites par des individus lors de discussions entourant un vote ou un sujet de discorde qui ne sont pas reflétées dans les procès-verbaux publiés publiquement doivent être considérées comme confidentielles.

source: Statements made by individuals regarding companies, research groups, individuals, or other entities for which they are not also members should be considered confidential. This is exempt when the entity in question is a member and in attendance to the TSC meeting or event.
fr: Les déclarations faites par des individus concernant des entreprises, des groupes de recherche, des individus ou d'autres entités dont ils ne sont pas également membres doivent être considérées comme confidentielles. Ceci est exonéré lorsque l'entité en question est membre et assiste à la réunion ou à l'événement du TSC.

source: Statements made in obvious confidence or explicitly stated as confidential regarding their own entity or opinions should remain confidential.
fr: Les déclarations faites à titre confidentiel ou explicitement déclarées confidentielles concernant leur propre entité ou leurs opinions doivent rester confidentielles.

source: Rule a-c may be waived by the TSC member who made the statement only by explicit verbal or written approval. If the existence of a waiver is put into question by either party, this waiver is considered nullified.
fr: La règle a-c peut être annulée par le membre du TSC qui a fait la déclaration uniquement par approbation verbale ou écrite explicite. Si l'existence d'une renonciation est remise en cause par l'une ou l'autre des parties, cette renonciation est considérée comme nulle.

source: Affiliates of TSC member organizations or guests of TSC events privy to confidential information will be held to the same standards set out in this section. It is the responsibility of the TSC member issuing invitations or sharing information to inform relevant parties of these confidentiality requirements. If this policy is broken, the TSC member is in full responsibility for the disclosure.
fr: Les affiliés des organisations membres du TSC ou les invités des événements du TSC ayant accès à des informations confidentielles seront tenus de respecter les mêmes normes énoncées dans cette section. Il est de la responsabilité du membre du TSC émettant des invitations ou partageant des informations d'informer les parties concernées de ces exigences de confidentialité. Si cette politique n'est pas respectée, le membre du TSC est entièrement responsable de la divulgation.
