Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/The-ROS2-Project/Governance/ROS2-TSC-Charter.po
Languages: fr

source: ROS 2 Technical Steering Committee Charter
fr: Charte du comité de pilotage technique ROS 2

source: Organization
fr: Organisation

source: Table of Contents
fr: Table des matières

source: Guiding Principles & Rationale
fr: Principes directeurs et justification

source: The ROS 2 Project (“ROS 2” or “the project”) operates openly, such that plans, decisions, and processes are freely available to the general public in a timely manner. All interested parties should have access to information about the project direction and timeline, from casual observers to companies planning product releases.
fr: Le projet ROS 2 (« ROS 2 » ou « le projet ») fonctionne ouvertement, de sorte que les plans, les décisions et les processus sont librement accessibles au grand public en temps opportun. Toutes les parties intéressées doivent avoir accès aux informations sur l'orientation et le calendrier du projet, des observateurs occasionnels aux entreprises qui planifient des versions de produits.

source: Responsibilities of the TSC
fr: Responsabilités du TSC

source: The ROS 2 Technical Steering Committee (“TSC”) is responsible for the technical direction that the project takes. The TSC makes decisions on the project roadmap, developer policies and process, release schedule, and other matters that require technical supervision in ROS 2. It is intended that these decisions be final and authoritative, but successful implementation of any decision depends on commitment of the necessary resources from the organizations represented on the TSC.
fr: Le comité de pilotage technique du ROS 2 (« TSC ») est responsable de la direction technique que prend le projet. Le TSC prend des décisions sur la feuille de route du projet, les politiques et processus de développement, le calendrier de publication et d'autres questions qui nécessitent une supervision technique dans ROS 2. Il est prévu que ces décisions soient définitives et faisant autorité, mais la mise en œuvre réussie de toute décision dépend de l'engagement du ressources nécessaires de la part des organisations représentées au TSC.

source: The TSC aims to ensure the following characteristics of the project:
fr: Le TSC vise à garantir les caractéristiques suivantes du projet :

source: **Independent and transparent governance**
fr: **Gouvernance indépendante et transparente**

source: The project is driven by the community that contributes to and uses the resulting software, with Open Robotics as the founding project sponsor.
fr: Le projet est piloté par la communauté qui contribue et utilise le logiciel résultant, avec Open Robotics comme sponsor fondateur du projet.

source: Those individuals and organizations that are contributing the labor and other resources to develop the project are in regular contact with each other to coordinate their plans and activities.
fr: Les individus et les organisations qui contribuent la main-d'œuvre et d'autres ressources pour développer le projet sont en contact régulier les uns avec les autres pour coordonner leurs plans et activités.

source: **Pace & quality**
fr: **Rapide et qualité**

source: The project advances as quickly as possible given the available resources and without sacrificing quality in the resulting software.
fr: Le projet avance le plus rapidement possible compte tenu des ressources disponibles et sans sacrifier la qualité du logiciel résultant.

source: **Policies**
fr: **Stratégies**

source: Contributions to the project are received, reviewed, and tested in a manner that is consistent with the requirements for widespread adoption of the resulting software in industry.
fr: Les contributions au projet sont reçues, examinées et testées d'une manière conforme aux exigences d'adoption généralisée du logiciel résultant dans l'industrie.

source: Establishment of the TSC
fr: Création du CST

source: The TSC is made up of individuals who contribute materially to the project and/or individuals who represent organizations that contribute materially to the project and/or selected community representatives. The TSC seeks to coordinate the contributions that members and their organizations are voluntarily making to the project. The TSC cannot compel or oblige any action on the part of a member, his or her organization, or that organization’s employees.
fr: Le TSC est composé d'individus qui contribuent matériellement au projet et/ou d'individus qui représentent des organisations qui contribuent matériellement au projet et/ou de représentants sélectionnés de la communauté. Le TSC cherche à coordonner les contributions que les membres et leurs organisations apportent volontairement au projet. Le TSC ne peut contraindre ou obliger une action de la part d'un membre, de son organisation ou des employés de cette organisation.

source: Material contribution is the commitment of a minimum level of effort toward developing software and/or documentation that is contributed to the project under the appropriate open source license. This contribution may be in the form of in-kind labor and/or outsourced work. No fees or payments beyond material contribution to the project are required for TSC membership.
fr: La contribution matérielle est l'engagement d'un niveau minimum d'effort vers le développement de logiciels et/ou de documentation qui est contribué au projet sous la licence open source appropriée. Cette contribution peut prendre la forme de travail en nature et/ou de travail externalisé. Aucun frais ou paiement au-delà de la contribution matérielle au projet n'est requis pour l'adhésion au TSC.

source: The minimum level of effort commitment required to qualify for TSC membership is **1 full-time equivalent (FTE)**. This level may be changed by the TSC via a standard TSC motion and vote.
fr: Le niveau minimum d'effort requis pour être admissible à l'adhésion au TSC est de **1 équivalent temps plein (ETP)**. Ce niveau peut être modifié par le TSC via une motion et un vote standard du TSC.

source: The TSC must have at least three members.
fr: Le TSC doit être composé d'au moins trois membres.

source: TSC membership is not time-limited.
fr: L'adhésion au TSC n'est pas limitée dans le temps.

source: There is no maximum size for the TSC. A size limit may be established by the TSC via a standard TSC motion and vote.
fr: Il n'y a pas de taille maximale pour le TSC. Une limite de taille peut être établie par le TSC via une motion et un vote standard du TSC.

source: The TSC may add additional members to the TSC by a standard TSC motion and vote. When considering the addition of a new member, the TSC is responsible for determining whether that potential member’s material contributions to the project are appropriate and sufficient to qualify for membership.
fr: Le TSC peut ajouter des membres supplémentaires au TSC par une motion et un vote standard du TSC. Lors de l'examen de l'ajout d'un nouveau membre, le TSC est chargé de déterminer si les contributions matérielles de ce membre potentiel au projet sont appropriées et suffisantes pour être admissible à l'adhésion.

source: A TSC member may be removed from the TSC by voluntary resignation, by a standard TSC motion and vote, or in accordance with the following participation rule:
fr: Un membre du TSC peut être retiré du TSC par démission volontaire, par une motion et un vote standard du TSC, ou conformément à la règle de participation suivante :

source: In the case where an individual TSC member -- within any three-month period -- attends fewer than 1⁄3 of the regularly scheduled meetings, does not participate in TSC discussions, and does not participate in TSC votes, the member shall be automatically removed from the TSC.
fr: Dans le cas où un membre individuel du TSC - au cours d'une période de trois mois - assiste à moins d'un tiers des réunions régulièrement programmées, ne participe pas aux discussions du TSC et ne participe pas aux votes du TSC, le membre sera automatiquement retiré du TSC.

source: The TSC will periodically review the material contributions of TSC members to ensure that they continue to meet the minimum level of effort established by the TSC for TSC membership. In the case where a TSC member’s material contributions fall below that minimum level, the TSC may decide to remove that TSC member by a standard TSC motion and vote.
fr: Le TSC examinera périodiquement les contributions matérielles des membres du TSC pour s'assurer qu'ils continuent de respecter le niveau d'effort minimum établi par le TSC pour l'adhésion au TSC. Dans le cas où les contributions matérielles d'un membre du TSC tombent en dessous de ce niveau minimum, le TSC peut décider de retirer ce membre du TSC par une motion et un vote standard du TSC.

source: With the exception of Open Robotics, there may be at most one TSC member from any single employer.
fr: À l'exception d'Open Robotics, il peut y avoir au plus un membre TSC d'un même employeur.

source: A TSC member may designate a proxy to participate in the TSC on that member’s behalf.
fr: Un membre du TSC peut désigner un mandataire pour participer au TSC en son nom.

source: TSC membership is public; the membership list is published via a website that Open Robotics maintains and updates periodically.
fr: L'adhésion au TSC est publique; la liste des membres est publiée via un site Web qu'Open Robotics maintient et met à jour périodiquement.

source: Open Robotics, as the founding sponsor of the project, has permanent membership on the TSC, hosts TSC meetings, and provides a representative to serve as chairperson.
fr: Open Robotics, en tant que sponsor fondateur du projet, est membre permanent du TSC, organise les réunions du TSC et fournit un représentant pour occuper le poste de président.

source: Any organization or individual may apply for membership on the TSC by email to info@openrobotics.org. The ROS 2 TSC applicant intake process is :doc:`here <ROS2-TSC-Intake-process>`.
fr: Toute organisation ou personne peut demander à devenir membre du TSC par courrier électronique à info@openrobotics.org. Le processus d'admission des candidats ROS 2 TSC est :doc:`ici <ROS2-TSC-Intake-process>`.

source: Community representation
fr: Représentation communautaire

source: The TSC shall include a number of individuals who represent the broader ROS community rather than any particular organisation or individual.
fr: Le TSC doit inclure un certain nombre de personnes qui représentent la communauté ROS au sens large plutôt qu'une organisation ou un individu en particulier.

source: The number of community representatives shall be set by a decision of the TSC. However, this number shall not be less than three, and shall also not be less than 10% of the number of non-community representative members in the TSC.
fr: Le nombre de représentants de la communauté est fixé par décision du CST. Toutefois, ce nombre ne doit pas être inférieur à trois et ne doit pas non plus être inférieur à 10 % du nombre de membres non représentatifs de la communauté au sein du CST.

source: A community representative serves for two years.
fr: Un représentant de la communauté siège pendant deux ans.

source: The term of service begins on the 1st of December immediately following an election.
fr: Le mandat commence le 1er décembre suivant immédiatement une élection.

source: Fifty percent (50%) of the initial set of community representatives shall serve for only one year in their first term to stagger the community representative terms.
fr: Cinquante pour cent (50 %) du groupe initial de représentants de la communauté ne serviront que pendant un an au cours de leur premier mandat pour échelonner les mandats des représentants de la communauté.

source: A community representative may be removed from the TSC earlier than two years if one of the following conditions is met:
fr: Un représentant de la communauté peut être retiré du TSC avant deux ans si l'une des conditions suivantes est remplie :

source: The community representative requests to stand down voluntarily.
fr: Le représentant de la communauté demande à se retirer volontairement.

source: The TSC chairperson deems that the community representative has behaved inappropriately. The TSC chairperson must make public the reason for standing down the community representative.
fr: Le président du TSC estime que le représentant de la communauté s'est comporté de manière inappropriée. Le président du TSC doit rendre public le motif de la révocation du représentant de la communauté.

source: When a community representative is removed from the TSC:
fr: Lorsqu'un représentant de la communauté est retiré du TSC :

source: If the number of community representatives is below the specified minimum, the TSC shall recommend and the chairperson shall appoint a new community representative to serve the remainder of the removed community representative's term.
fr: Si le nombre de représentants de la communauté est inférieur au minimum spécifié, le TSC recommandera et le président nommera un nouveau représentant de la communauté pour le reste du mandat du représentant de la communauté révoqué.

source: If the number of community representatives is above the specified minimum, no special action shall be taken.
fr: Si le nombre de représentants de la communauté est supérieur au minimum spécifié, aucune mesure particulière ne sera prise.

source: A community representative is selected via an open election.
fr: Un représentant de la communauté est sélectionné via une élection ouverte.

source: An individual is eligible to stand for election as a community representative if:
fr: Une personne est éligible pour se présenter aux élections en tant que représentant de la communauté si :

source: The maximum number of community representatives from any single organisation is one.
fr: Le nombre maximum de représentants communautaires d'une même organisation est d'un.

source: The individual has voluntarily nominated themselves.
fr: L'individu s'est volontairement proposé.

source: That individual's nomination has not been vetoed by the TSC chairperson.
fr: La nomination de cette personne n'a pas fait l'objet d'un veto de la part du président du TSC.

source: Community representative elections shall be held in the following manner:
fr: Les élections des représentants de la communauté se déroulent de la manière suivante :

source: On the first Tuesday of September a ROS Discourse post will be made asking for TSC member nominations.
fr: Le premier mardi de septembre, un message ROS Discourse sera publié pour demander les nominations des membres du TSC.

source: The nomination period will last two weeks until the third Tuesday in September.
fr: La période de mise en candidature durera deux semaines jusqu'au troisième mardi de septembre.

source: Prospective TSC member nominees must self nominate, but the community is encouraged to use the nomination Discourse thread to encourage other community members to run.
fr: Les membres potentiels du TSC nominés doivent se nommer eux-mêmes, mais la communauté est encouragée à utiliser le fil de discussion de nomination pour encourager les autres membres de la communauté à se présenter.

source: To self-nominate prospective TSC members must submit a candidate packet that includes a written biography, headshot, a written statement, and optionally a short video introduction.
fr: Pour se nommer eux-mêmes, les membres potentiels du TSC doivent soumettre un dossier de candidature comprenant une biographie écrite, une photo de la tête, une déclaration écrite et éventuellement une courte introduction vidéo.

source: The written statement shall state why the candidate believes themselves suitable and what they intend to accomplish as a community representative.
fr: La déclaration écrite doit indiquer pourquoi le candidat s'estime apte et ce qu'il entend accomplir en tant que représentant de la communauté.

source: Between the third Tuesday in September and the first Tuesday in October the ROS 2 TSC will review the candidates for any objections or conflicts of interest. The TSC chair will prepare a ROS Discourse post that includes all of the candidate packets.
fr: Entre le troisième mardi de septembre et le premier mardi d'octobre, le TSC ROS 2 examinera les candidats pour toute objection ou conflit d'intérêts. Le président du TSC préparera un article de discours ROS qui comprendra tous les paquets candidats.

source: On the first Tuesday of October the candidate packets will be posted to ROS Discourse along with with the online balloting form.
fr: Le premier mardi d'octobre, les dossiers des candidats seront publiés sur ROS Discourse avec le formulaire de vote en ligne.

source: The period between the start of the election process and the close of voting may be used for campaigning by candidates.
fr: La période entre le début du processus électoral et la clôture du scrutin peut être utilisée pour faire campagne par les candidats.

source: The eligibility criteria for voters shall be determined by the TSC prior to commencing an election and clearly stated in the election information from the start of nominations until the close of voting.
fr: Les critères d'éligibilité des électeurs doivent être déterminés par le TSC avant le début d'une élection et clairement indiqués dans les informations électorales depuis le début des nominations jusqu'à la clôture du vote.

source: Balloting will be open from the first Tuesday in October until the end of the first full day of ROSCon.
fr: Le scrutin sera ouvert du premier mardi d'octobre jusqu'à la fin de la première journée complète de ROSCon.

source: Balloting shall be conducted using the Condorcet method.
fr: Le scrutin se déroule selon la méthode Condorcet.

source: Candidates are encouraged, but not required, to attend ROSCon.
fr: Les candidats sont encouragés, mais pas obligés, à assister à ROSCon.

source: The results of the election shall be announced during the closing session of ROSCon along with an announcement post on ROS Discourse.
fr: Les résultats de l'élection seront annoncés lors de la session de clôture de ROSCon avec un message d'annonce sur ROS Discourse.

source: In the event that ROSCon is not held during a given calendar year for any reason, then the foregoing election process shall still be followed, with procedural modifications as necessary, at a time of the TSC’s choosing, but with the results being announced no later than the 15th of December.
fr: Dans le cas où le ROSCon n'a pas lieu au cours d'une année civile donnée pour quelque raison que ce soit, le processus d'élection ci-dessus doit toujours être suivi, avec les modifications de procédure nécessaires, au moment choisi par le TSC, mais les résultats étant annoncés au plus tard le le 15 décembre.

source: Meetings
fr: Réunions

source: The TSC meets regularly in-person and/or via an electronic means.
fr: Le TSC se réunit régulièrement en personne et/ou par voie électronique.

source: A minimum of three TSC members is required to establish a quorum to hold a TSC meeting.
fr: Un minimum de trois membres du TSC est requis pour établir un quorum pour tenir une réunion du TSC.

source: Participation in a TSC meeting is open to current members. Other organizations or individuals may be invited by Open Robotics to observe a TSC meeting. TSC members may suggest to Open Robotics the names of individuals or organizations for consideration as potential observers.
fr: La participation à une réunion du TSC est ouverte aux membres actuels. D'autres organisations ou individus peuvent être invités par Open Robotics à observer une réunion du TSC. Les membres du TSC peuvent suggérer à Open Robotics les noms d'individus ou d'organisations à considérer en tant qu'observateurs potentiels.

source: Minutes from each TSC meeting are published by Open Robotics shortly after the meeting. TSC meetings are not broadcast or recorded verbatim, but they should be treated as public discussions.
fr: Les procès-verbaux de chaque réunion du TSC sont publiés par Open Robotics peu de temps après la réunion. Les réunions du TSC ne sont pas diffusées ou enregistrées textuellement, mais elles doivent être traitées comme des discussions publiques.

source: Working Groups
fr: Groupes de travail

source: The TSC may establish one or more working groups (“WGs”) to discuss specific topics in greater detail than is practical for the TSC as a whole.
fr: Le TSC peut établir un ou plusieurs groupes de travail (« GT ») pour discuter de sujets spécifiques plus en détail que ce qui est pratique pour le TSC dans son ensemble.

source: A WG may be established by the TSC via standard TSC motion and vote. At the time of such establishment, the TSC is responsible for deciding the name, scope, and initial chair of the new WG.
fr: Un groupe de travail peut être établi par le TSC via une motion et un vote standard du TSC. Au moment de cette création, le TSC est chargé de décider du nom, de la portée et du président initial du nouveau groupe de travail.

source: A WG may be dissolved by the TSC via standard TSC motion and vote.
fr: Un groupe de travail peut être dissous par le TSC via une motion et un vote standard du TSC.

source: Each WG must be chaired by a TSC member. The chair of a WG is responsible for all aspects of that WG’s operation, including membership, meeting schedule, and decision-making.
fr: Chaque GT doit être présidé par un membre du TSC. Le président d'un groupe de travail est responsable de tous les aspects du fonctionnement de ce groupe de travail, y compris la composition, le calendrier des réunions et la prise de décision.

source: A WG may bring findings and/or recommendations to the TSC for discussion and/or decision.
fr: Un groupe de travail peut présenter des conclusions et/ou des recommandations au TSC pour discussion et/ou décision.

source: Voting
fr: Vote

source: The TSC aims to operate by consensus. When consensus cannot be reached, decisions should in most cases be made by resource commitment: e.g., if a member wants to include a feature on the roadmap but the rest of the TSC is uninterested, then that member can choose to commit his or her organization’s contribution to development of the desired feature and thereby have it included in the roadmap. In cases where consensus cannot be reached and resource commitment is insufficient or inappropriate, simple majority voting is used, with each member having one vote.
fr: Le TSC vise à fonctionner par consensus. Lorsqu'un consensus ne peut être atteint, les décisions doivent dans la plupart des cas être prises par l'engagement de ressources : par exemple, si un membre souhaite inclure une fonctionnalité dans la feuille de route mais que le reste du TSC n'est pas intéressé, alors ce membre peut choisir d'engager les ressources de son organisation. contribuer au développement de la fonctionnalité souhaitée et ainsi l'inclure dans la feuille de route. Dans les cas où le consensus ne peut être atteint et que l'engagement des ressources est insuffisant ou inapproprié, le vote à la majorité simple est utilisé, chaque membre disposant d'une voix.

source: Project Roles
fr: Rôles du projet
