Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/The-ROS2-Project/Governance/ROS2-TSC-Intake-process.po
Languages: fr

source: ROS 2 TSC applicant intake process
fr: Processus d'admission des candidats ROS 2 TSC

source: Objectives
fr: Objectifs

source: Increase the pool of high quality applicants
fr: Augmenter le vivier de candidats de qualité

source: Help applicants understand what the ROS 2 TSC expects from an application
fr: Aider les candidats à comprendre ce que le ROS 2 TSC attend d'une candidature

source: Help ROS 2 TSC better evaluate the applicants
fr: Aidez ROS 2 TSC à mieux évaluer les candidats

source: Process
fr: Processus

source: Applicant inquires about joining TSC via info@openrobotics.org per :doc:`ROS 2 Governance <../Governance>`.
fr: Le candidat se renseigne sur l'adhésion au TSC via info@openrobotics.org par :doc:`ROS 2 Governance <../Governance>`.

source: Open Robotics responds with the application questions (below).
fr: Open Robotics répond avec les questions d'application (ci-dessous).

source: Applicant completes and sends application to info@openrobotics.org.
fr: Le candidat remplit et envoie sa candidature à info@openrobotics.org.

source: Open Robotics does an initial review and gives applicant feedback if warranted. For example:
fr: Open Robotics effectue un examen initial et donne des commentaires au candidat si nécessaire. Par exemple:

source: "consider developing your track record of contribution and then re-apply."
fr: "Envisagez de développer vos antécédents de contribution, puis postulez à nouveau."

source: "What you contribute to is not part of ROS 2 Common Packages (REP 2005). Consider getting it added before proceeding with application for more favorable reception."
fr: "Ce à quoi vous contribuez ne fait pas partie des packages communs ROS 2 (REP 2005). Pensez à l'ajouter avant de procéder à la demande d'un accueil plus favorable."

source: If application seems worthwhile, Open Robotics passes it to TSC member to "sponsor".
fr: Si la candidature semble intéressante, Open Robotics la transmet au membre du TSC pour le "sponsoriser".

source: Open Robotics can ask TSC for volunteer(s) per applicant or Open Robotics could have list of TSC members who already volunteered to support this function.
fr: Open Robotics peut demander au TSC des bénévoles par candidat ou Open Robotics pourrait avoir une liste des membres du TSC qui se sont déjà portés volontaires pour soutenir cette fonction.

source: Sponsor arranges short 1:1 with applicant to talk about ROS 2 TSC role and responsibilities. Afterwards the applicant can:
fr: Le sponsor organise un court 1: 1 avec le candidat pour parler du rôle et des responsabilités de ROS 2 TSC. Ensuite, le demandeur peut :

source: proceed with application as-is
fr: procéder à l'application telle quelle

source: revise application
fr: réviser la demande

source: delay submission e.g. to develop their contribution track record
fr: retarder la soumission, par ex. développer leur historique de contribution

source: decide not to proceed.
fr: décider de ne pas continuer.

source: [two weeks before TSC meeting]: applications are distributed to TSC members for independent review
fr: [deux semaines avant la réunion du TSC] : les candidatures sont distribuées aux membres du TSC pour un examen indépendant

source: If 2 TSC members respond agreeing to "sponsor" applicant then these proceed to the next step. Applicant should "minimally meet" TSC member criteria before addressing TSC.
fr: Si 2 membres du TSC répondent en acceptant de "sponsoriser" le candidat, ils passent à l'étape suivante. Le candidat doit "répondre au minimum" aux critères de membre du TSC avant de s'adresser au TSC.

source: Otherwise Open Robotics informs applicant "Not at this time, please consider applying again later with more contribution history."
fr: Sinon, Open Robotics informe le candidat "Pas pour le moment, veuillez envisager de postuler à nouveau plus tard avec plus d'historique de contribution."

source: [in TSC meeting] Applicant or Sponsor can address TSC. 5 minute presentation with up to 5 additional minutes of Q&A.
fr: [en réunion TSC] Le demandeur ou le sponsor peut s'adresser au TSC. Présentation de 5 minutes avec jusqu'à 5 minutes supplémentaires de questions-réponses.

source: [in TSC meeting]: Synchronous private/unsharable discussion of the applications after applicant(s) leave the call. TSC members are to be discrete about what has been discussed.
fr: [en réunion TSC] : Discussion privée/non partageable synchrone des candidatures après que le ou les candidats ont quitté l'appel. Les membres du TSC doivent être discrets sur ce qui a été discuté.

source: [after TSC meeting]: Asynchronous vote on the applicants completed in around 10 days
fr: [après la réunion du TSC] : vote asynchrone sur les candidats terminé en 10 jours environ

source: Open Robotics notifies applicant(s) of TSC decision.
fr: Open Robotics informe le(s) demandeur(s) de la décision du TSC.

source: Questionnaire for the applicant
fr: Questionnaire pour le demandeur

source: The following is to be provided to the applicant by Open Robotics via email in response to them expressing interest in joining the ROS 2 TSC.
fr: Les éléments suivants doivent être fournis au candidat par Open Robotics par e-mail en réponse à leur souhait de rejoindre le ROS 2 TSC.

source: To which aspect(s) of ROS 2 do you plan to make open source contributions?
fr: À quel(s) aspect(s) de ROS 2 prévoyez-vous d'apporter des contributions open source ?

source: For example contributions to `ROS 2 Common Packages <https://www.ros.org/reps/rep-2005.html>`__.
fr: Par exemple, les contributions à `ROS 2 Common Packages <https://www.ros.org/reps/rep-2005.html>`__.

source: Are you already making those contributions? Since when? Please explain your history of contribution. If you have none, consider applying after developing some history of contribution.
fr: Faites-vous déjà ces contributions? Depuis quand? Veuillez expliquer votre historique de contribution. Si vous n'en avez pas, envisagez de postuler après avoir développé un historique de contribution.

source: Are there any other kinds of contributions that you are already making or plan? Education, evangelism, et al.?
fr: Y a-t-il d'autres types de cotisations que vous versez ou prévoyez déjà? Éducation, évangélisation, etc. ?

source: What level of effort do you plan to dedicate to making those contributions?
fr: Quel niveau d'effort prévoyez-vous de consacrer à ces contributions ?

source: How many FTE (full time equivalent) people will be making those contributions?
fr: Combien de personnes ETP (équivalent temps plein) apporteront ces contributions ?

source: How many FTE are already doing so?
fr: Combien d'ETP le font déjà ?

source: Are these contributions already happening now, and if so, can you point to results produced so far?
fr: Ces contributions se produisent-elles déjà maintenant, et si oui, pouvez-vous indiquer les résultats produits jusqu'à présent ?

source: For example describe or attach details of your contributions to `ROS 2 Common Packages <https://www.ros.org/reps/rep-2005.html>`__.
fr: Par exemple, décrivez ou joignez les détails de vos contributions à `ROS 2 Common Packages <https://www.ros.org/reps/rep-2005.html>`__.

source: Links to your contributions are helpful.
fr: Les liens vers vos contributions sont utiles.

source: How do these contributions benefit your business or organization?
fr: Comment ces contributions profitent-elles à votre entreprise ou organisation ?

source: Why do you do this?
fr: Pourquoi fais-tu cela?

source: Evaluation Guide for TSC members
fr: Guide d'évaluation pour les membres du TSC

source: The following is suggested guidance for TSC members to evaluate applicants:
fr: Les conseils suivants sont suggérés aux membres du TSC pour évaluer les candidats :

source: Are the contributions useful to the community?
fr: Les contributions sont-elles utiles à la communauté ?

source: Are the contributions to `ROS 2 Common Packages <https://www.ros.org/reps/rep-2005.html>`__?
fr: Les contributions à `ROS 2 Common Packages <https://www.ros.org/reps/rep-2005.html>`__ ?

source: Give more credence to past contributions
fr: Donner plus de crédit aux contributions passées

source: Proposed future contributions are important but consider past contribution to evaluate how credible those plans are.
fr: Les contributions futures proposées sont importantes, mais tenez compte des contributions passées pour évaluer la crédibilité de ces plans.

source: Are the contributions ones that the community and TSC values?
fr: Les contributions sont-elles celles que la communauté et TSC apprécient ?

source: Are the contributions to ROS 2 Common Packages (REP 2005)?
fr: Les contributions au ROS 2 Common Packages (REP 2005) ?

source: Emphasis is on what they’ve contributed already, not what they promise to do. If they don’t have enough evidence of contribution, encourage them to apply after developing their contribution track record.
fr: L'accent est mis sur ce qu'ils ont déjà contribué, pas sur ce qu'ils promettent de faire. S'ils n'ont pas suffisamment de preuves de contribution, encouragez-les à postuler après avoir développé leurs antécédents de contribution.

source: This answer helps you evaluate how much focus and investment it already has and whether it seems likely to continue.
fr: Cette réponse vous aide à évaluer le degré d'attention et d'investissement dont il dispose déjà et s'il semble susceptible de se poursuivre.

source: Do you see that the applicant has a vested interest in this work and the success of ROS 2? Or does it seem they seek to join merely for prestige and marketing?
fr: Voyez-vous que le candidat a un intérêt direct dans ce travail et le succès de ROS 2 ? Ou semble-t-il qu'ils cherchent à se joindre simplement pour le prestige et le marketing ?
