Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/How-To-Guides/Releasing/First-Time-Release.po
Languages: fr

source: First Time Release
fr: Première sortie

source: This guide explains how to release ROS 2 packages that you have not released before. Due to numerous options available when releasing ROS packages, this guide intends to cover the most common scenario and does not cover every corner-case.
fr: Ce guide explique comment publier des packages ROS 2 que vous n'avez pas encore publiés. En raison des nombreuses options disponibles lors de la publication des packages ROS, ce guide vise à couvrir le scénario le plus courant et ne couvre pas tous les cas particuliers.

source: Table of Contents
fr: Table des matières

source: Be part of a release team
fr: Faire partie d'une équipe de publication

source: You must be part of a :ref:`release team <what-is-a-release-team>`. If you are not part of a release team yet, follow either:
fr: Vous devez faire partie d'une :ref:`équipe de publication <what-is-a-release-team>`. Si vous ne faites pas encore partie d'une équipe de publication, suivez soit :

source: :ref:`Join a release team <join-a-release-team>`
fr: :ref:`Rejoindre une équipe de publication <join-a-release-team>`

source: :ref:`Start a new release team <start-a-new-release-team>`
fr: :ref:`Démarrer une nouvelle équipe de publication <start-a-new-release-team>`

source: Create a new release repository
fr: Créer un nouveau référentiel de version

source: You need a :ref:`release repository <what-is-a-release-repository>` to release a package. Follow :ref:`Create a new release repository <create-a-new-release-repository>`.
fr: Vous avez besoin d'un :ref:`release repository <what-is-a-release-repository>` pour publier un paquet. Suivez :ref:`Créez un nouveau dépôt de version <create-a-new-release-repository>`.

source: Install dependencies
fr: Installer les dépendances

source: Install tools that you will use in the upcoming steps according to your platform:
fr: Installez les outils que vous utiliserez dans les prochaines étapes en fonction de votre plateforme :

source: Debian (eg. Ubuntu)
fr: Debian (par exemple Ubuntu)

source: RPM (eg. RHEL)
fr: RPM (ex. RHEL)

source: Other
fr: Autre

source: Set Up a Personal Access Token
fr: Configurer un jeton d'accès personnel

source: If the file ``~/.config/bloom`` exists on your computer, it is likely that you have done this before so you should skip this section.
fr: Si le fichier ``~/.config/bloom`` existe sur votre ordinateur, il est probable que vous l'ayez déjà fait auparavant, vous devriez donc ignorer cette section.

source: During the release process, multiple HTTPS Git operations will be performed that require password authentication. To avoid being repeatedly asked for a password, a `Personal Access Token (PAT) <https://docs.github.com/en/authentication/keeping-your-account-and-data-secure/creating-a-personal-access-token>`_ will be set up. If you have multi-factor authentication setup on your GitHub account, you **must** setup a Personal Access Token.
fr: Au cours du processus de publication, plusieurs opérations HTTPS Git seront effectuées qui nécessitent une authentification par mot de passe. Pour éviter qu'on vous demande à plusieurs reprises un mot de passe, un `Personal Access Token (PAT) <https://docs.github.com/en/authentication/keeping-your-account-and-data-secure/creating-a-personal- access-token>`_ sera configuré. Si vous avez configuré l'authentification multifacteur sur votre compte GitHub, vous **devez** configurer un jeton d'accès personnel.

source: Create a Personal Access Token by:
fr: Créez un jeton d'accès personnel en :

source: Log in to GitHub and go to `Personal access tokens <https://github.com/settings/tokens>`_.
fr: Connectez-vous à GitHub et accédez à `Jetons d'accès personnels <https://github.com/settings/tokens>`_.

source: Click the **Generate new token** button.
fr: Cliquez sur le bouton **Générer un nouveau jeton**.

source: Set **Note** to something like ``Bloom token``.
fr: Définissez **Remarque** sur quelque chose comme ``Bloom token``.

source: Set **Expiration** to **No expiration**.
fr: Définissez **Expiration** sur **Aucune expiration**.

source: Tick the ``public_repo`` and ``workflow`` checkboxes.
fr: Cochez les cases ``public_repo`` et ``workflow``.

source: Click the **Generate token** button.
fr: Cliquez sur le bouton **Générer un jeton**.

source: After you have created the token, you will end up back at the *Personal access tokens* page. **Copy the alphanumeric token** that is highlighted in green.
fr: Après avoir créé le jeton, vous vous retrouverez sur la page *Jetons d'accès personnels*. **Copiez le jeton alphanumérique** surligné en vert.

source: Save your GitHub username and PAT to a new file called ``~/.config/bloom``, with the format below:
fr: Enregistrez votre nom d'utilisateur GitHub et votre PAT dans un nouveau fichier appelé ``~/.config/bloom``, au format ci-dessous :

source: Ensure repositories are up-to-date
fr: Assurez-vous que les référentiels sont à jour

source: Make sure that:
fr: Sois sûr que:

source: Your repository is hosted on a remote such as GitHub.
fr: Votre référentiel est hébergé sur une télécommande telle que GitHub.

source: You have a clone of the repository on your computer and are on the right branch.
fr: Vous avez un clone du référentiel sur votre ordinateur et vous êtes sur la bonne branche.

source: Both the remote repository and your clone are up-to-date.
fr: Le référentiel distant et votre clone sont à jour.

source: Generate Changelog
fr: Générer un journal des modifications

source: Generate a ``CHANGELOG.rst`` file per package in your repo using the following command:
fr: Générez un fichier ``CHANGELOG.rst`` par package dans votre référentiel à l'aide de la commande suivante :

source: Open all ``CHANGELOG.rst`` files in an editor. You will see that ``catkin_generate_changelog`` has auto-generated a forthcoming section with notes from commit messages:
fr: Ouvrez tous les fichiers ``CHANGELOG.rst`` dans un éditeur. Vous verrez que ``catkin_generate_changelog`` a généré automatiquement une section à venir avec des notes de messages de validation :

source: Clean up the list of commit messages to concisely convey the notable changes that have been made to the packages since the last release, and **commit all the CHANGELOG.rst files.** Do not modify the ``Forthcoming`` header.
fr: Nettoyez la liste des messages de validation pour transmettre de manière concise les changements notables qui ont été apportés aux packages depuis la dernière version, et **commettez tous les fichiers CHANGELOG.rst.** Ne modifiez pas l'en-tête ``Forthcoming``.

source: Bump the package version
fr: Bump la version du package

source: Every release of the package must have a unique version number higher than the previous release. Run:
fr: Chaque version du package doit avoir un numéro de version unique supérieur à celui de la version précédente. Courir:

source: which performs the following:
fr: qui effectue les opérations suivantes :

source: increases the package version in ``package.xml``
fr: augmente la version du paquet dans ``package.xml``

source: replaces the heading ``Forthcoming`` with ``version (date)`` (eg. ``0.0.1 (2022-01-08)``) in ``CHANGELOG.rst``
fr: remplace le titre ``À venir`` par ``version (date)`` (ex. ``0.0.1 (2022-01-08)``) dans ``CHANGELOG.rst``

source: commits those changes
fr: valide ces changements

source: creates a tag (eg. ``0.0.1``)
fr: crée une balise (ex. ``0.0.1``)

source: pushes the changes and the tag to your remote repository
fr: pousse les modifications et la balise vers votre référentiel distant

source: By default the patch version of the package is incremented, such as from ``0.0.0`` to ``0.0.1``. To increment the minor or major version instead, run ``catkin_prepare_release --bump minor`` or ``catkin_prepare_release --bump major``. For more details, see ``catkin_prepare_release --help``.
fr: Par défaut, la version du correctif du paquet est incrémentée, par exemple de ``0.0.0`` à ``0.0.1``. Pour incrémenter la version mineure ou majeure à la place, exécutez ``catkin_prepare_release --bump minor`` ou ``catkin_prepare_release --bump major``. Pour plus de détails, voir ``catkin_prepare_release --help``.

source: Bloom Release
fr: Libération de la floraison

source: Run the following command, replacing ``my_repo`` with the name of your repository:
fr: Exécutez la commande suivante en remplaçant ``my_repo`` par le nom de votre dépôt :

source: ``--new-track`` tells bloom to create a new :ref:`track <what-is-a-track>` and configure it.
fr: ``--new-track`` indique à bloom de créer un nouveau :ref:`track <what-is-a-track>` et de le configurer.

source: ``--rosdistro rolling`` indicates that this release is for the ``rolling`` distro
fr: ``--rosdistro rolling`` indique que cette version est pour la distribution ``rolling``

source: ``--track rolling`` indicates that you want the track name to be ``rolling``
fr: ``--track rolling`` indique que vous voulez que le nom de la piste soit ``rolling``

source: You will be prompted to enter information to configure a new track. In a common scenario such as:
fr: Vous serez invité à entrer des informations pour configurer une nouvelle piste. Dans un scénario courant tel que :

source: Your packages are in a repository called ``my_repo``
fr: Vos packages se trouvent dans un référentiel appelé ``my_repo``

source: You are releasing a branch called ``main``
fr: Vous libérez une branche appelée ``main``

source: The repository is hosted on GitHub at ``https://github.com/my_organization/my_repo.git``
fr: Le dépôt est hébergé sur GitHub à ``https://github.com/my_organization/my_repo.git``

source: Your release repository is at ``https://github.com/ros2-gbp/my_repo-release.git``
fr: Votre dépôt de version est à ``https://github.com/ros2-gbp/my_repo-release.git``

source: You should respond to the prompts as following:
fr: Vous devez répondre aux invites comme suit :

source: Value
fr: Valeur

source: :ref:`Repository Name <repository-name>`
fr: :ref:`Nom du référentiel <nom-du-référentiel>`

source: ``my_repo``
fr: ``mon_dépôt``

source: :ref:`Upstream Repository URI <upstream-repository-uri>`
fr: :ref:`URI du référentiel en amont <upstream-repository-uri>`

source: :ref:`Upstream VCS Type <upstream-vcs-type>`
fr: :ref:`Type VCS en amont <type-vcs-amont>`

source: :ref:`Upstream Devel Branch <upstream-devel-branch>`
fr: :ref:`Branche de développement en amont <branche-devel-amont>`

source: ``main``
fr: ``principal``

source: :ref:`Patches Directory <patches-directory>`
fr: :ref:`Répertoire des correctifs <répertoire-correctifs>`

source: An empty cell in the table indicates that the default value should be used. Simply respond to the prompt by pressing Enter.
fr: Une cellule vide dans le tableau indique que la valeur par défaut doit être utilisée. Répondez simplement à l'invite en appuyant sur Entrée.

source: Bloom will automatically create a pull request for you against `rosdistro <https://github.com/ros/rosdistro>`_.
fr: Bloom créera automatiquement une pull request pour vous contre `rosdistro <https://github.com/ros/rosdistro>`_.

source: Next Steps
fr: Prochaines étapes

source: Once your pull request has been submitted, usually within one or two days, one of the maintainers of rosdistro will review and merge your Pull Request. If your package build is successful, in 24-48 hours your packages will become available in the **ros-testing** repository, where you can :doc:`test your pre-release binaries <../../../Installation/Testing>`.
fr: Une fois votre demande de tirage soumise, généralement dans un délai d'un ou deux jours, l'un des responsables de rosdistro examinera et fusionnera votre demande de tirage. Si la construction de votre package réussit, vos packages seront disponibles dans les 24 à 48 heures dans le référentiel **ros-testing**, où vous pourrez :doc:`tester vos binaires de pré-version <../../.. /Installation/Tests>`.

source: Approximately every two to four weeks, the distribution's release manager manually synchronizes the contents of ros-testing into the main ROS repository. This is when your packages actually become available to the rest of the ROS community. To get updates on when the next synchronization (sync) is coming, subscribe to the `Packaging and Release Management Category on ROS Discourse <https://discourse.ros.org/c/release/16>`_.
fr: Environ toutes les deux à quatre semaines, le gestionnaire de publication de la distribution synchronise manuellement le contenu de ros-testing dans le référentiel ROS principal. C'est à ce moment que vos packages deviennent réellement disponibles pour le reste de la communauté ROS. Pour obtenir des mises à jour sur la date de la prochaine synchronisation (sync), abonnez-vous à la catégorie `Packaging and Release Management Category on ROS Discourse <https://discourse.ros.org/c/release/16>`_.
