Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/How-To-Guides/Releasing/Releasing-a-Package.po
Languages: fr

source: Releasing a Package
fr: Libérer un paquet

source: **Releasing a package makes your package available on the public ROS 2 buildfarm.** This will:
fr: ** La publication d'un package rend votre package disponible sur la ferme de construction ROS 2 publique. ** Cela :

source: Make your package available to be installed via package managers (eg. ``apt`` on Ubuntu) for all supported Linux platforms in a ROS distribution as described in `REP 2000 <https://ros.org/reps/rep-2000.html>`_.
fr: Rendez votre package disponible pour être installé via des gestionnaires de packages (par exemple, ``apt`` sur Ubuntu) pour toutes les plates-formes Linux prises en charge dans une distribution ROS, comme décrit dans `REP 2000 <https://ros.org/reps/rep-2000 .html>`_.

source: Allow your package to have API documentation automatically generated.
fr: Autorisez votre package à générer automatiquement la documentation de l'API.

source: Make your package part of the `ROS Index <https://index.ros.org>`_.
fr: Intégrez votre package au `ROS Index <https://index.ros.org>`_.

source: (Optionally) Allow you to have automatic CI run for pull requests in your repository.
fr: (Facultatif) Vous permet d'exécuter automatiquement le CI pour les demandes d'extraction dans votre référentiel.

source: **Follow one of the guides below to get your package released:**
fr: **Suivez l'un des guides ci-dessous pour obtenir votre package :**

source: :doc:`First Time Release <First-Time-Release>` - if this is the first release for the package
fr: :doc:`First Time Release <First-Time-Release>` - s'il s'agit de la première version du paquet

source: :doc:`Subsequent Releases <Subsequent-Releases>` - if you are releasing a new version of a package that has already been released
fr: :doc:`Subsequent Releases <Subsequent-Releases>` - si vous publiez une nouvelle version d'un paquet qui a déjà été publié

source: After successfully following the instructions, your package will be released into the ROS ecosystem on the next distro synchronization!
fr: Après avoir suivi avec succès les instructions, votre package sera publié dans l'écosystème ROS lors de la prochaine synchronisation de distribution !
