Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/How-To-Guides/Releasing/Release-Track.po
Languages: fr

source: Release Track
fr: Piste de sortie

source: Table of Contents
fr: Table des matières

source: What is a Track?
fr: Qu'est-ce qu'une piste ?

source: Bloom requires the user to enter configuration information when releasing packages for the first time. It is beneficial to store such configurations in the release repository so we don't have to manually enter configurations that won't change for subsequent releases.
fr: Bloom demande à l'utilisateur d'entrer des informations de configuration lors de la première publication de packages. Il est avantageux de stocker ces configurations dans le référentiel de version afin que nous n'ayons pas à entrer manuellement des configurations qui ne changeront pas pour les versions ultérieures.

source: Since some of the configurations will differ when releasing the package for different ROS distributions, bloom uses **release tracks to store the configurations for releasing** per distribution. By convention you should create tracks with the same name as the ROS distro you are releasing for.
fr: Étant donné que certaines configurations différeront lors de la publication du package pour différentes distributions ROS, bloom utilise des **pistes de publication pour stocker les configurations à publier** par distribution. Par convention, vous devez créer des pistes avec le même nom que la distribution ROS pour laquelle vous publiez.

source: All release track configurations are stored in ``tracks.yaml`` on the master branch of your release repository.
fr: Toutes les configurations de piste de version sont stockées dans ``tracks.yaml`` sur la branche principale de votre référentiel de version.

source: Track Configurations
fr: Configurations de piste

source: Track configurations are explained in more detail along with the prompts from bloom.
fr: Les configurations de piste sont expliquées plus en détail avec les invites de bloom.

source: Release Repository url
fr: URL du référentiel de versions

source: This is the url of your release repository, and should be of form ``https://github.com/ros2-gbp/my_repo-release.git`` if your release repository is hosted on ros2-gbp.
fr: Il s'agit de l'URL de votre référentiel de version et doit être de la forme ``https://github.com/ros2-gbp/my_repo-release.git`` si votre référentiel de version est hébergé sur ros2-gbp.

source: Paste your release repository URL and press Enter.
fr: Collez l'URL de votre référentiel de versions et appuyez sur Entrée.

source: Bloom may additionally ask you about initializing the new repository, as following:
fr: Bloom peut également vous demander d'initialiser le nouveau référentiel, comme suit :

source: Simply press Enter to accept the default of yes.
fr: Appuyez simplement sur Entrée pour accepter la valeur par défaut de oui.

source: Repository Name
fr: Nom du référentiel

source: The repository name is trivial, but it is recommended to set this to the name of your project.
fr: Le nom du référentiel est trivial, mais il est recommandé de le définir sur le nom de votre projet.

source: Type the name of your project (eg. ``my_project``) and press Enter.
fr: Tapez le nom de votre projet (par exemple, ``my_project``) et appuyez sur Entrée.

source: Upstream Repository URI
fr: URI du référentiel en amont

source: The **upstream repository** is the repository where your source code is. This is most likely an https link to your project hosted on a git hosting service such as GitHub or GitLab.
fr: Le **dépôt en amont** est le dépôt où se trouve votre code source. Il s'agit très probablement d'un lien https vers votre projet hébergé sur un service d'hébergement git tel que GitHub ou GitLab.

source: Make sure you **use the https address** (eg. ``https://github.com/my_organization/my_repo.git``) and not the ssh address.
fr: Assurez-vous d'**utiliser l'adresse https** (par exemple, ``https://github.com/my_organization/my_repo.git``) et non l'adresse ssh.

source: Upstream VCS Type
fr: Type de VCS en amont

source: This is the `Upstream Repository URI`_'s version control system (VCS) type. You must specify the type of vcs your repository is using, from ``svn``, ``git``, ``hg`` or ``tar``.
fr: Il s'agit du type de système de contrôle de version (VCS) de l'`Upstream Repository URI`_. Vous devez spécifier le type de vcs que votre référentiel utilise, parmi ``svn``, ``git``, ``hg`` ou ``tar``.

source: Most repositories will be using git, but some legacy repositories might be using hg or svn.
fr: La plupart des référentiels utiliseront git, mais certains référentiels hérités pourraient utiliser hg ou svn.

source: This is the version of the package you are releasing. (eg. ``1.0.3``)
fr: Il s'agit de la version du package que vous publiez. (ex. ``1.0.3``)

source: Setting this to ``:{auto}`` (the default, and recommended setup) will automatically determine the version from the devel branch's package.xml.
fr: Définir ceci sur ``:{auto}`` (la configuration par défaut et recommandée) déterminera automatiquement la version à partir du fichier package.xml de la branche de développement.

source: Setting this to ``:{ask}`` will bring up a prompt asking for the version every time you run a release with bloom.
fr: Définir ceci sur ``:{ask}`` fera apparaître une invite demandant la version chaque fois que vous exécutez une version avec bloom.

source: Release Tag
fr: Étiquette de version

source: The Release Tag refers to which tag or branch you want to import the code from.
fr: La balise de version fait référence à la balise ou à la branche à partir de laquelle vous souhaitez importer le code.

source: Setting this to ``:{version}`` (the default, and recommended setup) will make the release tag match the version tag.
fr: Définir ceci sur ``:{version}`` (la configuration par défaut et recommandée) fera correspondre la balise de version à la balise de version.

source: A less common setup is to set this to a branch name to always pull in that branch at the time of release from the upstream project.
fr: Une configuration moins courante consiste à définir ceci sur un nom de branche pour toujours extraire cette branche au moment de la publication du projet en amont.

source: Alternatively, if you want to be prompted to enter a different tag every time you do a release, enter ``:{ask}``. ``:{ask}`` is useful if the upstream project has frequent tagged releases and you want to refer to the new tag every time you're releasing.
fr: Alternativement, si vous souhaitez être invité à saisir une balise différente à chaque fois que vous effectuez une publication, saisissez ``:{ask}``. ``:{ask}`` est utile si le projet en amont a de fréquentes versions étiquetées et que vous souhaitez vous référer à la nouvelle étiquette à chaque fois que vous publiez.

source: Upstream Devel Branch
fr: Branche de développement en amont

source: The upstream devel branch is the name of the branch in your :ref:`upstream repository <upstream-repository-uri>`. If you use separate branches for each ROS distribution, this field would be different for each release track. It is used to determine the version of the package you are releasing when :ref:`Version` is set to ``:{auto}``.
fr: La branche de développement en amont est le nom de la branche dans votre :ref:`dépôt en amont <upstream-repository-uri>`. Si vous utilisez des branches distinctes pour chaque distribution ROS, ce champ sera différent pour chaque piste de version. Il est utilisé pour déterminer la version du package que vous publiez lorsque :ref:`Version` est défini sur ``:{auto}``.

source: To release from a branch called ``rolling``, enter ``rolling``. Leaving this as ``None`` would result in the version being determined from the default branch of your repository (this is not recommended).
fr: Pour libérer d'une branche appelée ``rolling``, entrez ``rolling``. Laisser ceci sur ``None`` entraînerait la détermination de la version à partir de la branche par défaut de votre référentiel (ce n'est pas recommandé).

source: ROS Distro
fr: Distribution ROS

source: This is the distribution you're planning on releasing the package into.
fr: Il s'agit de la distribution dans laquelle vous prévoyez de publier le paquet.

source: If you plan on releasing into ROS rolling, enter ``rolling``.
fr: Si vous envisagez de publier dans ROS Rolling, entrez ``rolling``.

source: Patches Directory
fr: Répertoire des correctifs

source: This is the directory where any additional patches to the releases are.
fr: Il s'agit du répertoire où se trouvent tous les correctifs supplémentaires aux versions.

source: Adding additional patches to a release is a rarely used feature. For almost all packages, this should be left as the default ``None``.
fr: L'ajout de correctifs supplémentaires à une version est une fonctionnalité rarement utilisée. Pour presque tous les packages, cela devrait être laissé par défaut ``None``.

source: Release Repository Push URL
fr: Publier l'URL push du référentiel

source: Can be left as the default in most cases.
fr: Peut être laissé par défaut dans la plupart des cas.
