Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Installation/Alternatives/macOS-Development-Setup.po
Languages: fr

source: Table of Contents
fr: Table des matières

source: System requirements
fr: Configuration requise

source: We currently support macOS Mojave (10.14). The Rolling Ridley distribution will change target platforms from time to time as new platforms become available. Most people will want to use a stable ROS distribution.
fr: Nous prenons actuellement en charge macOS Mojave (10.14). La distribution Rolling Ridley changera de plates-formes cibles de temps en temps à mesure que de nouvelles plates-formes seront disponibles. La plupart des gens voudront utiliser une distribution ROS stable.

source: Install prerequisites
fr: Installer les prérequis

source: You need the following things installed to build ROS 2:
fr: Vous devez installer les éléments suivants pour compiler ROS 2 :

source: If you don't already have it installed, install Xcode.
fr: Si vous ne l'avez pas déjà installé, installez Xcode.

source: Note: Versions of Xcode later than 11.3.1 can no longer be installed on macOS Mojave, so you will need to install an older version manually, see: https://stackoverflow.com/a/61046761
fr: Remarque : les versions de Xcode ultérieures à 11.3.1 ne peuvent plus être installées sur macOS Mojave, vous devrez donc installer une ancienne version manuellement, voir : https://stackoverflow.com/a/61046761

source: Also, if you don't already have it installed, install the Command Line Tools:
fr: De plus, si vous ne l'avez pas déjà installé, installez les outils de ligne de commande :

source: **brew** *(needed to install more stuff; you probably already have this)*:
fr: **brew** *(nécessaire pour installer plus de choses ; vous avez probablement déjà ceci)* :

source: Follow installation instructions at http://brew.sh/
fr: Suivez les instructions d'installation sur http://brew.sh/

source: *Optional*: Check that ``brew`` is happy with your system configuration by running:
fr: *Facultatif* : Vérifiez que ``brew`` est satisfait de la configuration de votre système en exécutant :

source: Fix any problems that it identifies.
fr: Corrigez tous les problèmes qu'il identifie.

source: Use ``brew`` to install more stuff:
fr: Utilisez ``brew`` pour installer plus de choses :

source: Setup some environment variables:
fr: Configurez quelques variables d'environnement :

source: Use ``python3 -m pip`` (just ``pip`` may install Python3 or Python2) to install more stuff:
fr: Utilisez ``python3 -m pip`` (juste ``pip`` peut installer Python3 ou Python2) pour installer plus de choses :

source: Please ensure that the ``$PATH`` environment variable contains the install location of the binaries (default: ``$HOME/Library/Python/<version>/bin``)
fr: Assurez-vous que la variable d'environnement ``$PATH`` contient l'emplacement d'installation des binaires (par défaut : ``$HOME/Library/Python/<version>/bin``)

source: *Optional*: if you want to build the ROS 1<->2 bridge, then you must also install ROS 1:
fr: *Facultatif* : si vous souhaitez construire le pont ROS 1<->2, vous devez également installer ROS 1 :

source: Start with the normal install instructions: http://wiki.ros.org/kinetic/Installation/OSX/Homebrew/Source
fr: Commencez par les instructions d'installation normales : http://wiki.ros.org/kinetic/Installation/OSX/Homebrew/Source

source: When you get to the step where you call ``rosinstall_generator`` to get the source code, here's an alternate invocation that brings in just the minimum required to produce a useful bridge:
fr: Lorsque vous arrivez à l'étape où vous appelez ``rosinstall_generator`` pour obtenir le code source, voici une autre invocation qui n'apporte que le minimum requis pour produire un pont utile :

source: Otherwise, just follow the normal instructions, then source the resulting ``install_isolated/setup.bash`` before proceeding here to build ROS 2.
fr: Sinon, suivez simplement les instructions normales, puis sourcez le résultat ``install_isolated/setup.bash`` avant de continuer ici pour construire ROS 2.

source: Disable System Integrity Protection (SIP)
fr: Désactiver la protection de l'intégrité du système (SIP)

source: macOS/OS X versions >=10.11 have System Integrity Protection enabled by default. So that SIP doesn't prevent processes from inheriting dynamic linker environment variables, such as ``DYLD_LIBRARY_PATH``, you'll need to disable it `following these instructions <https://developer.apple.com/library/content/documentation/Security/Conceptual/System_Integrity_Protection_Guide/ConfiguringSystemIntegrityProtection/ConfiguringSystemIntegrityProtection.html>`__.
fr: Les versions macOS/OS X >=10.11 ont la protection de l'intégrité du système activée par défaut. Pour que SIP n'empêche pas les processus d'hériter des variables d'environnement de l'éditeur de liens dynamique, telles que ``DYLD_LIBRARY_PATH``, vous devrez le désactiver en suivant ces instructions <https://developer.apple.com/library/content/documentation /Security/Conceptual/System_Integrity_Protection_Guide/ConfiguringSystemIntegrityProtection/ConfiguringSystemIntegrityProtection.html>`__.

source: Get the ROS 2 code
fr: Obtenir le code ROS 2

source: Create a workspace and clone all repos:
fr: Créez un espace de travail et clonez tous les dépôts :

source: Install additional DDS vendors (optional)
fr: Installer des fournisseurs DDS supplémentaires (facultatif)

source: If you would like to use another DDS or RTPS vendor besides the default, you can find instructions :doc:`here <../DDS-Implementations>`.
fr: Si vous souhaitez utiliser un autre fournisseur DDS ou RTPS en plus du fournisseur par défaut, vous pouvez trouver des instructions :doc:`ici <../DDS-Implementations>`.

source: Build the ROS 2 code
fr: Construire le code ROS 2

source: Run the ``colcon`` tool to build everything (more on using ``colcon`` in :doc:`this tutorial <../../Tutorials/Beginner-Client-Libraries/Colcon-Tutorial>`):
fr: Exécutez l'outil ``colcon`` pour tout construire (plus d'informations sur l'utilisation de ``colcon`` dans :doc:`ce tutoriel <../../Tutorials/Beginner-Client-Libraries/Colcon-Tutorial>`):

source: Note: due to an unresolved issue with SIP, Qt@5, and PyQt5, we need to disable ``python_qt_binding`` to have the build succeed. This will be removed when the issue is resolved, see: https://github.com/ros-visualization/python_qt_binding/issues/103
fr: Remarque : en raison d'un problème non résolu avec SIP, Qt@5 et PyQt5, nous devons désactiver ``python_qt_binding`` pour que la construction réussisse. Cela sera supprimé lorsque le problème sera résolu, voir : https://github.com/ros-visualization/python_qt_binding/issues/103

source: Environment setup
fr: Configuration de l'environnement

source: Source the ROS 2 setup file:
fr: Sourcez le fichier d'installation de ROS 2 :

source: This will automatically set up the environment for any DDS vendors that support was built for.
fr: Cela configurera automatiquement l'environnement pour tous les fournisseurs de DDS pour lesquels la prise en charge a été conçue.

source: Try some examples
fr: Essayez quelques exemples

source: In one terminal, set up the ROS 2 environment as described above and then run a C++ ``talker``:
fr: Dans un terminal, configurez l'environnement ROS 2 comme décrit ci-dessus, puis exécutez un ``talker`` C++ :

source: In another terminal source the setup file and then run a Python ``listener``:
fr: Dans un autre terminal, sourcez le fichier de configuration, puis exécutez un Python ``listener`` :

source: You should see the ``talker`` saying that it's ``Publishing`` messages and the ``listener`` saying ``I heard`` those messages. This verifies both the C++ and Python APIs are working properly. Hooray!
fr: Vous devriez voir le ``locuteur`` dire qu'il ``publie`` des messages et le ``auditeur`` dire ``J'ai entendu`` ces messages. Cela vérifie que les API C++ et Python fonctionnent correctement. Hourra !

source: Next steps after installing
fr: Prochaines étapes après l'installation

source: Continue with the `tutorials and demos <../../Tutorials>` to configure your environment, create your own workspace and packages, and learn ROS 2 core concepts.
fr: Continuez avec les `tutoriels et démos <../../Tutorials>` pour configurer votre environnement, créer votre propre espace de travail et vos packages, et apprendre les concepts de base de ROS 2.

source: Using the ROS 1 bridge
fr: Utilisation du pont ROS 1

source: The ROS 1 bridge can connect topics from ROS 1 to ROS 2 and vice-versa. See the dedicated `documentation <https://github.com/ros2/ros1_bridge/blob/master/README.md>`__ on how to build and use the ROS 1 bridge.
fr: Le pont ROS 1 peut connecter des sujets de ROS 1 à ROS 2 et vice-versa. Voir la `documentation dédiée <https://github.com/ros2/ros1_bridge/blob/master/README.md>`__ sur la façon de construire et d'utiliser le pont ROS 1.

source: Additional RMW implementations (optional)
fr: Implémentations RMW supplémentaires (facultatif)

source: The default middleware that ROS 2 uses is ``Fast DDS``, but the middleware (RMW) can be replaced at runtime. See the :doc:`guide <../../How-To-Guides/Working-with-multiple-RMW-implementations>` on how to work with multiple RMWs.
fr: Le middleware par défaut utilisé par ROS 2 est ``Fast DDS``, mais le middleware (RMW) peut être remplacé au moment de l'exécution. Consultez le :doc:`guide <../../How-To-Guides/Working-with-multiple-RMW-implementations>` pour savoir comment travailler avec plusieurs RMW.

source: Stay up to date
fr: Tiens-toi à jour

source: See :doc:`../Maintaining-a-Source-Checkout` to periodically refresh your source installation.
fr: Voir :doc:`../Maintaining-a-Source-Checkout` pour actualiser périodiquement votre installation source.

source: Troubleshooting
fr: Dépannage

source: Troubleshooting techniques can be found :ref:`here <macOS-troubleshooting>`.
fr: Les techniques de dépannage peuvent être trouvées :ref:`ici <macOS-troubleshooting>`.

source: Uninstall
fr: Désinstaller

source: If you installed your workspace with colcon as instructed above, "uninstalling" could be just a matter of opening a new terminal and not sourcing the workspace's ``setup`` file. This way, your environment will behave as though there is no Rolling install on your system.
fr: Si vous avez installé votre espace de travail avec colcon comme indiqué ci-dessus, la "désinstallation" pourrait consister simplement à ouvrir un nouveau terminal et à ne pas rechercher le fichier ``setup`` de l'espace de travail. De cette façon, votre environnement se comportera comme s'il n'y avait pas d'installation progressive sur votre système.

source: If you're also trying to free up space, you can delete the entire workspace directory with:
fr: Si vous essayez également de libérer de l'espace, vous pouvez supprimer tout le répertoire de l'espace de travail avec :
