Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Installation/Alternatives/Ubuntu-Development-Setup.po
Languages: fr

source: Ubuntu (source)
fr: gratuit (source)

source: Table of Contents
fr: Table des matières

source: System requirements
fr: Configuration requise

source: The current Debian-based target platforms for Rolling Ridley are:
fr: Les plates-formes cibles actuelles basées sur Debian pour Rolling Ridley sont :

source: Tier 1: Ubuntu Linux - Jammy (22.04) 64-bit
fr: Niveau 1 : Ubuntu Linux - Jammy (22.04) 64 bits

source: Tier 3: Ubuntu Linux - Focal (20.04) 64-bit
fr: Niveau 3 : Ubuntu Linux - Focal (20.04) 64 bits

source: Tier 3: Debian Linux - Bullseye (11) 64-bit
fr: Niveau 3 : Debian Linux - Bullseye (11) 64 bits

source: Other Linux platforms with varying support levels include:
fr: Les autres plates-formes Linux avec différents niveaux de support incluent :

source: Arch Linux, see `alternate instructions <https://wiki.archlinux.org/index.php/ROS#ROS_2>`__
fr: Arch Linux, voir `instructions alternatives <https://wiki.archlinux.org/index.php/ROS#ROS_2>`__

source: Fedora Linux, see :doc:`alternate instructions <Fedora-Development-Setup>`
fr: Fedora Linux, voir :doc:`instructions alternatives <Fedora-Development-Setup>`

source: OpenEmbedded / webOS OSE, see `alternate instructions <https://github.com/ros/meta-ros/wiki/OpenEmbedded-Build-Instructions>`__
fr: OpenEmbedded / webOS OSE, voir `instructions alternatives <https://github.com/ros/meta-ros/wiki/OpenEmbedded-Build-Instructions>`__

source: As defined in `REP 2000 <https://www.ros.org/reps/rep-2000.html>`_.
fr: Tel que défini dans `REP 2000 <https://www.ros.org/reps/rep-2000.html>`_.

source: System setup
fr: Installation du système

source: Make sure you have a locale which supports ``UTF-8``. If you are in a minimal environment (such as a docker container), the locale may be something minimal like ``POSIX``. We test with the following settings. However, it should be fine if you're using a different UTF-8 supported locale.
fr: Assurez-vous d'avoir une locale qui supporte ``UTF-8``. Si vous êtes dans un environnement minimal (comme un conteneur docker), la locale peut être quelque chose de minimal comme ``POSIX``. Nous testons avec les paramètres suivants. Cependant, cela devrait convenir si vous utilisez un autre paramètre régional pris en charge par UTF-8.

source: Add the ROS 2 apt repository
fr: Ajouter le référentiel ROS 2 apt

source: You will need to add the ROS 2 apt repository to your system.
fr: Vous devrez ajouter le référentiel ROS 2 apt à votre système.

source: First ensure that the `Ubuntu Universe repository <https://help.ubuntu.com/community/Repositories/Ubuntu>`_ is enabled.
fr: Assurez-vous d'abord que le `référentiel Ubuntu Universe <https://help.ubuntu.com/community/Repositories/Ubuntu>`_ est activé.

source: Now add the ROS 2 GPG key with apt.
fr: Ajoutez maintenant la clé ROS 2 GPG avec apt.

source: Then add the repository to your sources list.
fr: Ajoutez ensuite le référentiel à votre liste de sources.

source: Install development tools and ROS tools
fr: Installer les outils de développement et les outils ROS

source: Install common packages.
fr: Installez les packages communs.

source: Install packages according to your Ubuntu version.
fr: Installez les packages en fonction de votre version d'Ubuntu.

source: Ubuntu 22.04 LTS and later
fr: Ubuntu 22.04 LTS et versions ultérieures

source: Get ROS 2 code
fr: Obtenir le code ROS 2

source: Create a workspace and clone all repos:
fr: Créez un espace de travail et clonez tous les dépôts :

source: Install dependencies using rosdep
fr: Installer les dépendances à l'aide de rosdep

source: ROS 2 packages are built on frequently updated Ubuntu systems. It is always recommended that you ensure your system is up to date before installing new packages.
fr: Les packages ROS 2 sont construits sur des systèmes Ubuntu fréquemment mis à jour. Il est toujours recommandé de vous assurer que votre système est à jour avant d'installer de nouveaux packages.

source: **Note**: If you're using a distribution that is based on Ubuntu (like Linux Mint) but does not identify itself as such, you'll get an error message like ``Unsupported OS [mint]``. In this case append ``--os=ubuntu:jammy`` to the above command.
fr: **Remarque** : Si vous utilisez une distribution basée sur Ubuntu (comme Linux Mint) mais qui ne s'identifie pas comme telle, vous obtiendrez un message d'erreur du type ``Unsupported OS [mint]``. Dans ce cas, ajoutez ``--os=ubuntu:jammy`` à la commande ci-dessus.

source: Install additional DDS implementations (optional)
fr: Installer des implémentations DDS supplémentaires (facultatif)

source: If you would like to use another DDS or RTPS vendor besides the default, you can find instructions :doc:`here <../DDS-Implementations>`.
fr: Si vous souhaitez utiliser un autre fournisseur DDS ou RTPS en plus du fournisseur par défaut, vous pouvez trouver des instructions :doc:`ici <../DDS-Implementations>`.

source: Build the code in the workspace
fr: Construire le code dans l'espace de travail

source: If you have already installed ROS 2 another way (either via Debians or the binary distribution), make sure that you run the below commands in a fresh environment that does not have those other installations sourced. Also ensure that you do not have ``source /opt/ros/${ROS_DISTRO}/setup.bash`` in your ``.bashrc``. You can make sure that ROS 2 is not sourced with the command ``printenv | grep -i ROS``. The output should be empty.
fr: Si vous avez déjà installé ROS 2 d'une autre manière (soit via Debians, soit via la distribution binaire), assurez-vous d'exécuter les commandes ci-dessous dans un nouvel environnement qui ne contient pas ces autres installations. Assurez-vous également que vous n'avez pas ``source /opt/ros/${ROS_DISTRO}/setup.bash`` dans votre ``.bashrc``. Vous pouvez vous assurer que ROS 2 n'est pas sourcé avec la commande ``printenv | grep -i ROS``. La sortie doit être vide.

source: More info on working with a ROS workspace can be found in :doc:`this tutorial <../../Tutorials/Beginner-Client-Libraries/Colcon-Tutorial>`.
fr: Vous trouverez plus d'informations sur l'utilisation d'un espace de travail ROS dans :doc:`ce tutoriel <../../Tutorials/Beginner-Client-Libraries/Colcon-Tutorial>`.

source: Note: if you are having trouble compiling all examples and this is preventing you from completing a successful build, you can use ``COLCON_IGNORE`` in the same manner as `CATKIN_IGNORE <https://github.com/ros-infrastructure/rep/blob/master/rep-0128.rst>`__ to ignore the subtree or remove the folder from the workspace. Take for instance: you would like to avoid installing the large OpenCV library. Well then simply run ``touch COLCON_IGNORE`` in the ``cam2image`` demo directory to leave it out of the build process.
fr: Remarque : si vous rencontrez des difficultés pour compiler tous les exemples et que cela vous empêche de terminer une construction réussie, vous pouvez utiliser ``COLCON_IGNORE`` de la même manière que `CATKIN_IGNORE <https://github.com/ros-infrastructure/rep /blob/master/rep-0128.rst>`__ pour ignorer la sous-arborescence ou supprimer le dossier de l'espace de travail. Prenons par exemple : vous voudriez éviter d'installer la grande bibliothèque OpenCV. Eh bien, exécutez simplement ``touch COLCON_IGNORE`` dans le répertoire de démonstration ``cam2image`` pour le laisser en dehors du processus de construction.

source: Environment setup
fr: Configuration de l'environnement

source: Source the setup script
fr: Source du script d'installation

source: Set up your environment by sourcing the following file.
fr: Configurez votre environnement en vous procurant le fichier suivant.

source: Try some examples
fr: Essayez quelques exemples

source: In one terminal, source the setup file and then run a C++ ``talker``\ :
fr: Dans un terminal, sourcez le fichier de configuration, puis exécutez un ``talker``\ C++ :

source: In another terminal source the setup file and then run a Python ``listener``\ :
fr: Dans un autre terminal, sourcez le fichier de configuration, puis exécutez un Python ``listener``\ :

source: You should see the ``talker`` saying that it's ``Publishing`` messages and the ``listener`` saying ``I heard`` those messages. This verifies both the C++ and Python APIs are working properly. Hooray!
fr: Vous devriez voir le ``locuteur`` dire qu'il ``publie`` des messages et le ``auditeur`` dire ``J'ai entendu`` ces messages. Cela vérifie que les API C++ et Python fonctionnent correctement. Hourra !

source: Next steps after installing
fr: Prochaines étapes après l'installation

source: Continue with the :doc:`tutorials and demos <../../Tutorials>` to configure your environment, create your own workspace and packages, and learn ROS 2 core concepts.
fr: Continuez avec les :doc:`tutoriels et démos <../../Tutoriels>` pour configurer votre environnement, créer votre propre espace de travail et vos packages, et apprendre les concepts de base de ROS 2.

source: Using the ROS 1 bridge
fr: Utilisation du pont ROS 1

source: The ROS 1 bridge can connect topics from ROS 1 to ROS 2 and vice-versa. See the dedicated `documentation <https://github.com/ros2/ros1_bridge/blob/master/README.md>`__ on how to build and use the ROS 1 bridge.
fr: Le pont ROS 1 peut connecter des sujets de ROS 1 à ROS 2 et vice-versa. Voir la `documentation dédiée <https://github.com/ros2/ros1_bridge/blob/master/README.md>`__ sur la façon de construire et d'utiliser le pont ROS 1.

source: Additional RMW implementations (optional)
fr: Implémentations RMW supplémentaires (facultatif)

source: The default middleware that ROS 2 uses is ``Fast DDS``, but the middleware (RMW) can be replaced at runtime. See the :doc:`guide <../../How-To-Guides/Working-with-multiple-RMW-implementations>` on how to work with multiple RMWs.
fr: Le middleware par défaut utilisé par ROS 2 est ``Fast DDS``, mais le middleware (RMW) peut être remplacé au moment de l'exécution. Consultez le :doc:`guide <../../How-To-Guides/Working-with-multiple-RMW-implementations>` pour savoir comment travailler avec plusieurs RMW.

source: Alternate compilers
fr: Compilateurs alternatifs

source: Using a different compiler besides gcc to compile ROS 2 is easy. If you set the environment variables ``CC`` and ``CXX`` to executables for a working C and C++ compiler, respectively, and retrigger CMake configuration (by using ``--force-cmake-config`` or by deleting the packages you want to be affected), CMake will reconfigure and use the different compiler.
fr: Utiliser un compilateur différent de gcc pour compiler ROS 2 est facile. Si vous définissez les variables d'environnement ``CC`` et ``CXX`` sur des exécutables pour un compilateur C et C++ fonctionnel, respectivement, et que vous relancez la configuration de CMake (en utilisant ``--force-cmake-config`` ou en supprimant les packages que vous souhaitez affecter), CMake reconfigurera et utilisera le compilateur différent.

source: Clang
fr: Bruit

source: To configure CMake to detect and use Clang:
fr: Pour configurer CMake pour détecter et utiliser Clang :

source: Stay up to date
fr: Tiens-toi à jour

source: See :doc:`../Maintaining-a-Source-Checkout` to periodically refresh your source installation.
fr: Voir :doc:`../Maintaining-a-Source-Checkout` pour actualiser périodiquement votre installation source.

source: Troubleshooting
fr: Dépannage

source: Troubleshooting techniques can be found :ref:`here <linux-troubleshooting>`.
fr: Les techniques de dépannage peuvent être trouvées :ref:`ici <linux-troubleshooting>`.

source: Uninstall
fr: Désinstaller

source: If you installed your workspace with colcon as instructed above, "uninstalling" could be just a matter of opening a new terminal and not sourcing the workspace's ``setup`` file. This way, your environment will behave as though there is no Rolling install on your system.
fr: Si vous avez installé votre espace de travail avec colcon comme indiqué ci-dessus, la "désinstallation" pourrait consister simplement à ouvrir un nouveau terminal et à ne pas rechercher le fichier ``setup`` de l'espace de travail. De cette façon, votre environnement se comportera comme s'il n'y avait pas d'installation progressive sur votre système.

source: If you're also trying to free up space, you can delete the entire workspace directory with:
fr: Si vous essayez également de libérer de l'espace, vous pouvez supprimer tout le répertoire de l'espace de travail avec :
