Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Installation/Alternatives/Windows-Development-Setup.po
Languages: fr

source: Table of Contents
fr: Table des matières

source: This guide is about how to setup a development environment for ROS 2 on Windows.
fr: Ce guide explique comment configurer un environnement de développement pour ROS 2 sous Windows.

source: System requirements
fr: Configuration requise

source: Only Windows 10 is supported.
fr: Seul Windows 10 est pris en charge.

source: Language support
fr: Support linguistique

source: Make sure you have a locale which supports ``UTF-8``. For example, for a Chinese-language Windows 10 installation, you may need to install an `English language pack <https://support.microsoft.com/en-us/windows/language-packs-for-windows-a5094319-a92d-18de-5b53-1cfc697cfca8>`_.
fr: Assurez-vous d'avoir une locale qui supporte ``UTF-8``. Par exemple, pour une installation de Windows 10 en chinois, vous devrez peut-être installer un `package de langue anglaise <https://support.microsoft.com/en-us/windows/language-packs-for-windows-a5094319-a92d -18de-5b53-1cfc697cfca8>`_.

source: Installing prerequisites
fr: Installation des prérequis

source: Install Chocolatey
fr: Installer Chocolatey

source: Chocolatey is a package manager for Windows, install it by following their installation instructions:
fr: Chocolatey est un gestionnaire de paquets pour Windows, installez-le en suivant leurs instructions d'installation :

source: You'll use Chocolatey to install some other developer tools.
fr: Vous utiliserez Chocolatey pour installer d'autres outils de développement.

source: Install Python
fr: Installer Python

source: Open a Command Prompt and type the following to install Python via Chocolatey:
fr: Ouvrez une invite de commande et tapez ce qui suit pour installer Python via Chocolatey :

source: Open a Command Prompt and type the following to install them via Chocolatey:
fr: Ouvrez une invite de commande et tapez ce qui suit pour les installer via Chocolatey :

source: Install OpenSSL
fr: Installer OpenSSL

source: Download the *Win64 OpenSSL v1.1.1n* OpenSSL installer from `this page <https://slproweb.com/products/Win32OpenSSL.html>`__. Scroll to the bottom of the page and download *Win64 OpenSSL v1.1.1n*. Don't download the Win32 or Light versions, or the v3.X.Y installers.
fr: Téléchargez le programme d'installation OpenSSL *Win64 OpenSSL v1.1.1n* à partir de `cette page <https://slproweb.com/products/Win32OpenSSL.html>`__. Faites défiler vers le bas de la page et téléchargez *Win64 OpenSSL v1.1.1n*. Ne téléchargez pas les versions Win32 ou Light, ni les programmes d'installation v3.X.Y.

source: Run the installer with default parameters, as the following commands assume you used the default installation directory.
fr: Exécutez le programme d'installation avec les paramètres par défaut, car les commandes suivantes supposent que vous avez utilisé le répertoire d'installation par défaut.

source: This command sets an environment variable that persists over sessions:
fr: Cette commande définit une variable d'environnement qui persiste au fil des sessions :

source: You will need to append the OpenSSL-Win64 bin folder to your PATH. You can do this by clicking the Windows icon, typing "Environment Variables", then clicking on "Edit the system environment variables". In the resulting dialog, click "Environment Variables", then click "Path" on the bottom pane, finally click "Edit" and add the path below.
fr: Vous devrez ajouter le dossier bin OpenSSL-Win64 à votre PATH. Vous pouvez le faire en cliquant sur l'icône Windows, en tapant "Variables d'environnement", puis en cliquant sur "Modifier les variables d'environnement système". Dans la boîte de dialogue résultante, cliquez sur "Variables d'environnement", puis cliquez sur "Chemin" dans le volet inférieur, enfin cliquez sur "Modifier" et ajoutez le chemin ci-dessous.

source: Install Visual Studio
fr: Installer Visual Studio

source: Install Visual Studio 2019.
fr: Installez Visual Studio 2019.

source: If you already have a paid version of Visual Studio 2019 (Professional, Enterprise), skip this step.
fr: Si vous disposez déjà d'une version payante de Visual Studio 2019 (Professional, Enterprise), ignorez cette étape.

source: Microsoft provides a free of charge version of Visual Studio 2019, named Community, which can be used to build applications that use ROS 2. `You can download the installer directly through this link. <https://visualstudio.microsoft.com/thank-you-downloading-visual-studio/?sku=Community&rel=16&src=myvs&utm_medium=microsoft&utm_source=my.visualstudio.com&utm_campaign=download&utm_content=vs+community+2019>`_
fr: Microsoft fournit une version gratuite de Visual Studio 2019, nommée Community, qui peut être utilisée pour créer des applications utilisant ROS 2. `Vous pouvez télécharger le programme d'installation directement via ce lien. <https://visualstudio.microsoft.com/thank-you-downloading-visual-studio/?sku=Community&rel=16&src=myvs&utm_medium=microsoft&utm_source=my.visualstudio.com&utm_campaign=download&utm_content=vs+community+2019>`_

source: Make sure that the Visual C++ features are installed.
fr: Assurez-vous que les fonctionnalités Visual C++ sont installées.

source: An easy way to make sure they're installed is to select the ``Desktop development with C++`` workflow during the install.
fr: Un moyen simple de s'assurer qu'ils sont installés est de sélectionner le flux de travail ``Développement de bureau avec C++`` lors de l'installation.

source: Make sure that no C++ CMake tools are installed by unselecting them in the list of components to be installed.
fr: Assurez-vous qu'aucun outil C++ CMake n'est installé en les désélectionnant dans la liste des composants à installer.

source: Install OpenCV
fr: Installer OpenCV

source: Some of the examples require OpenCV to be installed.
fr: Certains exemples nécessitent l'installation d'OpenCV.

source: You can download a precompiled version of OpenCV 3.4.6 from https://github.com/ros2/ros2/releases/download/opencv-archives/opencv-3.4.6-vc16.VS2019.zip .
fr: Vous pouvez télécharger une version précompilée d'OpenCV 3.4.6 à partir de https://github.com/ros2/ros2/releases/download/opencv-archives/opencv-3.4.6-vc16.VS2019.zip .

source: Assuming you unpacked it to ``C:\opencv``, type the following on a Command Prompt (requires Admin privileges):
fr: En supposant que vous l'avez décompressé dans ``C:\opencv``, tapez ce qui suit sur une invite de commande (nécessite des privilèges d'administrateur) :

source: Since you are using a precompiled ROS version, we have to tell it where to find the OpenCV libraries. You have to extend the ``PATH`` variable to ``C:\opencv\x64\vc16\bin``.
fr: Puisque vous utilisez une version ROS précompilée, nous devons lui indiquer où trouver les bibliothèques OpenCV. Vous devez étendre la variable ``PATH`` à ``C:\opencv\x64\vc16\bin``.

source: Install dependencies
fr: Installer les dépendances

source: There are a few dependencies not available in the Chocolatey package database. In order to ease the manual installation process, we provide the necessary Chocolatey packages.
fr: Il existe quelques dépendances non disponibles dans la base de données du package Chocolatey. Afin de faciliter le processus d'installation manuelle, nous fournissons les packages Chocolatey nécessaires.

source: As some chocolatey packages rely on it, we start by installing CMake
fr: Comme certains packages chocolatés en dépendent, nous commençons par installer CMake

source: You will need to append the CMake bin folder ``C:\Program Files\CMake\bin`` to your PATH.
fr: Vous devrez ajouter le dossier CMake bin ``C:\Program Files\CMake\bin`` à votre PATH.

source: Please download these packages from `this <https://github.com/ros2/choco-packages/releases/latest>`__ GitHub repository.
fr: Veuillez télécharger ces packages depuis `ce <https://github.com/ros2/choco-packages/releases/latest>`__ référentiel GitHub.

source: asio.1.12.1.nupkg
fr: install.1.12.1.nupkg

source: bullet.3.17.nupkg
fr: puce.3.17.nupkg

source: eigen-3.3.4.nupkg
fr: propre-3.3.4.nupkg

source: Once these packages are downloaded, open an administrative shell and execute the following command:
fr: Une fois ces packages téléchargés, ouvrez un shell d'administration et exécutez la commande suivante :

source: Please replace ``<PATH\TO\DOWNLOADS>`` with the folder you downloaded the packages to.
fr: Veuillez remplacer ``<PATH\TO\DOWNLOADS>`` par le dossier dans lequel vous avez téléchargé les packages.

source: First upgrade pip and setuptools:
fr: Premier pip de mise à niveau et setuptools :

source: Now install some additional python dependencies:
fr: Installez maintenant quelques dépendances Python supplémentaires :

source: Install Qt5
fr: Installer Qt5

source: Download the `5.12.X offline installer <https://www.qt.io/offline-installers>`_ from Qt's website. Run the installer. Make sure to select the ``MSVC 2017 64-bit`` component under the ``Qt`` -> ``Qt 5.12.12`` tree.
fr: Téléchargez le `5.12.X offline installer <https://www.qt.io/offline-installers>`_ depuis le site Web de Qt. Exécutez le programme d'installation. Assurez-vous de sélectionner le composant ``MSVC 2017 64-bit`` sous l'arborescence ``Qt`` -> ``Qt 5.12.12``.

source: Finally, in an administrator ``cmd.exe`` window set these environment variables. The commands below assume you installed it to the default location of ``C:\Qt``.
fr: Enfin, dans une fenêtre administrateur ``cmd.exe``, définissez ces variables d'environnement. Les commandes ci-dessous supposent que vous l'avez installé à l'emplacement par défaut de ``C:\Qt``.

source: This path might change based on the installed MSVC version, the directory Qt was installed to, and the version of Qt installed.
fr: Ce chemin peut changer en fonction de la version de MSVC installée, du répertoire dans lequel Qt a été installé et de la version de Qt installée.

source: RQt dependencies
fr: Dépendances RQt

source: To run rqt_graph you need to `download <https://graphviz.gitlab.io/_pages/Download/Download_windows.html>`__ and install `Graphviz <https://graphviz.gitlab.io/>`__. The installer will ask if to add graphviz to PATH, choose to either add it to the current user or all users.
fr: Pour exécuter rqt_graph, vous devez `télécharger <https://graphviz.gitlab.io/_pages/Download/Download_windows.html>`__ et installer `Graphviz <https://graphviz.gitlab.io/>`__. Le programme d'installation vous demandera si vous souhaitez ajouter graphviz à PATH, choisissez de l'ajouter à l'utilisateur actuel ou à tous les utilisateurs.

source: Install additional DDS implementations (optional)
fr: Installer des implémentations DDS supplémentaires (facultatif)

source: If you would like to use another DDS or RTPS vendor besides the default, Fast DDS, you can find instructions `here </Installation/DDS-Implementations>`_.
fr: Si vous souhaitez utiliser un autre fournisseur DDS ou RTPS en plus du Fast DDS par défaut, vous pouvez trouver des instructions `ici </Installation/DDS-Implementations>`_.

source: Additional prerequisites
fr: Prérequis supplémentaires

source: When building from source you'll need a few additional prerequisites installed.
fr: Lors de la construction à partir de la source, vous aurez besoin de quelques prérequis supplémentaires installés.

source: Install additional prerequisites from Chocolatey
fr: Installez les prérequis supplémentaires de Chocolatey

source: You will need to append the Git cmd folder ``C:\Program Files\Git\cmd`` to the PATH (you can do this by clicking the Windows icon, typing "Environment Variables", then clicking on "Edit the system environment variables". In the resulting dialog, click "Environment Variables", the click "Path" on the bottom pane, then click "Edit" and add the path).
fr: Vous devrez ajouter le dossier Git cmd ``C:\Program Files\Git\cmd`` au PATH (vous pouvez le faire en cliquant sur l'icône Windows, en tapant "Variables d'environnement", puis en cliquant sur "Modifier l'environnement système variables". Dans la boîte de dialogue résultante, cliquez sur "Variables d'environnement", cliquez sur "Chemin" dans le volet inférieur, puis cliquez sur "Modifier" et ajoutez le chemin).

source: Install Python prerequisites
fr: Installer les prérequis Python

source: Installing additional Python dependencies:
fr: Installation de dépendances Python supplémentaires :

source: Install miscellaneous prerequisites
fr: Installer divers prérequis

source: Next install xmllint:
fr: Installez ensuite xmllint :

source: Download the `64 bit binary archives <https://www.zlatkovic.com/pub/libxml/64bit/>`__ of ``libxml2`` (and its dependencies ``iconv`` and ``zlib``) from https://www.zlatkovic.com/projects/libxml/
fr: Téléchargez les `archives binaires 64 bits <https://www.zlatkovic.com/pub/libxml/64bit/>`__ de ``libxml2`` (et ses dépendances ``iconv`` et ``zlib``) depuis https://www.zlatkovic.com/projects/libxml/

source: Unpack all archives into e.g. ``C:\xmllint``
fr: Décompressez toutes les archives, par ex. ``C:\xmllint``

source: Add ``C:\xmllint\bin`` to the ``PATH``.
fr: Ajoutez ``C:\xmllint\bin`` au ``PATH``.

source: Get the ROS 2 code
fr: Obtenir le code ROS 2

source: Now that we have the development tools we can get the ROS 2 source code.
fr: Maintenant que nous avons les outils de développement, nous pouvons obtenir le code source de ROS 2.

source: First setup a development folder, for example ``C:\rolling``:
fr: Configurez d'abord un dossier de développement, par exemple ``C:\rolling`` :

source: It is very important that the chosen path is short, due to the short default Windows path limits (260 characters). To allow longer paths, see https://learn.microsoft.com/en-us/windows/win32/fileio/maximum-file-path-limitation?tabs=registry.
fr: Il est très important que le chemin choisi soit court, en raison des courtes limites de chemin Windows par défaut (260 caractères). Pour autoriser des chemins plus longs, consultez https://learn.microsoft.com/en-us/windows/win32/fileio/maximum-file-path-limitation?tabs=registry.

source: Get the ``ros2.repos`` file which defines the repositories to clone from:
fr: Récupérez le fichier ``ros2.repos`` qui définit les dépôts à partir desquels cloner :

source: Fast DDS is bundled with the ROS 2 source and will always be built unless you put an ``COLCON_IGNORE`` file in the ``src\eProsima`` folder.
fr: Fast DDS est fourni avec la source ROS 2 et sera toujours construit à moins que vous ne mettiez un fichier ``COLCON_IGNORE`` dans le dossier ``src\eProsima``.

source: If you would like to use another DDS or RTPS vendor besides the default, you can find instructions :doc:`here <../DDS-Implementations>`.
fr: Si vous souhaitez utiliser un autre fournisseur DDS ou RTPS en plus du fournisseur par défaut, vous pouvez trouver des instructions :doc:`ici <../DDS-Implementations>`.

source: Build the ROS 2 code
fr: Construire le code ROS 2

source: To build ROS 2 you will need a Visual Studio Command Prompt ("x64 Native Tools Command Prompt for VS 2019") running as Administrator.
fr: Pour construire ROS 2, vous aurez besoin d'une invite de commande Visual Studio ("Invite de commande x64 Native Tools pour VS 2019") exécutée en tant qu'administrateur.

source: To build the ``\rolling`` folder tree:
fr: Pour construire l'arborescence de dossiers ``\rolling`` :

source: We're using ``--merge-install`` here to avoid a ``PATH`` variable that is too long at the end of the build. If you're adapting these instructions to build a smaller workspace then you might be able to use the default behavior which is isolated install, i.e. where each package is installed to a different folder.
fr: Nous utilisons ici ``--merge-install`` pour éviter une variable ``PATH`` trop longue à la fin de la construction. Si vous adaptez ces instructions pour créer un espace de travail plus petit, vous pourrez peut-être utiliser le comportement par défaut qui est l'installation isolée, c'est-à-dire où chaque package est installé dans un dossier différent.

source: If you are doing a debug build use ``python_d path\to\colcon_executable`` ``colcon``. See `Extra stuff for debug mode`_ for more info on running Python code in debug builds on Windows.
fr: Si vous faites une construction de débogage, utilisez ``python_d path\to\colcon_executable`` ``colcon``. Voir `Éléments supplémentaires pour le mode débogage`_ pour plus d'informations sur l'exécution de code Python dans les versions de débogage sous Windows.

source: Environment setup
fr: Configuration de l'environnement

source: Start a command shell and source the ROS 2 setup file to set up the workspace:
fr: Démarrez un shell de commande et sourcez le fichier de configuration ROS 2 pour configurer l'espace de travail :

source: This will automatically set up the environment for any DDS vendors that support was built for.
fr: Cela configurera automatiquement l'environnement pour tous les fournisseurs de DDS pour lesquels la prise en charge a été conçue.

source: It is normal that the previous command, if nothing else went wrong, outputs "The system cannot find the path specified." exactly once.
fr: Il est normal que la commande précédente, si rien d'autre ne s'est mal passé, affiche "Le système ne peut pas trouver le chemin spécifié". exactement une fois.

source: Test and run
fr: Tester et exécuter

source: Note that the first time you run any executable you will have to allow access to the network through a Windows Firewall popup.
fr: Notez que la première fois que vous exécutez un exécutable, vous devrez autoriser l'accès au réseau via une fenêtre contextuelle du pare-feu Windows.

source: You can run the tests using this command:
fr: Vous pouvez exécuter les tests à l'aide de cette commande :

source: ``--merge-install`` should only be used if it was also used in the build step.
fr: ``--merge-install`` ne doit être utilisé que s'il a également été utilisé dans l'étape de construction.

source: Afterwards you can get a summary of the tests using this command:
fr: Ensuite, vous pouvez obtenir un résumé des tests à l'aide de cette commande :

source: To run the examples, first open a clean new ``cmd.exe`` and set up the workspace by sourcing the ``local_setup.bat`` file. Then, run a C++ ``talker``\ :
fr: Pour exécuter les exemples, ouvrez d'abord un nouveau fichier ``cmd.exe`` et configurez l'espace de travail en sélectionnant le fichier ``local_setup.bat``. Ensuite, lancez un ``talker``\ C++ :

source: In a separate shell you can do the same, but instead run a Python ``listener``\ :
fr: Dans un shell séparé, vous pouvez faire la même chose, mais à la place, exécutez un Python ``listener``\ :

source: You should see the ``talker`` saying that it's ``Publishing`` messages and the ``listener`` saying ``I heard`` those messages. This verifies both the C++ and Python APIs are working properly. Hooray!
fr: Vous devriez voir le ``locuteur`` dire qu'il ``publie`` des messages et le ``auditeur`` dire ``J'ai entendu`` ces messages. Cela vérifie que les API C++ et Python fonctionnent correctement. Hourra !

source: It is not recommended to build in the same cmd prompt that you've sourced the ``local_setup.bat``.
fr: Il n'est pas recommandé de construire dans la même invite cmd que vous avez fourni le ``local_setup.bat``.

source: Next steps after installing
fr: Prochaines étapes après l'installation

source: Continue with the :doc:`tutorials and demos <../../Tutorials>` to configure your environment, create your own workspace and packages, and learn ROS 2 core concepts.
fr: Continuez avec les :doc:`tutoriels et démos <../../Tutoriels>` pour configurer votre environnement, créer votre propre espace de travail et vos packages, et apprendre les concepts de base de ROS 2.

source: Additional RMW implementations (optional)
fr: Implémentations RMW supplémentaires (facultatif)

source: The default middleware that ROS 2 uses is ``Fast DDS``, but the middleware (RMW) can be replaced at runtime. See the :doc:`guide <../../How-To-Guides/Working-with-multiple-RMW-implementations>` on how to work with multiple RMWs.
fr: Le middleware par défaut utilisé par ROS 2 est ``Fast DDS``, mais le middleware (RMW) peut être remplacé au moment de l'exécution. Consultez le :doc:`guide <../../How-To-Guides/Working-with-multiple-RMW-implementations>` pour savoir comment travailler avec plusieurs RMW.

source: Extra stuff for Debug mode
fr: Trucs supplémentaires pour le mode débogage

source: If you want to be able to run all the tests in Debug mode, you'll need to install a few more things:
fr: Si vous voulez pouvoir exécuter tous les tests en mode débogage, vous devrez installer quelques éléments supplémentaires :

source: To be able to extract the Python source tarball, you can use PeaZip:
fr: Pour pouvoir extraire l'archive source Python, vous pouvez utiliser PeaZip :

source: You'll also need SVN, since some of the Python source-build dependencies are checked out via SVN:
fr: Vous aurez également besoin de SVN, car certaines des dépendances de construction source Python sont extraites via SVN :

source: You'll need to quit and restart the command prompt after installing the above.
fr: Vous devrez quitter et redémarrer l'invite de commande après avoir installé ce qui précède.

source: Get and extract the Python 3.8.3 source from the ``tgz``:
fr: Obtenez et extrayez la source Python 3.8.3 du ``tgz`` :

source: To keep these instructions concise, please extract it to ``C:\dev\Python-3.8.3``
fr: Pour garder ces instructions concises, veuillez les extraire dans ``C:\dev\Python-3.8.3``

source: Now, build the Python source in debug mode from a Visual Studio command prompt:
fr: Maintenant, créez la source Python en mode débogage à partir d'une invite de commande Visual Studio :

source: Finally, copy the build products into the Python38 installation directories, next to the Release-mode Python executable and DLL's:
fr: Enfin, copiez les produits de construction dans les répertoires d'installation de Python38, à côté de l'exécutable Python en mode Release et des DLL :

source: Now, from a fresh command prompt, make sure that ``python_d`` works:
fr: Maintenant, à partir d'une nouvelle invite de commande, assurez-vous que ``python_d`` fonctionne :

source: Once you have verified the operation of ``python_d``, it is necessary to reinstall a few dependencies with the debug-enabled libraries:
fr: Une fois que vous avez vérifié le fonctionnement de ``python_d``, il est nécessaire de réinstaller quelques dépendances avec les bibliothèques activées pour le débogage :

source: To verify the installation of these dependencies:
fr: Pour vérifier l'installation de ces dépendances :

source: When you wish to return to building release binaries, it is necessary to uninstall the debug variants and use the release variants:
fr: Lorsque vous souhaitez revenir à la construction des binaires de version, il est nécessaire de désinstaller les variantes de débogage et d'utiliser les variantes de version :

source: To create executables python scripts(.exe), python_d should be used to invoke colcon
fr: Pour créer des scripts python exécutables (.exe), python_d doit être utilisé pour invoquer colcon

source: Hooray, you're done!
fr: Hourra, vous avez terminé !

source: Stay up to date
fr: Tiens-toi à jour

source: See :doc:`../Maintaining-a-Source-Checkout` to periodically refresh your source installation.
fr: Voir :doc:`../Maintaining-a-Source-Checkout` pour actualiser périodiquement votre installation source.

source: Troubleshooting
fr: Dépannage

source: Troubleshooting techniques can be found :ref:`here <windows-troubleshooting>`.
fr: Les techniques de dépannage peuvent être trouvées :ref:`ici <windows-troubleshooting>`.

source: Uninstall
fr: Désinstaller
