Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Installation/Alternatives/Windows-Development-Setup.po
Languages: fr

source: If you installed your workspace with colcon as instructed above, "uninstalling" could be just a matter of opening a new terminal and not sourcing the workspace's ``setup`` file. This way, your environment will behave as though there is no Rolling install on your system.
fr: Si vous avez installé votre espace de travail avec colcon comme indiqué ci-dessus, la "désinstallation" pourrait consister simplement à ouvrir un nouveau terminal et à ne pas rechercher le fichier ``setup`` de l'espace de travail. De cette façon, votre environnement se comportera comme s'il n'y avait pas d'installation progressive sur votre système.

source: If you're also trying to free up space, you can delete the entire workspace directory with:
fr: Si vous essayez également de libérer de l'espace, vous pouvez supprimer tout le répertoire de l'espace de travail avec :
