Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Tutorials/Intermediate/Launch/Creating-Launch-Files.po
Languages: fr

source: Creating a launch file
fr: Création d'un fichier de lancement

source: **Goal:** Create a launch file to run a complex ROS 2 system.
fr: **Objectif :** Créer un fichier de lancement pour exécuter un système ROS 2 complexe.

source: **Tutorial level:** Intermediate
fr: **Niveau du didacticiel :** Intermédiaire

source: **Time:** 10 minutes
fr: **Durée :** 10 minutes

source: Contents
fr: Contenu

source: Prerequisites
fr: Conditions préalables

source: This tutorial uses the :doc:`rqt_graph and turtlesim <../../Beginner-CLI-Tools/Introducing-Turtlesim/Introducing-Turtlesim>` packages.
fr: Ce tutoriel utilise les packages :doc:`rqt_graph et turtlesim <../../Beginner-CLI-Tools/Introducing-Turtlesim/Introducing-Turtlesim>`.

source: You will also need to use a text editor of your preference.
fr: Vous devrez également utiliser un éditeur de texte de votre choix.

source: As always, don’t forget to source ROS 2 in :doc:`every new terminal you open <../../Beginner-CLI-Tools/Configuring-ROS2-Environment>`.
fr: Comme toujours, n'oubliez pas de sourcer ROS 2 dans :doc:`chaque nouveau terminal que vous ouvrez <../../Beginner-CLI-Tools/Configuring-ROS2-Environment>`.

source: Background
fr: Arrière-plan

source: The launch system in ROS 2 is responsible for helping the user describe the configuration of their system and then execute it as described. The configuration of the system includes what programs to run, where to run them, what arguments to pass them, and ROS-specific conventions which make it easy to reuse components throughout the system by giving them each a different configuration. It is also responsible for monitoring the state of the processes launched, and reporting and/or reacting to changes in the state of those processes.
fr: Le système de lancement de ROS 2 est chargé d'aider l'utilisateur à décrire la configuration de son système, puis de l'exécuter comme décrit. La configuration du système comprend les programmes à exécuter, où les exécuter, les arguments à transmettre et les conventions spécifiques à ROS qui facilitent la réutilisation des composants dans tout le système en leur donnant à chacun une configuration différente. Il est également chargé de surveiller l'état des processus lancés, de signaler et/ou de réagir aux changements d'état de ces processus.

source: Launch files written in Python, XML, or YAML can start and stop different nodes as well as trigger and act on various events. See :doc:`../../../How-To-Guides/Launch-file-different-formats` for a description of the different formats. The package providing this framework is ``launch_ros``, which uses the non-ROS-specific ``launch`` framework underneath.
fr: Les fichiers de lancement écrits en Python, XML ou YAML peuvent démarrer et arrêter différents nœuds ainsi que déclencher et agir sur divers événements. Voir :doc:`../../../How-To-Guides/Launch-file-different-formats` pour une description des différents formats. Le package fournissant ce framework est ``launch_ros``, qui utilise le framework ``launch`` non spécifique à ROS en dessous.

source: The `design document <https://design.ros2.org/articles/roslaunch.html>`__ details the goal of the design of ROS 2's launch system (not all functionality is currently available).
fr: Le `document de conception <https://design.ros2.org/articles/roslaunch.html>`__ détaille l'objectif de la conception du système de lancement de ROS 2 (toutes les fonctionnalités ne sont pas actuellement disponibles).

source: Tasks
fr: Tâches

source: 1 Setup
fr: 1 Configuration

source: Create a new directory to store your launch files:
fr: Créez un nouveau répertoire pour stocker vos fichiers de lancement :

source: 2 Write the launch file
fr: 2 Écrivez le fichier de lancement

source: Let’s put together a ROS 2 launch file using the ``turtlesim`` package and its executables. As mentioned above, this can either be in Python, XML, or YAML.
fr: Constituons un fichier de lancement ROS 2 en utilisant le package ``turtlesim`` et ses exécutables. Comme mentionné ci-dessus, cela peut être en Python, XML ou YAML.

source: Copy and paste the complete code into the ``launch/turtlesim_mimic_launch.py`` file:
fr: Copiez et collez le code complet dans le fichier ``launch/turtlesim_mimic_launch.py`` :

source: Copy and paste the complete code into the ``launch/turtlesim_mimic_launch.xml`` file:
fr: Copiez et collez le code complet dans le fichier ``launch/turtlesim_mimic_launch.xml`` :

source: Copy and paste the complete code into the ``launch/turtlesim_mimic_launch.yaml`` file:
fr: Copiez et collez le code complet dans le fichier ``launch/turtlesim_mimic_launch.yaml`` :

source: 2.1 Examine the launch file
fr: 2.1 Examiner le fichier de lancement

source: All of the launch files above are launching a system of three nodes, all from the ``turtlesim`` package. The goal of the system is to launch two turtlesim windows, and have one turtle mimic the movements of the other.
fr: Tous les fichiers de lancement ci-dessus lancent un système de trois nœuds, tous issus du package ``turtlesim``. Le but du système est de lancer deux fenêtres de simulation de tortues et de faire en sorte qu'une tortue imite les mouvements de l'autre.

source: When launching the two turtlesim nodes, the only difference between them is their namespace values. Unique namespaces allow the system to start two nodes without node name or topic name conflicts. Both turtles in this system receive commands over the same topic and publish their pose over the same topic. With unique namespaces, messages meant for different turtles can be distinguished.
fr: Lors du lancement des deux nœuds turtlesim, la seule différence entre eux réside dans leurs valeurs d'espace de noms. Les espaces de noms uniques permettent au système de démarrer deux nœuds sans conflit de nom de nœud ou de nom de rubrique. Les deux tortues de ce système reçoivent des commandes sur le même sujet et publient leur pose sur le même sujet. Avec des espaces de noms uniques, les messages destinés à différentes tortues peuvent être distingués.

source: The final node is also from the ``turtlesim`` package, but a different executable: ``mimic``. This node has added configuration details in the form of remappings. ``mimic``'s ``/input/pose`` topic is remapped to ``/turtlesim1/turtle1/pose`` and it's ``/output/cmd_vel`` topic to ``/turtlesim2/turtle1/cmd_vel``. This means ``mimic`` will subscribe to ``/turtlesim1/sim``'s pose topic and republish it for ``/turtlesim2/sim``'s velocity command topic to subscribe to. In other words, ``turtlesim2`` will mimic ``turtlesim1``'s movements.
fr: Le nœud final provient également du package ``turtlesim``, mais un exécutable différent : ``mimic``. Ce nœud a ajouté des détails de configuration sous la forme de remappages. Le sujet ``/input/pose`` de ``mimic`` est remappé sur ``/turtlesim1/turtle1/pose`` et c'est le sujet ``/output/cmd_vel`` sur ``/turtlesim2/turtle1/cmd_vel` `. Cela signifie que ``mimic`` s'abonnera au sujet de pose de ``/turtlesim1/sim`` et le republiera pour le sujet de commande de vélocité de ``/turtlesim2/sim`` auquel s'abonner. En d'autres termes, ``turtlesim2`` imitera les mouvements de ``turtlesim1``.

source: These import statements pull in some Python ``launch`` modules.
fr: Ces instructions d'importation récupèrent certains modules Python ``launch``.

source: Next, the launch description itself begins:
fr: Ensuite, la description de lancement elle-même commence :

source: The first two actions in the launch description launch the two turtlesim windows:
fr: Les deux premières actions de la description de lancement lancent les deux fenêtres turtlesim :

source: The final action launches the mimic node with the remaps:
fr: L'action finale lance le nœud mimique avec les remappages :

source: The first two actions launch the two turtlesim windows:
fr: Les deux premières actions lancent les deux fenêtres turtlesim :

source: 3 ros2 launch
fr: lancement de 3 ros2

source: To run the launch file created above, enter into the directory you created earlier and run the following command:
fr: Pour exécuter le fichier de lancement créé ci-dessus, entrez dans le répertoire que vous avez créé précédemment et exécutez la commande suivante :

source: It is possible to launch a launch file directly (as we do above), or provided by a package. When it is provided by a package, the syntax is:
fr: Il est possible de lancer un fichier de lancement directement (comme nous le faisons plus haut), ou fourni par un package. Lorsqu'il est fourni par un package, la syntaxe est :

source: You learned about creating packages in :doc:`../../Beginner-Client-Libraries/Creating-Your-First-ROS2-Package`.
fr: Vous avez appris à créer des packages dans :doc:`../../Beginner-Client-Libraries/Creating-Your-First-ROS2-Package`.

source: For packages with launch files, it is a good idea to add an ``exec_depend`` dependency on the ``ros2launch`` package in your package's ``package.xml``:
fr: Pour les paquets avec des fichiers de lancement, c'est une bonne idée d'ajouter une dépendance ``exec_depend`` sur le paquet ``ros2launch`` dans le ``package.xml`` de votre paquet :

source: This helps make sure that the ``ros2 launch`` command is available after building your package. It also ensures that all :doc:`launch file formats <../../../How-To-Guides/Launch-file-different-formats>` are recognized.
fr: Cela permet de s'assurer que la commande ``ros2 launch`` est disponible après la construction de votre package. Il garantit également que tous les :doc:`formats de fichier de lancement <../../../How-To-Guides/Launch-file-different-formats>` sont reconnus.

source: Two turtlesim windows will open, and you will see the following ``[INFO]`` messages telling you which nodes your launch file has started:
fr: Deux fenêtres turtlesim s'ouvriront et vous verrez les messages ``[INFO]`` suivants vous indiquant quels nœuds votre fichier de lancement a démarré :

source: To see the system in action, open a new terminal and run the ``ros2 topic pub`` command on the ``/turtlesim1/turtle1/cmd_vel`` topic to get the first turtle moving:
fr: Pour voir le système en action, ouvrez un nouveau terminal et exécutez la commande ``ros2 topic pub`` sur le sujet ``/turtlesim1/turtle1/cmd_vel`` pour faire bouger la première tortue :

source: You will see both turtles following the same path.
fr: Vous verrez les deux tortues suivre le même chemin.

source: 4 Introspect the system with rqt_graph
fr: 4 Introspecter le système avec rqt_graph

source: While the system is still running, open a new terminal and run ``rqt_graph`` to get a better idea of the relationship between the nodes in your launch file.
fr: Pendant que le système est toujours en cours d'exécution, ouvrez un nouveau terminal et exécutez ``rqt_graph`` pour avoir une meilleure idée de la relation entre les nœuds dans votre fichier de lancement.

source: Run the command:
fr: Exécutez la commande :

source: A hidden node (the ``ros2 topic pub`` command you ran) is publishing data to the ``/turtlesim1/turtle1/cmd_vel`` topic on the left, which the ``/turtlesim1/sim`` node is subscribed to. The rest of the graph shows what was described earlier: ``mimic`` is subscribed to ``/turtlesim1/sim``'s pose topic, and publishes to ``/turtlesim2/sim``'s velocity command topic.
fr: Un nœud caché (la commande ``ros2 topic pub`` que vous avez exécutée) publie des données dans le sujet ``/turtlesim1/turtle1/cmd_vel`` à gauche, auquel le nœud ``/turtlesim1/sim`` est abonné. . Le reste du graphique montre ce qui a été décrit précédemment : ``mimic`` est abonné au sujet de pose de ``/turtlesim1/sim`` et publie dans le sujet de commande de vélocité de ``/turtlesim2/sim``.

source: Summary
fr: Résumé

source: Launch files simplify running complex systems with many nodes and specific configuration details. You can create launch files using Python, XML, or YAML, and run them using the ``ros2 launch`` command.
fr: Les fichiers de lancement simplifient l'exécution de systèmes complexes avec de nombreux nœuds et des détails de configuration spécifiques. Vous pouvez créer des fichiers de lancement à l'aide de Python, XML ou YAML et les exécuter à l'aide de la commande ``ros2 launch``.
