Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Tutorials/Intermediate/Launch/Launch-Main.po
Languages: fr

source: Launch
fr: Lancement

source: ROS 2 Launch files allow you to start up and configure a number of executables containing ROS 2 nodes simultaneously.
fr: Les fichiers de lancement ROS 2 vous permettent de démarrer et de configurer simultanément un certain nombre d'exécutables contenant des nœuds ROS 2.

source: :doc:`Creating a launch file <./Creating-Launch-Files>`.
fr: :doc:`Création d'un fichier de lancement <./Creating-Launch-Files>`.

source: Learn how to create a launch file that will start up nodes and their configurations all at once.
fr: Apprenez à créer un fichier de lancement qui démarrera les nœuds et leurs configurations en même temps.

source: :doc:`Launching and monitoring multiple nodes <./Launch-system>`.
fr: :doc:`Lancement et surveillance de plusieurs nœuds <./Launch-system>`.

source: Get a more advanced overview of how launch files work.
fr: Obtenez un aperçu plus avancé du fonctionnement des fichiers de lancement.

source: :doc:`Using substitutions <./Using-Substitutions>`.
fr: :doc:`Utilisation des substitutions <./Using-Substitutions>`.

source: Use substitutions to provide more flexibility when describing reusable launch files.
fr: Utilisez des substitutions pour offrir plus de flexibilité lors de la description de fichiers de lancement réutilisables.

source: :doc:`Using event handlers <./Using-Event-Handlers>`.
fr: :doc:`Utilisation des gestionnaires d'événements <./Using-Event-Handlers>`.

source: Use event handlers to monitor the state of processes or to define a complex set of rules that can be used to dynamically modify the launch file.
fr: Utilisez des gestionnaires d'événements pour surveiller l'état des processus ou pour définir un ensemble complexe de règles pouvant être utilisées pour modifier dynamiquement le fichier de lancement.

source: :doc:`Managing large projects <./Using-ROS2-Launch-For-Large-Projects>`.
fr: :doc:`Gestion de grands projets <./Using-ROS2-Launch-For-Large-Projects>`.

source: Structure launch files for large projects so they may be reused as much as possible in different situations. See usage examples of different launch tools like parameters, YAML files, remappings, namespaces, default arguments, and RViz configs.
fr: Structurez les fichiers de lancement pour les grands projets afin qu'ils puissent être réutilisés autant que possible dans différentes situations. Consultez des exemples d'utilisation de différents outils de lancement tels que les paramètres, les fichiers YAML, les remappages, les espaces de noms, les arguments par défaut et les configurations RViz.

source: If you are coming from ROS 1, you can use the :doc:`ROS Launch Migration guide <../../../How-To-Guides/Launch-files-migration-guide>` to help you migrate your launch files to ROS 2.
fr: Si vous venez de ROS 1, vous pouvez utiliser le :doc:`guide de migration de lancement de ROS <../../../How-To-Guides/Launch-files-migration-guide>` pour vous aider à migrer votre lancer des fichiers vers ROS 2.
