Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Tutorials/Intermediate/Launch/Launch-system.po
Languages: fr

source: Integrating launch files into ROS 2 packages
fr: Intégration des fichiers de lancement dans les packages ROS 2

source: **Goal:** Add a launch file to a ROS 2 package
fr: **Objectif :** Ajouter un fichier de lancement à un package ROS 2

source: **Tutorial level:** Intermediate
fr: **Niveau du didacticiel :** Intermédiaire

source: **Time:** 10 minutes
fr: **Durée :** 10 minutes

source: Contents
fr: Contenu

source: Prerequisites
fr: Conditions préalables

source: You should have gone through the tutorial on how to :doc:`create a ROS 2 package <../../Beginner-Client-Libraries/Creating-Your-First-ROS2-Package>`.
fr: Vous devriez avoir suivi le didacticiel sur la façon de :doc:`créer un package ROS 2 <../../Beginner-Client-Libraries/Creating-Your-First-ROS2-Package>`.

source: As always, don’t forget to source ROS 2 in :doc:`every new terminal you open <../../Beginner-CLI-Tools/Configuring-ROS2-Environment>`.
fr: Comme toujours, n'oubliez pas de sourcer ROS 2 dans :doc:`chaque nouveau terminal que vous ouvrez <../../Beginner-CLI-Tools/Configuring-ROS2-Environment>`.

source: Background
fr: Arrière-plan

source: In the :doc:`previous tutorial <Creating-Launch-Files>`, we saw how to write a standalone launch file. This tutorial will show how to add a launch file to an existing package, and the conventions typically used.
fr: Dans le :doc:`tutoriel précédent <Creating-Launch-Files>`, nous avons vu comment écrire un fichier de lancement autonome. Ce didacticiel montrera comment ajouter un fichier de lancement à un package existant et les conventions généralement utilisées.

source: Tasks
fr: Tâches

source: 1 Create a package
fr: 1 Créer un package

source: Create a workspace for the package to live in:
fr: Créez un espace de travail dans lequel le package doit résider :

source: Windows
fr: les fenêtres

source: Python package
fr: Paquet Python

source: C++ package
fr: Paquet C++

source: 2 Creating the structure to hold launch files
fr: 2 Création de la structure pour contenir les fichiers de lancement

source: By convention, all launch files for a package are stored in the ``launch`` directory inside of the package. Make sure to create a ``launch`` directory at the top-level of the package you created above.
fr: Par convention, tous les fichiers de lancement d'un paquet sont stockés dans le répertoire ``launch`` à l'intérieur du paquet. Assurez-vous de créer un répertoire ``launch`` au niveau supérieur du paquet que vous avez créé ci-dessus.

source: For Python packages, the directory containing your package should look like this:
fr: Pour les packages Python, le répertoire contenant votre package devrait ressembler à ceci :

source: In order for colcon to find the launch files, we need to inform Python's setup tools of our launch files using the ``data_files`` parameter of ``setup``.
fr: Pour que colcon trouve les fichiers de lancement, nous devons informer les outils de configuration de Python de nos fichiers de lancement en utilisant le paramètre ``data_files`` de ``setup``.

source: Inside our ``setup.py`` file:
fr: Dans notre fichier ``setup.py`` :

source: For C++ packages, we will only be adjusting the ``CMakeLists.txt`` file by adding:
fr: Pour les packages C++, nous n'ajusterons le fichier ``CMakeLists.txt`` qu'en ajoutant :

source: to the end of the file (but before ``ament_package()``).
fr: à la fin du fichier (mais avant ``ament_package()``).

source: 3 Writing the launch file
fr: 3 Ecriture du fichier de lancement

source: Python launch file
fr: Fichier de lancement Python

source: Inside your ``launch`` directory, create a new launch file called ``my_script_launch.py``. ``_launch.py`` is recommended, but not required, as the file suffix for Python launch files. However, the launch file name needs to end with ``launch.py`` to be recognized and autocompleted by ``ros2 launch``.
fr: Dans votre répertoire ``launch``, créez un nouveau fichier de lancement appelé ``my_script_launch.py``. ``_launch.py`` est recommandé, mais pas obligatoire, comme suffixe de fichier pour les fichiers de lancement Python. Cependant, le nom du fichier de lancement doit se terminer par ``launch.py`` pour être reconnu et complété automatiquement par ``ros2 launch``.

source: Your launch file should define the ``generate_launch_description()`` function which returns a ``launch.LaunchDescription()`` to be used by the ``ros2 launch`` verb.
fr: Votre fichier de lancement doit définir la fonction ``generate_launch_description()`` qui renvoie un ``launch.LaunchDescription()`` à utiliser par le verbe ``ros2 launch``.

source: XML launch file
fr: Fichier de lancement XML

source: Inside your ``launch`` directory, create a new launch file called ``my_script_launch.xml``. ``_launch.xml`` is recommended, but not required, as the file suffix for XML launch files.
fr: Dans votre répertoire ``launch``, créez un nouveau fichier de lancement appelé ``my_script_launch.xml``. ``_launch.xml`` est recommandé, mais pas obligatoire, comme suffixe de fichier pour les fichiers de lancement XML.

source: YAML launch file
fr: Fichier de lancement YAML

source: Inside your ``launch`` directory, create a new launch file called ``my_script_launch.yaml``. ``_launch.yaml`` is recommended, but not required, as the file suffix for YAML launch files.
fr: Dans votre répertoire ``launch``, créez un nouveau fichier de lancement appelé ``my_script_launch.yaml``. ``_launch.yaml`` est recommandé, mais pas obligatoire, comme suffixe de fichier pour les fichiers de lancement YAML.

source: 4 Building and running the launch file
fr: 4 Construire et exécuter le fichier de lancement

source: Go to the top-level of the workspace, and build it:
fr: Accédez au niveau supérieur de l'espace de travail et créez-le :

source: After the ``colcon build`` has been successful and you've sourced the workspace, you should be able to run the launch file as follows:
fr: Une fois que le ``colcon build`` a réussi et que vous avez créé l'espace de travail, vous devriez pouvoir exécuter le fichier de lancement comme suit :

source: `The launch documentation <https://github.com/ros2/launch/blob/rolling/launch/doc/source/architecture.rst>`__ provides more details on concepts that are also used in ``launch_ros``.
fr: `La documentation de lancement <https://github.com/ros2/launch/blob/rolling/launch/doc/source/architecture.rst>`__ fournit plus de détails sur les concepts qui sont également utilisés dans ``launch_ros``.

source: Additional documentation/examples of launch capabilities are forthcoming. See the source code (https://github.com/ros2/launch and https://github.com/ros2/launch_ros) in the meantime.
fr: De la documentation/des exemples supplémentaires de capacités de lancement sont à venir. Voir le code source (https://github.com/ros2/launch et https://github.com/ros2/launch_ros) en attendant.
