Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Tutorials/Intermediate/Launch/Using-Event-Handlers.po
Languages: fr

source: Using event handlers
fr: Utilisation des gestionnaires d'événements

source: **Goal:** Learn about event handlers in ROS 2 launch files
fr: **Objectif :** En savoir plus sur les gestionnaires d'événements dans les fichiers de lancement de ROS 2

source: **Tutorial level:** Intermediate
fr: **Niveau du didacticiel :** Intermédiaire

source: **Time:** 15 minutes
fr: **Durée :** 15 minutes

source: Table of Contents
fr: Table des matières

source: Background
fr: Arrière-plan

source: Launch in ROS 2 is a system that executes and manages user-defined processes. It is responsible for monitoring the state of processes it launched, as well as reporting and reacting to changes in the state of those processes. These changes are called events and can be handled by registering an event handler with the launch system. Event handlers can be registered for specific events and can be useful for monitoring the state of processes. Additionally, they can be used to define a complex set of rules which can be used to dynamically modify the launch file.
fr: Le lancement dans ROS 2 est un système qui exécute et gère des processus définis par l'utilisateur. Il est chargé de surveiller l'état des processus qu'il a lancés, ainsi que de signaler et de réagir aux changements d'état de ces processus. Ces modifications sont appelées événements et peuvent être gérées en enregistrant un gestionnaire d'événements auprès du système de lancement. Les gestionnaires d'événements peuvent être enregistrés pour des événements spécifiques et peuvent être utiles pour surveiller l'état des processus. De plus, ils peuvent être utilisés pour définir un ensemble complexe de règles qui peuvent être utilisées pour modifier dynamiquement le fichier de lancement.

source: This tutorial shows usage examples of event handlers in ROS 2 launch files.
fr: Ce didacticiel montre des exemples d'utilisation de gestionnaires d'événements dans les fichiers de lancement ROS 2.

source: Prerequisites
fr: Conditions préalables

source: This tutorial uses the :doc:`turtlesim <../../Beginner-CLI-Tools/Introducing-Turtlesim/Introducing-Turtlesim>` package. This tutorial also assumes you have :doc:`created a new package <../../Beginner-Client-Libraries/Creating-Your-First-ROS2-Package>` of build type ``ament_python`` called ``launch_tutorial``.
fr: Ce tutoriel utilise le package :doc:`turtlesim <../../Beginner-CLI-Tools/Introducing-Turtlesim/Introducing-Turtlesim>`. Ce didacticiel suppose également que vous avez :doc:`créé un nouveau package <../../Beginner-Client-Libraries/Creating-Your-First-ROS2-Package>` de type de construction ``ament_python`` appelé ``launch_tutorial ``.

source: This tutorial extends the code shown in the :doc:`Using substitutions in launch files <./Using-Substitutions>` tutorial.
fr: Ce didacticiel étend le code présenté dans le didacticiel :doc:`Using substitutions in launch files <./Using-Substitutions>`.

source: 1 Event handlers example launch file
fr: 1 Exemple de fichier de lancement de gestionnaires d'événements

source: Create a new file called ``example_event_handlers.launch.py`` file in the ``launch`` folder of the ``launch_tutorial`` package.
fr: Créez un nouveau fichier nommé ``example_event_handlers.launch.py`` dans le dossier ``launch`` du package ``launch_tutorial``.

source: ``RegisterEventHandler`` actions for the ``OnProcessStart``, ``OnProcessIO``, ``OnExecutionComplete``, ``OnProcessExit``, and ``OnShutdown`` events were defined in the launch description.
fr: Les actions ``RegisterEventHandler`` pour les événements ``OnProcessStart``, ``OnProcessIO``, ``OnExecutionComplete``, ``OnProcessExit`` et ``OnShutdown`` ont été définies dans la description de lancement.

source: The ``OnProcessStart`` event handler is used to register a callback function that is executed when the turtlesim node starts. It logs a message to the console and executes the ``spawn_turtle`` action when the turtlesim node starts.
fr: Le gestionnaire d'événements ``OnProcessStart`` est utilisé pour enregistrer une fonction de rappel qui est exécutée lorsque le nœud turtlesim démarre. Il enregistre un message sur la console et exécute l'action ``spawn_turtle`` lorsque le nœud turtlesim démarre.

source: The ``OnProcessIO`` event handler is used to register a callback function that is executed when the ``spawn_turtle`` action writes to its standard output. It logs the result of the spawn request.
fr: Le gestionnaire d'événements ``OnProcessIO`` est utilisé pour enregistrer une fonction de rappel qui est exécutée lorsque l'action ``spawn_turtle`` écrit sur sa sortie standard. Il enregistre le résultat de la demande de spawn.

source: The ``OnExecutionComplete`` event handler is used to register a callback function that is executed when the ``spawn_turtle`` action completes. It logs a message to the console and executes the ``change_background_r`` and ``change_background_r_conditioned`` actions when the spawn action completes.
fr: Le gestionnaire d'événements ``OnExecutionComplete`` est utilisé pour enregistrer une fonction de rappel qui est exécutée lorsque l'action ``spawn_turtle`` se termine. Il consigne un message dans la console et exécute les actions ``change_background_r`` et ``change_background_r_conditioned`` lorsque l'action spawn est terminée.

source: The ``OnProcessExit`` event handler is used to register a callback function that is executed when the turtlesim node exits. It logs a message to the console and executes the ``EmitEvent`` action to emit a ``Shutdown`` event when the turtlesim node exits. It means that the launch process will shutdown when the turtlesim window is closed.
fr: Le gestionnaire d'événements ``OnProcessExit`` est utilisé pour enregistrer une fonction de rappel qui est exécutée lorsque le nœud turtlesim se termine. Il enregistre un message sur la console et exécute l'action ``EmitEvent`` pour émettre un événement ``Shutdown`` lorsque le nœud turtlesim se termine. Cela signifie que le processus de lancement s'arrêtera lorsque la fenêtre turtlesim sera fermée.

source: Finally, the ``OnShutdown`` event handler is used to register a callback function that is executed when the launch file is asked to shutdown. It logs a message to the console why the launch file is asked to shutdown. It logs the message with a reason for shutdown like the closure of turtlesim window or ``ctrl-c`` signal made by the user.
fr: Enfin, le gestionnaire d'événements ``OnShutdown`` est utilisé pour enregistrer une fonction de rappel qui est exécutée lorsque le fichier de lancement est invité à s'arrêter. Il enregistre un message sur la console expliquant pourquoi le fichier de lancement est invité à s'arrêter. Il enregistre le message avec une raison d'arrêt comme la fermeture de la fenêtre turtlesim ou le signal ``ctrl-c`` effectué par l'utilisateur.

source: Build the package
fr: Construire le paquet

source: Go to the root of the workspace, and build the package:
fr: Accédez à la racine de l'espace de travail et créez le package :

source: Also remember to source the workspace after building.
fr: N'oubliez pas non plus de sourcer l'espace de travail après la construction.

source: Launching example
fr: Exemple de lancement

source: Now you can launch the ``example_event_handlers.launch.py`` file using the ``ros2 launch`` command.
fr: Vous pouvez maintenant lancer le fichier ``example_event_handlers.launch.py`` en utilisant la commande ``ros2 launch``.

source: This will do the following:
fr: Cela fera ce qui suit :

source: Start a turtlesim node with a blue background
fr: Démarrer un nœud turtlesim avec un fond bleu

source: Spawn the second turtle
fr: Faire apparaître la deuxième tortue

source: Change the color to purple
fr: Changer la couleur en violet

source: Change the color to pink after two seconds if the provided ``background_r`` argument is ``200`` and ``use_provided_red`` argument is ``True``
fr: Changez la couleur en rose après deux secondes si l'argument ``background_r`` fourni est ``200`` et l'argument ``use_provided_red`` est ``True``

source: Shutdown the launch file when the turtlesim window is closed
fr: Arrêter le fichier de lancement lorsque la fenêtre turtlesim est fermée

source: Additionally, it will log messages to the console when:
fr: De plus, il consignera les messages dans la console lorsque :

source: The turtlesim node starts
fr: Le noeud turtlesim démarre

source: The spawn action is executed
fr: L'action spawn est exécutée

source: The ``change_background_r`` action is executed
fr: L'action ``change_background_r`` est exécutée

source: The ``change_background_r_conditioned`` action is executed
fr: L'action ``change_background_r_conditioned`` est exécutée

source: The turtlesim node exits
fr: Le noeud turtlesim se ferme

source: The launch process is asked to shutdown.
fr: Le processus de lancement est invité à s'arrêter.

source: `The launch documentation <https://github.com/ros2/launch/blob/rolling/launch/doc/source/architecture.rst>`_ provides detailed information about available event handlers.
fr: `La documentation de lancement <https://github.com/ros2/launch/blob/rolling/launch/doc/source/architecture.rst>`_ fournit des informations détaillées sur les gestionnaires d'événements disponibles.

source: Summary
fr: Résumé

source: In this tutorial, you learned about using event handlers in launch files. You learned about their syntax and usage examples to define a complex set of rules to dynamically modify launch files.
fr: Dans ce didacticiel, vous avez appris à utiliser des gestionnaires d'événements dans les fichiers de lancement. Vous avez découvert leur syntaxe et des exemples d'utilisation pour définir un ensemble complexe de règles permettant de modifier dynamiquement les fichiers de lancement.
