Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Tutorials/Intermediate/Launch/Using-ROS2-Launch-For-Large-Projects.po
Languages: fr

source: Managing large projects
fr: Gestion de grands projets

source: **Goal:** Learn best practices of managing large projects using ROS 2 launch files.
fr: **Objectif :** Apprendre les meilleures pratiques de gestion de grands projets à l'aide des fichiers de lancement ROS 2.

source: **Tutorial level:** Intermediate
fr: **Niveau du didacticiel :** Intermédiaire

source: **Time:** 20 minutes
fr: **Durée :** 20 minutes

source: Contents
fr: Contenu

source: Background
fr: Arrière-plan

source: This tutorial describes some tips for writing launch files for large projects. The focus is on how to structure launch files so they may be reused as much as possible in different situations. Additionally, it covers usage examples of different ROS 2 launch tools, like parameters, YAML files, remappings, namespaces, default arguments, and RViz configs.
fr: Ce didacticiel décrit quelques conseils pour écrire des fichiers de lancement pour des projets volumineux. L'accent est mis sur la façon de structurer les fichiers de lancement afin qu'ils puissent être réutilisés autant que possible dans différentes situations. En outre, il couvre des exemples d'utilisation de différents outils de lancement ROS 2, tels que les paramètres, les fichiers YAML, les remappages, les espaces de noms, les arguments par défaut et les configurations RViz.

source: Prerequisites
fr: Conditions préalables

source: This tutorial uses the :doc:`turtlesim <../../Beginner-CLI-Tools/Introducing-Turtlesim/Introducing-Turtlesim>` and :doc:`turtle_tf2_py <../Tf2/Introduction-To-Tf2>` packages. This tutorial also assumes you have :doc:`created a new package <../../Beginner-Client-Libraries/Creating-Your-First-ROS2-Package>` of build type ``ament_python`` called ``launch_tutorial``.
fr: Ce tutoriel utilise :doc:`turtlesim <../../Beginner-CLI-Tools/Introducing-Turtlesim/Introducing-Turtlesim>` et :doc:`turtle_tf2_py <../Tf2/Introduction-To-Tf2>` paquets. Ce didacticiel suppose également que vous avez :doc:`créé un nouveau package <../../Beginner-Client-Libraries/Creating-Your-First-ROS2-Package>` de type de construction ``ament_python`` appelé ``launch_tutorial ``.

source: Large applications on a robot typically involve several interconnected nodes, each of which can have many parameters. Simulation of multiple turtles in the turtle simulator can serve as a good example. The turtle simulation consists of multiple turtle nodes, the world configuration, and the TF broadcaster and listener nodes. Between all of the nodes, there are a large number of ROS parameters that affect the behavior and appearance of these nodes. ROS 2 launch files allow us to start all nodes and set corresponding parameters in one place. By the end of a tutorial, you will build the ``launch_turtlesim.launch.py`` launch file in the ``launch_tutorial`` package. This launch file will bring up different nodes responsible for the simulation of two turtlesim simulations, starting TF broadcasters and listener, loading parameters, and launching an RViz configuration. In this tutorial, we'll go over this launch file and all related features used.
fr: Les grandes applications sur un robot impliquent généralement plusieurs nœuds interconnectés, chacun pouvant avoir de nombreux paramètres. La simulation de plusieurs tortues dans le simulateur de tortues peut servir de bon exemple. La simulation de tortue se compose de plusieurs nœuds de tortue, de la configuration mondiale et des nœuds de diffusion et d'écoute TF. Entre tous les nœuds, il existe un grand nombre de paramètres ROS qui affectent le comportement et l'apparence de ces nœuds. Les fichiers de lancement ROS 2 nous permettent de démarrer tous les nœuds et de définir les paramètres correspondants en un seul endroit. À la fin d'un didacticiel, vous construirez le fichier de lancement ``launch_turtlesim.launch.py`` dans le package ``launch_tutorial``. Ce fichier de lancement fera apparaître différents nœuds responsables de la simulation de deux simulations turtlesim, du démarrage des diffuseurs et de l'écouteur TF, du chargement des paramètres et du lancement d'une configuration RViz. Dans ce didacticiel, nous allons passer en revue ce fichier de lancement et toutes les fonctionnalités associées utilisées.

source: Writing launch files
fr: Ecriture des fichiers de lancement

source: 1 Top-level organization
fr: 1 Organisation au plus haut niveau

source: One of the aims in the process of writing launch files should be making them as reusable as possible. This could be done by clustering related nodes and configurations into separate launch files. Afterwards, a top-level launch file dedicated to a specific configuration could be written. This would allow moving between identical robots to be done without changing the launch files at all. Even a change such as moving from a real robot to a simulated one can be done with only a few changes.
fr: L'un des objectifs du processus d'écriture des fichiers de lancement devrait être de les rendre aussi réutilisables que possible. Cela peut être fait en regroupant les nœuds et les configurations associés dans des fichiers de lancement distincts. Ensuite, un fichier de lancement de niveau supérieur dédié à une configuration spécifique pourrait être écrit. Cela permettrait de se déplacer entre des robots identiques sans modifier du tout les fichiers de lancement. Même un changement tel que le passage d'un robot réel à un robot simulé peut être effectué avec seulement quelques changements.

source: We will now go over the top-level launch file structure that makes this possible. Firstly, we will create a launch file that will call separate launch files. To do this, let's create a ``launch_turtlesim.launch.py`` file in the ``/launch`` folder of our ``launch_tutorial`` package.
fr: Nous allons maintenant passer en revue la structure de fichier de lancement de niveau supérieur qui rend cela possible. Tout d'abord, nous allons créer un fichier de lancement qui appellera des fichiers de lancement séparés. Pour ce faire, créons un fichier ``launch_turtlesim.launch.py`` dans le dossier ``/launch`` de notre package ``launch_tutorial``.

source: This launch file includes a set of other launch files. Each of these included launch files contains nodes, parameters, and possibly, nested includes, which pertain to one part of the system. To be exact, we launch two turtlesim simulation worlds, TF broadcaster, TF listener, mimic, fixed frame broadcaster, and RViz nodes.
fr: Ce fichier de lancement inclut un ensemble d'autres fichiers de lancement. Chacun de ces fichiers de lancement inclus contient des nœuds, des paramètres et éventuellement des inclusions imbriquées, qui se rapportent à une partie du système. Pour être exact, nous lançons deux mondes de simulation turtlesim, un diffuseur TF, un écouteur TF, un synoptique, un diffuseur à cadre fixe et des nœuds RViz.

source: Design Tip: Top-level launch files should be short, consist of includes to other files corresponding to subcomponents of the application, and commonly changed parameters.
fr: Conseil de conception : les fichiers de lancement de niveau supérieur doivent être courts, se composer d'inclusions dans d'autres fichiers correspondant aux sous-composants de l'application et des paramètres couramment modifiés.

source: Writing launch files in the following manner makes it easy to swap out one piece of the system, as we'll see later. However, there are cases when some nodes or launch files have to be launched separately due to performance and usage reasons.
fr: L'écriture des fichiers de lancement de la manière suivante facilite l'échange d'un élément du système, comme nous le verrons plus tard. Cependant, il existe des cas où certains nœuds ou fichiers de lancement doivent être lancés séparément pour des raisons de performances et d'utilisation.

source: Design tip: Be aware of the tradeoffs when deciding how many top-level launch files your application requires.
fr: Conseil de conception : Soyez conscient des compromis lorsque vous décidez du nombre de fichiers de lancement de niveau supérieur dont votre application a besoin.

source: 2 Parameters
fr: 2 paramètres

source: 2.1 Setting parameters in the launch file
fr: 2.1 Réglage des paramètres dans le fichier de lancement

source: We will begin by writing a launch file that will start our first turtlesim simulation. First, create a new file called ``turtlesim_world_1.launch.py``.
fr: Nous allons commencer par écrire un fichier de lancement qui lancera notre première simulation turtlesim. Tout d'abord, créez un nouveau fichier appelé ``turtlesim_world_1.launch.py``.

source: This launch file starts the ``turtlesim_node`` node, which starts the turtlesim simulation, with simulation configuration parameters that are defined and passed to the nodes.
fr: Ce fichier de lancement démarre le nœud ``turtlesim_node``, qui démarre la simulation turtlesim, avec les paramètres de configuration de la simulation qui sont définis et transmis aux nœuds.

source: 2.2 Loading parameters from YAML file
fr: 2.2 Chargement des paramètres depuis le fichier YAML

source: In the second launch, we will start a second turtlesim simulation with a different configuration. Now create a ``turtlesim_world_2.launch.py`` file.
fr: Lors du second lancement, nous lancerons une seconde simulation turtlesim avec une configuration différente. Créez maintenant un fichier ``turtlesim_world_2.launch.py``.

source: This launch file will launch the same ``turtlesim_node`` with parameter values that are loaded directly from the YAML configuration file. Defining arguments and parameters in YAML files make it easy to store and load a large number of variables. In addition, YAML files can be easily exported from the current ``ros2 param`` list. To learn how to do that, refer to the :doc:`Understand parameters <../../Beginner-CLI-Tools/Understanding-ROS2-Parameters/Understanding-ROS2-Parameters>` tutorial.
fr: Ce fichier de lancement lancera le même ``turtlesim_node`` avec des valeurs de paramètres chargées directement depuis le fichier de configuration YAML. La définition d'arguments et de paramètres dans les fichiers YAML facilite le stockage et le chargement d'un grand nombre de variables. De plus, les fichiers YAML peuvent être facilement exportés à partir de la liste actuelle ``ros2 param``. Pour savoir comment procéder, reportez-vous au didacticiel :doc:`Understand parameters <../../Beginner-CLI-Tools/Understanding-ROS2-Parameters/Understanding-ROS2-Parameters>`.

source: Let's now create a configuration file, ``turtlesim.yaml``, in the ``/config`` folder of our package, which will be loaded by our launch file.
fr: Créons maintenant un fichier de configuration, ``turtlesim.yaml``, dans le dossier ``/config`` de notre package, qui sera chargé par notre fichier de lancement.

source: If we now start the ``turtlesim_world_2.launch.py`` launch file, we will start the ``turtlesim_node`` with preconfigured background colors.
fr: Si nous démarrons maintenant le fichier de lancement ``turtlesim_world_2.launch.py``, nous lancerons le ``turtlesim_node`` avec des couleurs d'arrière-plan préconfigurées.

source: To learn more about using parameters and using YAML files, take a look at the :doc:`Understand parameters <../../Beginner-CLI-Tools/Understanding-ROS2-Parameters/Understanding-ROS2-Parameters>` tutorial.
fr: Pour en savoir plus sur l'utilisation des paramètres et l'utilisation des fichiers YAML, consultez le didacticiel :doc:`Understand parameters <../../Beginner-CLI-Tools/Understanding-ROS2-Parameters/Understanding-ROS2-Parameters>`.

source: 2.3 Using wildcards in YAML files
fr: 2.3 Utilisation de caractères génériques dans les fichiers YAML

source: There are cases when we want to set the same parameters in more than one node. These nodes could have different namespaces or names but still have the same parameters. Defining separate YAML files that explicitly define namespaces and node names is not efficient. A solution is to use wildcard characters, which act as substitutions for unknown characters in a text value, to apply parameters to several different nodes.
fr: Il y a des cas où nous voulons définir les mêmes paramètres dans plusieurs nœuds. Ces nœuds peuvent avoir des espaces de noms ou des noms différents mais avoir toujours les mêmes paramètres. La définition de fichiers YAML distincts qui définissent explicitement les espaces de noms et les noms de nœuds n'est pas efficace. Une solution consiste à utiliser des caractères génériques, qui remplacent les caractères inconnus dans une valeur de texte, pour appliquer des paramètres à plusieurs nœuds différents.

source: Now let's create a new ``turtlesim_world_3.launch.py`` file similar to ``turtlesim_world_2.launch.py`` to include one more ``turtlesim_node`` node.
fr: Créons maintenant un nouveau fichier ``turtlesim_world_3.launch.py`` similaire à ``turtlesim_world_2.launch.py`` pour inclure un autre nœud ``turtlesim_node``.

source: Loading the same YAML file, however, will not affect the appearance of the third turtlesim world. The reason is that its parameters are stored under another namespace as shown below:
fr: Cependant, le chargement du même fichier YAML n'affectera pas l'apparence du troisième monde turtlesim. La raison en est que ses paramètres sont stockés sous un autre espace de noms, comme indiqué ci-dessous :

source: Therefore, instead of creating a new configuration for the same node that use the same parameters, we can use wildcards syntax. ``/**`` will assign all the parameters in every node, despite differences in node names and namespaces.
fr: Par conséquent, au lieu de créer une nouvelle configuration pour le même nœud qui utilise les mêmes paramètres, nous pouvons utiliser la syntaxe des caractères génériques. ``/**`` attribuera tous les paramètres à chaque nœud, malgré les différences de noms de nœuds et d'espaces de noms.

source: We will now update the ``turtlesim.yaml``, in the ``/config`` folder in the following manner:
fr: Nous allons maintenant mettre à jour le ``turtlesim.yaml``, dans le dossier ``/config`` de la manière suivante :

source: Now include the ``turtlesim_world_3.launch.py`` launch description in our main launch file. Using that configuration file in our launch descriptions will assign ``background_b``, ``background_g``, and ``background_r`` parameters to specified values in ``turtlesim3/sim`` and ``turtlesim2/sim`` nodes.
fr: Incluez maintenant la description de lancement ``turtlesim_world_3.launch.py`` dans notre fichier de lancement principal. L'utilisation de ce fichier de configuration dans nos descriptions de lancement affectera les paramètres ``background_b``, ``background_g`` et ``background_r`` aux valeurs spécifiées dans les nœuds ``turtlesim3/sim`` et ``turtlesim2/sim``.

source: 3 Namespaces
fr: 3 espaces de noms

source: As you may have noticed, we have defined the namespace for the turlesim world in the ``turtlesim_world_2.launch.py`` file. Unique namespaces allow the system to start two similar nodes without node name or topic name conflicts.
fr: Comme vous l'avez peut-être remarqué, nous avons défini l'espace de noms pour le monde turlesim dans le fichier ``turtlesim_world_2.launch.py``. Les espaces de noms uniques permettent au système de démarrer deux nœuds similaires sans conflit de nom de nœud ou de nom de rubrique.

source: However, if the launch file contains a large number of nodes, defining namespaces for each of them can become tedious. To solve that issue, the ``PushROSNamespace`` action can be used to define the global namespace for each launch file description. Every nested node will inherit that namespace automatically.
fr: Cependant, si le fichier de lancement contient un grand nombre de nœuds, définir des espaces de noms pour chacun d'eux peut devenir fastidieux. Pour résoudre ce problème, l'action ``PushROSNamespace`` peut être utilisée pour définir l'espace de noms global pour chaque description de fichier de lancement. Chaque nœud imbriqué héritera automatiquement de cet espace de noms.

source: To do that, firstly, we need to remove the ``namespace='turtlesim2'`` line from the ``turtlesim_world_2.launch.py`` file. Afterwards, we need to update the ``launch_turtlesim.launch.py`` to include the following lines:
fr: Pour ce faire, nous devons d'abord supprimer la ligne ``namespace='turtlesim2'`` du fichier ``turtlesim_world_2.launch.py``. Ensuite, nous devons mettre à jour le ``launch_turtlesim.launch.py`` pour inclure les lignes suivantes :

source: Finally, we replace the ``turtlesim_world_2`` to ``turtlesim_world_2_with_namespace`` in the ``return LaunchDescription`` statement. As a result, each node in the ``turtlesim_world_2.launch.py`` launch description will have a ``turtlesim2`` namespace.
fr: Enfin, nous remplaçons ``turtlesim_world_2`` par ``turtlesim_world_2_with_namespace`` dans l'instruction ``return LaunchDescription``. Par conséquent, chaque nœud dans la description de lancement ``turtlesim_world_2.launch.py`` aura un espace de noms ``turtlesim2``.

source: 4 Reusing nodes
fr: 4 Réutiliser les nœuds

source: Now create a ``broadcaster_listener.launch.py`` file.
fr: Créez maintenant un fichier ``broadcaster_listener.launch.py``.

source: In this file, we have declared the ``target_frame`` launch argument with a default value of ``turtle1``. The default value means that the launch file can receive an argument to forward to its nodes, or in case the argument is not provided, it will pass the default value to its nodes.
fr: Dans ce fichier, nous avons déclaré l'argument de lancement ``target_frame`` avec une valeur par défaut de ``turtle1``. La valeur par défaut signifie que le fichier de lancement peut recevoir un argument à transmettre à ses nœuds, ou si l'argument n'est pas fourni, il transmettra la valeur par défaut à ses nœuds.

source: Afterwards, we use the ``turtle_tf2_broadcaster`` node two times using different names and parameters during launch. This allows us to duplicate the same node without conflicts.
fr: Ensuite, nous utilisons le nœud ``turtle_tf2_broadcaster`` deux fois en utilisant des noms et des paramètres différents lors du lancement. Cela nous permet de dupliquer le même nœud sans conflits.

source: We also start a ``turtle_tf2_listener`` node and set its ``target_frame`` parameter that we declared and acquired above.
fr: Nous démarrons également un nœud ``turtle_tf2_listener`` et définissons son paramètre ``target_frame`` que nous avons déclaré et acquis ci-dessus.

source: 5 Parameter overrides
fr: 5 Remplacements de paramètres

source: Recall that we called the ``broadcaster_listener.launch.py`` file in our top-level launch file. In addition to that, we have passed it ``target_frame`` launch argument as shown below:
fr: Rappelez-vous que nous avons appelé le fichier ``broadcaster_listener.launch.py`` dans notre fichier de lancement de niveau supérieur. En plus de cela, nous lui avons passé l'argument de lancement ``target_frame`` comme indiqué ci-dessous :

source: This syntax allows us to change the default goal target frame to ``carrot1``. If you would like ``turtle2`` to follow ``turtle1`` instead of the ``carrot1``, just remove the line that defines ``launch_arguments``. This will assign ``target_frame`` its default value, which is ``turtle1``.
fr: Cette syntaxe nous permet de changer le cadre cible de l'objectif par défaut en ``carrot1``. Si vous souhaitez que ``turtle2`` suive ``turtle1`` au lieu de ``carrot1``, supprimez simplement la ligne qui définit ``launch_arguments``. Cela affectera à ``target_frame`` sa valeur par défaut, qui est ``turtle1``.

source: 6 Remapping
fr: 6 Remappage

source: Now create a ``mimic.launch.py`` file.
fr: Créez maintenant un fichier ``mimic.launch.py``.

source: This launch file will start the ``mimic`` node, which will give commands to one turtlesim to follow the other. The node is designed to receive the target pose on the topic ``/input/pose``. In our case, we want to remap the target pose from ``/turtle2/pose`` topic. Finally, we remap the ``/output/cmd_vel`` topic to ``/turtlesim2/turtle1/cmd_vel``. This way ``turtle1`` in our ``turtlesim2`` simulation world will follow ``turtle2`` in our initial turtlesim world.
fr: Ce fichier de lancement démarrera le nœud ``mimic``, qui donnera des commandes à une tortue pour qu'elle suive l'autre. Le nœud est conçu pour recevoir la pose cible sur le sujet ``/input/pose``. Dans notre cas, nous voulons remapper la pose cible du sujet ``/turtle2/pose``. Enfin, nous remappons le sujet ``/output/cmd_vel`` à ``/turtlesim2/turtle1/cmd_vel``. De cette façon, ``turtle1`` dans notre monde de simulation ``turtlesim2`` suivra ``turtle2`` dans notre monde initial de simulation de tortues.

source: 7 Config files
fr: 7 fichiers de configuration

source: Let's now create a file called ``turtlesim_rviz.launch.py``.
fr: Créons maintenant un fichier appelé ``turtlesim_rviz.launch.py``.

source: This launch file will start the RViz with the configuration file defined in the ``turtle_tf2_py`` package. This RViz configuration will set the world frame, enable TF visualization, and start RViz with a top-down view.
fr: Ce fichier de lancement démarrera le RViz avec le fichier de configuration défini dans le package ``turtle_tf2_py``. Cette configuration RViz définira le cadre mondial, activera la visualisation TF et démarrera RViz avec une vue descendante.

source: 8 Environment Variables
fr: 8 variables d'environnement

source: Let's now create the last launch file called ``fixed_broadcaster.launch.py`` in our package.
fr: Créons maintenant le dernier fichier de lancement appelé ``fixed_broadcaster.launch.py`` dans notre package.

source: This launch file shows the way environment variables can be called inside the launch files. Environment variables can be used to define or push namespaces for distinguishing nodes on different computers or robots.
fr: Ce fichier de lancement montre comment les variables d'environnement peuvent être appelées dans les fichiers de lancement. Les variables d'environnement peuvent être utilisées pour définir ou pousser des espaces de noms pour distinguer les nœuds sur différents ordinateurs ou robots.

source: Running launch files
fr: Exécution des fichiers de lancement

source: 1 Update setup.py
fr: 1 Mettre à jour setup.py

source: Open ``setup.py`` and add the following lines so that the launch files from the ``launch/`` folder and configuration file from the ``config/`` would be installed. The ``data_files`` field should now look like this:
fr: Ouvrez ``setup.py`` et ajoutez les lignes suivantes afin que les fichiers de lancement du dossier ``launch/`` et le fichier de configuration de ``config/`` soient installés. Le champ ``data_files`` devrait maintenant ressembler à ceci :

source: 2 Build and run
fr: 2 Construire et exécuter

source: To finally see the result of our code, build the package and launch the top-level launch file using the following command:
fr: Pour enfin voir le résultat de notre code, construisez le package et lancez le fichier de lancement de niveau supérieur à l'aide de la commande suivante :
