Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Tutorials/Intermediate/Launch/Using-Substitutions.po
Languages: fr

source: Using substitutions
fr: Utiliser des substitutions

source: **Goal:** Learn about substitutions in ROS 2 launch files.
fr: **Objectif :** En savoir plus sur les substitutions dans les fichiers de lancement de ROS 2.

source: **Tutorial level:** Intermediate
fr: **Niveau du didacticiel :** Intermédiaire

source: **Time:** 15 minutes
fr: **Durée :** 15 minutes

source: Table of Contents
fr: Table des matières

source: Background
fr: Arrière-plan

source: Launch files are used to start nodes, services and execute processes. This set of actions may have arguments, which affect their behavior. Substitutions can be used in arguments to provide more flexibility when describing reusable launch files. Substitutions are variables that are only evaluated during execution of the launch description and can be used to acquire specific information like a launch configuration, an environment variable, or to evaluate an arbitrary Python expression.
fr: Les fichiers de lancement sont utilisés pour démarrer des nœuds, des services et exécuter des processus. Cet ensemble d'actions peut avoir des arguments qui affectent leur comportement. Des substitutions peuvent être utilisées dans les arguments pour offrir plus de flexibilité lors de la description de fichiers de lancement réutilisables. Les substitutions sont des variables qui ne sont évaluées que lors de l'exécution de la description de lancement et peuvent être utilisées pour acquérir des informations spécifiques comme une configuration de lancement, une variable d'environnement ou pour évaluer une expression Python arbitraire.

source: This tutorial shows usage examples of substitutions in ROS 2 launch files.
fr: Ce didacticiel montre des exemples d'utilisation de substitutions dans les fichiers de lancement ROS 2.

source: Prerequisites
fr: Conditions préalables

source: This tutorial uses the :doc:`turtlesim <../../Beginner-CLI-Tools/Introducing-Turtlesim/Introducing-Turtlesim>` package. This tutorial also assumes you are familiar with :doc:`creating packages <../../Beginner-Client-Libraries/Creating-Your-First-ROS2-Package>`.
fr: Ce tutoriel utilise le package :doc:`turtlesim <../../Beginner-CLI-Tools/Introducing-Turtlesim/Introducing-Turtlesim>`. Ce didacticiel suppose également que vous êtes familiarisé avec :doc:`creating packages <../../Beginner-Client-Libraries/Creating-Your-First-ROS2-Package>`.

source: As always, don’t forget to source ROS 2 in :doc:`every new terminal you open <../../Beginner-CLI-Tools/Configuring-ROS2-Environment>`.
fr: Comme toujours, n'oubliez pas de sourcer ROS 2 dans :doc:`chaque nouveau terminal que vous ouvrez <../../Beginner-CLI-Tools/Configuring-ROS2-Environment>`.

source: 1 Create and setup the package
fr: 1 Créer et configurer le package

source: Create a new package of build_type ``ament_python`` called ``launch_tutorial``:
fr: Créez un nouveau package de build_type ``ament_python`` appelé ``launch_tutorial`` :

source: Inside of that package, create a directory called ``launch``:
fr: À l'intérieur de ce package, créez un répertoire appelé ``launch`` :

source: Windows
fr: les fenêtres

source: Finally, make sure to add in changes to the ``setup.py`` of the package so that the launch files will be installed:
fr: Enfin, assurez-vous d'ajouter des modifications au ``setup.py`` du package afin que les fichiers de lancement soient installés :

source: 2 Parent launch file
fr: 2 Fichier de lancement parent

source: Let's create a launch file that will call and pass arguments to another launch file. To do this, create an ``example_main.launch.py`` file in the ``launch`` folder of the ``launch_tutorial`` package.
fr: Créons un fichier de lancement qui appellera et transmettra des arguments à un autre fichier de lancement. Pour ce faire, créez un fichier ``example_main.launch.py`` dans le dossier ``launch`` du package ``launch_tutorial``.

source: In the ``example_main.launch.py`` file, the ``FindPackageShare`` substitution is used to find the path to the ``launch_tutorial`` package. The ``PathJoinSubstitution`` substitution is then used to join the path to that package path with the ``example_substitutions.launch.py`` file name.
fr: Dans le fichier ``example_main.launch.py``, la substitution ``FindPackageShare`` est utilisée pour trouver le chemin vers le package ``launch_tutorial``. La substitution ``PathJoinSubstitution`` est ensuite utilisée pour joindre le chemin à ce chemin de package avec le nom de fichier ``example_substitutions.launch.py``.

source: The ``launch_arguments`` dictionary with ``turtlesim_ns`` and ``use_provided_red`` arguments is passed to the ``IncludeLaunchDescription`` action. The ``TextSubstitution`` substitution is used to define the ``new_background_r`` argument with the value of the ``background_r`` key in the ``colors`` dictionary.
fr: Le dictionnaire ``launch_arguments`` avec les arguments ``turtlesim_ns`` et ``use_provided_red`` est passé à l'action ``IncludeLaunchDescription``. La substitution ``TextSubstitution`` est utilisée pour définir l'argument ``new_background_r`` avec la valeur de la clé ``background_r`` dans le dictionnaire ``colors``.

source: 3 Substitutions example launch file
fr: 3 Fichier de lancement d'exemple de substitutions

source: Now create an ``example_substitutions.launch.py`` file in the same folder.
fr: Créez maintenant un fichier ``example_substitutions.launch.py`` dans le même dossier.

source: In the ``example_substitutions.launch.py`` file, ``turtlesim_ns``, ``use_provided_red``, and ``new_background_r`` launch configurations are defined. They are used to store values of launch arguments in the above variables and to pass them to required actions. These ``LaunchConfiguration`` substitutions allow us to acquire the value of the launch argument in any part of the launch description.
fr: Dans le fichier ``example_substitutions.launch.py``, les configurations de lancement ``turtlesim_ns``, ``use_provided_red`` et ``new_background_r`` sont définies. Ils sont utilisés pour stocker les valeurs des arguments de lancement dans les variables ci-dessus et pour les transmettre aux actions requises. Ces substitutions ``LaunchConfiguration`` nous permettent d'acquérir la valeur de l'argument de lancement dans n'importe quelle partie de la description de lancement.

source: ``DeclareLaunchArgument`` is used to define the launch argument that can be passed from the above launch file or from the console.
fr: ``DeclareLaunchArgument`` est utilisé pour définir l'argument de lancement qui peut être passé depuis le fichier de lancement ci-dessus ou depuis la console.

source: The ``turtlesim_node`` node with the ``namespace`` set to ``turtlesim_ns`` ``LaunchConfiguration`` substitution is defined.
fr: Le nœud ``turtlesim_node`` avec le ``namespace`` défini sur la substitution ``turtlesim_ns`` ``LaunchConfiguration`` est défini.

source: Afterwards, the ``ExecuteProcess`` action called ``spawn_turtle`` is defined with the corresponding ``cmd`` argument. This command makes a call to the spawn service of the turtlesim node.
fr: Ensuite, l'action ``ExecuteProcess`` appelée ``spawn_turtle`` est définie avec l'argument ``cmd`` correspondant. Cette commande fait un appel au service spawn du noeud turtlesim.

source: Additionally, the ``LaunchConfiguration`` substitution is used to get the value of the ``turtlesim_ns`` launch argument to construct a command string.
fr: De plus, la substitution ``LaunchConfiguration`` est utilisée pour obtenir la valeur de l'argument de lancement ``turtlesim_ns`` afin de construire une chaîne de commande.

source: The same approach is used for the ``change_background_r`` and ``change_background_r_conditioned`` actions that change the turtlesim background's red color parameter. The difference is that the ``change_background_r_conditioned`` action is only executed if the provided ``new_background_r`` argument equals ``200`` and the ``use_provided_red`` launch argument is set to ``True``. The evaluation inside the ``IfCondition`` is done using the ``PythonExpression`` substitution.
fr: La même approche est utilisée pour les actions ``change_background_r`` et ``change_background_r_conditioned`` qui modifient le paramètre de couleur rouge de l'arrière-plan de turtlesim. La différence est que l'action ``change_background_r_conditioned`` n'est exécutée que si l'argument ``new_background_r`` fourni est égal à ``200`` et que l'argument de lancement ``use_provided_red`` est défini sur ``True``. L'évaluation à l'intérieur de ``IfCondition`` est effectuée à l'aide de la substitution ``PythonExpression``.

source: 4 Build the package
fr: 4 Construire le package

source: Go to the root of the workspace, and build the package:
fr: Accédez à la racine de l'espace de travail et créez le package :

source: Also remember to source the workspace after building.
fr: N'oubliez pas non plus de sourcer l'espace de travail après la construction.

source: Launching example
fr: Exemple de lancement

source: Now you can launch the ``example_main.launch.py`` file using the ``ros2 launch`` command.
fr: Vous pouvez maintenant lancer le fichier ``example_main.launch.py`` en utilisant la commande ``ros2 launch``.

source: This will do the following:
fr: Cela fera ce qui suit :

source: Start a turtlesim node with a blue background
fr: Démarrer un nœud turtlesim avec un fond bleu

source: Spawn the second turtle
fr: Faire apparaître la deuxième tortue

source: Change the color to purple
fr: Changer la couleur en violet

source: Change the color to pink after two seconds if the provided ``background_r`` argument is ``200`` and ``use_provided_red`` argument is ``True``
fr: Changez la couleur en rose après deux secondes si l'argument ``background_r`` fourni est ``200`` et l'argument ``use_provided_red`` est ``True``

source: Modifying launch arguments
fr: Modification des arguments de lancement

source: If you want to change the provided launch arguments, you can either update them in ``launch_arguments`` dictionary in the ``example_main.launch.py`` or launch the ``example_substitutions.launch.py`` with preferred arguments. To see arguments that may be given to the launch file, run the following command:
fr: Si vous souhaitez modifier les arguments de lancement fournis, vous pouvez soit les mettre à jour dans le dictionnaire ``launch_arguments`` dans ``example_main.launch.py`` ou lancer ``example_substitutions.launch.py`` avec les arguments préférés. Pour voir les arguments qui peuvent être donnés au fichier de lancement, exécutez la commande suivante :

source: This will show the arguments that may be given to the launch file and their default values.
fr: Cela montrera les arguments qui peuvent être donnés au fichier de lancement et leurs valeurs par défaut.

source: Now you can pass the desired arguments to the launch file as follows:
fr: Vous pouvez maintenant passer les arguments souhaités au fichier de lancement comme suit :

source: `The launch documentation <https://github.com/ros2/launch/blob/rolling/launch/doc/source/architecture.rst>`_ provides detailed information about available substitutions.
fr: `La documentation de lancement <https://github.com/ros2/launch/blob/rolling/launch/doc/source/architecture.rst>`_ fournit des informations détaillées sur les substitutions disponibles.

source: Summary
fr: Résumé

source: In this tutorial, you learned about using substitutions in launch files. You learned about their possibilities and capabilities to create reusable launch files.
fr: Dans ce didacticiel, vous avez appris à utiliser des substitutions dans les fichiers de lancement. Vous avez découvert leurs possibilités et capacités pour créer des fichiers de lancement réutilisables.

source: You can now learn more about :doc:`using event handlers in launch files <./Using-Event-Handlers>` which are used to define a complex set of rules which can be used to dynamically modify the launch file.
fr: Vous pouvez maintenant en savoir plus sur :doc:`l'utilisation des gestionnaires d'événements dans les fichiers de lancement <./Using-Event-Handlers>` qui sont utilisés pour définir un ensemble complexe de règles pouvant être utilisées pour modifier dynamiquement le fichier de lancement.
