Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Tutorials/Intermediate/Launch/Using-ROS2-Launch-For-Large-Projects.po
Languages: fr

source: You will now see the two turtlesim simulations started. There are two turtles in the first one and one in the second one. In the first simulation, ``turtle2`` is spawned in the bottom-left part of the world. Its aim is to reach the ``carrot1`` frame which is five meters away on the x-axis relative to the ``turtle1`` frame.
fr: Vous verrez maintenant les deux simulations de turtlesim démarrer. Il y a deux tortues dans le premier et une dans le second. Dans la première simulation, ``turtle2`` apparaît dans la partie inférieure gauche du monde. Son but est d'atteindre le repère ``carrot1`` qui est à cinq mètres de distance sur l'axe des abscisses par rapport au repère ``turtle1``.

source: The ``turtlesim2/turtle1`` in the second is designed to mimic the behavior of the ``turtle2``.
fr: Le ``turtlesim2/turtle1`` dans le second est conçu pour imiter le comportement du ``turtle2``.

source: If you want to control the ``turtle1``, run the teleop node.
fr: Si vous voulez contrôler la ``turtle1``, lancez le nœud teleop.

source: As a result, you will see a similar picture:
fr: En conséquence, vous verrez une image similaire :

source: In addition to that, the RViz should have started. It will show all turtle frames relative to the ``world`` frame, whose origin is at the bottom-left corner.
fr: En plus de cela, le RViz aurait dû démarrer. Il affichera tous les cadres de tortues par rapport au cadre ``world``, dont l'origine se trouve dans le coin inférieur gauche.

source: Summary
fr: Résumé

source: In this tutorial, you learned about various tips and practices of managing large projects using ROS 2 launch files.
fr: Dans ce didacticiel, vous avez découvert divers conseils et pratiques de gestion de projets volumineux à l'aide de fichiers de lancement ROS 2.
