Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Tutorials/Advanced/Topic-Statistics-Tutorial/Topic-Statistics-Tutorial.po
Languages: fr

source: Enabling topic statistics (C++)
fr: Activation des statistiques de sujet (C++)

source: **Goal:** Enable ROS 2 Topic Statistics and view the output statistics data.
fr: **Objectif :** Activer les statistiques de sujet ROS 2 et afficher les données statistiques de sortie.

source: **Tutorial level:** Advanced
fr: **Niveau du didacticiel :** Avancé

source: **Time:** 10 minutes
fr: **Durée :** 10 minutes

source: Table of Contents
fr: Table des matières

source: Background
fr: Arrière-plan

source: This is a short tutorial of how to enable :doc:`Topic Statistics<../../../Concepts/About-Topic-Statistics>` in ROS 2 and view the published statistics output using command line tools (:doc:`ros2topic<../../Beginner-CLI-Tools/Understanding-ROS2-Topics/Understanding-ROS2-Topics>`).
fr: Il s'agit d'un court didacticiel expliquant comment activer :doc:`Topic Statistics<../../../Concepts/About-Topic-Statistics>` dans ROS 2 et afficher la sortie des statistiques publiées à l'aide des outils de ligne de commande (:doc :`ros2topic<../../Beginner-CLI-Tools/Understanding-ROS2-Topics/Understanding-ROS2-Topics>`).

source: ROS 2 provides the integrated measurement of statistics for messages received by any subscription, called Topic Statistics. With Topic Statistics enabled for your subscription, you can characterize the performance of your system or use the data to help diagnose any present issues.
fr: ROS 2 fournit la mesure intégrée des statistiques pour les messages reçus par n'importe quel abonnement, appelée Topic Statistics. Avec Topic Statistics activé pour votre abonnement, vous pouvez caractériser les performances de votre système ou utiliser les données pour vous aider à diagnostiquer les problèmes actuels.

source: For more details please see the :doc:`Topic Statistics Concepts Page<../../../Concepts/About-Topic-Statistics>`.
fr: Pour plus de détails, veuillez consulter la :doc:`page des concepts de statistiques thématiques<../../../Concepts/About-Topic-Statistics>`.

source: Prerequisites
fr: Conditions préalables

source: An installation from either binaries or source.
fr: Une installation à partir des binaires ou de la source.

source: In previous tutorials, you learned how to :doc:`create a workspace <../../Beginner-Client-Libraries/Creating-A-Workspace/Creating-A-Workspace>`, :doc:`create a package <../../Beginner-Client-Libraries/Creating-Your-First-ROS2-Package>`, and create a :doc:`C++ <../../Beginner-Client-Libraries/Writing-A-Simple-Cpp-Publisher-And-Subscriber>` publisher and subscriber.
fr: Dans les tutoriels précédents, vous avez appris à :doc:`créer un espace de travail <../../Beginner-Client-Libraries/Creating-A-Workspace/Creating-A-Workspace>`, :doc:`créer un package < ../../Beginner-Client-Libraries/Creating-Your-First-ROS2-Package>` et créez un :doc:`C++ <../../Beginner-Client-Libraries/Writing-A-Simple -Cpp-Publisher-And-Subscriber>` éditeur et abonné.

source: This tutorial assumes that you still have your ``cpp_pubsub`` package from the :doc:`C++ <../../Beginner-Client-Libraries/Writing-A-Simple-Cpp-Publisher-And-Subscriber>` tutorial.
fr: Ce tutoriel suppose que vous avez toujours votre package ``cpp_pubsub`` du tutoriel :doc:`C++ <../../Beginner-Client-Libraries/Writing-A-Simple-Cpp-Publisher-And-Subscriber>` .

source: Tasks
fr: Tâches

source: 1 Write the subscriber node with statistics enabled
fr: 1 Écrivez le nœud de l'abonné avec les statistiques activées

source: Navigate into the ``ros2_ws/src/cpp_pubsub/src`` folder, created in the :doc:`previous tutorial <../../Beginner-Client-Libraries/Writing-A-Simple-Cpp-Publisher-And-Subscriber>`, and download the example talker code by entering the following command:
fr: Naviguez dans le dossier ``ros2_ws/src/cpp_pubsub/src``, créé dans le :doc:`tutoriel précédent <../../Beginner-Client-Libraries/Writing-A-Simple-Cpp-Publisher-And- Subscriber>`, et téléchargez l'exemple de code talker en saisissant la commande suivante :

source: Windows
fr: les fenêtres

source: Right click this link and select Save As ``publisher_member_function.cpp``:
fr: Faites un clic droit sur ce lien et sélectionnez Enregistrer sous ``publisher_member_function.cpp`` :

source: Now there will be a new file named ``member_function_with_topic_statistics.cpp``. Open the file using your preferred text editor.
fr: Il y aura maintenant un nouveau fichier nommé ``member_function_with_topic_statistics.cpp``. Ouvrez le fichier à l'aide de votre éditeur de texte préféré.

source: 1.1 Examine the code
fr: 1.1 Examiner le code

source: As in the :doc:`C++ <../../Beginner-Client-Libraries/Writing-A-Simple-Cpp-Publisher-And-Subscriber>` tutorial, we have a subscriber node which receives string messages from the ``topic`` topic from the ``topic_callback`` function. However, we've now added options to configure the subscription to enable topic statistics with the ``rclcpp::SubscriptionOptions()`` options struct.
fr: Comme dans le didacticiel :doc:`C++ <../../Beginner-Client-Libraries/Writing-A-Simple-Cpp-Publisher-And-Subscriber>`, nous avons un nœud d'abonné qui reçoit des messages de chaîne du ` `topic`` sujet de la fonction ``topic_callback``. Cependant, nous avons maintenant ajouté des options pour configurer l'abonnement afin d'activer les statistiques de sujet avec la structure d'options ``rclcpp::SubscriptionOptions()``.

source: Optionally, fields such as the statistics collection/publish period and the topic used to publish statistics can be configured as well.
fr: En option, des champs tels que la période de collecte/publication des statistiques et le sujet utilisé pour publier les statistiques peuvent également être configurés.

source: The configurable fields are described in the following table:
fr: Les champs configurables sont décrits dans le tableau suivant :

source: Subscription Config Field
fr: Champ de configuration de l'abonnement

source: Purpose
fr: But

source: Enable or disable topic statistics (default ``rclcpp::TopicStatisticsState::Disable``)
fr: Activer ou désactiver les statistiques de sujet (par défaut ``rclcpp::TopicStatisticsState::Disable``)

source: The period in which to collect statistics data and publish a statistics message (default ``1s``)
fr: La période pendant laquelle collecter des données statistiques et publier un message de statistiques (par défaut ``1s``)

source: The topic to use when publishing statistics data (default ``/statistics``)
fr: Le sujet à utiliser lors de la publication de données statistiques (par défaut ``/statistics``)

source: Now open the ``CMakeLists.txt`` file.
fr: Ouvrez maintenant le fichier ``CMakeLists.txt``.

source: Add the executable and name it ``listener_with_topic_statistics`` so you can run your node using ``ros2 run``:
fr: Ajoutez l'exécutable et nommez-le ``listener_with_topic_statistics`` afin que vous puissiez exécuter votre nœud en utilisant ``ros2 run`` :

source: Make sure to save the file, and then your pub/sub system, with topic statistics enabled, should be ready for use.
fr: Assurez-vous d'enregistrer le fichier, puis votre système pub/sub, avec les statistiques de sujet activées, devrait être prêt à l'emploi.

source: 2 Build and run
fr: 2 Construire et exécuter

source: To build, see the :ref:`Build and run <cpppubsub-build-and-run>` section in the pub/sub tutorial.
fr: Pour compiler, consultez la section :ref:`Build and run <cpppubsub-build-and-run>` dans le didacticiel pub/sub.

source: Run the subscriber with statistics enabled node:
fr: Exécutez l'abonné avec le nœud activé pour les statistiques :

source: Now run the talker node:
fr: Exécutez maintenant le nœud Talker :

source: The terminal should start publishing info messages every 0.5 seconds, like so:
fr: Le terminal devrait commencer à publier des messages d'information toutes les 0,5 seconde, comme ceci :

source: The listener will start printing messages to the console, starting at whatever message count the publisher is on at that time, like so:
fr: L'écouteur commencera à imprimer des messages sur la console, à partir du nombre de messages sur lequel l'éditeur se trouve à ce moment-là, comme ceci :

source: Now that the subscriber node is receiving messages, it will periodically publish statistics messages. We will observe these messages in the next section.
fr: Maintenant que le nœud d'abonné reçoit des messages, il publiera périodiquement des messages de statistiques. Nous observerons ces messages dans la section suivante.

source: 3 Observe published statistic data
fr: 3 Observer les données statistiques publiées

source: While the nodes are running, open a new terminal window. Execute the following command:
fr: Pendant que les nœuds sont en cours d'exécution, ouvrez une nouvelle fenêtre de terminal. Exécutez la commande suivante :

source: This will list all currently active topics. You should see the following:
fr: Cela listera tous les sujets actuellement actifs. Vous devriez voir ce qui suit :

source: If you optionally changed the ``topic_stats_options.publish_topic`` field earlier in the tutorial, then you will see that name instead of ``/statistics``.
fr: Si vous avez éventuellement modifié le champ ``topic_stats_options.publish_topic`` plus tôt dans le didacticiel, vous verrez ce nom au lieu de ``/statistics``.

source: The subscriber node you created is publishing statistics, for the topic ``topic``, to the output topic ``/statistics``.
fr: Le nœud d'abonné que vous avez créé publie des statistiques, pour le sujet ``topic``, dans le sujet de sortie ``/statistics``.

source: We can visualize this using :doc:`RQt <../../../Concepts/About-RQt>`
fr: Nous pouvons visualiser cela en utilisant :doc:`RQt <../../../Concepts/About-RQt>`

source: Now we can view the statistics data published to this topic with the following command:
fr: Nous pouvons maintenant afficher les données statistiques publiées sur ce sujet avec la commande suivante :

source: The terminal should start publishing statistics messages every 10 seconds, because the ``topic_stats_options.publish_period`` subscription configuration was optionally changed earlier in the tutorial.
fr: Le terminal devrait commencer à publier des messages de statistiques toutes les 10 secondes, car la configuration de l'abonnement ``topic_stats_options.publish_period`` a éventuellement été modifiée plus tôt dans le didacticiel.

source: From the `message definition <https://github.com/ros2/rcl_interfaces/tree/rolling/statistics_msgs>`__ the ``data_types`` are as follows
fr: À partir de la `définition du message <https://github.com/ros2/rcl_interfaces/tree/rolling/statistics_msgs>`__, les ``data_types`` sont les suivants

source: data_type value
fr: valeur du type de données

source: statistics
fr: statistiques

source: average
fr: moyenne

source: minimum
fr: le minimum

source: standard deviation
fr: écart-type

source: sample count
fr: nombre d'échantillons

source: Here we see the two currently possible calculated statistics for the ``std_msgs::msg::String`` message published to ``/topic`` by the ``minimal_publisher``. Because the ``std_msgs::msg::String`` does not have a message header, the ``message_age`` calculation cannot be performed, so NaNs are returned. However, the ``message_period`` can be calculated and we see the statistics populated in the message above.
fr: Ici, nous voyons les deux statistiques calculées actuellement possibles pour le message ``std_msgs::msg::String`` publié sur ``/topic`` par le ``minimal_publisher``. Étant donné que ``std_msgs::msg::String`` n'a pas d'en-tête de message, le calcul de ``message_age`` ne peut pas être effectué, donc les NaN sont renvoyés. Cependant, le ``message_period`` peut être calculé et nous voyons les statistiques renseignées dans le message ci-dessus.

source: Summary
fr: Résumé

source: You created a subscriber node with topic statistics enabled, which published statistics data from the :doc:`C++ <../../Beginner-Client-Libraries/Writing-A-Simple-Cpp-Service-And-Client>`'s publisher node. You were able to compile and run this node. While running, you were able to observe the statistics data.
fr: Vous avez créé un nœud d'abonné avec les statistiques de rubrique activées, qui a publié des données de statistiques à partir du :doc:`C++ <../../Beginner-Client-Libraries/Writing-A-Simple-Cpp-Service-And-Client>`' le nœud de l'éditeur. Vous avez pu compiler et exécuter ce nœud. Pendant la course, vous avez pu observer les données statistiques.

source: Related content
fr: Contenu connexe

source: To observe how the ``message_age`` period is calculated please see the `ROS 2 Topic Statistics demo <https://github.com/ros2/demos/tree/rolling/topic_statistics_demo>`__.
fr: Pour observer comment la période ``message_age`` est calculée, veuillez consulter la démo `ROS 2 Topic Statistics <https://github.com/ros2/demos/tree/rolling/topic_statistics_demo>`__.
