Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/The-ROS2-Project/Contributing.po
Languages: fr

source: Contributing
fr: Contribuant

source: Table of Contents
fr: Table des matières

source: A few things to remember before you start contributing to the ROS 2 project.
fr: Quelques points à retenir avant de commencer à contribuer au projet ROS 2.

source: Tenets
fr: Principes

source: Respect what came before
fr: Respectez ce qui a précédé

source: ROS has been around for more than a decade and is used by developers and across the world. Keep a humble attitude and an open mindset while contributing.
fr: ROS existe depuis plus d'une décennie et est utilisé par les développeurs et dans le monde entier. Gardez une attitude humble et un état d'esprit ouvert tout en contribuant.

source: Engage Open Robotics as early as possible
fr: Engagez Open Robotics le plus tôt possible

source: Open Robotics acts as a gate-keeper and advocate for the ROS community. Rely on their expertise and technical judgement from the design phase.
fr: Open Robotics agit en tant que gardien et défenseur de la communauté ROS. Appuyez-vous sur leur expertise et leur jugement technique dès la phase de conception.

source: Start discussions with Open Robotics and the community early. Long time ROS contributors may have a clearer vision of the bigger picture. If you implement a feature and send a pull request without discussing with the community first, you are taking the risk of it being rejected, or you may be asked to largely rethink your design.
fr: Commencez tôt les discussions avec Open Robotics et la communauté. Les contributeurs ROS de longue date peuvent avoir une vision plus claire de la situation dans son ensemble. Si vous implémentez une fonctionnalité et envoyez une pull request sans en discuter au préalable avec la communauté, vous prenez le risque qu'elle soit rejetée, ou qu'on vous demande de repenser en grande partie votre design.

source: Opening issues or using Discourse to socialize an idea before starting the implementation is generally preferable.
fr: Ouvrir des problèmes ou utiliser Discourse pour socialiser une idée avant de commencer la mise en œuvre est généralement préférable.

source: Adopt community best-practices whenever possible instead of ad-hoc processes
fr: Adoptez les meilleures pratiques de la communauté chaque fois que possible au lieu de processus ad hoc

source: Think about your end-user's experience when developing and contributing. Avoid using non-standard tools or libraries that may not be accessible to everyone.
fr: Pensez à l'expérience de votre utilisateur final lors du développement et de la contribution. Évitez d'utiliser des outils ou des bibliothèques non standard qui peuvent ne pas être accessibles à tout le monde.

source: Think about the community as a whole
fr: Penser à la communauté dans son ensemble

source: Think about the bigger picture. There are developers building different robots with different constraints. ROS needs to accommodate requirements of the whole community.
fr: Pensez à la situation dans son ensemble. Il existe des développeurs qui construisent différents robots avec différentes contraintes. Le ROS doit répondre aux besoins de l'ensemble de la communauté.

source: There are a number of ways you can contribute to the ROS 2 project.
fr: Vous pouvez contribuer au projet ROS 2 de plusieurs manières.

source: Discussions and support
fr: Discussions et soutien

source: Some of the easiest ways to contribute to ROS 2 involve engaging in community discussions and support. You can find more information on how to pitch in on the :doc:`Contact <../../Contact>` page.
fr: Certaines des façons les plus simples de contribuer à ROS 2 impliquent de s'engager dans des discussions et un soutien communautaires. Vous trouverez plus d'informations sur la manière de participer sur la page :doc:`Contact <../../Contact>`.

source: Contributing code
fr: Code contributeur

source: Setting up your development environment
fr: Configuration de votre environnement de développement

source: To get started, you'll want to install from source; follow :ref:`the source installation instructions <building-from-source>` for your platform.
fr: Pour commencer, vous voudrez installer à partir de la source ; suivez :ref:`les instructions d'installation source <building-from-source>` pour votre plate-forme.

source: Development Guides
fr: Guides de développement

source: What to work on
fr: Sur quoi travailler

source: We have identified a number of tasks that could be worked on by community members: they can be listed by `searching across the ROS 2 repositories for issues labeled as "help wanted" <https://github.com/search?q=user%3Aament+user%3Aros2+is%3Aopen+label%3A"help+wanted"&type=Issues>`__. If you see something on that list that you would like to work on, please comment on the item to let others know that you are looking into it.
fr: Nous avons identifié un certain nombre de tâches sur lesquelles les membres de la communauté pourraient travailler : elles peuvent être répertoriées en "recherchant dans les référentiels ROS 2 les problèmes étiquetés comme "demande d'aide" <https://github.com/search?q=user %3Aament+user%3Aros2+is%3Aopen+label%3A"help+wanted"&type=Issues>`__. Si vous voyez quelque chose sur cette liste sur lequel vous aimeriez travailler, veuillez commenter l'élément pour faire savoir aux autres que vous l'étudiez.

source: We also have a label for issues that we think should be more accessible for first-time contributors, `labeled “good first issue” <https://github.com/search?q=user%3Aament+user%3Aros2+is%3Aopen+label%3A%22good+first+issue%22&type=Issues>`__. If you are interested in contributing to the ROS 2 project, we encourage you to take a look at those issues first. If you’d like to cast a wider net, we welcome contributions on any open issue (or others that you might propose), particularly tasks that have a milestone signifying they’re targeted for the next ROS 2 release (the milestone will be the next release's e.g. 'crystal').
fr: Nous avons également une étiquette pour les problèmes qui, selon nous, devraient être plus accessibles aux nouveaux contributeurs, `étiquetés "bon premier numéro" <https://github.com/search?q=user%3Aament+user%3Aros2+is% 3Aopen+label%3A%22good+first+issue%22&type=Issues>`__. Si vous êtes intéressé à contribuer au projet ROS 2, nous vous encourageons à jeter un coup d'œil à ces questions en premier. Si vous souhaitez élargir votre réseau, nous accueillons les contributions sur tout problème ouvert (ou d'autres que vous pourriez proposer), en particulier les tâches qui ont un jalon signifiant qu'elles sont ciblées pour la prochaine version de ROS 2 (le jalon sera le la prochaine version, par exemple 'crystal').

source: If you have some code to contribute that fixes a bug or improves documentation, please submit it as a pull request to the relevant repository. For larger changes, it is a good idea to discuss the proposal `on the ROS 2 forum <https://discourse.ros.org/c/ng-ros>`__ before you start to work on it so that you can identify if someone else is already working on something similar. If your proposal involves changes to the APIs, it is especially recommended that you discuss the approach before starting work.
fr: Si vous avez du code à contribuer qui corrige un bogue ou améliore la documentation, veuillez le soumettre en tant que demande d'extraction au référentiel concerné. Pour les modifications plus importantes, il est judicieux de discuter de la proposition `sur le forum ROS 2 <https://discourse.ros.org/c/ng-ros>`__ avant de commencer à travailler dessus afin de pouvoir identifier si quelqu'un d'autre travaille déjà sur quelque chose de similaire. Si votre proposition implique des modifications des API, il est particulièrement recommandé de discuter de l'approche avant de commencer le travail.

source: Submitting your code changes
fr: Soumettre vos modifications de code

source: Code contributions should be made via pull requests to `the appropriate ros2 repositories <https://github.com/ros2>`__.
fr: Les contributions de code doivent être effectuées via des demandes d'extraction vers `les référentiels ros2 appropriés <https://github.com/ros2>`__.

source: We ask all contributors to follow the practices explained in :doc:`the developer guide <Contributing/Developer-Guide>`.
fr: Nous demandons à tous les contributeurs de suivre les pratiques expliquées dans :doc:`le guide du développeur <Contributing/Developer-Guide>`.

source: Please be sure to :ref:`run tests <colcon-run-the-tests>` for your code changes because most packages have tests that check that the code complies with our style guidelines.
fr: Assurez-vous de :ref:`exécuter des tests <colcon-run-the-tests>` pour vos modifications de code car la plupart des packages ont des tests qui vérifient que le code est conforme à nos directives de style.

source: Becoming a core maintainer
fr: Devenir un mainteneur principal

source: The ROS 2 maintainers ensure that the project is generally making progress. The responsibilities of the maintainers include:
fr: Les mainteneurs de ROS 2 s'assurent que le projet progresse globalement. Les responsabilités des mainteneurs comprennent :

source: Reviewing incoming code contributions for style, quality, and overall fit into the goals of the repository/ROS 2.
fr: Examiner les contributions de code entrantes pour le style, la qualité et l'adéquation globale aux objectifs du référentiel/ROS 2.

source: Ensuring that CI continues to stay green.
fr: Veiller à ce que CI continue de rester vert.

source: Merging pull requests that meet the quality and CI standards above.
fr: Fusionner les demandes d'extraction qui répondent aux normes de qualité et CI ci-dessus.

source: Addressing issues opened up by users.
fr: Résolution des problèmes signalés par les utilisateurs.

source: Each repository in the `ros2 <https://github.com/ros2>`__ and `ament <https://github.com/ament>`__ organizations has a separate set of maintainers. Becoming a maintainer of one or more of those repositories is an invitation-only process, and generally involves the following steps:
fr: Chaque référentiel des organisations `ros2 <https://github.com/ros2>`__ et `ament <https://github.com/ament>`__ possède un ensemble distinct de responsables. Devenir mainteneur d'un ou plusieurs de ces référentiels est un processus sur invitation uniquement et implique généralement les étapes suivantes :

source: Within the last year, have a substantial number of code contributions to the repository.
fr: Au cours de la dernière année, avoir un nombre substantiel de contributions de code au référentiel.

source: Within the last year, do a substantial number of reviews on incoming pull requests to the repository.
fr: Au cours de la dernière année, effectuez un nombre important d'examens des demandes d'extraction entrantes dans le référentiel.

source: Approximately every 3 months, the ROS 2 team will review the contributions in all of the repositories and send out invitations to new maintainers. Once the invitation is accepted, the new maintainer will be asked to go through a short training process on the mechanisms and policies of the ROS 2 repositories. After that training process is completed, the new maintainer will be given write access to the appropriate repositories.
fr: Environ tous les 3 mois, l'équipe ROS 2 examinera les contributions dans tous les référentiels et enverra des invitations aux nouveaux responsables. Une fois l'invitation acceptée, le nouveau mainteneur sera invité à suivre un court processus de formation sur les mécanismes et les politiques des référentiels ROS 2. Une fois ce processus de formation terminé, le nouveau responsable se verra accorder un accès en écriture aux référentiels appropriés.
