Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/The-ROS2-Project/Feature-Ideas.po
Languages: fr

source: Feature Ideas
fr: Idées de fonctionnalités

source: Table of Contents
fr: Table des matières

source: The following are feature ideas in no specific order. This list contains features that we think are important and can make for good contributions to ROS 2. :doc:`Please get in touch with us <../Contact>` before digging into a new feature. We can offer guidance, and connect you with other developers.
fr: Voici des idées de fonctionnalités sans ordre spécifique. Cette liste contient des fonctionnalités que nous pensons importantes et qui peuvent apporter de bonnes contributions à ROS 2. :doc:`Veuillez nous contacter <../Contact>` avant de creuser dans une nouvelle fonctionnalité. Nous pouvons vous conseiller et vous mettre en contact avec d'autres développeurs.

source: Design / Concept
fr: Concept design

source: IDL format
fr: Format IDL

source: Leverage new features like grouping constants into enums
fr: Tirez parti de nouvelles fonctionnalités telles que le regroupement de constantes en énumérations

source: Extend usage to ``.idl`` files with just constants and/or declare parameters with ranges
fr: Étendez l'utilisation aux fichiers ``.idl`` avec juste des constantes et/ou déclarez des paramètres avec des plages

source: Revisit constraints of IDL interface naming, see `ros2/design#220 <https://github.com/ros2/design/pull/220>`_
fr: Revoir les contraintes de nommage de l'interface IDL, voir `ros2/design#220 <https://github.com/ros2/design/pull/220>`_

source: Create migration plan for ROS 1 -> ROS 2 transition
fr: Créer un plan de migration pour la transition ROS 1 -> ROS 2

source: Uniqueness of node names, see `ros2/design#187 <https://github.com/ros2/design/issues/187>`_
fr: Unicité des noms de nœuds, voir `ros2/design#187 <https://github.com/ros2/design/issues/187>`_

source: Specific "API" of a node in terms of topics / services / etc. in a descriptive format, see `ros2/design#266 <https://github.com/ros2/design/pull/266>`_
fr: "API" spécifique d'un nœud en termes de sujets/services/etc. dans un format descriptif, voir `ros2/design#266 <https://github.com/ros2/design/pull/266>`_

source: Infrastructure and tools
fr: Infrastructures et outils

source: Building
fr: Bâtiment

source: Consolidate https://build.ros2.org and https://ci.ros2.org
fr: Consolider https://build.ros2.org et https://ci.ros2.org

source: Provision macOS
fr: Provisionner macOS

source: Windows and macOS packages
fr: Forfaits Windows et macOS

source: Support profiles in ``colcon``
fr: Profils de support dans ``colcon``

source: Deprecate https://design.ros2.org. Content should move to either an REP, to https://github.com/ros2/ros2_documentation, or be removed.
fr: Obsolète https://design.ros2.org. Le contenu doit être déplacé vers un REP, vers https://github.com/ros2/ros2_documentation, ou être supprimé.

source: Fix per-package documentation builder to be able to document build artifacts, i.e. messages, services, actions, etc.
fr: Correction du générateur de documentation par package pour pouvoir documenter les artefacts de construction, c'est-à-dire les messages, les services, les actions, etc.

source: Make https://docs.ros.org/en/ros2_documentation automatically rebuild on changes to https://github.com/ros2/ros2_documentation.
fr: Assurez-vous que https://docs.ros.org/en/ros2_documentation se reconstruit automatiquement lors des modifications apportées à https://github.com/ros2/ros2_documentation.

source: ``ament`` documentation
fr: documentation ``principale''

source: Add documentation examples of using ROS 2 with Jupyter notebooks.
fr: Ajoutez des exemples de documentation sur l'utilisation de ROS 2 avec les blocs-notes Jupyter.

source: Add documentation for implementing a new RMW.
fr: Ajouter de la documentation pour la mise en œuvre d'un nouveau RMW.

source: Provide three different kinds of content:
fr: Fournissez trois types de contenu différents :

source: "demos" to show features and cover them with tests
fr: "démos" pour montrer les fonctionnalités et les couvrir de tests

source: "examples" to show a simple/minimalistic usage which might have multiple ways to do something
fr: "exemples" pour montrer une utilisation simple/minimaliste qui pourrait avoir plusieurs façons de faire quelque chose

source: "tutorials" which contain more comments and anchors for the wiki (teaching one recommended way)
fr: "tutoriels" qui contiennent plus de commentaires et d'ancres pour le wiki (enseigner une méthode recommandée)

source: New features
fr: Nouvelles fonctionnalités

source: The trailing stars indicate the rough effort: 1 star for small, 2 stars for medium, 3 stars for large.
fr: Les étoiles en queue indiquent l'effort approximatif : 1 étoile pour petit, 2 étoiles pour moyen, 3 étoiles pour grand.

source: Logging improvements [\* / \*\*]
fr: Améliorations de la journalisation [\* / \*\*]

source: Configuration specified in a file
fr: Configuration spécifiée dans un fichier

source: Per-logger configuration (enabling e.g. ``rqt_logger_level``)
fr: Configuration par enregistreur (activation par exemple de ``rqt_logger_level``)

source: Time related
fr: Lié au temps

source: Support rate and sleep based on clock
fr: Taux d'assistance et sommeil en fonction de l'horloge

source: Additional Graph API features [\*\* / \*\*\*]
fr: Fonctionnalités supplémentaires de l'API Graph [\*\* / \*\*\*]

source: Introspect QoS setting for all (especially remote) topics
fr: Introspecter le paramètre QoS pour tous les sujets (en particulier à distance)

source: a la ROS 1 Master API: https://wiki.ros.org/ROS/Master_API
fr: à l'API maître ROS 1 : https://wiki.ros.org/ROS/Master_API

source: Event-based notification
fr: Notification basée sur les événements

source: Requires knowledge of the rmw interface which needs to be extended
fr: Nécessite la connaissance de l'interface rmw qui doit être étendue

source: Executor
fr: Exécuteur

source: Performance improvements (mostly around the waitset)
fr: Améliorations des performances (principalement autour du jeu d'attente)

source: Deterministic ordering (fair scheduling)
fr: Ordonnancement déterministe (ordonnancement équitable)

source: Decouple waitables
fr: Découpler les attentes

source: Message generation
fr: Génération de messages

source: Catch-up message generation for languages not supported out-of-the-box
fr: Génération de messages de rattrapage pour les langues non prises en charge prêtes à l'emploi

source: Mangle field names in message to avoid language specific keywords
fr: Modifiez les noms de champs dans le message pour éviter les mots-clés spécifiques à la langue

source: Improve generator performance by running them in the same Python interpreter
fr: Améliorez les performances du générateur en les exécutant dans le même interpréteur Python

source: Launch
fr: Lancement

source: Support for launching multi-node executables (i.e. manual composition)
fr: Prise en charge du lancement d'exécutables multi-nœuds (c'est-à-dire composition manuelle)

source: Extend launch XML/YAML support: events and event handlers, tag namespaces and aliasing
fr: Extension de la prise en charge XML/YAML de lancement : événements et gestionnaires d'événements, espaces de noms de balises et alias

source: Support recording services (and actions)
fr: Soutenir les services d'enregistrement (et les actions)

source: Support bridging actions
fr: Soutenir les actions passerelles

source: RMW configuration
fr: Configuration RMW

source: Unified standard way of configuring the middleware
fr: Méthode standard unifiée de configuration du middleware

source: Remapping [\*\* / \*\*\*]
fr: Remappage [\*\* / \*\*\*]

source: Dynamic remapping and aliasing through a Service interface
fr: Remappage et alias dynamique via une interface de service

source: Type masquerading [\*\*\*]
fr: Masquage de type [\*\*\*]

source: Requires knowledge of the typesupport system
fr: Nécessite une connaissance du système de support de type

source: Expand on real-time safety [\*\*\*]
fr: Développer la sécurité en temps réel [\*\*\*]

source: For services, clients, and parameters
fr: Pour les services, les clients et les paramètres

source: Expose more quality of service parameters related to real-time performance
fr: Exposez davantage de paramètres de qualité de service liés aux performances en temps réel

source: Real-time-safe intra-process messaging
fr: Messagerie intra-processus sécurisée en temps réel

source: Multi-robot supporting features and demos [\*\*\*]
fr: Fonctionnalités et démonstrations multi-robots [\*\*\*]

source: Undesired that all nodes across all robots share the same domain (and discover each other)
fr: Indésirable que tous les nœuds de tous les robots partagent le même domaine (et se découvrent)

source: Design how to “partition” the system
fr: Concevoir comment « partitionner » le système

source: Support more DDS / RTPS implementations:
fr: Prend en charge plus d'implémentations DDS/RTPS :

source: RTI Connext DDS Micro (implemented, not enabled by default or officially supported).
fr: RTI Connext DDS Micro (implémenté, non activé par défaut ou officiellement pris en charge).

source: Security improvements:
fr: Améliorations de la sécurité :

source: More granularity in security configuration (allow authentication only, authentication and encryption, etc.) [\*]
fr: Plus de granularité dans la configuration de la sécurité (autoriser l'authentification uniquement, l'authentification et le chiffrement, etc.) [\*]

source: Integrate DDS-Security logging plugin (unified way to aggregate security events and report them to the users through a ROS interface) [\*\*]
fr: Intégrer le plug-in de journalisation DDS-Security (manière unifiée d'agréger les événements de sécurité et de les signaler aux utilisateurs via une interface ROS) [\*\*]

source: Key storage security (right now, keys are just stored in the filesystem) [\*\*]
fr: Sécurité du stockage des clés (actuellement, les clés sont simplement stockées dans le système de fichiers) [\*\*]

source: More user friendly interface (make it easier to specify security config). Maybe a Qt GUI? This GUI could also assist in distributing keys somehow. [\*\*\*]
fr: Interface plus conviviale (facilite la spécification de la configuration de sécurité). Peut-être une interface graphique Qt ? Cette interface graphique pourrait également aider à distribuer les clés d'une manière ou d'une autre. [\*\*\*]

source: A way to say "please secure this running system" with some UI that would auto-generate keys and policies for everything that is currently running. [\*\*\*]
fr: Une façon de dire "s'il vous plaît sécuriser ce système en cours d'exécution" avec une interface utilisateur qui générerait automatiquement des clés et des politiques pour tout ce qui est en cours d'exécution. [\*\*\*]

source: If there are hardware-specific features for securing keys or accelerating encryption/signing messages, that could be interesting to add to DDS/RTPS implementations that don't use it already. [\*\*\*]
fr: S'il existe des fonctionnalités spécifiques au matériel pour sécuriser les clés ou accélérer le chiffrement/la signature des messages, cela pourrait être intéressant à ajouter aux implémentations DDS/RTPS qui ne l'utilisent pas déjà. [\*\*\*]

source: Reducing Technical Debt
fr: Réduction de la dette technique

source: Fix flaky tests on https://ci.ros2.org/view/nightly.
fr: Correction des tests floconneux sur https://ci.ros2.org/view/nightly.

source: Ability to run (all) unit tests with tools e.g. valgrind, clang-tidy, clang static analysis (scan-build), ASAN, TSAN, UBSAN, etc.
fr: Capacité à exécuter (tous) les tests unitaires avec des outils, par ex. valgrind, clang-tidy, analyse statique clang (scan-build), ASAN, TSAN, UBSAN, etc.

source: API review, specifically user-facing APIs in rclcpp and rclpy
fr: Examen des API, en particulier des API destinées aux utilisateurs dans rclcpp et rclpy

source: Refactor the rclcpp API into separate packages focused on a single aspect, rclcpp should afterward still provide the combined user-facing API
fr: Refactoriser l'API rclcpp dans des packages séparés axés sur un seul aspect, rclcpp devrait ensuite toujours fournir l'API combinée destinée à l'utilisateur

source: Revisit message allocators, consider using std::polymorphic_allocator to address problems
fr: Revisitez les répartiteurs de messages, envisagez d'utiliser std :: polymorphic_allocator pour résoudre les problèmes

source: Synchronize / reconcile `design docs <https://design.ros2.org>`__ with the implementation.
fr: Synchroniser/réconcilier `design docs <https://design.ros2.org>`__ avec l'implémentation.

source: Address / classify pending tickets
fr: Adresser/classer les tickets en attente

source: Address TODOs in code / docs
fr: Adresser les TODO dans le code / docs

source: Remove tinyxml as a dependency
fr: Supprimer tinyxml en tant que dépendance
