Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/The-ROS2-Project/Features.po
Languages: fr

source: Features Status
fr: Statut des fonctionnalités

source: The features listed below are available in the current ROS 2 release. Unless otherwise specified, the features are available for all supported platforms (Ubuntu 22.04 (Jammy), Windows 10), DDS implementations (eProsima Fast DDS, RTI Connext DDS, and Eclipse Cyclone DDS) and programming language client libraries (C++ and Python). For planned future development, see the :doc:`Roadmap <Roadmap>`.
fr: Les fonctionnalités répertoriées ci-dessous sont disponibles dans la version actuelle de ROS 2. Sauf indication contraire, les fonctionnalités sont disponibles pour toutes les plates-formes prises en charge (Ubuntu 22.04 (Jammy), Windows 10), les implémentations DDS (eProsima Fast DDS, RTI Connext DDS et Eclipse Cyclone DDS) et les bibliothèques clientes de langage de programmation (C++ et Python). Pour les développements futurs prévus, consultez la :doc:`Roadmap <Roadmap>`.

source: Functionality
fr: Fonctionnalité

source: Link
fr: Lien

source: Fine print
fr: Petits caractères

source: Discovery, transport and serialization over DDS
fr: Découverte, transport et sérialisation sur DDS

source: Support for :doc:`multiple DDS implementations <../Concepts/About-Different-Middleware-Vendors>`, chosen at runtime
fr: Prise en charge de :doc:`plusieurs implémentations DDS <../Concepts/About-Different-Middleware-Vendors>`, choisies au moment de l'exécution

source: :doc:`Concept <../Concepts/About-Different-Middleware-Vendors>`, :doc:`How-to Guide <../How-To-Guides/Working-with-multiple-RMW-implementations>`
fr: :doc:`Concept <../Concepts/About-Different-Middleware-Vendors>`, :doc:`Guide pratique <../How-To-Guides/Working-with-multiple-RMW-implementations>`

source: Currently Eclipse Cyclone DDS, eProsima Fast DDS, and RTI Connext DDS are fully supported.
fr: Actuellement, Eclipse Cyclone DDS, eProsima Fast DDS et RTI Connext DDS sont entièrement pris en charge.

source: Common core client library that is wrapped by language-specific libraries
fr: Bibliothèque cliente de base commune qui est enveloppée par des bibliothèques spécifiques à la langue

source: :doc:`Details <../Concepts/About-ROS-2-Client-Libraries>`
fr: :doc:`Détails <../Concepts/About-ROS-2-Client-Libraries>`

source: Publish/subscribe over topics
fr: Publier/s'abonner sur des sujets

source: `Sample code <https://github.com/ros2/examples>`__\ , `Article <https://design.ros2.org/articles/topic_and_service_names.html>`__
fr: `Exemple de code <https://github.com/ros2/examples>`__\ , `Article <https://design.ros2.org/articles/topic_and_service_names.html>`__

source: Clients and services
fr: Clients et services

source: `Sample code <https://github.com/ros2/examples>`__
fr: `Exemple de code <https://github.com/ros2/examples>`__

source: Set/retrieve parameters
fr: Définir/récupérer les paramètres

source: `Sample code <https://github.com/ros2/demos/tree/0.5.1/demo_nodes_cpp/src/parameters>`__
fr: `Exemple de code <https://github.com/ros2/demos/tree/0.5.1/demo_nodes_cpp/src/parameters>`__

source: ROS 1 - ROS 2 communication bridge
fr: Pont de communication ROS 1 - ROS 2

source: `Tutorial <https://github.com/ros2/ros1_bridge/blob/master/README.md>`__
fr: `Tutoriel <https://github.com/ros2/ros1_bridge/blob/master/README.md>`__

source: Available for topics and services, not yet available for actions.
fr: Disponible pour les sujets et les services, pas encore disponible pour les actions.

source: Quality of service settings for handling non-ideal networks
fr: Paramètres de qualité de service pour la gestion de réseaux non idéaux

source: :doc:`Demo <../Tutorials/Demos/Quality-of-Service>`
fr: :doc:`Démo <../Tutorials/Demos/Quality-of-Service>`

source: Inter- and intra-process communication using the same API
fr: Communication inter- et intra-processus utilisant la même API

source: :doc:`Demo <../Tutorials/Demos/Intra-Process-Communication>`
fr: :doc:`Démo <../Tutorials/Demos/Intra-Process-Communication>`

source: Currently only in C++.
fr: Actuellement uniquement en C++.

source: Composition of node components at compile, link, load, or run time
fr: Composition des composants de nœud au moment de la compilation, de la liaison, du chargement ou de l'exécution

source: :doc:`Demo <../Tutorials/Intermediate/Composition>`
fr: :doc:`Démo <../Tutoriels/Intermédiaire/Composition>`

source: Multiple executors (at level of callback groups) in same node
fr: Plusieurs exécuteurs (au niveau des groupes de rappel) dans le même nœud

source: `Demo <https://github.com/ros2/examples/tree/humble/rclcpp/executors/cbg_executor>`__
fr: `Démo <https://github.com/ros2/examples/tree/humble/rclcpp/executors/cbg_executor>`__

source: Only in C++.
fr: Uniquement en C++.

source: Support for nodes with managed lifecycles
fr: Prise en charge des nœuds avec des cycles de vie gérés

source: :doc:`Demo <../Tutorials/Demos/Managed-Nodes>`
fr: :doc:`Démo <../Tutorials/Demos/Managed-Nodes>`

source: DDS-Security support
fr: Prise en charge de la sécurité DDS

source: `Demo <https://github.com/ros2/sros2>`__
fr: `Démo <https://github.com/ros2/sros2>`__

source: Command-line introspection tools using an extensible framework
fr: Outils d'introspection en ligne de commande utilisant un framework extensible

source: Launch system for coordinating multiple nodes
fr: Système de lancement pour coordonner plusieurs nœuds

source: :doc:`Tutorial <../Tutorials/Intermediate/Launch/Launch-system>`
fr: :doc:`Tutoriel <../Tutorials/Intermediate/Launch/Launch-system>`

source: Namespace support for nodes and topics
fr: Prise en charge des espaces de noms pour les nœuds et les sujets

source: Static remapping of ROS names
fr: Remappage statique des noms ROS

source: :doc:`How-to Guide <../How-To-Guides/Node-arguments>`
fr: :doc:`Guide pratique <../How-To-Guides/Node-arguments>`

source: Demos of an all-ROS 2 mobile robot
fr: Démos d'un robot mobile tout ROS 2

source: `Demo <https://github.com/ros2/turtlebot2_demo>`__
fr: `Démo <https://github.com/ros2/turtlebot2_demo>`__

source: Preliminary support for real-time code
fr: Prise en charge préliminaire du code en temps réel

source: Linux only. Not available for Fast RTPS.
fr: Linux uniquement. Non disponible pour Fast RTPS.

source: Preliminary support for "bare-metal" microcontrollers
fr: Prise en charge préliminaire des microcontrôleurs "bare-metal"

source: Content filtering subscription
fr: Abonnement au filtrage de contenu

source: :doc:`Demo <../Tutorials/Demos/Content-Filtering-Subscription>`
fr: :doc:`Démo <../Tutorials/Demos/Content-Filtering-Subscription>`

source: Besides core features of the platform, the biggest impact of ROS comes from its available packages. The following are a few high-profile packages which are available in the latest release:
fr: Outre les fonctionnalités de base de la plate-forme, le plus grand impact de ROS provient de ses packages disponibles. Voici quelques packages de haut niveau disponibles dans la dernière version :

source: `rosbag2 <https://index.ros.org/r/rosbag2/>`__
fr: erosbag2 <https://index.ros.org/r/rosbag2/>yo__

source: `RQt <https://index.ros.org/r/rqt/>`__
fr: chrysat <http://index.ros.org/r/ryat/>ч__

source: `RViz2 <https://index.ros.org/r/rviz/>`__
fr: irvzi <http://index.rus.org/r/rviz/>a
