Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/The-ROS2-Project/Governance.po
Languages: fr

source: Project Governance
fr: Gouvernance du projet

source: Table of Contents
fr: Table des matières

source: Technical Steering Committee (TSC)
fr: Comité Technique de Pilotage (CST)

source: Since the beginning of ROS, the project has been overseen and prioritized primarily by one organization, first Willow Garage and now Open Robotics. That approach has worked well enough, as evidenced by the widespread adoption of ROS around the world.
fr: Depuis le début de ROS, le projet a été supervisé et priorisé principalement par une organisation, d'abord Willow Garage et maintenant Open Robotics. Cette approche a assez bien fonctionné, comme en témoigne l'adoption généralisée des ROS dans le monde entier.

source: But with ROS 2, we want to broaden participation to accelerate ROS 2 delivery, starting with these areas: determining the roadmap, developing core tools and libraries, and establishing working groups to focus on important topics. To that end, we've established a Technical Steering Committee (TSC). As described in the :doc:`charter <Governance/ROS2-TSC-Charter>`, the TSC comprises representatives of organizations that are contributing to the development of ROS 2, and it has the responsibility to set the technical direction for the project.
fr: Mais avec ROS 2, nous voulons élargir la participation pour accélérer la livraison de ROS 2, en commençant par ces domaines : déterminer la feuille de route, développer des outils et des bibliothèques de base, et établir des groupes de travail pour se concentrer sur des sujets importants. À cette fin, nous avons mis en place un comité directeur technique (TSC). Comme décrit dans la :doc:`charter <Governance/ROS2-TSC-Charter>`, le TSC comprend des représentants des organisations qui contribuent au développement de ROS 2, et il a la responsabilité de définir la direction technique du projet.

source: Packages relevant to this ROS 2 TSC are listed in `REP 2005 <https://www.ros.org/reps/rep-2005.html>`_.
fr: Les packages pertinents pour ce TSC ROS 2 sont répertoriés dans `REP 2005 <https://www.ros.org/reps/rep-2005.html>`_.

source: Meeting notes can be found on `ROS Discourse <https://discourse.ros.org/tag/tsc>`_.
fr: Les notes de réunion sont disponibles sur `ROS Discourse <https://discourse.ros.org/tag/tsc>`_.

source: The current members of the ROS 2 TSC are (23 as of 2022-02-01):
fr: Les membres actuels du ROS 2 TSC sont (23 au 2022-02-01):

source: amazon
fr: amazone

source: apex
fr: sommet

source: canonical
fr: canonique

source: eprosima
fr: accessible

source: intel
fr: renseignements

source: irobot
fr: je robot

source: openrobotics
fr: robotique ouverte

source: picknik
fr: pique-nique

source: rosindustrial
fr: rosindustriel

source: tri
fr: trois

source: foxglove
fr: digitale pourprée

source: zettascale
fr: échelle de zetta

source: If you are interested in joining the ROS 2 TSC, please inquire via info@openrobotics.org.
fr: Si vous souhaitez rejoindre le TSC ROS 2, veuillez vous renseigner via info@openrobotics.org.

source: Working Groups (WGs)
fr: Groupes de travail (GT)

source: As described in its :doc:`charter <Governance/ROS2-TSC-Charter>`, the TSC establishes working groups (WGs) to discuss and make progress on specific topics.
fr: Comme décrit dans sa :doc:`charter <Governance/ROS2-TSC-Charter>`, le TSC établit des groupes de travail (WG) pour discuter et progresser sur des sujets spécifiques.

source: The current WGs are (12 as of 2021-01-12):
fr: Les GT actuels sont (12 au 12/01/2021) :

source: Client Libraries
fr: Bibliothèques clientes

source: Lead(s): Geoffrey Biggs, Alberto Soragna
fr: Responsable(s) : Geoffrey Biggs, Alberto Soragna

source: Resources:
fr: Ressources:

source: Meeting invite group: `ros-client-libraries-working-group-invites@googlegroups.com <https://groups.google.com/forum/#!forum/ros-client-libraries-working-group-invites>`_
fr: Groupe d'invitation à la réunion : `ros-client-libraries-working-group-invites@googlegroups.com <https://groups.google.com/forum/#!forum/ros-client-libraries-working-group-invites>` _

source: `Meeting minutes and agendas <https://docs.google.com/document/d/1MAMQisfbITOR4eDyCBhTEaFJ3QBNW38S7Z7RpBBSSvg/edit>`_
fr: `Procès-verbaux et ordres du jour des réunions <https://docs.google.com/document/d/1MAMQisfbITOR4eDyCBhTEaFJ3QBNW38S7Z7RpBBSSvg/edit>`_

source: Working group charter: https://github.com/ros2-client-libraries-wg/community
fr: Charte du groupe de travail : https://github.com/ros2-client-libraries-wg/community

source: Discourse tag: `wg-client-libraries <https://discourse.ros.org/tags/wg-client-libraries>`_
fr: Balise de discours : `wg-client-libraries <https://discourse.ros.org/tags/wg-client-libraries>`_

source: Control
fr: Contrôle

source: Lead(s): Bence Magyar
fr: Responsable(s) : Bence Magyar

source: Webite link: https://control.ros.org
fr: Lien du site Web : https://control.ros.org

source: Meeting invite group `ros-control-working-group-invites@googlegroups.com <https://groups.google.com/forum/#!forum/ros-control-working-group-invites>`_
fr: Groupe d'invitation à la réunion `ros-control-working-group-invites@googlegroups.com <https://groups.google.com/forum/#!forum/ros-control-working-group-invites>`_

source: Discourse tag: `wg-ros2-control <https://discourse.ros.org/tags/wg-ros2-control>`_
fr: Balise de discours : `wg-ros2-control <https://discourse.ros.org/tags/wg-ros2-control>`_

source: Edge AI
fr: peinture amour

source: Lead(s): TBD
fr: Lead(s) : à déterminer

source: Meeting invite group `ros-edge-ai-working-group-invites <https://groups.google.com/forum/#!forum/ros-edge-ai-working-group-invites>`_
fr: Groupe d'invitation à la réunion `ros-edge-ai-working-group-invites <https://groups.google.com/forum/#!forum/ros-edge-ai-working-group-invites>`_

source: Discourse tag: `wg-edgeai <https://discourse.ros.org/tag/wg-edgeai>`_
fr: Balise de discours : `wg-edgeai <https://discourse.ros.org/tag/wg-edgeai>`_

source: Embedded Systems
fr: Systèmes embarqués

source: `2019-07-29 meeting notes <https://discourse.ros.org/uploads/short-url/z1caIm7m5IVP4cPJUwg3Chq36wO.pdf>`__
fr: `2019-07-29 notes de réunion <https://discourse.ros.org/uploads/short-url/z1caIm7m5IVP4cPJUwg3Chq36wO.pdf>`__

source: `2019-01-15 meeting notes <https://discourse.ros.org/t/ros2-embedded-sig-meeting-2/7243/5>`__
fr: `2019-01-15 notes de réunion <https://discourse.ros.org/t/ros2-embedded-sig-meeting-2/7243/5>`__

source: Meeting invite group `ros-embedded-working-group-invites@googlegroups.com <https://groups.google.com/forum/#!forum/ros-embedded-working-group-invites>`_
fr: Groupe d'invitation à la réunion `ros-embedded-working-group-invites@googlegroups.com <https://groups.google.com/forum/#!forum/ros-embedded-working-group-invites>`_

source: Discourse tag: `wg-embedded <https://discourse.ros.org/tag/wg-embedded>`_
fr: Balise de discours : `wg-embedded <https://discourse.ros.org/tag/wg-embedded>`_

source: Middleware
fr: Intergiciel

source: Lead(s): William Woodall
fr: Responsable(s) : William Woodall

source: Meeting invite group `ros-middleware-working-group-invites@googlegroups.com <https://groups.google.com/forum/#!forum/ros-middleware-working-group-invites>`_
fr: Groupe d'invitation à la réunion `ros-middleware-working-group-invites@googlegroups.com <https://groups.google.com/forum/#!forum/ros-middleware-working-group-invites>`_

source: Discourse tag: `wg-middleware <https://discourse.ros.org/tag/wg-middleware>`_
fr: Balise de discours : `wg-middleware <https://discourse.ros.org/tag/wg-middleware>`_

source: Navigation
fr: La navigation

source: Lead(s): Steve Macenski
fr: Responsable(s) : Steve Macenski

source: `2019-03-17 meeting notes <https://discourse.ros.org/t/ros2-navigation-wg-thursday-3-00-pm-pacific-gmt-7-00/7586/9>`__
fr: `2019-03-17 notes de réunion <https://discourse.ros.org/t/ros2-navigation-wg-thursday-3-00-pm-pacific-gmt-7-00/7586/9>`__

source: Meeting invite group `ros-navigation-working-group-invites@googlegroups.com <https://groups.google.com/forum/#!forum/ros-navigation-working-group-invites>`_
fr: Groupe d'invitation à la réunion `ros-navigation-working-group-invites@googlegroups.com <https://groups.google.com/forum/#!forum/ros-navigation-working-group-invites>`_

source: Discourse tag: `wg-navigation <https://discourse.ros.org/tag/wg-navigation>`_
fr: Balise de discours : `wg-navigation <https://discourse.ros.org/tag/wg-navigation>`_

source: Discourse Channel: `Navigation Stack <https://discourse.ros.org/c/navigation/44>`_
fr: Canal de discussion : `Pile de navigation <https://discourse.ros.org/c/navigation/44>`_

source: Lead(s): Dave Coleman, Mark Moll
fr: Responsable(s) : Dave Coleman, Mark Moll

source: `About our working group meetings <https://discourse.ros.org/t/moveit-maintainer-meeting-all-invited-july-25th/9899>`__
fr: `À propos de nos réunions de groupe de travail <https://discourse.ros.org/t/moveit-maintainer-meeting-all-invited-july-25th/9899>`__

source: Meeting invite group `ros-manipulation-working-group-invites@googlegroups.com <https://groups.google.com/forum/#!forum/ros-manipulation-working-group-invites>`_
fr: Groupe d'invitation à la réunion `ros-manipulation-working-group-invites@googlegroups.com <https://groups.google.com/forum/#!forum/ros-manipulation-working-group-invites>`_

source: Discourse tag: `wg-moveit <https://discourse.ros.org/tag/moveit2>`_
fr: Balise de discours : `wg-moveit <https://discourse.ros.org/tag/moveit2>`_

source: Discourse Channel: `MoveIt <https://discourse.ros.org/c/moveit>`_
fr: Chaîne Discourse : `MoveIt <https://discourse.ros.org/c/moveit>`_

source: Real-time
fr: Temps réel

source: Lead(s): Andrei Kholodnyi, Carlos San Vicente
fr: Glace(s): Andrey Kholodny, Tsarlos San Vicente

source: `Working group website <https://real-time-working-group.readthedocs.io/>`__
fr: `Site Web du groupe de travail <https://real-time-working-group.readthedocs.io/>`__

source: `Working Group Community <https://github.com/ros-realtime/community>`__
fr: `Communauté du groupe de travail <https://github.com/ros-realtime/community>`__

source: Meeting invite group `ros-real-time-working-group-invites@googlegroups.com <https://groups.google.com/forum/#!forum/ros-real-time-working-group-invites>`_
fr: Groupe d'invitation à la réunion `ros-real-time-working-group-invites@googlegroups.com <https://groups.google.com/forum/#!forum/ros-real-time-working-group-invites>`_

source: Discourse tag: `wg-real-time <https://discourse.ros.org/tag/wg-real-time>`_
fr: Balise de discours : `wg-real-time <https://discourse.ros.org/tag/wg-real-time>`_

source: Matrix chat `+ros-realtime:matrix.org <https://matrix.to/#/+ros-realtime:matrix.org>`_
fr: Chat matriciel `+ros-realtime:matrix.org <https://matrix.to/#/+ros-realtime:matrix.org>`_

source: Safety
fr: Sécurité

source: Lead(s): Geoffrey Biggs
fr: Responsable(s) : Geoffrey Biggs

source: `Working group website <https://github.com/ros-safety/safety_working_group>`__
fr: `Site Web du groupe de travail <https://github.com/ros-safety/safety_working_group>`__

source: `Working group Community <https://github.com/ros-safety/safety_working_group>`__
fr: `Communauté du groupe de travail <https://github.com/ros-safety/safety_working_group>`__

source: Meeting invite group `ros-safety-working-group-invites@googlegroups.com <https://groups.google.com/forum/#!forum/ros-safety-working-group-invites>`_
fr: Groupe d'invitation à la réunion `ros-safety-working-group-invites@googlegroups.com <https://groups.google.com/forum/#!forum/ros-safety-working-group-invites>`_

source: Discourse tag: `wg-safety-critical <https://discourse.ros.org/tag/wg-safety-critical>`_
fr: Balise de discours : `wg-safety-critical <https://discourse.ros.org/tag/wg-safety-critical>`_

source: Security
fr: Sécurité

source: Lead(s): Jeremie Deray
fr: Responsable(s) : Jérémy Deray

source: `ROS 2 Security Working Group Community <https://github.com/ros-security/community>`__
fr: `Communauté du groupe de travail sur la sécurité ROS 2 <https://github.com/ros-security/community>`__

source: Meeting invite group `ros-security-working-group-invites@googlegroups.com <https://groups.google.com/forum/#!forum/ros-security-working-group-invites>`_
fr: Groupe d'invitation à la réunion `ros-security-working-group-invites@googlegroups.com <https://groups.google.com/forum/#!forum/ros-security-working-group-invites>`_

source: Discourse tag: `wg-security <https://discourse.ros.org/tag/wg-security>`_
fr: Balise de discours : `wg-security <https://discourse.ros.org/tag/wg-security>`_

source: Matrix chat `+rosorg-security:matrix.org <https://matrix.to/#/+rosorg-security:matrix.org>`_
fr: Chat matriciel `+rosorg-security:matrix.org <https://matrix.to/#/+rosorg-security:matrix.org>`_

source: Rosbag2 and Tooling
fr: Rosbag2 et Outillage

source: Lead(s): Michael Orlov
fr: Responsable(s) : Michael Orlov

source: `Charter <https://github.com/ros-tooling/community>`__
fr: `Charte <https://github.com/ros-tooling/community>`__

source: `Meeting Notes <https://docs.google.com/document/d/1Dsg_9XZQPhihpKQGQWMYTz2doGH4P2cAaNqr60cuNgw/edit>`__
fr: `Notes de réunion <https://docs.google.com/document/d/1Dsg_9XZQPhihpKQGQWMYTz2doGH4P2cAaNqr60cuNgw/edit>`__

source: Meeting invite group `ros-tooling-working-group-invites@googlegroups.com <https://groups.google.com/forum/#!forum/ros-tooling-working-group-invites>`_
fr: Groupe d'invitation à la réunion `ros-tooling-working-group-invites@googlegroups.com <https://groups.google.com/forum/#!forum/ros-tooling-working-group-invites>`_

source: Discourse tag: `wg-tooling <https://discourse.ros.org/tag/wg-tooling>`_
fr: Balise de discours : `wg-tooling <https://discourse.ros.org/tag/wg-tooling>`_

source: Matrix chat `+ros-tooling:matrix.org <https://matrix.to/#/+ros-tooling:matrix.org>`_
fr: Chat matriciel `+ros-tooling:matrix.org <https://matrix.to/#/+ros-tooling:matrix.org>`_

source: Lead(s): Emerson Knapp
fr: Responsable(s) : Emerson Knapp

source: `Charter <https://github.com/RobotWebTools/community>`__
fr: `Charte <https://github.com/RobotWebTools/community>`__

source: `Meeting Notes <https://docs.google.com/document/d/1esrRj2x80TSCEHOwuh-cT_bQvAqqvloQAQr8mPMzcTc/edit>`__
fr: `Notes de réunion <https://docs.google.com/document/d/1esrRj2x80TSCEHOwuh-cT_bQvAqqvloQAQr8mPMzcTc/edit>`__

source: `Video Recordings <https://www.youtube.com/playlist?list=PLpUh4ScdBhSMb98_C0q_zIT8GNMehYBd>`__
fr: `Enregistrements vidéo <https://www.youtube.com/playlist?list=PLpUh4ScdBhSMb98_C0q_zIT8GNMehYBd>`__

source: `Google Group <https://groups.google.com/g/ros-webtools-working-group>`__
fr: `Groupe Google <https://groups.google.com/g/ros-webtools-working-group>`__

source: Discourse tag: `wg-webtools <https://discourse.ros.org/tag/wg-webtools>`__
fr: Balise de discours : `wg-webtools <https://discourse.ros.org/tag/wg-webtools>`__

source: Community Working Groups
fr: Groupes de travail communautaires

source: The ROS 2 TSC is interested in encouraging and promoting working groups outside its direct purview. To provide extra visibility the TSC maintains a list of the community driven working groups here as well as working with the community to provide them with the same infrastructure.
fr: Le TSC ROS 2 souhaite encourager et promouvoir des groupes de travail en dehors de sa compétence directe. Pour fournir une visibilité supplémentaire, le TSC maintient une liste des groupes de travail dirigés par la communauté ici et travaille avec la communauté pour leur fournir la même infrastructure.

source: Hardware Acceleration
fr: Accélération matérielle

source: Lead(s): Víctor Mayoral Vilches
fr: Responsable(s) : Victor Mayoral Vilches

source: Meeting invite group `ROS 2 Hardware Acceleration WG Google Group <https://groups.google.com/g/ros-2-hardware-acceleration-wg>`_
fr: Groupe d'invitation à la réunion `Groupe Google ROS 2 Hardware Acceleration WG <https://groups.google.com/g/ros-2-hardware-acceleration-wg>`_

source: Discourse tag: `wg-acceleration <https://discourse.ros.org/tag/wg-acceleration>`_
fr: Balise de discours : `wg-acceleration <https://discourse.ros.org/tag/wg-acceleration>`_

source: Github organization: `ros-acceleration <https://github.com/ros-acceleration>`_
fr: Organisation Github : `ros-acceleration <https://github.com/ros-acceleration>`_

source: Rust
fr: Rouiller

source: Lead(s): Esteve Fernandez, Jacob Hassold
fr: Responsable(s) : Esteve Fernandez, Jacob Hassold

source: `Working group Community <https://github.com/ros2-rust/rust-wg>`__
fr: `Communauté du groupe de travail <https://github.com/ros2-rust/rust-wg>`__

source: Meeting invite group `ros-rust-working-group-invites@googlegroups.com <https://groups.google.com/forum/#!forum/ros-rust-working-group-invites>`_
fr: Groupe d'invitation à la réunion `ros-rust-working-group-invites@googlegroups.com <https://groups.google.com/forum/#!forum/ros-rust-working-group-invites>`_

source: Discourse tag: `wg-rust <https://discourse.ros.org/tag/wg-rust>`_
fr: Balise de discours : `wg-rust <https://discourse.ros.org/tag/wg-rust>`_

source: Matrix chat `+rosorg-rust:matrix.org <https://matrix.to/#/+rosorg-rust:matrix.org>`_
fr: Chat matriciel `+rosorg-rust:matrix.org <https://matrix.to/#/+rosorg-rust:matrix.org>`_

source: If you'd like to join an existing ROS 2 WG, please contact the appropriate group lead(s) directly. If you'd like to create a new WG, please inquire via info@openrobotics.org.
fr: Si vous souhaitez rejoindre un groupe de travail ROS 2 existant, veuillez contacter directement le ou les responsables de groupe appropriés. Si vous souhaitez créer un nouveau groupe de travail, veuillez vous renseigner via info@openrobotics.org.

source: Working Group Policies
fr: Politiques du groupe de travail

source: Meetings should be posted to the Google calendar as well as announced on Discourse.
fr: Les réunions doivent être publiées sur le calendrier Google et annoncées sur Discourse.

source: Meetings should have notes and be posted to Discourse using appropriate working group tag.
fr: Les réunions doivent avoir des notes et être publiées sur Discourse en utilisant la balise de groupe de travail appropriée.

source: For attending the groups meetings please join the associated google group to get invites automatically.
fr: Pour assister aux réunions de groupes, veuillez rejoindre le groupe Google associé pour recevoir automatiquement des invitations.

source: Upcoming ROS Events
fr: Prochains événements ROS

source: Upcoming Working group meetings can be found in this `Google Calendar <https://calendar.google.com/calendar/embed?src=agf3kajirket8khktupm9go748%40group.calendar.google.com&ctz=America%2FLos_Angeles>`_. It can be accessed via `iCal <https://calendar.google.com/calendar/ical/agf3kajirket8khktupm9go748%40group.calendar.google.com/public/basic.ics>`_.
fr: Les prochaines réunions du groupe de travail peuvent être trouvées dans ce `Google Calendar <https://calendar.google.com/calendar/embed?src=agf3kajirket8khktupm9go748%40group.calendar.google.com&ctz=America%2FLos_Angeles>`_. Il est accessible via `iCal <https://calendar.google.com/calendar/ical/agf3kajirket8khktupm9go748%40group.calendar.google.com/public/basic.ics>`_.

source: If you have an individual event or series of events that you'd like to post please contact info@openrobotics.org
fr: Si vous souhaitez publier un événement individuel ou une série d'événements, veuillez contacter info@openrobotics.org
