Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/The-ROS2-Project/Marketing.po
Languages: fr

source: Marketing
fr: Commercialisation

source: General Use ROS Artwork
fr: Illustration ROS à usage général

source: The ROS 2 media kit, which includes branding language, high resolution ROS logo graphics, and release images, can be found in the `ROS art repository. <https://github.com/ros-infrastructure/artwork>`__ Please refer to this repository for ROS art work and our branding guidelines.
fr: Le kit média ROS 2, qui comprend un langage de marque, des graphiques de logo ROS haute résolution et des images de sortie, peut être trouvé dans le référentiel d'art `ROS. <https://github.com/ros-infrastructure/artwork>`__ Veuillez vous référer à ce référentiel pour les œuvres d'art ROS et nos directives de marque.

source: Stickers, Posters, and Canvas Prints
fr: Autocollants, affiches et impressions sur toile

source: Open Robotics hosts an online storefront on `Zazzle.com <https://www.zazzle.com/store/openrobotics?rf=238583394320947238>`__ with artwork available in various formats.
fr: Open Robotics héberge une vitrine en ligne sur `Zazzle.com <https://www.zazzle.com/store/openrobotics?rf=238583394320947238>`__ avec des illustrations disponibles dans différents formats.

source: `Posters <https://www.zazzle.com/store/openrobotics/products?dp=0&cg=196892405499231339&rf=238583394320947238>`__ Printed on paper with selectable sizes.
fr: `Affiches <https://www.zazzle.com/store/openrobotics/products?dp=0&cg=196892405499231339&rf=238583394320947238>`__ Imprimées sur du papier avec des tailles sélectionnables.

source: `Canvas Prints <https://www.zazzle.com/store/openrobotics/products?dp=0&cg=196964974640243022&rf=238583394320947238>`__ Printed on wrapped canvas with selectable sizes.
fr: `Impressions sur toile <https://www.zazzle.com/store/openrobotics/products?dp=0&cg=196964974640243022&rf=238583394320947238>`__ Imprimé sur toile enveloppée avec des tailles sélectionnables.

source: `Sticker Sheets <https://www.zazzle.com/store/openrobotics/products?dp=0&cg=196936312033387169&rf=238583394320947238>`__ Printed on a sheet, 20 per sheet for the small, 6 per sheet in the large size.
fr: `Feuilles d'autocollants <https://www.zazzle.com/store/openrobotics/products?dp=0&cg=196936312033387169&rf=238583394320947238>`__ Imprimé sur une feuille, 20 par feuille pour le petit, 6 par feuille dans le grand format.

source: Brochure: Why ROS 2?
fr: Plaquette : Pourquoi ROS 2 ?

source: Use this brochure to promote the goals and features of ROS 2 and encourage adoption.
fr: Utilisez cette brochure pour promouvoir les objectifs et les fonctionnalités de ROS 2 et encourager son adoption.

source: License: `CC BY-ND 4.0 <https://creativecommons.org/licenses/by-nd/4.0/>`__
fr: Licence : `CC BY-ND 4.0 <https://creativecommons.org/licenses/by-nd/4.0/>`__

source: Available formats:
fr: Formats disponibles :

source: :download:`A4 (for web/email) <Marketing/documents/ros2-brochure-a4-web.pdf>`
fr: :download:`A4 (pour le Web/e-mail) <Marketing/documents/ros2-brochure-a4-web.pdf>`

source: :download:`A4 (for print) <Marketing/documents/ros2-brochure-a4-print.pdf>`
fr: :download:`A4 (pour impression) <Marketing/documents/ros2-brochure-a4-print.pdf>`

source: :download:`US Letter (for web/email) <Marketing/documents/ros2-brochure-ltr-web.pdf>`
fr: :download:`US Letter (pour le web/email) <Marketing/documents/ros2-brochure-ltr-web.pdf>`

source: :download:`US Letter (for print) <Marketing/documents/ros2-brochure-ltr-print.pdf>`
fr: :download:`US Letter (pour impression) <Marketing/documents/ros2-brochure-ltr-print.pdf>`
