Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/The-ROS2-Project/Roadmap.po
Languages: fr

source: Roadmap
fr: Feuille de route

source: Table of Contents
fr: Table des matières

source: This page describes planned work for ROS 2. The set of planned features and development efforts should provide insight into the overall direction of ROS 2. If you would like to see other features on the roadmap, please get in touch with us at info@openrobotics.org.
fr: Cette page décrit le travail prévu pour ROS 2. L'ensemble des fonctionnalités prévues et les efforts de développement devraient donner un aperçu de l'orientation générale de ROS 2. Si vous souhaitez voir d'autres fonctionnalités sur la feuille de route, veuillez nous contacter à info@openrobotics .org.

source: Iron Roadmap
fr: Feuille de route du fer

source: Iron Irwini is the ROS 2 release expected in May 2023. See :ref:`release <iron-release>` for a detailed timeline.
fr: Iron Irwini est la version de ROS 2 attendue en mai 2023. Voir :ref:`release <iron-release>` pour une chronologie détaillée.

source: The items in the roadmap below are the major features being worked on by the ROS 2 community. The "Size" is an estimated size of the task, where *Small* means person-days to complete, *Medium* means person-weeks to complete, and *Large* means person-months to complete.
fr: Les éléments de la feuille de route ci-dessous sont les principales fonctionnalités sur lesquelles travaille la communauté ROS 2. La "Taille" est une estimation de la taille de la tâche, où *Petite* signifie des jours-personnes à terminer, *Moyenne* signifie des semaines-personnes à terminer et *Grande* signifie des mois-personnes à terminer.

source: If you are working on a feature for ROS 2 Iron and would like to have it listed, please open a pull request to `ROS 2 Documentation <https://github.com/ros2/ros2_documentation>`__. If you'd like to take on one of these tasks, please :doc:`get in touch with us <../Contact>`.
fr: Si vous travaillez sur une fonctionnalité pour ROS 2 Iron et que vous souhaitez qu'elle soit répertoriée, veuillez ouvrir une demande d'extraction à `Documentation ROS 2 <https://github.com/ros2/ros2_documentation>`__. Si vous souhaitez entreprendre l'une de ces tâches, veuillez :doc:`contactez-nous <../Contact>`.

source: Task
fr: Tâche

source: Size
fr: Taille

source: Owner
fr: Propriétaire

source: Expected Completion
fr: Achèvement prévu

source: Various improvements and port of further functionality for Diagnostics
fr: Diverses améliorations et port de fonctionnalités supplémentaires pour les diagnostics

source: Medium
fr: Moyen

source: Q1 2023
fr: T1 2023

source: License linter and copyright file generator for binary packages
fr: Linter de licence et générateur de fichiers de droits d'auteur pour les packages binaires

source: Q2 2023
fr: Vomi 2023

source: rclc Dispatcher Executor for non-POSIX OS
fr: rclc Dispatcher Executor pour les systèmes d'exploitation non POSIX

source: Improve rclcpp executor performance
fr: Améliorer les performances de l'exécuteur rclcpp

source: Large
fr: Grand

source: Open Robotics
fr: Robotique ouverte

source: Q4 2022
fr: I4 2022

source: DDS User Experience - Improve the out-of-the-box experience
fr: Expérience utilisateur DDS - Améliorez l'expérience prête à l'emploi

source: DDS User Experience - Configuration of Initial Peers for Discovery
fr: Expérience utilisateur DDS - Configuration des homologues initiaux pour la découverte

source: Small
fr: Petit

source: DDS User Experience - Develop a configuration tool
fr: Expérience utilisateur DDS - Développer un outil de configuration

source: Python per-package documentation generation
fr: Génération de documentation Python par paquet

source: rclpy performance with large messages
fr: performances de rclpy avec des messages volumineux

source: ROS 1 to ROS 2 migration documentation and tools
fr: Documentation et outils de migration ROS 1 vers ROS 2

source: SDF integration
fr: Intégration SDF

source: Better error message for launch (stretch goal)
fr: Meilleur message d'erreur pour le lancement (objectif extensible)

source: Relaunch of individual nodes in a complex system (stretch goal)
fr: Relance de nœuds individuels dans un système complexe (objectif étendu)

source: Logging configuration and features (stretch goal)
fr: Configuration et fonctionnalités de journalisation (objectif étendu)

source: Iron release
fr: Libération de fer

source: Sony Group Corporation
fr: Société du groupe Sony

source: `on_pub/sub_matched callback support <https://github.com/ros2/rmw/issues/330>`__
fr: `prise en charge du rappel on_pub/sub_matched <https://github.com/ros2/rmw/issues/330>`__

source: ROS 2 core ContentFiltering Enhancement
fr: Amélioration du filtrage de contenu de base ROS 2

source: Additional project-specific roadmaps can be found in the links below:
fr: Des feuilles de route supplémentaires spécifiques au projet peuvent être trouvées dans les liens ci-dessous :

source: Planned releases
fr: Sorties prévues

source: Please see the :doc:`Distributions page <../Releases>` for the timeline of and information about future distributions.
fr: Veuillez consulter la :doc:`page Distributions <../Releases>` pour la chronologie et les informations sur les distributions futures.

source: Contributing to ROS 2
fr: Contribuer à ROS 2

source: Looking for something to work on, or just want to help out? Here are a few resources to get you going.
fr: Vous cherchez quelque chose sur quoi travailler ou vous voulez simplement aider? Voici quelques ressources pour vous aider.

source: The :doc:`Contributing <Contributing>` guide describes how to make a contribution to ROS 2.
fr: Le guide :doc:`Contributing <Contributing>` décrit comment apporter une contribution à ROS 2.

source: Check out the list of :doc:`Feature Ideas <Feature-Ideas>` for inspiration.
fr: Consultez la liste des :doc:`Feature Ideas <Feature-Ideas>` pour vous inspirer.

source: For more information on the design of ROS 2 please see `design.ros2.org <https://design.ros2.org>`__.
fr: Pour plus d'informations sur la conception de ROS 2, veuillez consulter `design.ros2.org <https://design.ros2.org>`__.

source: The core code for ROS 2 is in the `ros2 GitHub organization <https://github.com/ros2>`__.
fr: Le code principal de ROS 2 se trouve dans l'organisation `ros2 GitHub <https://github.com/ros2>`__.

source: The Discourse forum/mailing list for discussing ROS 2 design is `ng-ros <https://discourse.ros.org/c/ng-ros>`__.
fr: Le forum/la liste de diffusion Discourse pour discuter de la conception de ROS 2 est `ng-ros <https://discourse.ros.org/c/ng-ros>`__.

source: Questions should be asked on `ROS answers <https://answers.ros.org>`__\ , make sure to include at least the ``ros2`` tag and the rosdistro version you are running, e.g. ``humble``.
fr: Les questions doivent être posées sur `ROS answers <https://answers.ros.org>`__\ , assurez-vous d'inclure au moins la balise ``ros2`` et la version de rosdistro que vous utilisez, par exemple. ``humble``.
