Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/The-ROS2-Project/ROSCon-Content.po
Languages: fr

source: ROSCon Talks
fr: Pourparlers ROSCon

source: The following `ROSCon <https://roscon.ros.org>`__ talks have been given on ROS 2 and provide information about the workings of ROS 2 and various demos:
fr: Les conférences `ROSCon <https://roscon.ros.org>`__ suivantes ont été données sur ROS 2 et fournissent des informations sur le fonctionnement de ROS 2 et diverses démos :

source: Title
fr: Titre

source: Links
fr: Liens

source: Panel: The ROS 2 Developer Experience
fr: Panel : L'expérience des développeurs ROS 2

source: `video <https://vimeo.com/showcase/9954564/video/767155188>`__
fr: `vidéo <https://vimeo.com/showcase/9954564/video/767155188>`__

source: Wearable ROS: Development of wearable robot system using ROS 2
fr: Wearable ROS : Développement d'un système de robot portable utilisant ROS 2

source: `video <https://vimeo.com/showcase/9954564/video/767140298>`__
fr: `vidéo <https://vimeo.com/showcase/9954564/video/767140298>`__

source: Building ROS 2 enabled Android apps with C++
fr: Création d'applications Android compatibles ROS 2 avec C++

source: `video <https://vimeo.com/showcase/9954564/video/767161955>`__
fr: `vidéo <https://vimeo.com/showcase/9954564/video/767161955>`__

source: Distributed Robotics Simulator with Unreal Engine
fr: Simulateur de robotique distribuée avec Unreal Engine

source: `video <https://vimeo.com/showcase/9954564/video/767139975>`__
fr: `vidéo <https://vimeo.com/showcase/9954564/video/767139975>`__

source: Tools and processes for improving the certifiability of ROS 2
fr: Outils et processus pour améliorer la certifiabilité du ROS 2

source: `video <https://vimeo.com/showcase/9954564/video/767150613>`__
fr: `vidéo <https://vimeo.com/showcase/9954564/video/767150613>`__

source: Failover ROS Framework : Consensus-based node redundancy
fr: Failover ROS Framework : Redondance de nœud basée sur le consensus

source: `video <https://vimeo.com/showcase/9954564/video/767156308>`__
fr: `vidéo <https://vimeo.com/showcase/9954564/video/767156308>`__

source: ROS 2 and Gazebo Integration Best Practices
fr: Meilleures pratiques d'intégration de ROS 2 et Gazebo

source: `video <https://vimeo.com/showcase/9954564/video/767127300>`__
fr: `vidéo <https://vimeo.com/showcase/9954564/video/767127300>`__

source: Chain-Aware ROS Evaluation Tool (CARET)
fr: Outil d'évaluation ROS en chaîne (CARET)

source: `video <https://vimeo.com/showcase/9954564/video/767150288>`__
fr: `vidéo <https://vimeo.com/showcase/9954564/video/767150288>`__

source: ROS 2 network monitoring
fr: Surveillance du réseau ROS 2

source: `video <https://vimeo.com/showcase/9954564/video/767140681>`__
fr: `vidéo <https://vimeo.com/showcase/9954564/video/767140681>`__

source: How custom tasks are defined, assigned, and executed in Open-RMF
fr: Comment les tâches personnalisées sont définies, affectées et exécutées dans Open-RMF

source: `video <https://vimeo.com/showcase/9954564/video/767157210>`__
fr: `vidéo <https://vimeo.com/showcase/9954564/video/767157210>`__

source: A practitioner's guide to ros2_control
fr: Guide du praticien sur ros2_control

source: `video <https://vimeo.com/showcase/9954564/video/767139648>`__
fr: `vidéo <https://vimeo.com/showcase/9954564/video/767139648>`__

source: Zenoh: How to Make ROS 2 Work at any Scale and Integrate with Anything
fr: Zenoh : comment faire fonctionner ROS 2 à n'importe quelle échelle et s'intégrer à tout

source: `video <https://vimeo.com/769972405>`__
fr: `vidéo <https://vimeo.com/769972405>`__

source: A case study in optics manufacturing with MoveIt2 and ros2_control
fr: Une étude de cas dans la fabrication d'optiques avec MoveIt2 et ros2_control

source: `video <https://vimeo.com/showcase/9954564/video/767140351>`__
fr: `vidéo <https://vimeo.com/showcase/9954564/video/767140351>`__

source: 20/20 Robot Vision - How to setup cameras in ROS 1 & ROS 2 using camera_aravis
fr: 20/20 Robot Vision - Comment configurer les caméras dans ROS 1 et ROS 2 à l'aide de camera_aravis

source: `video <https://vimeo.com/showcase/9954564/video/767140329>`__
fr: `vidéo <https://vimeo.com/showcase/9954564/video/767140329>`__

source: Filter your ROS 2 content
fr: Filtrez votre contenu ROS 2

source: `video <https://vimeo.com/767166447>`__
fr: `vidéo <https://vimeo.com/767166447>`__

source: Evolving Message Types, and Other Interfaces, Over Time
fr: Évolution des types de messages et d'autres interfaces au fil du temps

source: `video <https://vimeo.com/showcase/9954564/video/767140015>`__
fr: `vidéo <https://vimeo.com/showcase/9954564/video/767140015>`__

source: Migrating from ROS1 to ROS 2 - choosing the right bridge
fr: Migration de ROS1 vers ROS 2 - choisir le bon pont

source: `video <https://vimeo.com/showcase/9954564/video/767140113>`__
fr: `vidéo <https://vimeo.com/showcase/9954564/video/767140113>`__

source: On Use of Nav2 Smac Planners
fr: Sur l'utilisation des planificateurs Nav2 Smac

source: `video <https://vimeo.com/showcase/9954564/video/767157646>`__
fr: `vidéo <https://vimeo.com/showcase/9954564/video/767157646>`__

source: Bazel and ROS 2 – building large scale safety applications
fr: Bazel et ROS 2 – création d'applications de sécurité à grande échelle

source: `video <https://vimeo.com/showcase/9954564/video/767139879>`__
fr: `vidéo <https://vimeo.com/showcase/9954564/video/767139879>`__

source: Native Rust components for ROS 2
fr: Composants Native Rust pour ROS 2

source: `video <https://vimeo.com/showcase/9954564/video/767140150>`__
fr: `vidéo <https://vimeo.com/showcase/9954564/video/767140150>`__

source: The ROS build farm and you: How ROS packages you release become binary packages.
fr: La batterie de builds ROS et vous : comment les packages ROS que vous publiez deviennent des packages binaires.

source: `video <https://vimeo.com/showcase/9954564/video/767169376>`__
fr: `vidéo <https://vimeo.com/showcase/9954564/video/767169376>`__

source: mROS 2: yet another runtime environment onto embedded devices
fr: mROS 2 : encore un autre environnement d'exécution sur des appareils embarqués

source: `video <https://vimeo.com/showcase/9954564/video/767150435>`__
fr: `vidéo <https://vimeo.com/showcase/9954564/video/767150435>`__

source: ROS 2 & Edge Impulse: Embedded AI in robotics applications
fr: ROS 2 & Edge Impulse : IA embarquée dans les applications robotiques

source: `video <https://vimeo.com/showcase/9954564/video/767140724>`__
fr: `vidéo <https://vimeo.com/showcase/9954564/video/767140724>`__

source: micro-ROS goes Automotive: supporting AUTOSAR-based microcontrollers
fr: micro-ROS devient automobile : prise en charge des microcontrôleurs basés sur AUTOSAR

source: `video <https://vimeo.com/769963507>`__
fr: `vidéo <https://vimeo.com/769963507>`__

source: An open architecture for Hardware Acceleration in ROS 2
fr: Une architecture ouverte pour l'accélération matérielle dans ROS 2

source: `video <https://vimeo.com/769967795>`__
fr: `vidéo <https://vimeo.com/769967795>`__

source: ROS 2 and the Crazyflie: Aerial swarms and Autonomy with a tiny flying robot
fr: ROS 2 et le Crazyflie : essaims aériens et autonomie avec un petit robot volant

source: `video <https://vimeo.com/showcase/9954564/video/767140197>`__
fr: `vidéo <https://vimeo.com/showcase/9954564/video/767140197>`__

source: A Raspberry Pi image with ROS 2 + RT and a customizable image builder
fr: Une image Raspberry Pi avec ROS 2 + RT et un constructeur d'image personnalisable

source: `video <https://vimeo.com/showcase/9954564/video/767139709>`__
fr: `vidéo <https://vimeo.com/showcase/9954564/video/767139709>`__

source: `video <https://vimeo.com/649655394/f9b25be7f9>`__
fr: `vidéo <https://vimeo.com/649655394/f9b25be7f9>`__

source: rospy2: Convert a ROS1 node to ROS2 by changing only one line of code
fr: rospy2 : convertir un nœud ROS1 en ROS2 en modifiant une seule ligne de code

source: `video <https://vimeo.com/649655340/127d801385>`__
fr: `vidéo <https://vimeo.com/649655340/127d801385>`__

source: Hello Robot: Democratizing Mobile Manipulation with ROS
fr: Hello Robot : Démocratiser la manipulation mobile avec ROS

source: `video <https://vimeo.com/649649087/b1a3a67369>`__
fr: `vidéo <https://vimeo.com/649649087/b1a3a67369>`__

source: Challenges for ROS2 in Autonomous Agricultural Applications
fr: Défis pour ROS2 dans les applications agricoles autonomes

source: `video <https://vimeo.com/649646777>`__
fr: `vidéo <https://vimeo.com/649646777>`__

source: ESP32 microcontroller robot with Navigation 2 ROS 2 running in the Cloud
fr: Robot microcontrôleur ESP32 avec Navigation 2 ROS 2 fonctionnant dans le Cloud

source: `video <https://vimeo.com/649648283>`__
fr: `vidéo <https://vimeo.com/649648283>`__

source: Middleware interconnecting ROS/ROS2 with the EtherCAT protocol
fr: Middleware interconnectant ROS/ROS2 avec le protocole EtherCAT

source: `video <https://vimeo.com/649651918>`__
fr: `vidéo <https://vimeo.com/649651918>`__

source: Build and Manage Cloud-enhanced ROS Robots with AWS IoT Greengrass 2.0
fr: Créez et gérez des robots ROS optimisés pour le cloud avec AWS IoT Greengrass 2.0

source: `video <https://vimeo.com/649647971/0f36010e6e>`__
fr: `vidéo <https://vimeo.com/649647971/0f36010e6e>`__

source: Driving Autonomy in Mobile Robotics with ROS2 and PX4
fr: Autonomie de conduite dans la robotique mobile avec ROS2 et PX4

source: `video <https://vimeo.com/649648867/c524ae57fd>`__
fr: `vidéo <https://vimeo.com/649648867/c524ae57fd>`__

source: Integrating ROS 2 with existing DDS networks
fr: Intégration de ROS 2 aux réseaux DDS existants

source: `video <https://vimeo.com/649649793/31032f6fba>`__
fr: `vidéo <https://vimeo.com/649649793/31032f6fba>`__

source: VIPER: Volatiles Investigating Polar Exploration Rover
fr: VIPER : Volatiles enquête sur le rover d'exploration polaire

source: `video <https://vimeo.com/649657650/ce9245dc22>`__
fr: `vidéo <https://vimeo.com/649657650/ce9245dc22>`__

source: Chronicles of Caching and Containerising CI for Nav2
fr: Chroniques de la mise en cache et de la conteneurisation des CI pour Nav2

source: `video <https://vimeo.com/649647161/5b0c278e6c>`__
fr: `vidéo <https://vimeo.com/649647161/5b0c278e6c>`__

source: A New Way to Interact with PointCloud2 Messages
fr: Une nouvelle façon d'interagir avec les messages PointCloud2

source: `video <https://vimeo.com/649643457/7ba0e85107>`__
fr: `vidéo <https://vimeo.com/649643457/7ba0e85107>`__

source: ROS 2 Grasp Library – Acceleration for 3D Object Pose Detection
fr: Bibliothèque ROS 2 Grasp - Accélération pour la détection de pose d'objet 3D

source: `video <https://vimeo.com/649654728/25bef7e247>`__
fr: `vidéo <https://vimeo.com/649654728/25bef7e247>`__

source: ros2_control: The future of ros_control
fr: ros2_control : L'avenir de ros_control

source: `video <https://vimeo.com/649654948>`__
fr: `vidéo <https://vimeo.com/649654948>`__

source: `video <https://vimeo.com/649650919>`__
fr: `vidéo <https://vimeo.com/649650919>`__

source: Hybrid Planning - Enabling Reactive Manipulation with MoveIt 2
fr: Planification hybride - Permettre la manipulation réactive avec MoveIt 2

source: `video <https://vimeo.com/649649286/17fb9b9f4d>`__
fr: `vidéo <https://vimeo.com/649649286/17fb9b9f4d>`__

source: Apex.OS Cert: Taking ROS 2 from prototype into production
fr: Apex.OS Cert : faire passer ROS 2 du prototype à la production

source: `video <https://vimeo.com/649645295/67e0a6569f>`__
fr: `vidéo <https://vimeo.com/649645295/67e0a6569f>`__

source: Making a robot ROS 2 powered - a case study using the UR manipulators
fr: Fabrication d'un robot alimenté par ROS 2 - une étude de cas utilisant les manipulateurs UR

source: `video <https://vimeo.com/649651707/46a3be27ed>`__
fr: `vidéo <https://vimeo.com/649651707/46a3be27ed>`__

source: Online Trajectory Generation and Admittance Control in ROS2
fr: Génération de trajectoire en ligne et contrôle d'admission dans ROS2

source: `video <https://vimeo.com/649652452/682bd92e95>`__
fr: `vidéo <https://vimeo.com/649652452/682bd92e95>`__

source: VSCode, Docker and ROS2
fr: VSCode, Docker et ROS2

source: `video <https://vimeo.com/649658020/9ef0b5ec32>`__
fr: `vidéo <https://vimeo.com/649658020/9ef0b5ec32>`__

source: ROS 2 Content Filtered Topics
fr: Sujets filtrés de contenu ROS 2

source: `video <https://vimeo.com/649654533/c8104829db>`__
fr: `vidéo <https://vimeo.com/649654533/c8104829db>`__

source: Rosbag2 for Power Users
fr: Rosbag2 pour les utilisateurs expérimentés

source: `video <https://vimeo.com/649655219/75630c8cff>`__
fr: `vidéo <https://vimeo.com/649655219/75630c8cff>`__

source: We Have Ignition: The Next Generation of Gazebo Simulation
fr: We Have Ignition : la prochaine génération de simulation de belvédère

source: `video <https://vimeo.com/649658182>`__
fr: `vidéo <https://vimeo.com/649658182>`__

source: Using NVIDIA Isaac Sim For Synthetic Data Generation & ROS Development
fr: Utilisation de NVIDIA Isaac Sim pour la génération de données synthétiques et le développement ROS

source: `video <https://vimeo.com/649656932/3d8d5abb53>`__
fr: `vidéo <https://vimeo.com/649656932/3d8d5abb53>`__

source: Augmented Reality and Robotics
fr: Réalité Augmentée et Robotique

source: `video <https://vimeo.com/649645502/9be46e9ff8>`__
fr: `vidéo <https://vimeo.com/649645502/9be46e9ff8>`__

source: Modeling sensors for simulation of ROS applications in Unity
fr: Modélisation de capteurs pour la simulation d'applications ROS dans Unity

source: `video <https://vimeo.com/649652075/295c92d323>`__
fr: `vidéo <https://vimeo.com/649652075/295c92d323>`__

source: Panel: Simulation Tools for ROS
fr: Panel : Outils de simulation pour ROS

source: `video <https://vimeo.com/649653566/9d02eac6cb>`__
fr: `vidéo <https://vimeo.com/649653566/9d02eac6cb>`__

source: Accelerating Innovation with ROS: Lessons in Healthcare
fr: Accélérer l'innovation avec les ROS : Leçons en matière de soins de santé

source: `video <https://vimeo.com/showcase/7812155/video/480611811>`__
fr: `vidéo <https://vimeo.com/showcase/7812155/video/480611811>`__

source: Panel: Software Quality in Robotics
fr: Panel : Qualité logicielle en robotique

source: `video <https://vimeo.com/showcase/7812155/video/480586443>`__
fr: `vidéo <https://vimeo.com/showcase/7812155/video/480586443>`__

source: `video <https://vimeo.com/showcase/7812155/video/480592013>`__
fr: `vidéo <https://vimeo.com/showcase/7812155/video/480592013>`__

source: Achieving Generality and Robustness in Semantic Segmentation
fr: Atteindre la généralité et la robustesse dans la segmentation sémantique

source: `video <https://vimeo.com/showcase/7812155/video/480600107>`__
fr: `vidéo <https://vimeo.com/showcase/7812155/video/480600107>`__

source: Navigation2: The Next Generation Navigation System
fr: Navigation2 : le système de navigation de nouvelle génération

source: `video <https://vimeo.com/showcase/7812155/video/480604621>`__
fr: `vidéo <https://vimeo.com/showcase/7812155/video/480604621>`__

source: CHAMP Quadruped Control
fr: Contrôle quadrupède CHAMP

source: `video <https://vimeo.com/showcase/7812155/video/480603868>`__
fr: `vidéo <https://vimeo.com/showcase/7812155/video/480603868>`__

source: Kiwibot: ROS2 in the atoms delivery industry
fr: Kiwibot : ROS2 dans l'industrie de la livraison d'atomes

source: `video <https://vimeo.com/showcase/7812155/video/480601709>`__
fr: `vidéo <https://vimeo.com/showcase/7812155/video/480601709>`__

source: `video <https://vimeo.com/showcase/7812155/video/480482977>`__
fr: `vidéo <https://vimeo.com/showcase/7812155/video/480482977>`__

source: `video <https://vimeo.com/showcase/7812155/video/480465027>`__
fr: `vidéo <https://vimeo.com/showcase/7812155/video/480465027>`__

source: `video <https://vimeo.com/showcase/7812155/video/480460365>`__
fr: `vidéo <https://vimeo.com/showcase/7812155/video/480460365>`__

source: Autoware
fr: Logiciel automatique

source: `video <https://vimeo.com/showcase/7812155/video/480450941>`__
fr: `vidéo <https://vimeo.com/showcase/7812155/video/480450941>`__

source: `video <https://vimeo.com/showcase/7812155/video/480477960>`__
fr: `vidéo <https://vimeo.com/showcase/7812155/video/480477960>`__

source: `video <https://vimeo.com/showcase/7812155/video/480473016>`__
fr: `vidéo <https://vimeo.com/showcase/7812155/video/480473016>`__

source: Lightning Talks and Sponsor Videos 1
fr: Lightning Talks et vidéos des sponsors 1

source: `video <https://vimeo.com/showcase/7812155/video/480530126>`__
fr: `vidéo <https://vimeo.com/showcase/7812155/video/480530126>`__

source: Lightning Talks and Sponsor Videos 2
fr: Lightning Talks et vidéos des sponsors 2

source: `video <https://vimeo.com/showcase/7812155/video/480435216>`__
fr: `vidéo <https://vimeo.com/showcase/7812155/video/480435216>`__

source: Lightning Talks and Sponsor Videos 3
fr: Lightning Talks et vidéos des sponsors 3

source: `video <https://vimeo.com/showcase/7812155/video/480436954>`__
fr: `vidéo <https://vimeo.com/showcase/7812155/video/480436954>`__

source: Lightning Talks and Sponsor Videos 4
fr: Lightning Talks et vidéos des sponsors 4

source: `video <https://vimeo.com/showcase/7812155/video/490004991>`__
fr: `vidéo <https://vimeo.com/showcase/7812155/video/490004991>`__

source: Migrating a large ROS 1 codebase to ROS 2
fr: Migration d'une grande base de code ROS 1 vers ROS 2

source: `slides <https://roscon.ros.org/2019/talks/roscon2019_migrating_a_large_ros_1_codebase_to_ros_2.pdf>`__ / `video <https://vimeo.com/378682692>`__
fr: `diapositives <https://roscon.ros.org/2019/talks/roscon2019_migrating_a_large_ros_1_codebase_to_ros_2.pdf>`__ / `vidéo <https://vimeo.com/378682692>`__

source: The New Architecture of Gazebo Wrappers for ROS 2
fr: La nouvelle architecture des wrappers Gazebo pour ROS 2

source: `slides <https://roscon.ros.org/2019/talks/roscon2019_gazebo_ros2.pdf>`__ / `video <https://vimeo.com/378683414>`__
fr: `diapositives <https://roscon.ros.org/2019/talks/roscon2019_gazebo_ros2.pdf>`__ / `vidéo <https://vimeo.com/378683414>`__

source: Migrating to ROS 2: Advice from Rover Robotics
fr: Migrer vers ROS 2 : conseils de Rover Robotics

source: `slides <https://roscon.ros.org/2019/talks/roscon2019_migrating_to_ros_2.pdf>`__ / `video <https://vimeo.com/378682068>`__
fr: `diapositives <https://roscon.ros.org/2019/talks/roscon2019_migrating_to_ros_2.pdf>`__ / `vidéo <https://vimeo.com/378682068>`__

source: ROS 2 on VxWorks
fr: ROS 2 sur VxWorks

source: `slides <https://roscon.ros.org/2019/talks/roscon2019_ros2onvxworks.pdf>`__ / `video <https://vimeo.com/378682144>`__
fr: `diapositives <https://roscon.ros.org/2019/talks/roscon2019_ros2onvxworks.pdf>`__ / `vidéo <https://vimeo.com/378682144>`__

source: Navigation2 Overview
fr: Aperçu de la navigation2

source: `slides <https://roscon.ros.org/2019/talks/roscon2019_navigation2_overview_final.pdf>`__ / `video <https://vimeo.com/378682188>`__
fr: `diapositives <https://roscon.ros.org/2019/talks/roscon2019_navigation2_overview_final.pdf>`__ / `vidéo <https://vimeo.com/378682188>`__

source: Launch Testing - Launch description and integration testing for ros2
fr: Test de lancement - Description du lancement et tests d'intégration pour ros2

source: `slides <https://roscon.ros.org/2019/talks/roscon2019_launch_testing_presentation.pdf>`__ / `video <https://vimeo.com/378683186>`__
fr: `diapositives <https://roscon.ros.org/2019/talks/roscon2019_launch_testing_presentation.pdf>`__ / `vidéo <https://vimeo.com/378683186>`__

source: ROS 2 for Consumer Robotics: : The iRobot use-case
fr: ROS 2 pour la robotique grand public : : le cas d'utilisation d'iRobot

source: `slides <https://roscon.ros.org/2019/talks/roscon2019_irobot_usecase.pdf>`__ / `video <https://vimeo.com/378916114>`__
fr: `diapositives <https://roscon.ros.org/2019/talks/roscon2019_irobot_usecase.pdf>`__ / `vidéo <https://vimeo.com/378916114>`__

source: Composable Nodes in ROS2
fr: Nœuds composables dans ROS2

source: `slides <https://roscon.ros.org/2019/talks/roscon2019_composablenodes.pdf>`__ / `video <https://vimeo.com/378916125>`__
fr: `diapositives <https://roscon.ros.org/2019/talks/roscon2019_composablenodes.pdf>`__ / `vidéo <https://vimeo.com/378916125>`__

source: Concurrency in ROS 1 and ROS 2
fr: Concurrence dans ROS 1 et ROS 2

source: `slides <https://roscon.ros.org/2019/talks/roscon2019_concurrency.pdf>`__ / `video <https://vimeo.com/379127709>`__
fr: `diapositives <https://roscon.ros.org/2019/talks/roscon2019_concurrency.pdf>`__ / `vidéo <https://vimeo.com/379127709>`__

source: A True Zero-Copy RMW Implementation for ROS2
fr: Une véritable implémentation RMW sans copie pour ROS2

source: `slides <https://roscon.ros.org/2019/talks/roscon2019_truezerocopy.pdf>`__ / `video <https://vimeo.com/379127778>`__
fr: `diapositives <https://roscon.ros.org/2019/talks/roscon2019_truezerocopy.pdf>`__ / `vidéo <https://vimeo.com/379127778>`__

source: ROS2 Real-Time Behavior: Static Memory Allocation
fr: Comportement en temps réel de ROS2 : allocation de mémoire statique

source: `video <https://vimeo.com/379127767>`__
fr: `vidéo <https://vimeo.com/379127767>`__

source: PackML2: State Machine Based System Programming, Monitoring and Control in ROS2
fr: PackML2 : programmation, surveillance et contrôle du système basé sur la machine d'état dans ROS2

source: `slides <https://roscon.ros.org/2019/talks/roscon2019_packml2.pdf>`__ / `video <https://vimeo.com/378683073>`__
fr: `diapositives <https://roscon.ros.org/2019/talks/roscon2019_packml2.pdf>`__ / `vidéo <https://vimeo.com/378683073>`__

source: Quality of Service Policies for ROS2 Communications
fr: Politiques de qualité de service pour les communications ROS2

source: `slides <https://roscon.ros.org/2019/talks/roscon2019_qos.pdf>`__ / `video <https://vimeo.com/379127762>`__
fr: `diapositives <https://roscon.ros.org/2019/talks/roscon2019_qos.pdf>`__ / `vidéo <https://vimeo.com/379127762>`__

source: Micro-ROS: ROS2 on Microcontrollers
fr: Micro-ROS : ROS2 sur microcontrôleurs

source: `slides <https://roscon.ros.org/2019/talks/roscon2019_microros.pdf>`__ / `video <https://vimeo.com/379127756>`__
fr: `diapositives <https://roscon.ros.org/2019/talks/roscon2019_microros.pdf>`__ / `vidéo <https://vimeo.com/379127756>`__

source: ROS2 on Large Scale Systems: Discovery Server
fr: ROS2 sur les systèmes à grande échelle : serveur de découverte

source: `video <https://vimeo.com/379127745>`__
fr: `vidéo <https://vimeo.com/379127745>`__

source: Bridging Your Transitions from ROS 1 to ROS 2
fr: Combler vos transitions de ROS 1 à ROS 2

source: `slides <https://roscon.ros.org/2019/talks/roscon2019_bridging_ros1_to_ros2.pdf>`__ / `video <https://vimeo.com/379127737>`__
fr: `diapositives <https://roscon.ros.org/2019/talks/roscon2019_bridging_ros1_to_ros2.pdf>`__ / `vidéo <https://vimeo.com/379127737>`__

source: Markup Extensions for ROS 2 Launch
fr: Extensions de balisage pour le lancement de ROS 2

source: `slides <https://roscon.ros.org/2019/talks/roscon2019_markupextensionsforros2launch.pdf>`__ / `video <https://vimeo.com/379127678>`__
fr: `diapositives <https://roscon.ros.org/2019/talks/roscon2019_markupextensionsforros2launch.pdf>`__ / `vidéo <https://vimeo.com/379127678>`__

source: Hands-on ROS 2: A Walkthrough
fr: ROS 2 pratique : une procédure pas à pas

source: `slides <https://roscon.ros.org/2018/presentations/ROSCon2018_ROS2HandsOn.pdf>`__ / `video <https://vimeo.com/292693129>`__
fr: `diapositives <https://roscon.ros.org/2018/presentations/ROSCon2018_ROS2HandsOn.pdf>`__ / `vidéo <https://vimeo.com/292693129>`__

source: Launch for ROS 2
fr: Lancement pour ROS 2

source: `slides <https://roscon.ros.org/2018/presentations/ROSCon2018_launch.pdf>`__ / `video <https://vimeo.com/292699162>`__
fr: `diapositives <https://roscon.ros.org/2018/presentations/ROSCon2018_launch.pdf>`__ / `vidéo <https://vimeo.com/292699162>`__
