Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/The-ROS2-Project/ROSCon-Content.po
Languages: fr

source: The ROS 2 vision for advancing the future of robotics development
fr: La vision ROS 2 pour faire avancer l'avenir du développement de la robotique

source: `slides <https://roscon.ros.org/2017/presentations/ROSCon%202017%20ROS2%20Vision.pdf>`__ / `video <https://vimeo.com/236161417>`__
fr: `diapositives <https://roscon.ros.org/2017/presentations/ROSCon%202017%20ROS2%20Vision.pdf>`__ / `vidéo <https://vimeo.com/236161417>`__

source: ROS 2 Update - summary of alpha releases, architectural overview
fr: Mise à jour ROS 2 - résumé des versions alpha, aperçu de l'architecture

source: `slides <https://roscon.ros.org/2016/presentations/ROSCon%202016%20-%20ROS%202%20Update.pdf>`__ / `video <https://vimeo.com/187696091>`__
fr: `diapositives <https://roscon.ros.org/2016/presentations/ROSCon%202016%20-%20ROS%202%20Update.pdf>`__ / `vidéo <https://vimeo.com/187696091>`__

source: Evaluating the resilience of ROS2 communication layer
fr: Évaluation de la résilience de la couche de communication ROS2

source: `slides <https://roscon.ros.org/2016/presentations/rafal.kozik-ros2evaluation.pdf>`__ / `video <https://vimeo.com/187705229>`__
fr: `diapositives <https://roscon.ros.org/2016/presentations/rafal.kozik-ros2evaluation.pdf>`__ / `vidéo <https://vimeo.com/187705229>`__

source: State of ROS 2 - demos and the technology behind
fr: État de ROS 2 - démos et technologie sous-jacente

source: `slides <https://roscon.ros.org/2015/presentations/state-of-ros2.pdf>`__ / `video <https://vimeo.com/142151734>`__
fr: `diapositives <https://roscon.ros.org/2015/presentations/state-of-ros2.pdf>`__ / `vidéo <https://vimeo.com/142151734>`__

source: ROS 2 on "small" embedded systems
fr: ROS 2 sur les "petits" systèmes embarqués

source: `slides <https://roscon.ros.org/2015/presentations/ros2_on_small_embedded_systems.pdf>`__ / `video <https://vimeo.com/142150576>`__
fr: `diapositives <https://roscon.ros.org/2015/presentations/ros2_on_small_embedded_systems.pdf>`__ / `vidéo <https://vimeo.com/142150576>`__

source: Real-time control in ROS and ROS 2
fr: Contrôle en temps réel dans ROS et ROS 2

source: `slides <https://roscon.ros.org/2015/presentations/RealtimeROS2.pdf>`__ / `video <https://vimeo.com/142621778>`__
fr: `diapositives <https://roscon.ros.org/2015/presentations/RealtimeROS2.pdf>`__ / `vidéo <https://vimeo.com/142621778>`__

source: Why you want to use ROS 2
fr: Pourquoi voulez-vous utiliser ROS 2

source: `slides <https://www.osrfoundation.org/wordpress2/wp-content/uploads/2015/04/ROSCON-2014-Why-you-want-to-use-ROS-2.pdf>`__ / `video <https://vimeo.com/107531013>`__
fr: `diapositives <https://www.osrfoundation.org/wordpress2/wp-content/uploads/2015/04/ROSCON-2014-Why-you-want-to-use-ROS-2.pdf>`__ / `vidéo <https://vimeo.com/107531013>`__

source: Next-generation ROS: Building on DDS
fr: ROS de nouvelle génération : s'appuyer sur DDS

source: `slides <https://roscon.ros.org/2014/wp-content/uploads/2014/07/ROSCON-2014-Next-Generation-of-ROS-on-top-of-DDS.pdf>`__ / `video <https://vimeo.com/106992622>`__
fr: `diapositives <https://roscon.ros.org/2014/wp-content/uploads/2014/07/ROSCON-2014-Next-Generation-of-ROS-on-top-of-DDS.pdf>`__ / `vidéo <https://vimeo.com/106992622>`__
