Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Tutorials/Beginner-CLI-Tools/Understanding-ROS2-Services/Understanding-ROS2-Services.po
Languages: fr

source: Understanding services
fr: Comprendre les services

source: **Goal:** Learn about services in ROS 2 using command line tools.
fr: **Objectif :** En savoir plus sur les services dans ROS 2 à l'aide d'outils de ligne de commande.

source: **Tutorial level:** Beginner
fr: **Niveau du tutoriel :** Débutant

source: **Time:** 10 minutes
fr: **Durée :** 10 minutes

source: Contents
fr: Contenu

source: Background
fr: Arrière-plan

source: Services are another method of communication for nodes in the ROS graph. Services are based on a call-and-response model, versus topics’ publisher-subscriber model. While topics allow nodes to subscribe to data streams and get continual updates, services only provide data when they are specifically called by a client.
fr: Les services sont une autre méthode de communication pour les nœuds du graphe ROS. Les services sont basés sur un modèle d'appel et de réponse, par opposition au modèle éditeur-abonné des sujets. Alors que les rubriques permettent aux nœuds de s'abonner à des flux de données et d'obtenir des mises à jour continues, les services ne fournissent des données que lorsqu'ils sont spécifiquement appelés par un client.

source: Prerequisites
fr: Conditions préalables

source: Some concepts mentioned in this tutorial, like :doc:`Nodes <../Understanding-ROS2-Nodes/Understanding-ROS2-Nodes>` and :doc:`Topics <../Understanding-ROS2-Topics/Understanding-ROS2-Topics>`, were covered in previous tutorials in the series.
fr: Certains concepts mentionnés dans ce tutoriel, comme :doc:`Nodes <../Understanding-ROS2-Nodes/Understanding-ROS2-Nodes>` et :doc:`Topics <../Understanding-ROS2-Topics/Understanding-ROS2- Les sujets> ', ont été couverts dans les didacticiels précédents de la série.

source: You will need the :doc:`turtlesim package <../Introducing-Turtlesim/Introducing-Turtlesim>`.
fr: Vous aurez besoin du :doc:`package tortuesim <../Introducing-Turtlesim/Introducing-Turtlesim>`.

source: As always, don’t forget to source ROS 2 in :doc:`every new terminal you open <../Configuring-ROS2-Environment>`.
fr: Comme toujours, n'oubliez pas de sourcer ROS 2 dans :doc:`chaque nouveau terminal que vous ouvrez <../Configuring-ROS2-Environment>`.

source: Tasks
fr: Tâches

source: 1 Setup
fr: 1 Configuration

source: Start up the two turtlesim nodes, ``/turtlesim`` and ``/teleop_turtle``.
fr: Démarrez les deux nœuds turtlesim, ``/turtlesim`` et ``/teleop_turtle``.

source: Open a new terminal and run:
fr: Ouvrez un nouveau terminal et exécutez :

source: Open another terminal and run:
fr: Ouvrez un autre terminal et exécutez :

source: 2 ros2 service list
fr: 2 liste de services ros2

source: Running the ``ros2 service list`` command in a new terminal will return a list of all the services currently active in the system:
fr: L'exécution de la commande ``ros2 service list`` dans un nouveau terminal renverra une liste de tous les services actuellement actifs dans le système :

source: You will see that both nodes have the same six services with ``parameters`` in their names. Nearly every node in ROS 2 has these infrastructure services that parameters are built off of. There will be more about parameters in the next tutorial. In this tutorial, the parameter services will be omitted from discussion.
fr: Vous verrez que les deux nœuds ont les six mêmes services avec ``parameters`` dans leurs noms. Presque tous les nœuds de ROS 2 disposent de ces services d'infrastructure à partir desquels les paramètres sont construits. Vous en saurez plus sur les paramètres dans le prochain tutoriel. Dans ce didacticiel, les services de paramètres seront omis de la discussion.

source: For now, let’s focus on the turtlesim-specific services, ``/clear``, ``/kill``, ``/reset``, ``/spawn``, ``/turtle1/set_pen``, ``/turtle1/teleport_absolute``, and ``/turtle1/teleport_relative``. You may recall interacting with some of these services using rqt in the :doc:`Use turtlesim and rqt <../Introducing-Turtlesim/Introducing-Turtlesim>` tutorial.
fr: Pour l'instant, concentrons-nous sur les services spécifiques à turtlesim, ``/clear``, ``/kill``, ``/reset``, ``/spawn``, ``/turtle1/set_pen``, ` `/turtle1/teleport_absolute`` et ``/turtle1/teleport_relative``. Vous vous souvenez peut-être d'avoir interagi avec certains de ces services en utilisant rqt dans le didacticiel :doc:`Utiliser turtlesim et rqt <../Introducing-Turtlesim/Introducing-Turtlesim>`.

source: 3 ros2 service type
fr: 3 types de services ros2

source: Services have types that describe how the request and response data of a service is structured. Service types are defined similarly to topic types, except service types have two parts: one message for the request and another for the response.
fr: Les services ont des types qui décrivent comment les données de demande et de réponse d'un service sont structurées. Les types de service sont définis de la même manière que les types de rubrique, sauf que les types de service comportent deux parties : un message pour la demande et un autre pour la réponse.

source: To find out the type of a service, use the command:
fr: Pour connaître le type d'un service, utilisez la commande :

source: Let’s take a look at turtlesim’s ``/clear`` service. In a new terminal, enter the command:
fr: Jetons un coup d'œil au service ``/clear`` de turtlesim. Dans un nouveau terminal, entrez la commande :

source: Which should return:
fr: Qui devrait retourner :

source: The ``Empty`` type means the service call sends no data when making a request and receives no data when receiving a response.
fr: Le type ``Vide`` signifie que l'appel de service n'envoie aucune donnée lors d'une requête et ne reçoit aucune donnée lors de la réception d'une réponse.

source: 3.1 ros2 service list -t
fr: 3.1 liste de services ros2 -t

source: To see the types of all the active services at the same time, you can append the ``--show-types`` option, abbreviated as ``-t``, to the ``list`` command:
fr: Pour voir les types de tous les services actifs en même temps, vous pouvez ajouter l'option ``--show-types``, abrégée en ``-t``, à la commande ``list`` :

source: Which will return:
fr: Qui reviendra :

source: 4 ros2 service find
fr: 4 ros2 service trouver

source: If you want to find all the services of a specific type, you can use the command:
fr: Si vous voulez trouver tous les services d'un type spécifique, vous pouvez utiliser la commande :

source: For example, you can find all the ``Empty`` typed services like this:
fr: Par exemple, vous pouvez trouver tous les services de type ``Vide`` comme ceci :

source: 5 ros2 interface show
fr: 5 spectacle d'interface ros2

source: You can call services from the command line, but first you need to know the structure of the input arguments.
fr: Vous pouvez appeler des services à partir de la ligne de commande, mais vous devez d'abord connaître la structure des arguments d'entrée.

source: To run this command on the ``/clear`` service’s type, ``Empty``:
fr: Pour exécuter cette commande sur le type de service ``/clear``, ``Empty`` :

source: The ``---`` separates the request structure (above) from the response structure (below). But, as you learned earlier, the ``Empty`` type doesn’t send or receive any data. So, naturally, its structure is blank.
fr: Le ``---`` sépare la structure de la requête (ci-dessus) de la structure de la réponse (ci-dessous). Mais, comme vous l'avez appris précédemment, le type ``Empty`` n'envoie ni ne reçoit aucune donnée. Donc, naturellement, sa structure est vierge.

source: Let’s introspect a service with a type that sends and receives data, like ``/spawn``. From the results of ``ros2 service list -t``, we know ``/spawn``’s type is ``turtlesim/srv/Spawn``.
fr: Introspectons un service avec un type qui envoie et reçoit des données, comme ``/spawn``. D'après les résultats de ``ros2 service list -t``, nous savons que le type de ``/spawn`` est ``turtlesim/srv/Spawn``.

source: To see the arguments in a ``/spawn`` call-and-request, run the command:
fr: Pour voir les arguments dans un appel et une requête ``/spawn``, exécutez la commande :

source: The information above the ``---`` line tells us the arguments needed to call ``/spawn``. ``x``, ``y`` and ``theta`` determine the location of the spawned turtle, and ``name`` is clearly optional.
fr: Les informations au-dessus de la ligne ``---`` nous indiquent les arguments nécessaires pour appeler ``/spawn``. ``x``, ``y`` et ``theta`` déterminent l'emplacement de la tortue engendrée, et ``name`` est clairement facultatif.

source: The information below the line isn’t something you need to know in this case, but it can help you understand the data type of the response you get from the call.
fr: Les informations sous la ligne ne sont pas quelque chose que vous devez savoir dans ce cas, mais elles peuvent vous aider à comprendre le type de données de la réponse que vous obtenez de l'appel.

source: 6 ros2 service call
fr: 6 appel de service ros2

source: Now that you know what a service type is, how to find a service’s type, and how to find the structure of that type’s arguments, you can call a service using:
fr: Maintenant que vous savez ce qu'est un type de service, comment trouver un type de service et comment trouver la structure des arguments de ce type, vous pouvez appeler un service en utilisant :

source: The ``<arguments>`` part is optional. For example, you know that ``Empty`` typed services don’t have any arguments:
fr: La partie ``<arguments>`` est facultative. Par exemple, vous savez que les services de type ``Empty`` n'ont pas d'argument :

source: This command will clear the turtlesim window of any lines your turtle has drawn.
fr: Cette commande effacera de la fenêtre turtlesim toutes les lignes dessinées par votre tortue.

source: Now let’s spawn a new turtle by calling ``/spawn`` and inputting arguments. Input ``<arguments>`` in a service call from the command-line need to be in YAML syntax.
fr: Créons maintenant une nouvelle tortue en appelant ``/spawn`` et en entrant des arguments. L'entrée ``<arguments>`` dans un appel de service depuis la ligne de commande doit être en syntaxe YAML.

source: Enter the command:
fr: Entrez la commande :

source: You will get this method-style view of what’s happening, and then the service response:
fr: Vous obtiendrez cette vue de style méthode de ce qui se passe, puis la réponse du service :

source: Your turtlesim window will update with the newly spawned turtle right away:
fr: Votre fenêtre turtlesim se mettra immédiatement à jour avec la tortue nouvellement créée :

source: Summary
fr: Résumé

source: Nodes can communicate using services in ROS 2. Unlike a topic - a one way communication pattern where a node publishes information that can be consumed by one or more subscribers - a service is a request/response pattern where a client makes a request to a node providing the service and the service processes the request and generates a response.
fr: Les nœuds peuvent communiquer à l'aide de services dans ROS 2. Contrairement à un sujet - un modèle de communication à sens unique où un nœud publie des informations qui peuvent être consommées par un ou plusieurs abonnés - un service est un modèle de demande/réponse où un client fait une demande à un nœud fournissant le service et le service traite la demande et génère une réponse.

source: You generally don’t want to use a service for continuous calls; topics or even actions would be better suited.
fr: Vous ne souhaitez généralement pas utiliser un service pour des appels continus ; des sujets ou même des actions seraient mieux adaptés.

source: In this tutorial you used command line tools to identify, elaborate on, and call services.
fr: Dans ce didacticiel, vous avez utilisé des outils de ligne de commande pour identifier, élaborer et appeler des services.

source: Next steps
fr: Prochaines étapes

source: In the next tutorial, :doc:`../Understanding-ROS2-Parameters/Understanding-ROS2-Parameters`, you will learn about configuring node settings.
fr: Dans le didacticiel suivant, :doc:`../Understanding-ROS2-Parameters/Understanding-ROS2-Parameters`, vous apprendrez à configurer les paramètres de nœud.

source: Related content
fr: Contenu connexe

source: Check out `this tutorial <https://discourse.ubuntu.com/t/call-services-in-ros-2/15261>`_; it's an excellent realistic application of ROS services using a Robotis robot arm.
fr: Consultez `ce tutoriel <https://discourse.ubuntu.com/t/call-services-in-ros-2/15261>`_; c'est une excellente application réaliste des services ROS utilisant un bras robotique Robotis.
