Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Releases/Alpha-Overview.po
Languages: fr

source: Table of Contents
fr: Table des matières

source: This is a merged version of the previously separated pages for the 8 alpha releases of ROS 2.
fr: Il s'agit d'une version fusionnée des pages précédemment séparées pour les 8 versions alpha de ROS 2.

source: We hope that you try them out and `provide feedback <../../Contact>`.
fr: Nous espérons que vous les essayerez et que vous "fournirez des commentaires <../../Contact>".

source: ROS 2 alpha8 release (code name *Hook-and-Loop*; October 2016)
fr: Version ROS 2 alpha8 (nom de code *Hook-and-Loop* ; octobre 2016)

source: Changes to supported DDS vendors
fr: Modifications apportées aux fournisseurs DDS pris en charge

source: ROS 2 supports multiple middleware implementations (see `this page <../../Concepts/About-Different-Middleware-Vendors>` for more details). Until Alpha 8, ROS 2 was supporting ROS middleware implementations for eProsima's Fast RTPS, RTI's Connext and PrismTech's OpenSplice. To streamline our efforts, as of Alpha 8, Fast RTPS and Connext (static) will be supported, with Fast RTPS (`now Apache 2.0-licensed <http://www.eprosima.com/index.php/company-all/news/61-eprosima-goes-apache>`__) shipped as the default.
fr: ROS 2 prend en charge plusieurs implémentations de middleware (voir `cette page <../../Concepts/About-Different-Middleware-Vendors>` pour plus de détails). Jusqu'à Alpha 8, ROS 2 prenait en charge les implémentations de middleware ROS pour Fast RTPS d'eProsima, Connext de RTI et OpenSplice de PrismTech. Pour rationaliser nos efforts, à partir d'Alpha 8, Fast RTPS et Connext (statique) seront pris en charge, avec Fast RTPS (`maintenant sous licence Apache 2.0 <http://www.eprosima.com/index.php/company-all/ news/61-eprosima-goes-apache>`__) livré par défaut.

source: Scope
fr: Portée

source: As the "alpha" qualifier suggests, this release of ROS 2 is far from complete. You should not expect to switch from ROS 1 to ROS 2, nor should you expect to build a new robot control system with ROS 2. Rather, you should expect to try out some demos, explore the code, and perhaps write your own demos.
fr: Comme le suggère le qualificatif "alpha", cette version de ROS 2 est loin d'être complète. Vous ne devez pas vous attendre à passer de ROS 1 à ROS 2, ni à construire un nouveau système de contrôle de robot avec ROS 2. Vous devez plutôt vous attendre à essayer quelques démos, à explorer le code et peut-être à écrire vos propres démos.

source: The improvements included in this release are:
fr: Les améliorations incluses dans cette version sont :

source: Several improvements to Fast RTPS and its rmw implementation
fr: Plusieurs améliorations de Fast RTPS et de son implémentation rmw

source: Support for large (image) messages in Fast RTPS
fr: Prise en charge des messages volumineux (image) dans Fast RTPS

source: ``wait_for_service`` functionality in Fast RTPS
fr: Fonctionnalité ``wait_for_service`` dans Fast RTPS

source: Support for all ROS 2 message types in Python and C
fr: Prise en charge de tous les types de messages ROS 2 en Python et C

source: Added support for Quality of Service (QoS) settings in Python
fr: Ajout de la prise en charge des paramètres de qualité de service (QoS) dans Python

source: Fixed various bugs with the previous alpha release
fr: Correction de divers bugs avec la version alpha précédente

source: Pretty much anything not listed above is not included in this release. The next steps are described in the `Roadmap <../../The-ROS2-Project/Roadmap>`.
fr: Pratiquement tout ce qui n'est pas répertorié ci-dessus n'est pas inclus dans cette version. Les prochaines étapes sont décrites dans la `Roadmap <../../The-ROS2-Project/Roadmap>`.

source: ROS 2 alpha7 release (code name *Glue Gun*\ ; July 2016)
fr: Version ROS 2 alpha7 (nom de code *Pistolet à colle*\ ; juillet 2016)

source: New version of Ubuntu required
fr: Nouvelle version d'Ubuntu requise

source: Until Alpha 6 ROS 2 was targeting Ubuntu Trusty Tahr (14.04). As of this Alpha ROS 2 is targeting Ubuntu Xenial Xerus (16.04) to benefit from newer versions of the compiler, CMake, Python, etc.
fr: Jusqu'à Alpha 6, ROS 2 ciblait Ubuntu Trusty Tahr (14.04). A partir de là, Alpha ROS 2 cible Ubuntu Xenial Xerus (16.04) pour bénéficier des nouvelles versions du compilateur, CMake, Python, etc.

source: The major features included in this release are:
fr: Les principales fonctionnalités incluses dans cette version sont :

source: Graph API functionality: wait_for_service
fr: Fonctionnalité de l'API graphique : wait_for_service

source: Added interfaces in rclcpp and make use of them in examples, demos, and tests
fr: Ajout d'interfaces dans rclcpp et utilisation de celles-ci dans des exemples, des démos et des tests

source: Improved support for large messages in both Connext and Fast-RTPS (partial for Fast-RTPS)
fr: Prise en charge améliorée des messages volumineux dans Connext et Fast-RTPS (partiel pour Fast-RTPS)

source: Turtlebot demo using ported code from ROS 1
fr: Démo Turtlebot utilisant le code porté de ROS 1

source: See: https://github.com/ros2/turtlebot2_demo
fr: Voir : https://github.com/ros2/turtlebot2_demo

source: ROS 2 alpha6 release (code name *Fastener*; June 2016)
fr: Version ROS 2 alpha6 (nom de code *Fastener* ; juin 2016)

source: Added graph guard condition to nodes for waiting on graph changes
fr: Ajout d'une condition de garde de graphique aux nœuds pour attendre les changements de graphique

source: Added ``rmw_service_server_is_available`` for verifying if a service is available
fr: Ajout de ``rmw_service_server_is_available`` pour vérifier si un service est disponible

source: Refactored ``rclcpp`` to use ``rcl``
fr: Refactorisation de ``rclcpp`` pour utiliser ``rcl``

source: Improved support for complex message types in Python
fr: Prise en charge améliorée des types de messages complexes en Python

source: Nested messages
fr: Messages imbriqués

source: Arrays
fr: Tableaux

source: Strings
fr: Cordes

source: ROS 2 alpha5 release (code name *Epoxy*; April 2016)
fr: Version ROS 2 alpha5 (nom de code * Epoxy *; avril 2016)

source: Support for C data structures in Fast RTPS and Connext Dynamic rmw implementations.
fr: Prise en charge des structures de données C dans les implémentations Fast RTPS et Connext Dynamic rmw.

source: Support services in C.
fr: Services d'assistance en C.

source: Added 32-bit and 64-bit ARM as experimentally supported platforms.
fr: Ajout d'ARM 32 bits et 64 bits en tant que plates-formes prises en charge expérimentalement.

source: ROS 2 alpha4 release (code name *Duct tape*; February 2016)
fr: Version ROS 2 alpha4 (nom de code * Duct tape *; février 2016)

source: Background
fr: Arrière-plan

source: As explained in a `design article <https://design.ros2.org/articles/why_ros2.html>`__, we are engaged in the development of a new major version of ROS, called "ROS 2." While the underlying concepts (e.g., publish / subscribe messaging) and goals (e.g., flexibility and reusability) are the same as for ROS 1, we are taking this opportunity to make substantial changes to the system, including changing some of the core APIs. For a deeper treatment of those changes and their rationale, consult the other `ROS 2 design articles <https://design.ros2.org>`__.
fr: Comme expliqué dans un `article de conception <https://design.ros2.org/articles/why_ros2.html>`__, nous sommes engagés dans le développement d'une nouvelle version majeure de ROS, appelée "ROS 2". Bien que les concepts sous-jacents (par exemple, la messagerie de publication/d'abonnement) et les objectifs (par exemple, la flexibilité et la réutilisabilité) soient les mêmes que pour ROS 1, nous profitons de cette occasion pour apporter des modifications substantielles au système, notamment en modifiant certaines des API de base. Pour un traitement plus approfondi de ces changements et de leur justification, consultez les autres `articles de conception ROS 2 <https://design.ros2.org>`__.

source: Status
fr: Statut

source: On February 17, 2016, we are releasing ROS 2 alpha4, code-named **Duct tape**. Our primary goal with this release is to add more features, while also addressing the feedback we received for the previous releases. To that end, we built a set of `demos <../../Tutorials>` that show some of the key features of ROS 2. We encourage you to try out those demos, look at the code that implements them, and `provide feedback <../../Contact>`. We're especially interested to know how well (or poorly) we're addressing use cases that are important to you.
fr: Le 17 février 2016, nous lançons ROS 2 alpha4, dont le nom de code est **Duct tape**. Notre objectif principal avec cette version est d'ajouter plus de fonctionnalités, tout en répondant aux commentaires que nous avons reçus pour les versions précédentes. À cette fin, nous avons construit un ensemble de `demos <../../Tutorials>` qui montrent certaines des fonctionnalités clés de ROS 2. Nous vous encourageons à essayer ces démos, à regarder le code qui les implémente et `fournir des commentaires <../../Contact>`. Nous sommes particulièrement intéressés de savoir dans quelle mesure (ou mal) nous traitons les cas d'utilisation qui sont importants pour vous.

source: Intended audience
fr: Public visé

source: While everyone is welcome to try out the demos and look through the code, we're aiming this release at people who are already experienced with ROS 1 development. At this point, the ROS 2 documentation is pretty sparse and much of the system is explained by way of how it compares to ROS 1.
fr: Bien que tout le monde soit le bienvenu pour essayer les démos et parcourir le code, nous visons cette version aux personnes qui ont déjà de l'expérience avec le développement de ROS 1. À ce stade, la documentation de ROS 2 est assez clairsemée et une grande partie du système est expliquée par rapport à ROS 1.

source: Improved type support infrastructure, including support for C
fr: Amélioration de l'infrastructure de prise en charge des types, y compris la prise en charge de C

source: Preliminary Python client library, only publishers and subscriptions are supported. Beware, the API is subject to change and is far from complete!
fr: Bibliothèque client Python préliminaire, seuls les éditeurs et les abonnements sont pris en charge. Attention, l'API est susceptible d'évoluer et est loin d'être complète !

source: Added structures for ROS time in C API (still needs C++ API)
fr: Ajout de structures pour le temps ROS dans l'API C (nécessite toujours l'API C++)

source: New concept of extensible "time sources" for ROS Time, the default time source will be like ROS 1 (implementation pending)
fr: Nouveau concept de "sources de temps" extensibles pour ROS Time, la source de temps par défaut sera comme ROS 1 (implémentation en attente)

source: ROS 2 alpha3 release (code name *Cement*; December 2015)
fr: Version ROS 2 alpha3 (nom de code *Cement* ; décembre 2015)

source: On December 18, 2015, we are releasing ROS 2 alpha3, code-named **Cement**. Our primary goal with this release is to add more features, while also addressing the feedback we received for the previous releases. To that end, we built a set of `demos <../../Tutorials>` that show some of the key features of ROS 2. We encourage you to try out those demos, look at the code that implements them, and `provide feedback <../../Contact>`. We're especially interested to know how well (or poorly) we're addressing use cases that are important to you.
fr: Le 18 décembre 2015, nous lançons ROS 2 alpha3, dont le nom de code est **Cement**. Notre objectif principal avec cette version est d'ajouter plus de fonctionnalités, tout en répondant aux commentaires que nous avons reçus pour les versions précédentes. À cette fin, nous avons construit un ensemble de `demos <../../Tutorials>` qui montrent certaines des fonctionnalités clés de ROS 2. Nous vous encourageons à essayer ces démos, à regarder le code qui les implémente et `fournir des commentaires <../../Contact>`. Nous sommes particulièrement intéressés de savoir dans quelle mesure (ou mal) nous traitons les cas d'utilisation qui sont importants pour vous.

source: Updated ``rcl`` interface.
fr: Mise à jour de l'interface ``rcl``.

source: This interface will be wrapped in order to create language bindings, e.g. ``rclpy``.
fr: Cette interface sera encapsulée afin de créer des liaisons de langage, par ex. ``rclpy``.

source: This interface has improved documentation and test coverage over existing interfaces we currently have, e.g. ``rmw`` and ``rclcpp``.
fr: Cette interface a amélioré la documentation et la couverture des tests par rapport aux interfaces existantes que nous avons actuellement, par ex. ``rmw`` et ``rclcpp``.

source: See `rcl headers <https://github.com/ros2/rcl/tree/release-alpha3/rcl/include/rcl>`__.
fr: Voir `en-têtes rcl <https://github.com/ros2/rcl/tree/release-alpha3/rcl/include/rcl>`__.

source: Added support in rclcpp for using the TLSF (two-level segregate fit) allocator, a memory allocator design for embedded and real-time systems.
fr: Ajout de la prise en charge dans rclcpp de l'utilisation de l'allocateur TLSF (ajustement séparé à deux niveaux), une conception d'allocateur de mémoire pour les systèmes embarqués et en temps réel.

source: Improved efficiency of MultiThreadedExecutor and fixed numerous bugs with multi-threaded execution, which is now test on CI.
fr: Amélioration de l'efficacité de MultiThreadedExecutor et correction de nombreux bogues avec l'exécution multithread, qui est maintenant testée sur CI.

source: Added ability to cancel an Executor from within a callback called in spin.
fr: Ajout de la possibilité d'annuler un exécuteur à partir d'un rappel appelé en spin.

source: Added ability for a timer to cancel itself by supporting a Timer callback that accepts a reference to itself as a function parameter.
fr: Ajout de la possibilité pour une minuterie de s'annuler elle-même en prenant en charge un rappel de minuterie qui accepte une référence à elle-même en tant que paramètre de fonction.

source: Added checks for disallowing multiple threads to enter Executor::spin.
fr: Ajout de vérifications pour interdire à plusieurs threads d'entrer Executor::spin.

source: Improved reliability of numerous tests that had been sporadically failing.
fr: Amélioration de la fiabilité de nombreux tests qui échouaient sporadiquement.

source: Added support for using Fast RTPS (instead of, e.g., OpenSplice or Connext).
fr: Ajout de la prise en charge de l'utilisation de Fast RTPS (au lieu, par exemple, d'OpenSplice ou de Connext).

source: A partial port of tf2 including the core libraries and core command line tools.
fr: Un portage partiel de tf2 incluant les bibliothèques principales et les principaux outils de ligne de commande.

source: ROS 2 alpha2 release (code name *Baling wire*; October 2015)
fr: Version ROS 2 alpha2 (nom de code *Baling wire*; octobre 2015)

source: On November 3, 2015, we are releasing ROS 2 alpha2, code-named **Baling wire**. Our primary goal with this release is to add more features, while also addressing the feedback we received for the previous alpha 1 release. To that end, we built a set of `demos <../../Tutorials>` that show some of the key features of ROS 2. We encourage you to try out those demos, look at the code that implements them, and `provide feedback <../../Contact>`. We're especially interested to know how well (or poorly) we're addressing use cases that are important to you.
fr: Le 3 novembre 2015, nous lançons ROS 2 alpha2, dont le nom de code est **Baling wire**. Notre objectif principal avec cette version est d'ajouter plus de fonctionnalités, tout en répondant aux commentaires que nous avons reçus pour la version alpha 1 précédente. À cette fin, nous avons construit un ensemble de `demos <../../Tutorials>` qui montrent certaines des fonctionnalités clés de ROS 2. Nous vous encourageons à essayer ces démos, à regarder le code qui les implémente et `fournir des commentaires <../../Contact>`. Nous sommes particulièrement intéressés de savoir dans quelle mesure (ou mal) nous traitons les cas d'utilisation qui sont importants pour vous.

source: Support for custom allocators in rclcpp, useful for real-time messaging
fr: Prise en charge des répartiteurs personnalisés dans rclcpp, utile pour la messagerie en temps réel

source: Feature parity of Windows with Linux/OSX, including workspace management, services and parameters
fr: Parité des fonctionnalités de Windows avec Linux/OSX, y compris la gestion de l'espace de travail, les services et les paramètres

source: rclcpp API improvements
fr: Améliorations de l'API rclcpp

source: FreeRTPS improvements
fr: Améliorations FreeRTPS

source: ROS 2 alpha1 release (code name *Anchor*; August 2015)
fr: Version ROS 2 alpha1 (nom de code *Anchor* ; août 2015)

source: On August 31, 2015, we are releasing ROS 2 alpha1, code-named **Anchor**. Our primary goal with this release is to give you the opportunity to understand how ROS 2 works, in particular how it differs from ROS 1. To that end, we built a set of `demos <../../Tutorials>` that show some of the key features of ROS 2. We encourage you to try out those demos, look at the code that implements them, and `provide feedback <../../Contact>`. We're especially interested to know how well (or poorly) we're addressing use cases that are important to you.
fr: Le 31 août 2015, nous lançons ROS 2 alpha1, dont le nom de code est **Anchor**. Notre objectif principal avec cette version est de vous donner l'opportunité de comprendre comment ROS 2 fonctionne, en particulier en quoi il diffère de ROS 1. À cette fin, nous avons construit un ensemble de `demos <../../Tutorials>` qui montrent certaines des fonctionnalités clés de ROS 2. Nous vous encourageons à essayer ces démos, à examiner le code qui les implémente et à "fournir des commentaires <../../Contact>". Nous sommes particulièrement intéressés de savoir dans quelle mesure (ou mal) nous traitons les cas d'utilisation qui sont importants pour vous.

source: Discovery, transport, and serialization `use DDS <https://design.ros2.org/articles/ros_on_dds.html>`__
fr: Découverte, transport et sérialisation `utiliser DDS <https://design.ros2.org/articles/ros_on_dds.html>`__

source: Support `multiple DDS vendors <https://design.ros2.org/articles/ros_on_dds.html#vendors-and-licensing>`__
fr: Prise en charge de `plusieurs fournisseurs DDS <https://design.ros2.org/articles/ros_on_dds.html#vendors-and-licensing>`__

source: Support messaging primitives: topics (publish / subscribe), services (request / response), and parameters
fr: Prend en charge les primitives de messagerie : sujets (publier/s'abonner), services (demande/réponse) et paramètres

source: Support Linux (Ubuntu Trusty), OS X (Yosemite) and Windows (8)
fr: Prend en charge Linux (Ubuntu Trusty), OS X (Yosemite) et Windows (8)

source: `Use quality-of-service settings to handle lossy networks <../Tutorials/Demos/Quality-of-Service>`
fr: `Utiliser les paramètres de qualité de service pour gérer les réseaux avec perte <../Tutorials/Demos/Quality-of-Service>`

source: `Communicate inter-process or intra-process with the same API <../Tutorials/Demos/Intra-Process-Communication>`
fr: `Communiquer inter-processus ou intra-processus avec la même API <../Tutorials/Demos/Intra-Process-Communication>`

source: `Write real-time safe code that uses the ROS 2 APIs <../Tutorials/Demos/Real-Time-Programming>`
fr: `Écrire du code sécurisé en temps réel qui utilise les API ROS 2 <../Tutorials/Demos/Real-Time-Programming>`

source: `Run ROS 2 on "bare-metal" microcontrollers (no operating system) <https://github.com/ros2/freertps/wiki>`__
fr: `Exécutez ROS 2 sur des microcontrôleurs "bare-metal" (pas de système d'exploitation) <https://github.com/ros2/freertps/wiki>`__

source: `Bridge communication between ROS 1 and ROS 2 <https://github.com/ros2/ros1_bridge/blob/master/README.md>`__
fr: `Communication de pont entre ROS 1 et ROS 2 <https://github.com/ros2/ros1_bridge/blob/master/README.md>`__
