Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Releases/Beta2-Overview.po
Languages: fr

source: Beta 2 (``r2b2``)
fr: Bêta 2 (``r2b2``)

source: Table of Contents
fr: Table des matières

source: Supported Platforms
fr: Plates-formes prises en charge

source: We support ROS 2 Beta 2 on three platforms: Ubuntu 16.04 (Xenial), macOS 10.12 (Sierra), and Windows 10. We provide both binary packages and instructions for how to compile from source for all 3 platforms (see `install instructions <../../Installation>` as well as `documentation <https://docs.ros2.org/beta2/>`__).
fr: Nous prenons en charge ROS 2 Beta 2 sur trois plates-formes : Ubuntu 16.04 (Xenial), macOS 10.12 (Sierra) et Windows 10. Nous fournissons à la fois des packages binaires et des instructions sur la façon de compiler à partir de la source pour les 3 plates-formes (voir `instructions d'installation <. ./../Installation>` ainsi que la `documentation <https://docs.ros2.org/beta2/>`__).

source: Features
fr: Caractéristiques

source: Improvements since Beta 1 release
fr: Améliorations depuis la version bêta 1

source: DDS_Security support (aka SROS2, see `sros2 <https://github.com/ros2/sros2>`__)
fr: Prise en charge de DDS_Security (alias SROS2, voir `sros2 <https://github.com/ros2/sros2>`__)

source: Debian packages for Ubuntu Xenial
fr: Paquets Debian pour Ubuntu Xenial

source: Typesupport has been redesigned so that you only build a single executable and can choose one of the available RMW implementations by setting an environment variable (see `documentation <../../How-To-Guides/Working-with-multiple-RMW-implementations>`).
fr: Typesupport a été repensé afin que vous ne construisiez qu'un seul exécutable et que vous puissiez choisir l'une des implémentations RMW disponibles en définissant une variable d'environnement (voir `documentation <../../How-To-Guides/Working-with-multiple-RMW -implémentations>`).

source: Namespace support for nodes and topics (see `design article <https://design.ros2.org/articles/topic_and_service_names.html>`__, see known issues below).
fr: Prise en charge des espaces de noms pour les nœuds et les rubriques (voir `article de conception <https://design.ros2.org/articles/topic_and_service_names.html>`__, voir les problèmes connus ci-dessous).

source: A set of command-line tools using the extensible ``ros2`` command (see `conceptual article <../../Concepts/About-Command-Line-Tools>`).
fr: Un ensemble d'outils en ligne de commande utilisant la commande extensible ``ros2`` (voir `article conceptuel <../../Concepts/About-Command-Line-Tools>`).

source: A set of macros for logging messages in C / C++ (see API docs of `rcutils <https://docs.ros2.org/beta2/api/rcutils/index.html>`__).
fr: Un ensemble de macros pour la journalisation des messages en C/C++ (voir les docs API de `rcutils <https://docs.ros2.org/beta2/api/rcutils/index.html>`__).

source: New demo application
fr: Nouvelle application de démonstration

source: `Turtlebot 2 demos <https://github.com/ros2/turtlebot2_demo>`__ using the following repositories that have been (partially) converted to ROS 2 (Linux only):
fr: `Turtlebot 2 démos <https://github.com/ros2/turtlebot2_demo>`__ en utilisant les référentiels suivants qui ont été (partiellement) convertis en ROS 2 (Linux uniquement) :

source: `cartographer <https://github.com/ros2/cartographer.git>`__
fr: `cartographe <https://github.com/ros2/cartographer.git>`__

source: `Dummy_robot demo <../Tutorials/Demos/dummy-robot-demo>`:
fr: `Démo dummy_robot <../Tutorials/Demos/dummy-robot-demo>` :

source: Selected features from previous Alpha/Beta releases
fr: Fonctionnalités sélectionnées des versions alpha/bêta précédentes

source: For the complete list, see `earlier release notes <../index>`.
fr: Pour la liste complète, voir `notes de version antérieures <../index>`.

source: C++ and Python implementations of ROS 2 client libraries including APIs for:
fr: Implémentations C++ et Python des bibliothèques clientes ROS 2, y compris les API pour :

source: Publishing and subscribing to ROS topics
fr: Publication et abonnement aux rubriques ROS

source: Requesting and replying ROS services (synchronous (C++ only) and asynchronous)
fr: Demander et répondre aux services ROS (synchrone (C++ uniquement) et asynchrone)

source: Getting and setting ROS parameters (C++ only, synchronous and asynchronous)
fr: Obtenir et définir les paramètres ROS (C++ uniquement, synchrone et asynchrone)

source: Timer callbacks
fr: Rappels de minuterie

source: Support for interoperability between multiple DDS/RTPS implementations
fr: Prise en charge de l'interopérabilité entre plusieurs implémentations DDS/RTPS

source: eProsima Fast RTPS is our default implementation, and is included in the binary packages
fr: eProsima Fast RTPS est notre implémentation par défaut et est inclus dans les packages binaires

source: RTI Connext is supported: build from source to try it out
fr: RTI Connext est pris en charge : créez à partir de la source pour l'essayer

source: We initially supported PrismTech OpenSplice but support for it is currently on hold
fr: Nous avons initialement pris en charge PrismTech OpenSplice, mais sa prise en charge est actuellement suspendue

source: A graph API for network events
fr: Une API graphique pour les événements réseau

source: Distributed discovery
fr: Découverte distribuée

source: Realtime safe code paths for publish and subscribe with compatible DDS implementation (only Connext at the moment)
fr: Chemins de code sécurisés en temps réel pour la publication et l'abonnement avec une implémentation DDS compatible (uniquement Connext pour le moment)

source: Support for custom allocators
fr: Prise en charge des répartiteurs personnalisés

source: ROS 1 <-> ROS 2 dynamic bridge node
fr: Nœud de pont dynamique ROS 1 <-> ROS 2

source: Executor threading model (C++ only)
fr: Modèle de thread d'exécuteur (C++ uniquement)

source: Component model to compose nodes at compile / link / runtime
fr: Modèle de composant pour composer des nœuds à la compilation / au lien / à l'exécution

source: Managed component using a standard lifecycle
fr: Composant géré à l'aide d'un cycle de vie standard

source: Extended ``.msg`` format with new features:
fr: Format ``.msg`` étendu avec de nouvelles fonctionnalités :

source: Bounded arrays
fr: Tableaux bornés

source: Default values
fr: Les valeurs par défaut

source: Known issues
fr: Problèmes connus

source: We’re tracking issues in various repositories, but the main entry point is the `ros2/ros2 issue tracker <https://github.com/ros2/ros2/issues>`__
fr: Nous suivons les problèmes dans divers référentiels, mais le principal point d'entrée est le `ros2/ros2 issue tracker <https://github.com/ros2/ros2/issues>`__

source: We’d like to highlight a `known issue <https://github.com/ros2/rmw_connext/issues/234>`__ that we are looking into which doesn't allow two topics with the same base name but different namespaces to have a different type when using ``rmw_connext_cpp``.
fr: Nous aimerions souligner un `problème connu <https://github.com/ros2/rmw_connext/issues/234>`__ que nous examinons et qui n'autorise pas deux sujets avec le même nom de base mais des espaces de noms différents à avoir un type différent lors de l'utilisation de ``rmw_connext_cpp``.

source: Services with long responses are not working with Fast-RTPS. The fix, while not being part of beta2, is available upstream so you can work around this issue by building from source using Fast-RTPS master branch.
fr: Les services avec de longues réponses ne fonctionnent pas avec Fast-RTPS. Le correctif, bien qu'il ne fasse pas partie de la version bêta 2, est disponible en amont afin que vous puissiez contourner ce problème en créant à partir de la source à l'aide de la branche principale Fast-RTPS.
