Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Releases/Release-Humble-Hawksbill.po
Languages: fr

source: The ``SolidPrimitive`` message had a new ``PRISM`` type added, along with the appropriate metadata. See `ros2/common_interfaces#167 <https://github.com/ros2/common_interfaces/pull/167>`_ for more information.
fr: Le message ``SolidPrimitive`` avait un nouveau type ``PRISM`` ajouté, ainsi que les métadonnées appropriées. Voir `ros2/common_interfaces#167 <https://github.com/ros2/common_interfaces/pull/167>`_ pour plus d'informations.

source: ``struct`` type name suffix changed from ``_t`` to ``_s``
fr: Le suffixe du nom de type ``struct`` est passé de ``_t`` à ``_s``

source: To avoid type name duplication errors between ``struct`` type names and their ``typedef``-ed aliases when generating code documentation, the suffix for all ``struct`` type names has been changed from ``_t`` to ``_s``. Aliases with ``_t`` suffixes remain in place. Thus, this change is a breaking change only for code that uses full ``struct`` type specifiers i.e. ``struct type_name_t``.
fr: Pour éviter les erreurs de duplication de nom de type entre les noms de type ``struct`` et leurs alias ``typedef``-ed lors de la génération de la documentation du code, le suffixe pour tous les noms de type ``struct`` a été changé de ``_t`` à ``_s``. Les alias avec les suffixes ``_t`` restent en place. Ainsi, ce changement est un changement de rupture uniquement pour le code qui utilise des spécificateurs de type ``struct`` complets, c'est-à-dire ``struct type_name_t``.

source: See `ros2/rmw#313 <https://github.com/ros2/rmw/pull/313>`__ for more details.
fr: Voir `ros2/rmw#313 <https://github.com/ros2/rmw/pull/313>`__ pour plus de détails.

source: Use Connext 6 by default
fr: Utiliser Connext 6 par défaut

source: By default, Humble Hawksbill uses Connext 6.0.1 as the DDS implementation for ``rmw_connextdds``. It is still possible to use Connext 5.3.1 with ``rmw_connextdds``, but it must be rebuilt from source.
fr: Par défaut, Humble Hawksbill utilise Connext 6.0.1 comme implémentation DDS pour ``rmw_connextdds``. Il est toujours possible d'utiliser Connext 5.3.1 avec ``rmw_connextdds``, mais il doit être reconstruit à partir des sources.

source: See `ros2/rcl#932 <https://github.com/ros2/rcl/pull/932>`__ for more details.
fr: Voir `ros2/rcl#932 <https://github.com/ros2/rcl/pull/932>`__ pour plus de détails.

source: ROS_DISABLE_LOANED_MESSAGES environment variable added
fr: Variable d'environnement ROS_DISABLE_LOANED_MESSAGES ajoutée

source: This environment variable can be used to disable loaned messages support, independently if the rmw supports them or not. For more details, see the guide :doc:`Disabling Zero Copy Loaned Messages <../How-To-Guides/Disabling-ZeroCopy-loaned-messages>`.
fr: Cette variable d'environnement peut être utilisée pour désactiver le support des messages prêtés, indépendamment du fait que le rmw les supporte ou non. Pour plus de détails, consultez le guide :doc:`Disabling Zero Copy Loaned Messages <../How-To-Guides/Disabling-ZeroCopy-loaned-messages>`.

source: rclcpp
fr: RCLCP

source: Support Type Adaption for Publishers and Subscriptions
fr: Prise en charge de l'adaptation du type pour les éditeurs et les abonnements

source: After defining a type adapter, custom data structures can be used directly by publishers and subscribers, which helps to avoid additional work for the programmer and potential sources of errors. This is especially useful when working with complex data types, such as when converting OpenCV's ``cv::Mat`` to ROS's ``sensor_msgs/msg/Image`` type.
fr: Après avoir défini un adaptateur de type, les structures de données personnalisées peuvent être utilisées directement par les éditeurs et les abonnés, ce qui permet d'éviter un travail supplémentaire pour le programmeur et des sources potentielles d'erreurs. Ceci est particulièrement utile lorsque vous travaillez avec des types de données complexes, comme lors de la conversion du type ``cv::Mat`` d'OpenCV en type ``sensor_msgs/msg/Image`` de ROS.

source: Here is an example of a type adapter that converts ``std_msgs::msg::String`` to ``std::string``:
fr: Voici un exemple d'adaptateur de type qui convertit ``std_msgs::msg::String`` en ``std::string`` :

source: And an example of how the type adapter can be used:
fr: Et un exemple de la façon dont l'adaptateur de type peut être utilisé :

source: To learn more, see the `publisher <https://github.com/ros2/examples/blob/b83b18598b198b4a5ba44f9266c1bb39a393fa17/rclcpp/topics/minimal_publisher/member_function_with_type_adapter.cpp>`_ and `subscription <https://github.com/ros2/examples/blob/b83b18598b198b4a5ba44f9266c1bb39a393fa17/rclcpp/topics/minimal_subscriber/member_function_with_type_adapter.cpp>`_ examples, as well as a more complex `demo <https://github.com/ros2/demos/pull/482>`_. For more details, see `REP 2007 <https://ros.org/reps/rep-2007.html>`_.
fr: Pour en savoir plus, consultez `publisher <https://github.com/ros2/examples/blob/b83b18598b198b4a5ba44f9266c1bb39a393fa17/rclcpp/topics/minimal_publisher/member_function_with_type_adapter.cpp>`_ et `subscription <https://github.com/ros2 /examples/blob/b83b18598b198b4a5ba44f9266c1bb39a393fa17/rclcpp/topics/minimal_subscriber/member_function_with_type_adapter.cpp>`_ exemples, ainsi qu'une `démo plus complexe <https://github.com/ros2/demos/pull/482>`_. Pour plus de détails, voir `REP 2007 <https://ros.org/reps/rep-2007.html>`_.

source: ``Client::asnyc_send_request(request)`` returns a ``std::future`` instead of a ``std::shared_future``
fr: ``Client::asnyc_send_request(request)`` renvoie un ``std::future`` au lieu d'un ``std::shared_future``

source: This change was implemented in `rclcpp#1734 <https://github.com/ros2/rclcpp/pull/1734>`_. This breaks API, as ``std::future::get()`` methods extracts the value from the future. That means, if that method is called for a second time it will throw an exception. That doesn't happen with a ``std::shared_future``, as its ``get()`` method returns a ``const &``. Example:
fr: Ce changement a été implémenté dans `rclcpp#1734 <https://github.com/ros2/rclcpp/pull/1734>`_. Cela casse l'API, car les méthodes ``std::future::get()`` extraient la valeur du futur. Cela signifie que si cette méthode est appelée une deuxième fois, elle lèvera une exception. Cela n'arrive pas avec un ``std::shared_future``, car sa méthode ``get()`` renvoie un ``const &``. Exemple:

source: should be updated to:
fr: doit être mis à jour pour :

source: If a shared future is needed, the ``std::future::share()`` method can be used.
fr: Si un futur partagé est nécessaire, la méthode ``std::future::share()`` peut être utilisée.

source: ``wait_for_all_acked`` method added to ``Publisher``
fr: ``wait_for_all_acked`` méthode ajoutée à ``Publisher``

source: This new method will block until all messages in the publisher queue are acked by the matching subscriptions or the specified timeout expires. It is only useful for reliable publishers, as in the case of best effort QoS there's no acking. Examples:
fr: Cette nouvelle méthode bloquera jusqu'à ce que tous les messages de la file d'attente de l'éditeur soient confirmés par les abonnements correspondants ou que le délai spécifié expire. Il n'est utile que pour les éditeurs fiables, car dans le cas de la meilleure qualité de service, il n'y a pas d'acquittement. Exemples:

source: For a more complete example, see `here <https://github.com/ros2/examples/blob/humble/rclcpp/topics/minimal_publisher/member_function_with_wait_for_all_acked.cpp>`__.
fr: Pour un exemple plus complet, voir `ici <https://github.com/ros2/examples/blob/humble/rclcpp/topics/minimal_publisher/member_function_with_wait_for_all_acked.cpp>`__.

source: ``get_callback_groups`` method removed from ``NodeBase`` and ``Node`` classes
fr: Méthode ``get_callback_groups`` supprimée des classes ``NodeBase`` et ``Node``

source: ``for_each_callback_group()`` method has replaced ``get_callback_groups()`` by providing a thread-safe way to access ``callback_groups_`` vector. ``for_each_callback_group()`` accepts a function as an argument, iterates over the stored callback groups, and calls the passed function to ones that are valid.
fr: La méthode ``for_each_callback_group()`` a remplacé ``get_callback_groups()`` en fournissant un moyen thread-safe d'accéder au vecteur ``callback_groups_``. ``for_each_callback_group()`` accepte une fonction comme argument, parcourt les groupes de rappel stockés et appelle la fonction transmise à ceux qui sont valides.

source: For more details, please refer to this `pull request <https://github.com/ros2/rclcpp/pull/1723>`_.
fr: Pour plus de détails, veuillez vous référer à cette `demande d'extraction <https://github.com/ros2/rclcpp/pull/1723>`_.

source: ``add_to_wait_set`` method from ``Waitable`` class changes its return type from ``bool`` to ``void``
fr: La méthode ``add_to_wait_set`` de la classe ``Waitable`` change son type de retour de ``bool`` à ``void``

source: Before, classes derived from ``Waitable`` overriding ``add_to_wait_set`` were returning false when failing to add elements to the wait set, so the caller had to check this return value and throw or handle the error. This error handling should now be done directly on ``add_to_wait_set`` method, throwing if necessary. It is not required to return anything if no errors happened. Thus, this is a breaking change for downstream uses of ``Waitable``.
fr: Auparavant, les classes dérivées de ``Waitable`` remplaçant ``add_to_wait_set`` renvoyaient false lorsqu'elles échouaient à ajouter des éléments au jeu d'attente, de sorte que l'appelant devait vérifier cette valeur de retour et lancer ou gérer l'erreur. Cette gestion des erreurs doit maintenant être effectuée directement sur la méthode ``add_to_wait_set``, en lançant si nécessaire. Il n'est pas nécessaire de retourner quoi que ce soit si aucune erreur ne s'est produite. Il s'agit donc d'un changement radical pour les utilisations en aval de ``Waitable``.

source: See `ros2/rclcpp#1612 <https://github.com/ros2/rclcpp/pull/1612>`__ for more details.
fr: Voir `ros2/rclcpp#1612 <https://github.com/ros2/rclcpp/pull/1612>`__ pour plus de détails.

source: ``get_notify_guard_condition`` method return type from ``NodeBaseInterface`` class changed
fr: Le type de retour de la méthode ``get_notify_guard_condition`` de la classe ``NodeBaseInterface`` a été modifié

source: Now ``rclcpp`` uses the ``GuardCondition`` class wrapper around ``rcl_guard_condition_t``, so ``get_notify_guard_condition`` returns a reference to the node's ``rclcpp::GuardCondition``. Thus, this is a breaking change for downstream uses of ``NodeBaseInterface`` and ``NodeBase``.
fr: Maintenant, ``rclcpp`` utilise le wrapper de classe ``GuardCondition`` autour de ``rcl_guard_condition_t``, donc ``get_notify_guard_condition`` renvoie une référence au nœud ``rclcpp::GuardCondition``. Il s'agit donc d'un changement radical pour les utilisations en aval de ``NodeBaseInterface`` et ``NodeBase``.

source: ``sleep_until`` and ``sleep_for`` methods added to ``Clock``
fr: Les méthodes ``sleep_until`` et ``sleep_for`` ont été ajoutées à ``Clock``

source: Two new methods were added to allow sleeping on a particular clock in `ros2/rclcpp#1814 <https://github.com/ros2/rclcpp/pull/1814>`__ and `ros2/rclcpp#1828 <https://github.com/ros2/rclcpp/pull/1828>`__. ``Clock::sleep_until`` will suspend the current thread until the clock reaches a particular time. ``Clock::sleep_for`` will suspend the current thread until the clock advances a certain amount of time from when the method was called. Both methods will wake early if the ``Context`` is shutdown.
fr: Deux nouvelles méthodes ont été ajoutées pour permettre de dormir sur une horloge particulière dans `ros2/rclcpp#1814 <https://github.com/ros2/rclcpp/pull/1814>`__ et `ros2/rclcpp#1828 <https:// github.com/ros2/rclcpp/pull/1828>`__. ``Clock::sleep_until`` suspendra le thread en cours jusqu'à ce que l'horloge atteigne une heure particulière. ``Clock::sleep_for`` suspendra le thread en cours jusqu'à ce que l'horloge avance d'un certain temps depuis l'appel de la méthode. Les deux méthodes se réveilleront tôt si le ``Context`` est arrêté.

source: Active and deactivate transitions of publishers will be triggered automatically
fr: Les transitions actives et désactivées des éditeurs seront déclenchées automatiquement

source: Before, users needed to override ``LifecylceNode::on_activate()`` and ``LifecylceNode::on_deactivate()`` and call the similarly named methods on ``LifecyclePublisher`` to make the transition actually happen. Now, ``LifecylceNode`` provides a default interface of these methods that already do this. See the implementation of the ``lifecycle_talker`` node `here <https://github.com/ros2/demos/tree/humble/lifecycle>`__.
fr: Auparavant, les utilisateurs devaient remplacer ``LifecylceNode::on_activate()`` et ``LifecylceNode::on_deactivate()`` et appeler les méthodes portant le même nom sur ``LifecyclePublisher`` pour que la transition se produise réellement. Maintenant, ``LifecylceNode`` fournit une interface par défaut de ces méthodes qui le font déjà. Voir l'implémentation du nœud ``lifecycle_talker`` `ici <https://github.com/ros2/demos/tree/humble/lifecycle>`__.

source: Managed nodes
fr: Nœuds gérés

source: Lifecycle nodes support was added to rclpy. A complete demo can be found `here <https://github.com/ros2/demos/tree/humble/lifecycle_py>`__.
fr: La prise en charge des nœuds de cycle de vie a été ajoutée à rclpy. Une démo complète peut être trouvée `ici <https://github.com/ros2/demos/tree/humble/lifecycle_py>`__.

source: Similar to the feature added to rclcpp.
fr: Semblable à la fonctionnalité ajoutée à rclcpp.

source: Two new methods were added to allow sleeping on a particular clock in `ros2/rclpy#858 <https://github.com/ros2/rclpy/pull/858>`__ and `ros2/rclpy#864 <https://github.com/ros2/rclpy/pull/864>`__. ``sleep_until`` will suspend the current thread until the clock reaches a particular time. ``sleep_for`` will suspend the current thread until the clock advances a certain amount of time from when the method was called. Both methods will wake early if the ``Context`` is shutdown.
fr: Deux nouvelles méthodes ont été ajoutées pour permettre de dormir sur une horloge particulière dans `ros2/rclpy#858 <https://github.com/ros2/rclpy/pull/858>`__ et `ros2/rclpy#864 <https:// github.com/ros2/rclpy/pull/864>`__. ``sleep_until`` suspendra le thread en cours jusqu'à ce que l'horloge atteigne une heure particulière. ``sleep_for`` suspendra le thread en cours jusqu'à ce que l'horloge avance d'un certain temps à partir du moment où la méthode a été appelée. Les deux méthodes se réveilleront tôt si le ``Context`` est arrêté.

source: Since there is no official ROS 1 distribution on Ubuntu Jammy and forward, ``ros1_bridge`` is now compatible with the Ubuntu-packaged versions of ROS 1. More details about using ``ros1_bridge`` with Jammy packages are available in `the how-to guides <../How-To-Guides/Using-ros1_bridge-Jammy-upstream.rst>`__.
fr: Puisqu'il n'y a pas de distribution officielle de ROS 1 sur Ubuntu Jammy et versions ultérieures, ``ros1_bridge`` est désormais compatible avec les versions de ROS 1 sous Ubuntu. Plus de détails sur l'utilisation de ``ros1_bridge`` avec les packages Jammy sont disponibles dans `le comment -to guides <../How-To-Guides/Using-ros1_bridge-Jammy-upstream.rst>`__.

source: ``ros2`` commands disable output buffering by default
fr: Les commandes ``ros2`` désactivent la mise en mémoire tampon de sortie par défaut

source: Prior to this release, running a command like
fr: Avant cette version, l'exécution d'une commande telle que

source: would not print any data until the output buffer was full. Users could work around this by setting ``PYTHONUNBUFFERED=1``, but that was not very user friendly.
fr: n'imprimerait aucune donnée tant que le tampon de sortie n'était pas plein. Les utilisateurs pouvaient contourner ce problème en définissant ``PYTHONUNBUFFERED=1``, mais ce n'était pas très convivial.

source: Instead, all ``ros2`` commands now do line-buffering by default, so commands like the above work as soon as a newline is printed. To disable this behavior and use default python buffering rules, use the option ``--use-python-default-buffering``. See the `original issue <https://github.com/ros2/ros2cli/issues/595>`__ and the `pull request <https://github.com/ros2/ros2cli/pull/659>`__ for more information.
fr: Au lieu de cela, toutes les commandes ``ros2`` effectuent désormais la mise en mémoire tampon de ligne par défaut, de sorte que les commandes comme celles ci-dessus fonctionnent dès qu'une nouvelle ligne est imprimée. Pour désactiver ce comportement et utiliser les règles de mise en mémoire tampon python par défaut, utilisez l'option ``--use-python-default-buffering``. Voir le `problème d'origine <https://github.com/ros2/ros2cli/issues/595>`__ et la `demande d'extraction <https://github.com/ros2/ros2cli/pull/659>`__ pour plus information.

source: ``ros2 topic pub`` will wait for one matching subscription when using ``--times/--once/-1``
fr: ``ros2 topic pub`` attendra un abonnement correspondant lors de l'utilisation de ``--times/--once/-1``

source: When using ``--times/--once/-1`` flags, ``ros2 topic pub`` will wait for one matching subscription to be found before starting to publish. This avoids the issue of the ros2cli node starting to publish before discovering a matching subscription, which results in some of the first messages being lost. This is particularly unexpected when using a reliable qos profile.
fr: Lors de l'utilisation des drapeaux ``--times/--once/-1``, ``ros2 topic pub`` attendra qu'un abonnement correspondant soit trouvé avant de commencer à publier. Cela évite le problème du nœud ros2cli commençant à publier avant de découvrir un abonnement correspondant, ce qui entraîne la perte de certains des premiers messages. Ceci est particulièrement inattendu lors de l'utilisation d'un profil qos fiable.

source: The number of matching subscriptions to wait before starting publishing can be configured with the ``-w/--wait-matching-subscriptions`` flags, e.g.:
fr: Le nombre d'abonnements correspondants à attendre avant de commencer la publication peut être configuré avec les drapeaux ``-w/--wait-matching-subscriptions``, par exemple :

source: to wait for three matching subscriptions before starting to publish.
fr: attendre trois abonnements correspondants avant de commencer à publier.

source: ``-w`` can also be used independently of ``--times/--once/-1`` but it only defaults to one when combined with them, otherwise the ``-w`` default is zero.
fr: ``-w`` peut également être utilisé indépendamment de ``--times/--once/-1`` mais il n'est par défaut à un que lorsqu'il est combiné avec eux, sinon le ``-w`` par défaut est zéro.

source: See https://github.com/ros2/ros2cli/pull/642 for more details.
fr: Voir https://github.com/ros2/ros2cli/pull/642 pour plus de détails.

source: ``ros2 param dump`` default output changed
fr: ``ros2 param dump`` sortie par défaut modifiée

source: ``--print`` option for dump command was `deprecated <https://github.com/ros2/ros2cli/pull/638>`_.
fr: L'option ``--print`` pour la commande dump était `obsolète <https://github.com/ros2/ros2cli/pull/638>`_.

source: It prints to stdout by default:
fr: Il imprime sur stdout par défaut :

source: ``--output-dir`` option for dump command was `deprecated <https://github.com/ros2/ros2cli/pull/638>`_.
fr: L'option ``--output-dir`` pour la commande dump était `obsolète <https://github.com/ros2/ros2cli/pull/638>`_.

source: To dump parameters to a file, run:
fr: Pour vider les paramètres dans un fichier, exécutez :

source: ``ros2 param set`` now accepts more YAML syntax
fr: ``ros2 param set`` accepte désormais plus de syntaxe YAML

source: Previously, attempting to set a string like "off" to a parameter that was of string type did not work. That's because ``ros2 param set`` interprets the command-line arguments as YAML, and YAML considers "off" to be a boolean type. As of https://github.com/ros2/ros2cli/pull/684 , ``ros2 param set`` now accepts the YAML escape sequence of "!!str off" to ensure that the value is considered a string.
fr: Auparavant, tenter de définir une chaîne comme "off" sur un paramètre de type chaîne ne fonctionnait pas. C'est parce que ``ros2 param set`` interprète les arguments de la ligne de commande comme YAML, et YAML considère "off" comme un type booléen. Depuis https://github.com/ros2/ros2cli/pull/684 , ``ros2 param set`` accepte désormais la séquence d'échappement YAML de "!!str off" pour garantir que la valeur est considérée comme une chaîne.

source: ``ros2 pkg create`` can automatically generate a LICENSE file
fr: ``ros2 pkg create`` peut générer automatiquement un fichier LICENSE

source: If the ``--license`` flag is passed to ``ros2 pkg create``, and the license is one of the known licenses, ``ros2 pkg create`` will now automatically generate a LICENSE file in the root of the package. For a list of known licenses, run ``ros2 pkg create --license ? <package_name>``. See the associated `pull request <https://github.com/ros2/ros2cli/pull/650>`__ for more information.
fr: Si le drapeau ``--license`` est passé à ``ros2 pkg create``, et que la licence est l'une des licences connues, ``ros2 pkg create`` va maintenant générer automatiquement un fichier LICENSE à la racine du emballer. Pour obtenir une liste des licences connues, exécutez ``ros2 pkg create --license ? <nom_paquet>``. Voir la `demande d'extraction associée <https://github.com/ros2/ros2cli/pull/650>`__ pour plus d'informations.

source: Added ``frame_prefix`` parameter
fr: Ajout du paramètre ``frame_prefix``

source: A new parameter ``frame_prefix`` was added in `ros/robot_state_publisher#159 <https://github.com/ros/robot_state_publisher/pull/159>`__. This parameter is a string which is prepended to all frame names published by ``robot_state_publisher``. Similar to ``tf_prefix`` in the original ``tf`` library in ROS 1, this parameter can be used to publish the same robot description multiple times with different frame names.
fr: Un nouveau paramètre ``frame_prefix`` a été ajouté dans `ros/robot_state_publisher#159 <https://github.com/ros/robot_state_publisher/pull/159>`__. Ce paramètre est une chaîne qui est ajoutée à tous les noms de cadres publiés par ``robot_state_publisher``. Semblable à ``tf_prefix`` dans la bibliothèque originale ``tf`` de ROS 1, ce paramètre peut être utilisé pour publier plusieurs fois la même description de robot avec des noms de cadre différents.

source: Removal of deprecated ``use_tf_static`` parameter
fr: Suppression du paramètre obsolète ``use_tf_static``
