Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Releases/Release-Eloquent-Elusor.po
Languages: fr

source: Eloquent Elusor (``eloquent``)
fr: Eloquent Elusor (``éloquent'')

source: Table of Contents
fr: Table des matières

source: *Eloquent Elusor* is the fifth release of ROS 2.
fr: *Eloquent Elusor* est la cinquième version de ROS 2.

source: Supported Platforms
fr: Plates-formes prises en charge

source: Eloquent Elusor is primarily supported on the following platforms:
fr: Eloquent Elusor est principalement pris en charge sur les plates-formes suivantes :

source: Tier 1 platforms:
fr: Plateformes de niveau 1 :

source: Ubuntu 18.04 (Bionic): ``amd64`` and ``arm64``
fr: Ubuntu 18.04 (Bionic) : ``amd64`` et ``arm64``

source: Tier 2 platforms:
fr: Plateformes de niveau 2 :

source: Tier 3 platforms:
fr: Plateformes de niveau 3 :

source: Debian Stretch (9): ``amd64``, ``arm64`` and ``arm32``
fr: Debian Stretch (9) : ``amd64``, ``arm64`` et ``arm32``

source: OpenEmbedded Thud (2.6) / webOS OSE: ``arm32`` and ``x86``
fr: OpenEmbedded Thud (2.6) / webOS OSE : ``arm32`` et ``x86``

source: For more information about RMW implementations, compiler / interpreter versions, and system dependency versions see `REP 2000 <https://www.ros.org/reps/rep-2000.html>`__.
fr: Pour plus d'informations sur les implémentations RMW, les versions du compilateur/interpréteur et les versions des dépendances système, consultez `REP 2000 <https://www.ros.org/reps/rep-2000.html>`__.

source: `Install Eloquent Elusor <../../eloquent/Installation.html>`__
fr: `Installer Eloquent Elusor <../../eloquent/Installation.html>`__

source: New features in this ROS 2 release
fr: Nouvelles fonctionnalités de cette version de ROS 2

source: A few features and improvements we would like to highlight:
fr: Quelques fonctionnalités et améliorations que nous aimerions souligner :

source: `Support for markup-based launch files (XML/YAML) <https://github.com/ros2/launch/pull/226>`__
fr: `Prise en charge des fichiers de lancement basés sur le balisage (XML/YAML) <https://github.com/ros2/launch/pull/226>`__

source: `Improved launch-based testing <https://github.com/ros2/ros2/issues/739#issuecomment-555743540>`__
fr: `Tests basés sur le lancement améliorés <https://github.com/ros2/ros2/issues/739#issuecomment-555743540>`__

source: `Passing key-value parameters on CLI <https://github.com/ros2/design/pull/245>`__
fr: `Passage de paramètres clé-valeur sur CLI <https://github.com/ros2/design/pull/245>`__

source: `Support stream logging macros <https://github.com/ros2/rclcpp/pull/926>`__
fr: `Prise en charge des macros de journalisation de flux <https://github.com/ros2/rclcpp/pull/926>`__

source: `Per-node logging <https://github.com/ros2/ros2/issues/789>`__ - All stdout/stderr output from nodes are logged in ~/.ros
fr: `Journalisation par nœud <https://github.com/ros2/ros2/issues/789>`__ - Toutes les sorties stdout/stderr des nœuds sont consignées dans ~/.ros

source: `Improved performance of sourcing setup files <https://github.com/ros2/ros2/issues/764>`__
fr: `Amélioration des performances des fichiers de configuration de sourcing <https://github.com/ros2/ros2/issues/764>`__

source: rviz: `interactive markers <https://github.com/ros2/rviz/pull/457>`__, `torque ring <https://github.com/ros2/rviz/pull/396>`__, `tf message filters <https://github.com/ros2/rviz/pull/375>`__
fr: rviz : `marqueurs interactifs <https://github.com/ros2/rviz/pull/457>`__, `torque ring <https://github.com/ros2/rviz/pull/396>`__, `tf filtres de messages <https://github.com/ros2/rviz/pull/375>`__

source: rqt: `parameter plugin <https://github.com/ros-visualization/rqt_reconfigure/pull/31>`__, `tf tree plugin <https://github.com/ros-visualization/rqt_tf_tree/pull/13>`__, `robot steering plugin <https://github.com/ros-visualization/rqt_robot_steering/pull/7>`__ (also backported to Dashing)
fr: rqt : `plugin de paramètres <https://github.com/ros-visualization/rqt_reconfigure/pull/31>`__, `tf tree plugin <https://github.com/ros-visualization/rqt_tf_tree/pull/13> `__, `plugin de direction de robot <https://github.com/ros-visualization/rqt_robot_steering/pull/7>`__ (également rétroporté vers Dashing)

source: `turtlesim <https://github.com/ros/ros_tutorials/pull/53>`__ (also backported to Dashing)
fr: `turtlesim <https://github.com/ros/ros_tutorials/pull/53>`__ (également rétroporté vers Dashing)

source: RMW implementations:
fr: Implémentations RMW :

source: `API to loan message for zero copy <https://github.com/ros2/design/pull/256>`__, used by `rmw_iceoryx <https://github.com/ros2/rmw_iceoryx>`__
fr: `API pour prêter un message pour zéro copie <https://github.com/ros2/design/pull/256>`__, utilisé par `rmw_iceoryx <https://github.com/ros2/rmw_iceoryx>`__

source: `Fast RTPS 1.9.3 <https://github.com/ros2/ros2/issues/734#issuecomment-518018479>`__
fr: `RTPS rapide 1.9.3 <https://github.com/ros2/ros2/issues/734#issuecomment-518018479>`__

source: New Tier-2 implementation: `rmw_cyclonedds <https://github.com/ros2/rmw_cyclonedds>`__ (also backported to Dashing)
fr: Nouvelle implémentation de niveau 2 : `rmw_cyclonedds <https://github.com/ros2/rmw_cyclonedds>`__ (également rétroporté vers Dashing)

source: Environment variable `ROS_LOCALHOST_ONLY <https://github.com/ros2/ros2/issues/798>`__ to limit communication to localhost
fr: Variable d'environnement `ROS_LOCALHOST_ONLY <https://github.com/ros2/ros2/issues/798>`__ pour limiter la communication à localhost

source: MacOS Mojave Support
fr: Prise en charge de MacOS Mojave

source: `Tracing instrumentation <https://github.com/ros2/ros2/pull/748>`__ for rcl and rclcpp
fr: `Tracing instrumentation <https://github.com/ros2/ros2/pull/748>`__ pour rcl et rclcpp

source: During the development the `Eloquent meta ticket <https://github.com/ros2/ros2/issues/734>`__ on GitHub contains an up-to-date state of the ongoing high level tasks as well as references specific tickets with more details.
fr: Au cours du développement, le `meta ticket Eloquent <https://github.com/ros2/ros2/issues/734>`__ sur GitHub contient un état à jour des tâches de haut niveau en cours ainsi que des références de tickets spécifiques avec plus de détails.

source: Changes since the Dashing release
fr: Changements depuis la sortie de Dashing

source: The ``geometry_msgs/msg/Quaternion.msg`` interface now default initializes to a valid quaternion, with the following values:
fr: L'interface ``geometry_msgs/msg/Quaternion.msg`` s'initialise désormais par défaut sur un quaternion valide, avec les valeurs suivantes :

source: Here is the pull request for more detail: `https://github.com/ros2/common_interfaces/pull/74 <https://github.com/ros2/common_interfaces/pull/74>`_
fr: Voici la demande d'extraction pour plus de détails : `https://github.com/ros2/common_interfaces/pull/74 <https://github.com/ros2/common_interfaces/pull/74>`_

source: Static transform broadcasters and listeners now use QoS durability ``transient_local`` on the ``/tf_static`` topic. Similar to the latched setting in ROS 1, static transforms only need to be published once. New listeners will receive transforms from all static broadcasters that are alive and have published before. All publishers must be updated to use this durability setting or their messages won't be received by transform listeners. See this pull request for more detail: `https://github.com/ros2/geometry2/pull/160 <https://github.com/ros2/geometry2/pull/160>`_
fr: Les diffuseurs et les écouteurs de transformation statique utilisent désormais la durabilité QoS ``transient_local`` sur le sujet ``/tf_static``. Semblable au paramètre verrouillé dans ROS 1, les transformations statiques ne doivent être publiées qu'une seule fois. Les nouveaux auditeurs recevront des transformations de tous les diffuseurs statiques qui sont actifs et ont publié auparavant. Tous les éditeurs doivent être mis à jour pour utiliser ce paramètre de durabilité, sinon leurs messages ne seront pas reçus par les écouteurs de transformation. Voir cette pull request pour plus de détails : `https://github.com/ros2/geometry2/pull/160 <https://github.com/ros2/geometry2/pull/160>`_

source: rclcpp
fr: RCLCP

source: API Break with ``get_actual_qos()``
fr: Rupture d'API avec ``get_actual_qos()``

source: Introduced in Dashing, the ``get_actual_qos()`` method on the ``PublisherBase`` and ``SubscriptionBase`` previously returned an rmw type, ``rmw_qos_profile_t``, but that made it awkward to reuse with the creation of other entities. Therefore it was updated to return a ``rclcpp::QoS`` instead.
fr: Introduite dans Dashing, la méthode ``get_actual_qos()`` sur ``PublisherBase`` et ``SubscriptionBase`` renvoyait auparavant un type rmw, ``rmw_qos_profile_t``, mais cela rendait difficile la réutilisation avec la création d'autres entités. Par conséquent, il a été mis à jour pour renvoyer un ``rclcpp::QoS`` à la place.

source: Existing code will need to use the ``rclcpp::QoS::get_rmw_qos_profile()`` method if the rmw profile is still required. For example:
fr: Le code existant devra utiliser la méthode ``rclcpp::QoS::get_rmw_qos_profile()`` si le profil rmw est toujours requis. Par exemple:

source: The rationale for breaking this directly rather than doing a tick-tock is that it is a new function and is expected to be used infrequently by users. Also, since only the return type is changing, adding a new function with a different would be to only way to do a deprecation cycle and ``get_actual_qos()`` is the most appropriate name, so we would be forced to pick a less obvious name for the method.
fr: La raison pour casser cela directement plutôt que de faire un tic-tac est qu'il s'agit d'une nouvelle fonction et que les utilisateurs s'attendent à ce qu'elle soit rarement utilisée. De plus, puisque seul le type de retour change, l'ajout d'une nouvelle fonction avec un autre serait le seul moyen de faire un cycle de dépréciation et ``get_actual_qos()`` est le nom le plus approprié, nous serions donc obligés de choisir un moins nom évident pour la méthode.

source: API Break with Publisher and Subscription Classes
fr: Rupture d'API avec les classes d'éditeur et d'abonnement

source: In an effort to streamline the construction of Publishers and Subscriptions, the API of the constructors were changed.
fr: Dans un effort pour rationaliser la construction des éditeurs et des abonnements, l'API des constructeurs a été modifiée.

source: It would be impossible to support a deprecation cycle, because the old signature takes an rcl type and the new one takes the ``NodeBaseInterface`` type so that it can get additional information it now needs, and there's no way to get the additional information needed from just the rcl type. The new signature could possibly be backported if that would help contributors, but since the publishers and subscriptions are almost always created using the factory functions or some other higher level API, we do not expect this to be a problem for most users.
fr: Il serait impossible de prendre en charge un cycle de dépréciation, car l'ancienne signature prend un type rcl et la nouvelle prend le type ``NodeBaseInterface`` afin qu'elle puisse obtenir les informations supplémentaires dont elle a maintenant besoin, et il n'y a aucun moyen d'obtenir les informations supplémentaires nécessaire à partir du type rcl uniquement. La nouvelle signature pourrait éventuellement être rétroportée si cela aidait les contributeurs, mais comme les éditeurs et les abonnements sont presque toujours créés à l'aide des fonctions d'usine ou d'une autre API de niveau supérieur, nous ne nous attendons pas à ce que cela pose un problème pour la plupart des utilisateurs.

source: Please see the original pr for more detail and comment there if this causes issues:
fr: Veuillez consulter le pr original pour plus de détails et commenter si cela pose des problèmes :

source: Compiler warning about unused result of ``add_on_set_parameters_callback``
fr: Avertissement du compilateur concernant le résultat inutilisé de ``add_on_set_parameters_callback``

source: *Since Eloquent Patch Release 2 (2020-12-04)*
fr: *Depuis la version 2 du patch Eloquent (2020-12-04)*

source: Users should retain the handle returned by ``rclcpp::Node::add_on_set_parameters_callback``, otherwise their callback may be unregistered. A warning has been added to help identify bugs where the returned handle is not used.
fr: Les utilisateurs doivent conserver le descripteur renvoyé par ``rclcpp::Node::add_on_set_parameters_callback``, sinon leur rappel peut être désenregistré. Un avertissement a été ajouté pour aider à identifier les bogues où la poignée retournée n'est pas utilisée.

source: API Break Due to Addition of Publisher and Subscription Options
fr: Rupture de l'API en raison de l'ajout d'options d'éditeur et d'abonnement

source: The ``rmw_create_publisher()`` method had a new argument added of type ``const rmw_publisher_options_t *``. This new structure holds options (beyond the typesupport, topic name, and QoS) for new publishers.
fr: La méthode ``rmw_create_publisher()`` a un nouvel argument ajouté de type ``const rmw_publisher_options_t *``. Cette nouvelle structure contient des options (au-delà de la prise en charge du type, du nom du sujet et de la qualité de service) pour les nouveaux éditeurs.

source: The ``rmw_create_subscription()`` method had one argument removed, ``bool ignore_local_publications``, and replaced by the new options of type ``const rmw_subscription_options_t *``. The ``ignore_local_publications`` option was moved into the new ``rmw_subscription_options_t`` type.
fr: La méthode ``rmw_create_subscription()`` avait un argument supprimé, ``bool ignore_local_publications``, et remplacé par les nouvelles options de type ``const rmw_subscription_options_t *``. L'option ``ignore_local_publications`` a été déplacée dans le nouveau type ``rmw_subscription_options_t``.

source: In both cases the new argument, which are pointers, may never be null, and so the rmw implementations should check to make sure the options are not null. Additionally, the options should be copied into the corresponding rmw structure.
fr: Dans les deux cas, les nouveaux arguments, qui sont des pointeurs, ne peuvent jamais être nuls, et les implémentations de rmw doivent donc vérifier que les options ne sont pas nulles. De plus, les options doivent être copiées dans la structure rmw correspondante.

source: See this pull request, and the associated pull requests for more details:
fr: Consultez cette demande d'extraction et les demandes d'extraction associées pour plus de détails :

source: ros2cli
fr: Votre gagne-pain

source: ros2msg and ros2srv deprecated
fr: ros2msg et ros2srv obsolètes

source: The CLI tools ``ros2msg`` and ``ros2srv`` are deprecated. They have been replaced by the tool ``ros2interface``, which also supports action and IDL interfaces. You can run ``ros2 interface --help`` for usage.
fr: Les outils CLI ``ros2msg`` et ``ros2srv`` sont obsolètes. Ils ont été remplacés par l'outil ``ros2interface``, qui prend également en charge les interfaces d'action et IDL. Vous pouvez exécuter ``ros2 interface --help`` pour l'utilisation.

source: ros2node
fr: Parce que c'est s2

source: Service clients have been added to ros2node info. As part of that change the Python function ``ros2node.api.get_service_info`` has been renamed to ``ros2node.api.get_service_server_info``.
fr: Les clients de service ont été ajoutés aux informations de ros2node. Dans le cadre de ce changement, la fonction Python ``ros2node.api.get_service_info`` a été renommée ``ros2node.api.get_service_server_info``.

source: rviz
fr: voir

source: Renamed '2D Nav Goal' tool
fr: Outil renommé "Objectif de navigation 2D"

source: The tool was renamed to '2D Goal Pose' and the default topic was changed from ``/move_base_simple/goal`` to ``/goal_pose``.
fr: L'outil a été renommé '2D Goal Pose' et le sujet par défaut a été changé de ``/move_base_simple/goal`` à ``/goal_pose``.

source: Here is the related pull request:
fr: Voici la pull request associée :

source: TF2 Buffer
fr: Tampon TF2

source: TF2 buffers now have to be given a timer interface.
fr: Les tampons TF2 doivent maintenant être dotés d'une interface de temporisation.

source: If a timer interface is not given, an exception will be thrown.
fr: Si une interface de minuterie n'est pas donnée, une exception sera levée.

source: For example:
fr: Par exemple:

source: ROS command line argument changes
fr: Modifications des arguments de la ligne de commande ROS

source: To cope with an increasingly complex interface, with a now extended set of configuration options, ROS CLI syntax has been changed. As an example, a command line using Dashing syntax like:
fr: Pour faire face à une interface de plus en plus complexe, avec un ensemble désormais étendu d'options de configuration, la syntaxe ROS CLI a été modifiée. Par exemple, une ligne de commande utilisant la syntaxe Dashing comme :

source: is written using Eloquent (and onwards) syntax as:
fr: est écrit en utilisant la syntaxe Eloquent (et au-delà) comme suit :

source: This explicit syntax affords new features, like single parameter assignment ``--param name:=value``. For further reference and rationale, check the `ROS command line arguments design document <https://design.ros2.org/articles/ros_command_line_arguments.html>`__.
fr: Cette syntaxe explicite offre de nouvelles fonctionnalités, comme l'affectation d'un seul paramètre ``--param name:=value``. Pour plus de référence et de justification, consultez le `document de conception des arguments de ligne de commande ROS <https://design.ros2.org/articles/ros_command_line_arguments.html>`__.

source: Former syntax has been deprecated and is due for removal in the next release.
fr: L'ancienne syntaxe est obsolète et doit être supprimée dans la prochaine version.

source: Known Issues
fr: Problèmes connus

source: `[ros2/rosidl#402] <https://github.com/ros2/rosidl/issues/402>`_ ``find_package(PCL)`` interferes with ROS interface generation. Workaround: invoke ``find_package(PCL)`` *after* ``rosidl_generate_interfaces()``.
fr: `[ros2/rosidl#402] <https://github.com/ros2/rosidl/issues/402>`_ ``find_package(PCL)`` interfère avec la génération de l'interface ROS. Solution : appelez ``find_package(PCL)`` *après* ``rosidl_generate_interfaces()``.

source: `[ros2/rclcpp#893] <https://github.com/ros2/rclcpp/issues/893>`_ ``rclcpp::Context`` is not destroyed because of a reference cycle with ``rclcpp::GraphListener``. This causes a memory leak. A fix has not been backported because of the risk of breaking ABI.
fr: `[ros2/rclcpp#893] <https://github.com/ros2/rclcpp/issues/893>`_ ``rclcpp::Context`` n'est pas détruit à cause d'un cycle de référence avec ``rclcpp::GraphListener ``. Cela provoque une fuite de mémoire. Un correctif n'a pas été rétroporté en raison du risque de casser l'ABI.

source: Timeline before the release
fr: Chronologie avant la sortie

source: A few milestones leading up to the release:
fr: Quelques étapes menant à la sortie :

source: First releases of core packages available. Testing can happen from now on (some features might not have landed yet).
fr: Premières versions des packages de base disponibles. Les tests peuvent avoir lieu à partir de maintenant (certaines fonctionnalités n'ont peut-être pas encore été ajoutées).

source: Fri. Oct 18th
fr: Ven. 18 octobre

source: API and feature freeze for core packages Only bug fix releases should be made after this point. New packages can be released independently.
fr: Gel de l'API et des fonctionnalités pour les packages principaux Seules les versions de correctifs de bogues doivent être effectuées après ce point. De nouveaux packages peuvent être publiés indépendamment.

source: Thu. Oct 24th (beta)
fr: Jeu. 24 octobre (bêta)

source: Updated releases of core packages available. Additional testing of the latest features.
fr: Versions mises à jour des packages de base disponibles. Tests supplémentaires des dernières fonctionnalités.

source: Wed. Nov 13th (release candidate)
fr: Épouser. 13 novembre (version candidate)

source: Updated releases of core packages available.
fr: Versions mises à jour des packages de base disponibles.

source: Freeze rosdistro. No PRs for Eloquent on the `rosdistro` repo will be merged (reopens after the release announcement).
fr: Geler rosdistro. Aucun PR pour Eloquent sur le repo `rosdistro` ne sera fusionné (réouverture après l'annonce de la sortie).
