Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Releases/Release-Dashing-Diademata.po
Languages: fr

source: Dashing Diademata (``dashing``)
fr: Dashing Diademata (``fringant``)

source: Table of Contents
fr: Table des matières

source: *Dashing Diademata* is the fourth release of ROS 2.
fr: *Dashing Diademata* est la quatrième version de ROS 2.

source: Supported Platforms
fr: Plates-formes prises en charge

source: Dashing Diademata is primarily supported on the following platforms:
fr: Dashing Diademata est principalement pris en charge sur les plates-formes suivantes :

source: Tier 1 platforms:
fr: Plateformes de niveau 1 :

source: Ubuntu 18.04 (Bionic): ``amd64`` and ``arm64``
fr: Ubuntu 18.04 (Bionic) : ``amd64`` et ``arm64``

source: Tier 2 platforms:
fr: Plateformes de niveau 2 :

source: Tier 3 platforms:
fr: Plateformes de niveau 3 :

source: Debian Stretch (9): ``amd64``, ``arm64`` and ``arm32``
fr: Debian Stretch (9) : ``amd64``, ``arm64`` et ``arm32``

source: OpenEmbedded Thud (2.6) / webOS OSE: ``arm32`` and ``x86``
fr: OpenEmbedded Thud (2.6) / webOS OSE : ``arm32`` et ``x86``

source: For more information about RMW implementations, compiler / interpreter versions, and system dependency versions see `REP 2000 <https://www.ros.org/reps/rep-2000.html#dashing-diademata-may-2019-may-2021>`__.
fr: Pour plus d'informations sur les implémentations RMW, les versions du compilateur/interpréteur et les versions de dépendance du système, consultez `REP 2000 <https://www.ros.org/reps/rep-2000.html#dashing-diademata-may-2019-may-2021 >`__.

source: `Install Dashing Diademata <../../dashing/Installation.html>`__
fr: `Installer Dashing Diademata <../../dashing/Installation.html>`__

source: New features in this ROS 2 release
fr: Nouvelles fonctionnalités de cette version de ROS 2

source: A few features and improvements we would like to highlight:
fr: Quelques fonctionnalités et améliorations que nous aimerions souligner :

source: :doc:`Components <../Tutorials/Intermediate/Composition>` are now the recommended way to write your node. They can be used standalone as well as being composed within a process and both ways are fully support from ``launch`` files.
fr: :doc:`Components <../Tutorials/Intermediate/Composition>` sont maintenant la méthode recommandée pour écrire votre nœud. Ils peuvent être utilisés de manière autonome ou composés au sein d'un processus et les deux méthodes sont entièrement prises en charge à partir des fichiers de lancement.

source: The :doc:`intra-process communication <../Tutorials/Demos/Intra-Process-Communication>` (C++ only) has been improved - both in terms of latency as well as minimizing copies.
fr: La :doc:`communication intra-processus <../Tutorials/Demos/Intra-Process-Communication>` (C++ uniquement) a été améliorée - à la fois en termes de latence et de réduction des copies.

source: The Python client library has been updated to match most of the C++ equivalent and some important bug fixes and improvements have landed related to memory usage and performance.
fr: La bibliothèque cliente Python a été mise à jour pour correspondre à la plupart des équivalents C++ et certaines corrections de bogues et améliorations importantes ont été apportées concernant l'utilisation de la mémoire et les performances.

source: Parameters are now a complete alternative to ``dynamic_reconfigure`` from ROS 1 including constraints like ranges or being read-only.
fr: Les paramètres sont désormais une alternative complète à ``dynamic_reconfigure`` de ROS 1, y compris des contraintes telles que des plages ou étant en lecture seule.

source: By relying on (a subset of) `IDL 4.2 <https://www.omg.org/spec/IDL/4.2>`__ for the message generation pipeline it is now possible to use ``.idl`` files (beside ``.msg`` / ``.srv`` / ``.action`` files). This change comes with support for optional UTF-8 encoding for ordinary strings as well as UTF-16 encoded multi-byte strings (see `wide strings design article <https://design.ros2.org/articles/wide_strings.html>`__).
fr: En s'appuyant sur (un sous-ensemble de) `IDL 4.2 <https://www.omg.org/spec/IDL/4.2>`__ pour le pipeline de génération de messages, il est désormais possible d'utiliser des fichiers ``.idl`` (à côté ``.msg`` / ``.srv`` / ``.action`` fichiers). Cette modification s'accompagne de la prise en charge de l'encodage UTF-8 facultatif pour les chaînes ordinaires ainsi que des chaînes multi-octets encodées en UTF-16 (voir `wide strings design article <https://design.ros2.org/articles/wide_strings.html>` __).

source: Command line tools related to ``actions`` and ``components``.
fr: Outils de ligne de commande liés aux ``actions`` et ``composants``.

source: Support for Deadline, Lifespan & Liveliness quality of service settings.
fr: Prise en charge des paramètres de qualité de service Date limite, Durée de vie et vivacité.

source: MoveIt 2 `alpha release <https://github.com/AcutronicRobotics/moveit2/releases/tag/moveit_2_alpha>`__.
fr: MoveIt 2 `version alpha <https://github.com/AcutronicRobotics/moveit2/releases/tag/moveit_2_alpha>`__.

source: Please see the `Dashing meta ticket <https://github.com/ros2/ros2/issues/607>`__ on GitHub, which contains more information as well as references to specific tickets with additional details.
fr: Veuillez consulter le `Dashing meta ticket <https://github.com/ros2/ros2/issues/607>`__ sur GitHub, qui contient plus d'informations ainsi que des références à des tickets spécifiques avec des détails supplémentaires.

source: Changes since the Crystal release
fr: Changements depuis la sortie de Crystal

source: Declaring Parameters
fr: Déclaration des paramètres

source: There have been some changes to the behavior of parameters starting in Dashing, which have also lead to some new API's and the deprecation of other API's. See the ``rclcpp`` and ``rclpy`` sections below for more information about API changes.
fr: Il y a eu quelques changements dans le comportement des paramètres à partir de Dashing, qui ont également conduit à de nouvelles API et à la dépréciation d'autres API. Voir les sections ``rclcpp`` et ``rclpy`` ci-dessous pour plus d'informations sur les modifications de l'API.

source: Getting and Setting Undeclared Parameters
fr: Obtenir et définir des paramètres non déclarés

source: As of Dashing, parameters now need to be declared before being accessed or set.
fr: Depuis Dashing, les paramètres doivent désormais être déclarés avant d'être consultés ou définis.

source: Before Dashing, you could call ``get_parameter(name)`` and get either a value, if it had been previously set, or a parameter of type ``PARAMETER_NOT_SET``. You could also call ``set_parameter(name, value)`` at any point, even if the parameter was previously unset.
fr: Avant Dashing, vous pouviez appeler ``get_parameter(name)`` et obtenir soit une valeur, si elle avait été précédemment définie, soit un paramètre de type ``PARAMETER_NOT_SET``. Vous pouvez également appeler ``set_parameter(name, value)`` à tout moment, même si le paramètre n'était pas défini auparavant.

source: Since Dashing, you need to first declare a parameter before getting or setting it. If you try to get or set an undeclared parameter you will either get an exception thrown, e.g. ParameterNotDeclaredException, or in certain cases you will get an unsuccessful result communicated in a variety of ways (see specific functions for more details).
fr: Depuis Dashing, vous devez d'abord déclarer un paramètre avant de l'obtenir ou de le définir. Si vous essayez d'obtenir ou de définir un paramètre non déclaré, vous obtiendrez soit une exception levée, par ex. ParameterNotDeclaredException, ou dans certains cas, vous obtiendrez un résultat infructueux communiqué de différentes manières (voir les fonctions spécifiques pour plus de détails).

source: However, you can get the old behavior (mostly, see the note in the next paragraph) by using the ``allow_undeclared_parameters`` option when creating your node. You might want to do this in order to avoid code changes for now, or in order to fulfill some uncommon use cases. For example, a "global parameter server" or "parameter blackboard" may want to allow external nodes to set new parameters on itself without first declaring them, so it may use the ``allow_undeclared_parameters`` option to accomplish that. In most cases, however, this option is not recommended because it makes the rest of the parameter API less safe to bugs like parameter name typos and "use before set" logical errors.
fr: Cependant, vous pouvez obtenir l'ancien comportement (pour la plupart, voir la note dans le paragraphe suivant) en utilisant l'option ``allow_undeclared_parameters`` lors de la création de votre nœud. Vous voudrez peut-être le faire afin d'éviter les changements de code pour le moment, ou afin de répondre à certains cas d'utilisation peu courants. Par exemple, un « serveur de paramètres globaux » ou un « tableau noir de paramètres » peut vouloir autoriser les nœuds externes à définir de nouveaux paramètres sur lui-même sans les déclarer au préalable, il peut donc utiliser l'option ``allow_undeclared_parameters`` pour accomplir cela. Dans la plupart des cas, cependant, cette option n'est pas recommandée car elle rend le reste de l'API de paramètre moins sûr pour les bogues tels que les fautes de frappe de nom de paramètre et les erreurs logiques "utiliser avant de définir".

source: Note that using ``allow_undeclared_parameters`` will get you most of the old behavior specifically for "get" and "set" methods, but it will not revert all the behavior changes related to parameters back to how it was for ROS Crystal. For that you need to also set the ``automatically_declare_parameters_from_overrides`` option to ``true``, which is described below in :ref:`Parameter Configuration using a YAML File <parameter-configuration-using-a-yaml-file>`.
fr: Notez que l'utilisation de ``allow_undeclared_parameters`` vous permettra d'obtenir la plupart de l'ancien comportement spécifiquement pour les méthodes "get" et "set", mais cela ne rétablira pas tous les changements de comportement liés aux paramètres tels qu'ils étaient pour ROS Crystal. Pour cela, vous devez également définir l'option ``automatically_declare_parameters_from_overrides`` sur ``true``, qui est décrite ci-dessous dans :ref:`Configuration des paramètres à l'aide d'un fichier YAML <parameter-configuration-using-a-yaml-file>` .

source: Declaring a Parameter with a ParameterDescriptor
fr: Déclarer un paramètre avec un ParameterDescriptor

source: Another benefit to declaring your parameters before using them, is that it allows you to declare a parameter descriptor at the same time.
fr: Un autre avantage de déclarer vos paramètres avant de les utiliser est que cela vous permet de déclarer un descripteur de paramètre en même temps.

source: Now when declaring a parameter you may include a custom ``ParameterDescriptor`` as well as a name and default value. The ``ParameterDescriptor`` is defined as a message in ``rcl_interfaces/msg/ParameterDescriptor`` and contains meta data like ``description`` and constraints like ``read_only`` or ``integer_range``. These constraints can be used to reject invalid values when setting parameters and/or as hints to external tools about what values are valid for a given parameter. The ``read_only`` constraint will prevent the parameter's value from changing after being declared, as well as prevent if from being undeclared.
fr: Désormais, lors de la déclaration d'un paramètre, vous pouvez inclure un ``ParameterDescriptor`` personnalisé ainsi qu'un nom et une valeur par défaut. Le ``ParameterDescriptor`` est défini comme un message dans ``rcl_interfaces/msg/ParameterDescriptor`` et contient des métadonnées comme ``description`` et des contraintes comme ``read_only`` ou ``integer_range``. Ces contraintes peuvent être utilisées pour rejeter les valeurs non valides lors de la définition des paramètres et/ou comme conseils aux outils externes sur les valeurs valides pour un paramètre donné. La contrainte ``read_only`` empêchera la valeur du paramètre de changer après avoir été déclarée, ainsi que si elle n'est pas déclarée.

source: For reference, here's a link to the ``ParameterDescriptor`` message as of the time of writing this:
fr: Pour référence, voici un lien vers le message ``ParameterDescriptor`` au moment de la rédaction de ceci :

source: Parameter Configuration using a YAML File
fr: Configuration des paramètres à l'aide d'un fichier YAML

source: As of Dashing, parameters in a YAML configuration file, e.g. passed to the node via the command line argument ``__params:=``, are only used to override a parameter's default value when declaring the parameter.
fr: Depuis Dashing, les paramètres d'un fichier de configuration YAML, par ex. transmis au nœud via l'argument de ligne de commande ``__params:=``, ne sont utilisés que pour remplacer la valeur par défaut d'un paramètre lors de la déclaration du paramètre.

source: Before Dashing, any parameters you passed via a YAML file would be implicitly set on the node.
fr: Avant Dashing, tous les paramètres que vous passiez via un fichier YAML étaient implicitement définis sur le nœud.

source: Since Dashing, this is no longer the case, as parameters need to be declared in order to appear on the node to external observers, like ``ros2 param list``.
fr: Depuis Dashing, ce n'est plus le cas, car les paramètres doivent être déclarés pour apparaître sur le nœud aux observateurs externes, comme ``ros2 param list``.

source: The old behavior may be achieved using the ``automatically_declare_parameters_from_overrides`` option when creating a node. This option, if set to ``true``, will automatically declare all parameters in the input YAML file when the node is constructed. This may be used to avoid major changes to your existing code or to serve specific use cases. For example, a "global parameter server" may want to be seeded with arbitrary parameters on launch, which it could not have declared ahead of time. Most of the time, however, this option is not recommended, as it may lead to setting a parameter in a YAML file with the assumption that the node will use it, even if the node does not actually use it.
fr: L'ancien comportement peut être obtenu en utilisant l'option ``automatically_declare_parameters_from_overrides`` lors de la création d'un nœud. Cette option, si elle est définie sur ``true``, déclarera automatiquement tous les paramètres dans le fichier YAML d'entrée lors de la construction du nœud. Cela peut être utilisé pour éviter des changements majeurs à votre code existant ou pour servir des cas d'utilisation spécifiques. Par exemple, un "serveur de paramètres globaux" peut souhaiter recevoir des paramètres arbitraires au lancement, qu'il n'aurait pas pu déclarer à l'avance. La plupart du temps, cependant, cette option n'est pas recommandée, car elle peut conduire à définir un paramètre dans un fichier YAML en supposant que le nœud l'utilisera, même si le nœud ne l'utilise pas réellement.

source: In the future we hope to have a checker that will warn you if you pass a parameter to a node that it was not expecting.
fr: À l'avenir, nous espérons avoir un vérificateur qui vous avertira si vous passez un paramètre à un nœud qu'il n'attendait pas.

source: The parameters in the YAML file will continue to influence the value of parameters when they are first declared.
fr: Les paramètres du fichier YAML continueront d'influencer la valeur des paramètres lors de leur première déclaration.

source: ament_cmake
fr: current_cmake

source: The CMake function ``ament_index_has_resource`` was returning either ``TRUE`` or ``FALSE``. As of `this release <https://github.com/ament/ament_cmake/pull/155>`_ it returns either the prefix path in case the resource was found or ``FALSE``.
fr: La fonction CMake ``ament_index_has_resource`` renvoyait soit ``TRUE`` ou ``FALSE``. À partir de `cette version <https://github.com/ament/ament_cmake/pull/155>`_, il renvoie soit le chemin du préfixe au cas où la ressource a été trouvée, soit ``FALSE``.

source: If you are using the return value in a CMake condition like this:
fr: Si vous utilisez la valeur de retour dans une condition CMake comme celle-ci :

source: you need to update the condition to ensure it considers a string value as ``TRUE``:
fr: vous devez mettre à jour la condition pour vous assurer qu'elle considère une valeur de chaîne comme ``TRUE`` :

source: rclcpp
fr: RCLCP

source: Behavior Change for ``Node::get_node_names()``
fr: Changement de comportement pour ``Node::get_node_names()``

source: The function ``NodeGraph::get_node_names()``, and therefore also ``Node::get_node_names()``, now returns a ``std::vector<std::string>`` containing fully qualified node names with their namespaces included, instead of just the node names.
fr: La fonction ``NodeGraph::get_node_names()``, et donc aussi ``Node::get_node_names()``, renvoie désormais un ``std::vector<std::string>`` contenant des noms de nœuds complets avec leurs espaces de noms inclus, au lieu de simplement les noms de nœuds.

source: Changed the Way that Options are Passed to Nodes
fr: Modification de la manière dont les options sont transmises aux nœuds

source: Extended arguments (beyond name and namespace) to the ``rclcpp::Node()`` constructor have been replaced with a ``rclcpp::NodeOptions`` structure. See `ros2/rclcpp#622 <https://github.com/ros2/rclcpp/pull/622/files>`__ for details about the structure and default values of the options.
fr: Les arguments étendus (au-delà du nom et de l'espace de noms) du constructeur ``rclcpp::Node()`` ont été remplacés par une structure ``rclcpp::NodeOptions``. Voir `ros2/rclcpp#622 <https://github.com/ros2/rclcpp/pull/622/files>`__ pour plus de détails sur la structure et les valeurs par défaut des options.

source: If you are using any of the extended arguments to ``rclcpp::Node()`` like this:
fr: Si vous utilisez l'un des arguments étendus de ``rclcpp::Node()`` comme ceci :

source: You need to update to use the ``NodeOptions`` structure
fr: Vous devez mettre à jour pour utiliser la structure ``NodeOptions``

source: Changes to Creating Publishers and Subscriptions
fr: Modifications apportées à la création d'éditeurs et d'abonnements

source: There have been a few changes to creating publishers and subscriptions which are new in Dashing:
fr: Il y a eu quelques changements dans la création d'éditeurs et d'abonnements qui sont nouveaux dans Dashing :

source: QoS settings are now passed using the new ``rclcpp::QoS`` class, and the API encourages the user to specify at least the history depth.
fr: Les paramètres QoS sont maintenant passés à l'aide de la nouvelle classe ``rclcpp::QoS``, et l'API encourage l'utilisateur à spécifier au moins la profondeur de l'historique.

source: Options are now passed as an object, i.e. ``rclcpp::PublisherOptions`` and ``rclcpp::SubscriptionOptions``.
fr: Les options sont maintenant passées en tant qu'objet, c'est-à-dire ``rclcpp::PublisherOptions`` et ``rclcpp::SubscriptionOptions``.

source: All changes are backwards compatible (no code changes are required), but several existing call styles have been deprecated. Users are encouraged to update to the new signatures.
fr: Toutes les modifications sont rétrocompatibles (aucune modification de code n'est requise), mais plusieurs styles d'appel existants sont obsolètes. Les utilisateurs sont encouragés à mettre à jour les nouvelles signatures.

source: In the past, when creating a publisher or subscription, you could either not specify any QoS settings (e.g. just provide topic name for a publisher) or you could specify a "qos profile" data structure (of type ``rmw_qos_profile_t``) with all the settings already set. Now you must use the new ``rclcpp::QoS`` object to specify your QoS and at least the history settings for your QoS. This encourages the user to specify a history depth when using ``KEEP_LAST``, rather than defaulting it to a value that may or may not be appropriate.
fr: Dans le passé, lors de la création d'un éditeur ou d'un abonnement, vous pouviez soit ne spécifier aucun paramètre QoS (par exemple, fournir simplement le nom du sujet pour un éditeur), soit spécifier une structure de données de "profil qos" (de type ``rmw_qos_profile_t``) avec tous les paramètres déjà définis. Vous devez maintenant utiliser le nouvel objet ``rclcpp::QoS`` pour spécifier votre QoS et au moins les paramètres d'historique de votre QoS. Cela encourage l'utilisateur à spécifier une profondeur d'historique lors de l'utilisation de ``KEEP_LAST``, plutôt que de lui attribuer par défaut une valeur qui peut ou non être appropriée.

source: In ROS 1, this was known as the ``queue_size`` and it was required in both C++ and Python. We're changing the ROS 2 API to bring this requirement back.
fr: Dans ROS 1, cela s'appelait ``queue_size`` et était requis à la fois en C++ et en Python. Nous modifions l'API ROS 2 pour rétablir cette exigence.

source: Also, any options which could previously be passed during creation of a publisher or subscription have now been encapsulated in an ``rclcpp::PublisherOptions`` and ``rclcpp::SubscriptionOptions`` class respectively. This allows for shorter signatures, more convenient use, and for adding new future options without breaking API.
fr: De plus, toutes les options qui pouvaient auparavant être passées lors de la création d'un éditeur ou d'un abonnement ont maintenant été encapsulées dans une classe ``rclcpp::PublisherOptions`` et ``rclcpp::SubscriptionOptions`` respectivement. Cela permet des signatures plus courtes, une utilisation plus pratique et l'ajout de nouvelles options futures sans casser l'API.

source: Some signatures for creating publishers and subscribers are now deprecated, and new signatures have been added to allow you to use the new ``rclcpp::QoS`` and publisher/subscription option classes.
fr: Certaines signatures pour la création d'éditeurs et d'abonnés sont désormais obsolètes, et de nouvelles signatures ont été ajoutées pour vous permettre d'utiliser les nouvelles classes d'options ``rclcpp::QoS`` et éditeur/abonnement.

source: These are the new and recommended API's:
fr: Voici les nouvelles API recommandées :

source: And these are the deprecated ones:
fr: Et ce sont ceux qui sont obsolètes :

source: The change to how QoS is passed is most likely to impact users.
fr: La modification de la façon dont la qualité de service est transmise est très susceptible d'avoir un impact sur les utilisateurs.

source: A typical change for a publisher looks like this:
fr: Un changement typique pour un éditeur ressemble à ceci :

source: And for a subscription:
fr: Et pour un abonnement :

source: If you have no idea what depth to use and don't care right now (maybe just prototyping), then we recommend using ``10``, as that was the default before and should preserve existing behavior.
fr: Si vous n'avez aucune idée de la profondeur à utiliser et que vous ne vous en souciez pas pour le moment (peut-être juste pour le prototypage), nous vous recommandons d'utiliser ``10``, car c'était la valeur par défaut auparavant et devrait préserver le comportement existant.

source: More in depth documentation about how to select an appropriate depth is forthcoming.
fr: Une documentation plus détaillée sur la façon de sélectionner une profondeur appropriée est à venir.

source: This is an example of a slightly more involved change to avoid the newly deprecated API's:
fr: Voici un exemple d'un changement légèrement plus complexe pour éviter les API nouvellement obsolètes :

source: See the pull request (and connected pull requests) that introduced the QoS change for more examples and details:
fr: Consultez la demande d'extraction (et les demandes d'extraction connectées) qui ont introduit le changement de QoS pour plus d'exemples et de détails :

source: and others...
fr: et d'autres...
