Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Releases/Release-Iron-Irwini.po
Languages: fr

source: ROS 2 Iron Irwini (codename 'iron'; May, 2023)
fr: ROS 2 Iron Irwini (nom de code 'iron'; mai 2023)

source: Table of Contents
fr: Table des matières

source: *Iron Irwini* is the ninth release of ROS 2. What follows is highlights of the important changes and features in Iron Irwini since the last release.
fr: *Iron Irwini* est la neuvième version de ROS 2. Ce qui suit présente les principaux changements et fonctionnalités d'Iron Irwini depuis la dernière version.

source: Supported Platforms
fr: Plates-formes prises en charge

source: Iron Irwini is primarily supported on the following platforms:
fr: Iron Irwini est principalement pris en charge sur les plates-formes suivantes :

source: Tier 1 platforms:
fr: Plateformes de niveau 1 :

source: TBD
fr: À déterminer

source: Tier 2 platforms:
fr: Plateformes de niveau 2 :

source: Tier 3 platforms:
fr: Plateformes de niveau 3 :

source: For more information about RMW implementations, compiler / interpreter versions, and system dependency versions see `REP 2000 <https://www.ros.org/reps/rep-2000.html>`__.
fr: Pour plus d'informations sur les implémentations RMW, les versions du compilateur/interpréteur et les versions des dépendances système, consultez `REP 2000 <https://www.ros.org/reps/rep-2000.html>`__.

source: To come.
fr: Venir.

source: New features in this ROS 2 release
fr: Nouvelles fonctionnalités de cette version de ROS 2

source: ``now`` as keyword for ``builtin_interfaces.msg.Time`` and ``auto`` for ``std_msgs.msg.Header``
fr: ``now`` comme mot clé pour ``builtin_interfaces.msg.Time`` et ``auto`` pour ``std_msgs.msg.Header``

source: ``ros2 topic pub`` now allows to set a ``builtin_interfaces.msg.Time`` message to the current time via the ``now`` keyword. Similarly, a ``std_msg.msg.Header`` message will be automatically generated when passed the keyword ``auto``. This behavior matches that of ROS 1's ``rostopic`` (http://wiki.ros.org/ROS/YAMLCommandLine#Headers.2Ftimestamps)
fr: ``ros2 topic pub`` permet maintenant de définir un message ``builtin_interfaces.msg.Time`` à l'heure actuelle via le mot-clé ``now``. De même, un message ``std_msg.msg.Header`` sera généré automatiquement lors du passage du mot-clé ``auto``. Ce comportement correspond à celui de ``rostopic`` de ROS 1 (http://wiki.ros.org/ROS/YAMLCommandLine#Headers.2Ftimestamps)

source: Related PR: `ros2/ros2cli#749 <https://github.com/ros2/ros2cli/pull/749>`_
fr: PR associé : `ros2/ros2cli#749 <https://github.com/ros2/ros2cli/pull/749>`_

source: Changes since the Humble release
fr: Changements depuis la version Humble

source: Renamed classes which used ``Ros`` in the name to use ``ROS`` in line with PEP8
fr: Classes renommées qui utilisaient ``Ros`` dans le nom pour utiliser ``ROS`` conformément à PEP8

source: Classes that were changed:
fr: Classes modifiées :

source: ``launch.actions.RosTimer`` -> ``launch.actions.ROSTimer``
fr: ``lancer.actions.RosTimer`` -> ``lancer.actions.ROSTimer``

source: The old class names are still there, but will be deprecated.
fr: Les anciens noms de classe sont toujours là, mais seront obsolètes.

source: Change to the default console logging file flushing behavior
fr: Modification du comportement de vidage du fichier de journalisation de la console par défaut

source: This specifically applies to the default ``spdlog`` based logging backend in ROS 2, implemented in ``rcl_logging_spdlog``. Log file flushing was changed to flush every time an "error" log message is used, e.g. each ``RCLCPP_ERROR()`` call, and also periodically every five seconds.
fr: Cela s'applique spécifiquement au backend de journalisation par défaut basé sur ``spdlog`` dans ROS 2, implémenté dans ``rcl_logging_spdlog``. Le vidage du fichier journal a été modifié pour se vider à chaque fois qu'un message de journal "erreur" est utilisé, par ex. chaque appel ``RCLCPP_ERROR()``, et aussi périodiquement toutes les cinq secondes.

source: Previously, ``spdlog`` was used without configuring anything other than creating the sink for logging to a file.
fr: Auparavant, ``spdlog`` était utilisé sans rien configurer d'autre que la création du récepteur pour la journalisation dans un fichier.

source: We tested the change and did not find that the CPU overhead was significant, even on machines with slow disks (e.g. sd cards). However, if this change is causing you problems, you can get the old behavior by setting the ``RCL_LOGGING_SPDLOG_EXPERIMENTAL_OLD_FLUSHING_BEHAVIOR=1`` environment variable.
fr: Nous avons testé le changement et n'avons pas constaté que la surcharge du processeur était significative, même sur des machines avec des disques lents (par exemple, des cartes SD). Cependant, si ce changement vous cause des problèmes, vous pouvez obtenir l'ancien comportement en définissant la variable d'environnement ``RCL_LOGGING_SPDLOG_EXPERIMENTAL_OLD_FLUSHING_BEHAVIOR=1``.

source: Later we would like to have support for a full configuration file (see: https://github.com/ros2/rcl_logging/issues/92), giving you more flexibility in how the logging is done, but that is work that is only planned right now.
fr: Plus tard, nous aimerions avoir un support pour un fichier de configuration complet (voir : https://github.com/ros2/rcl_logging/issues/92), vous donnant plus de flexibilité dans la façon dont la journalisation est effectuée, mais c'est un travail qui n'est que prévu à l'instant.

source: Therefore, **this environment variable should be considered experimental and subject to removal without deprecation in the future**, when we add config file support for the ``rcl_logging_spdlog`` logging backend.
fr: Par conséquent, **cette variable d'environnement doit être considérée comme expérimentale et susceptible d'être supprimée sans dépréciation à l'avenir**, lorsque nous ajouterons la prise en charge des fichiers de configuration pour le backend de journalisation ``rcl_logging_spdlog``.

source: See this pull request for more details about the change: https://github.com/ros2/rcl_logging/pull/95
fr: Voir cette demande d'extraction pour plus de détails sur le changement : https://github.com/ros2/rcl_logging/pull/95

source: Known Issues
fr: Problèmes connus

source: Release Timeline
fr: Calendrier de publication

source: November, 2022 - Platform decisions
fr: Novembre 2022 - Décisions de la plateforme

source: REP 2000 is updated with the target platforms and major dependency versions.
fr: REP 2000 est mis à jour avec les plates-formes cibles et les principales versions de dépendance.

source: By January, 2023 - Rolling platform shift
fr: D'ici janvier 2023 - Changement de plate-forme roulante

source: Build farm is updated with the new platform versions and dependency versions for Iron Irwini (if necessary).
fr: La ferme de construction est mise à jour avec les nouvelles versions de plate-forme et les versions de dépendance pour Iron Irwini (si nécessaire).

source: Preliminary testing and stabilization of ROS Base [1]_ packages, and API and feature freeze for RMW provider packages.
fr: Tests préliminaires et stabilisation des packages ROS Base [1]_, et API et gel des fonctionnalités pour les packages du fournisseur RMW.

source: Mon. April 17, 2023 - Freeze
fr: Lun. 17 avril 2023 - Gel

source: API and feature freeze for ROS Base [1]_ packages in Rolling Ridley. Only bug fix releases should be made after this point. New packages can be released independently.
fr: API et gel des fonctionnalités pour les packages ROS Base [1]_ dans Rolling Ridley. Seules les versions de correctifs de bogues doivent être effectuées après ce point. De nouveaux packages peuvent être publiés indépendamment.

source: Branch from Rolling Ridley. ``rosdistro`` is reopened for Rolling PRs for ROS Base [1]_ packages. Iron development shifts from ``ros-rolling-*`` packages to ``ros-iron-*`` packages.
fr: Succursale de Rolling Ridley. ``rosdistro`` est rouvert pour Rolling PRs pour les packages ROS Base [1]_. Le développement du fer passe des packages ``ros-rolling-*`` aux packages ``ros-iron-*``.

source: Updated releases of ROS Desktop [2]_ packages available. Call for general testing.
fr: Versions mises à jour des packages ROS Desktop [2]_ disponibles. Appel pour des tests généraux.

source: Mon. May 15, 2023 - Release Candidate
fr: Lun. 15 mai 2023 - Candidat à la libération

source: Release Candidate packages are built. Updated releases of ROS Desktop [2]_ packages available.
fr: Les packages Release Candidate sont créés. Versions mises à jour des packages ROS Desktop [2]_ disponibles.

source: Thu. May 18, 2023 - Distro Freeze
fr: Jeu. 18 mai 2023 - Distro Freeze

source: Freeze rosdistro. No PRs for Iron on the ``rosdistro`` repo will be merged (reopens after the release announcement).
fr: Geler rosdistro. Aucun PR pour Iron sur le repo ``rosdistro`` ne sera fusionné (réouverture après l'annonce de la sortie).

source: Tue. May 23, 2023 - General Availability
fr: Mar. 23 mai 2023 - Disponibilité générale

source: Release announcement. ``rosdistro`` is reopened for Iron PRs.
fr: Annonce de sortie. ``rosdistro`` est rouvert pour les PR de fer.

source: The ``ros_base`` variant is described in `REP 2001 (ros-base) <https://www.ros.org/reps/rep-2001.html#ros-base>`_.
fr: La variante ``ros_base`` est décrite dans `REP 2001 (ros-base) <https://www.ros.org/reps/rep-2001.html#ros-base>`_.

source: The ``desktop`` variant is described in `REP 2001 (desktop-variants) <https://www.ros.org/reps/rep-2001.html#desktop-variants>`_.
fr: La variante ``desktop`` est décrite dans `REP 2001 (desktop-variants) <https://www.ros.org/reps/rep-2001.html#desktop-variants>`_.

source: Development progress
fr: Avancement du développement

source: For progress on the development and release of Iron Irwini, see `the tracking GitHub issue <https://github.com/ros2/ros2/issues/1298>`__.
fr: Pour connaître l'avancement du développement et de la publication d'Iron Irwini, consultez `the tracking GitHub issue <https://github.com/ros2/ros2/issues/1298>`__.

source: For the broad process followed by Iron Irwini, see the :doc:`process description page <Release-Process>`.
fr: Pour le processus général suivi par Iron Irwini, voir la :doc:`page de description du processus <Release-Process>`.
