Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Releases/Release-Foxy-Fitzroy.po
Languages: fr

source: Table of Contents
fr: Table des matières

source: *Foxy Fitzroy* is the sixth release of ROS 2.
fr: *Foxy Fitzroy* est la sixième version de ROS 2.

source: Supported Platforms
fr: Plates-formes prises en charge

source: Foxy Fitzroy is primarily supported on the following platforms:
fr: Foxy Fitzroy est principalement pris en charge sur les plates-formes suivantes :

source: Tier 1 platforms:
fr: Plateformes de niveau 1 :

source: Ubuntu 20.04 (Focal): ``amd64`` and ``arm64``
fr: Ubuntu 20.04 (Focal) : ``amd64`` et ``arm64``

source: Tier 3 platforms:
fr: Plateformes de niveau 3 :

source: Debian Buster (10): ``amd64``, ``arm64`` and ``arm32``
fr: Debian Buster (10) : ``amd64``, ``arm64`` et ``arm32``

source: OpenEmbedded Thud (2.6) / webOS OSE: ``arm32`` and ``x86``
fr: OpenEmbedded Thud (2.6) / webOS OSE : ``arm32`` et ``x86``

source: For more information about RMW implementations, compiler / interpreter versions, and system dependency versions see `REP 2000 <https://www.ros.org/reps/rep-2000.html>`__.
fr: Pour plus d'informations sur les implémentations RMW, les versions du compilateur/interpréteur et les versions des dépendances système, consultez `REP 2000 <https://www.ros.org/reps/rep-2000.html>`__.

source: `Install Foxy Fitzroy <../../foxy/Installation.html>`__
fr: `Installer Foxy Fitzroy <../../foxy/Installation.html>`__

source: New features in this ROS 2 release
fr: Nouvelles fonctionnalités de cette version de ROS 2

source: During the development the `Foxy meta-ticket <https://github.com/ros2/ros2/issues/830>`__ on GitHub contains an up-to-date state of the ongoing high-level tasks as well as references specific tickets with more details.
fr: Pendant le développement, le `méta-ticket Foxy <https://github.com/ros2/ros2/issues/830>`__ sur GitHub contient un état à jour des tâches de haut niveau en cours ainsi que des références spécifiques billets avec plus de détails.

source: Changes in Patch Release 8 (2022-09-28)
fr: Changements dans la version 8 du correctif (2022-09-28)

source: Launch GroupAction scopes environment
fr: Lancer l'environnement de portée GroupAction

source: The ``SetEnvironmentVariable`` action is now scoped to any ``GroupAction`` it is returned from.
fr: L'action ``SetEnvironmentVariable`` est désormais limitée à tout ``GroupAction`` à partir duquel elle est renvoyée.

source: For example, consider the following launch files,
fr: Par exemple, considérez les fichiers de lancement suivants,

source: Before patch release 8, the node ``foo`` will start with ``my_env_var=2``, but now it will start with ``my_env_var=1``.
fr: Avant la version 8 du patch, le nœud ``foo`` commencerait par ``my_env_var=2``, mais maintenant il commencera par ``my_env_var=1``.

source: To opt-out of the new behavior, you can set the argument ``scoped=False`` on the ``GroupAction``.
fr: Pour désactiver le nouveau comportement, vous pouvez définir l'argument ``scoped=False`` sur ``GroupAction``.

source: Related tickets:
fr: Billets associés :

source: `launch#630 <https://github.com/ros2/launch/pull/630>`_
fr: `lancement#630 <https://github.com/ros2/launch/pull/630>`_

source: Changes in Patch Release 7 (2022-02-08)
fr: Changements dans la version 7 du correctif (2022-02-08)

source: Launch set_env frontend behavior change
fr: Lancer le changement de comportement du frontend set_env

source: `launch#468 <https://github.com/ros2/launch/pull/468>`_ inadvertently changed behavior to the scope of the ``set_env`` action in frontend launch files. Changes to environment variables using the ``set_env`` action are no longer scoped to parent ``group`` actions, and instead apply globally. Since it was backported, the change affects this release.
fr: `launch#468 <https://github.com/ros2/launch/pull/468>`_ a modifié par inadvertance le comportement de la portée de l'action ``set_env`` dans les fichiers de lancement frontaux. Les modifications apportées aux variables d'environnement à l'aide de l'action ``set_env`` ne sont plus limitées aux actions parent ``group``, et s'appliquent à la place globalement. Depuis qu'il a été rétroporté, le changement affecte cette version.

source: We consider this change a regression and intend to fix the behavior in the next patch release and in future ROS distributions. We also plan to fix the behavior in Python launch files, which have never scoped setting environment variables properly.
fr: Nous considérons ce changement comme une régression et avons l'intention de corriger le comportement dans la prochaine version du correctif et dans les futures distributions ROS. Nous prévoyons également de corriger le comportement dans les fichiers de lancement Python, qui n'ont jamais défini correctement les variables d'environnement.

source: Related issues:
fr: Problèmes liés:

source: `launch#597 <https://github.com/ros2/launch/issues/597>`_
fr: `lancement#597 <https://github.com/ros2/launch/issues/597>`_

source: Fix launch frontend parser
fr: Correction du lancement de l'analyseur frontal

source: A refactor of the launch frontend parser fixed some `issues parsing special characters <https://github.com/ros2/launch_ros/issues/214>`_. As a result, there has been a small behavior change when it comes to parsing strings. For example, previously to pass a number as a string you would have to add extra quotation marks (two sets of quotation marks were needed if using a substitution):
fr: Une refactorisation de l'analyseur frontend de lancement a corrigé certains `problèmes d'analyse des caractères spéciaux <https://github.com/ros2/launch_ros/issues/214>`_. En conséquence, il y a eu un petit changement de comportement en ce qui concerne l'analyse des chaînes. Par exemple, auparavant, pour transmettre un nombre en tant que chaîne, vous deviez ajouter des guillemets supplémentaires (deux ensembles de guillemets étaient nécessaires si vous utilisiez une substitution) :

source: After the refactor, the above will result in the the string ``"''3''"`` (note the extra set of quotation marks). Now, users should use the ``type`` attribute to signal that the value should be interpreted as a string:
fr: Après la refactorisation, ce qui précède se traduira par la chaîne ``"''3''"`` (notez le jeu supplémentaire de guillemets). Désormais, les utilisateurs doivent utiliser l'attribut ``type`` pour signaler que la valeur doit être interprétée comme une chaîne :

source: Related pull requests:
fr: Demandes d'extraction associées :

source: `launch#530 <https://github.com/ros2/launch/pull/530>`_
fr: `lancement#530 <https://github.com/ros2/launch/pull/530>`_

source: Fix memory leaks and undefined behavior in rmw_fastrtps_dynamic_cpp
fr: Correction des fuites de mémoire et du comportement indéfini dans rmw_fastrtps_dynamic_cpp

source: API was changed in the following header files:
fr: L'API a été modifiée dans les fichiers d'en-tête suivants :

source: Though technically they are publically accessible, it is unlikely people are using them directly. Therefore, we decided to break API in order to fix memory leaks and undefined behavior.
fr: Bien qu'ils soient techniquement accessibles au public, il est peu probable que les gens les utilisent directement. Par conséquent, nous avons décidé de casser l'API afin de corriger les fuites de mémoire et les comportements indéfinis.

source: The fix was originally submitted in `rmw_fastrtps#429 <https://github.com/ros2/rmw_fastrtps/pull/429>`_ and later backported to Foxy in `rmw_fastrtps#577 <https://github.com/ros2/rmw_fastrtps/pull/577>`_.
fr: Le correctif a été initialement soumis dans `rmw_fastrtps#429 <https://github.com/ros2/rmw_fastrtps/pull/429>`_ et plus tard rétroporté sur Foxy dans `rmw_fastrtps#577 <https://github.com/ros2/ rmw_fastrtps/pull/577>`_.

source: Changes in Patch Release 2 (2020-08-07)
fr: Changements dans la version 2 du correctif (2020-08-07)

source: Bug in static_transform_publisher
fr: Bogue dans static_transform_publisher

source: During the development of Foxy, a bug was introduced into the tf2_ros static_transform_publisher program. The implementation of the order of the Euler angles passed to static_transform_publisher disagrees with the documentation. Foxy patch release 2 `fixes <https://github.com/ros2/geometry2/pull/296>`_ the order so that the implementation agrees with the documentation (yaw, pitch, roll). For users who have started using the initial Foxy release or patch release 1, this means that any launch files that use static_transform_publisher will have to have the command-line order swapped according to the new order. For users who are coming from ROS 2 Dashing, ROS 2 Eloquent, or ROS 1, no changes need to be made to port to Foxy patch release 2.
fr: Lors du développement de Foxy, un bogue a été introduit dans le programme tf2_ros static_transform_publisher. L'implémentation de l'ordre des angles d'Euler transmis à static_transform_publisher est en désaccord avec la documentation. Le correctif Foxy version 2 `corrige <https://github.com/ros2/geometry2/pull/296>`_ l'ordre afin que l'implémentation soit en accord avec la documentation (lacet, tangage, roulis). Pour les utilisateurs qui ont commencé à utiliser la version initiale de Foxy ou la version 1 du correctif, cela signifie que tous les fichiers de lancement qui utilisent static_transform_publisher devront avoir l'ordre de la ligne de commande permuté en fonction du nouvel ordre. Pour les utilisateurs qui viennent de ROS 2 Dashing, ROS 2 Eloquent ou ROS 1, aucune modification ne doit être apportée au port vers la version 2 du correctif Foxy.

source: Changes since the Eloquent release
fr: Changements depuis la sortie d'Eloquent

source: Classic CMake vs. modern CMake
fr: CMake classique contre CMake moderne

source: In "classic" CMake a package provides CMake variables like ``<pkgname>_INCLUDE_DIRS`` and ``<pkgname>_LIBRARIES`` when being ``find_package()``-ed. With ``ament_cmake`` that is achieved by calling ``ament_export_include_directories`` and ``ament_export_libraries``. In combination with ``ament_export_dependencies``, ``ament_cmake`` ensures that all include directories and libraries of recursive dependencies are concatenated and included in these variables.
fr: Dans CMake "classique", un package fournit des variables CMake telles que ``<pkgname>_INCLUDE_DIRS`` et ``<pkgname>_LIBRARIES`` lorsqu'il est ``find_package()``-ed. Avec ``ament_cmake`` cela est réalisé en appelant ``ament_export_include_directories`` et ``ament_export_libraries``. En combinaison avec ``ament_export_dependencies``, ``ament_cmake`` garantit que tous les répertoires d'inclusion et bibliothèques de dépendances récursives sont concaténés et inclus dans ces variables.

source: In "modern" CMake a package provides an interface target instead (commonly named ``<pkgname>::<pkgname>``) which in itself encapsulates all recursive dependencies. In order to export a library target to use modern CMake ``ament_export_targets`` needs to be called with an export name which is also used when installing the libraries using ``install(TARGETS <libA> <libB> EXPORT <export_name> ...)``. The exported interface targets are available through the CMake variable ``<pkgname>_TARGETS``. For library targets to be exportable like this they must not rely on classic functions affecting global state like ``include_directories()`` but set the include directories on the target itself - for the build as well as install environment - using generator expressions, e.g. ``target_include_directories(<target> PUBLIC "$<BUILD_INTERFACE:${CMAKE_CURRENT_BINARY_DIR}/include>" "$<INSTALL_INTERFACE:include>")``.
fr: Dans CMake "moderne", un package fournit à la place une cible d'interface (communément appelée ``<pkgname>::<pkgname>``) qui en elle-même encapsule toutes les dépendances récursives. Afin d'exporter une cible de bibliothèque pour utiliser CMake moderne, ``ament_export_targets`` doit être appelé avec un nom d'exportation qui est également utilisé lors de l'installation des bibliothèques à l'aide de ``install(TARGETS <libA> <libB> EXPORT <export_name> .. .)``. Les cibles d'interface exportées sont disponibles via la variable CMake ``<pkgname>_TARGETS``. Pour que les cibles de bibliothèque soient exportables comme ceci, elles ne doivent pas s'appuyer sur des fonctions classiques affectant l'état global comme ``include_directories()`` mais définir les répertoires d'inclusion sur la cible elle-même - pour la construction ainsi que l'environnement d'installation - en utilisant des expressions de générateur, par ex. ``target_include_directories(<cible> PUBLIC "$<BUILD_INTERFACE:${CMAKE_CURRENT_BINARY_DIR}/include>" "$<INSTALL_INTERFACE:include>")``.

source: When ``ament_target_dependencies`` is used to add dependencies to a library target the function uses modern CMake targets when they are available. Otherwise it falls back to using classic CMake variables. As a consequence you should only export modern CMake targets if all dependencies are also providing modern CMake targets. **Otherwise the exported interface target will contain the absolute paths to include directories / libraries in the generated CMake logic which makes the package non-relocatable.**
fr: Lorsque ``ament_target_dependencies`` est utilisé pour ajouter des dépendances à une cible de bibliothèque, la fonction utilise des cibles CMake modernes lorsqu'elles sont disponibles. Sinon, il revient à l'utilisation de variables CMake classiques. Par conséquent, vous ne devez exporter des cibles CMake modernes que si toutes les dépendances fournissent également des cibles CMake modernes. **Sinon, la cible d'interface exportée contiendra les chemins absolus pour inclure les répertoires/bibliothèques dans la logique CMake générée, ce qui rend le package non déplaçable.**

source: For examples how packages have been updated to modern CMake in Foxy see `ros2/ros2#904 <https://github.com/ros2/ros2/issues/904>`_.
fr: Pour des exemples de mise à jour des packages vers CMake moderne dans Foxy, voir `ros2/ros2#904 <https://github.com/ros2/ros2/issues/904>`_.

source: ament_export_interfaces replaced by ament_export_targets
fr: ament_export_interfaces remplacé par ament_export_targets

source: The CMake function ``ament_export_interfaces`` from the package ``ament_cmake_export_interfaces`` has been deprecated in favor of the function ``ament_export_targets`` in the new package ``ament_cmake_export_targets``. See the GitHub ticket `ament/ament_cmake#237 <https://github.com/ament/ament_cmake/issues/237>`_ for more context.
fr: La fonction CMake ``ament_export_interfaces`` du package ``ament_cmake_export_interfaces`` a été dépréciée au profit de la fonction ``ament_export_targets`` dans le nouveau package ``ament_cmake_export_targets``. Voir le ticket GitHub `ament/ament_cmake#237 <https://github.com/ament/ament_cmake/issues/237>`_ pour plus de contexte.

source: rosidl_generator_c|cpp namespace / API changes
fr: rosidl_generator_c|espace de noms cpp / modifications de l'API

source: The packages ``rosidl_generator_c`` and ``rosidl_generator_cpp`` have been refactored with many headers and sources moved into the new packages ``rosidl_runtime_c`` and ``rosidl_runtime_cpp``. The intention is to remove run dependencies on the generator packages and therefore the code generation tools using Python. While moving the headers the include paths / namespaces were updated accordingly so in many cases changing include directives from the generator package to the runtime package is sufficient.
fr: Les packages ``rosidl_generator_c`` et ``rosidl_generator_cpp`` ont été refactorisés avec de nombreux en-têtes et sources déplacés dans les nouveaux packages ``rosidl_runtime_c`` et ``rosidl_runtime_cpp``. L'intention est de supprimer les dépendances d'exécution sur les packages du générateur et donc les outils de génération de code utilisant Python. Lors du déplacement des en-têtes, les chemins d'inclusion/espaces de noms ont été mis à jour en conséquence, de sorte que dans de nombreux cas, la modification des directives d'inclusion du package générateur vers le package d'exécution est suffisante.

source: The generated C / C++ code has also been refactored. The files ending in ``__struct.h|hpp``, ``__functions.h``, ``__traits.hpp``, etc. have been moved into a subdirectory ``detail`` but most code only includes the header named after the interface without any of these suffixes.
fr: Le code C/C++ généré a également été refactorisé. Les fichiers se terminant par ``__struct.h|hpp``, ``__functions.h``, ``__traits.hpp``, etc. ont été déplacés dans un sous-répertoire ``detail`` mais la plupart du code n'inclut que l'en-tête nommé d'après l'interface sans aucun de ces suffixes.

source: Some types regarding string and sequence bounds have also been renamed to match the naming conventions but they aren't expected to be used in user code (above RMW implementation and type support packages)
fr: Certains types concernant les limites de chaîne et de séquence ont également été renommés pour correspondre aux conventions de dénomination, mais ils ne devraient pas être utilisés dans le code utilisateur (au-dessus de l'implémentation RMW et des packages de prise en charge de type)

source: For more information see `ros2/rosidl#446 (for C) <https://github.com/ros2/rosidl/issues/446>`_ and `ros2/rosidl#447 (for C++) <https://github.com/ros2/rosidl/issues/447>`_.
fr: Pour plus d'informations, voir `ros2/rosidl#446 (pour C) <https://github.com/ros2/rosidl/issues/446>`_ et `ros2/rosidl#447 (pour C++) <https://github .com/ros2/rosidl/issues/447>`_.

source: Default working directory for ament_add_test
fr: Répertoire de travail par défaut pour ament_add_test

source: The default working directory for tests added with ``ament_add_test`` has been changed to ``CMAKE_CURRENT_BINARY_DIR`` to match the behavior of CMake ``add_test``. Either update the tests to work with the new default or pass ``WORKING_DIRECTORY ${CMAKE_SOURCE_DIR}`` to restore the previous value.
fr: Le répertoire de travail par défaut pour les tests ajoutés avec ``ament_add_test`` a été remplacé par ``CMAKE_CURRENT_BINARY_DIR`` pour correspondre au comportement de CMake ``add_test``. Mettez à jour les tests pour qu'ils fonctionnent avec la nouvelle valeur par défaut ou passez ``WORKING_DIRECTORY ${CMAKE_SOURCE_DIR}`` pour restaurer la valeur précédente.

source: Default Console Logging Format
fr: Format de journalisation de la console par défaut

source: The default console logging output format was changed to include the timestamp by default, see:
fr: Le format de sortie de journalisation de la console par défaut a été modifié pour inclure l'horodatage par défaut, voir :

source: Default Console Logging Output Stream
fr: Flux de sortie de journalisation de la console par défaut

source: As of Foxy, all logging messages at all severity levels get logged to stderr by default. This ensures that logging messages come out immediately, and brings the ROS 2 logging system into alignment with most other logging systems. It is possible to change the stream to stdout at runtime via the RCUTILS_LOGGING_USE_STDOUT environment variable, but all logging messages will still go to the same stream. See `https://github.com/ros2/rcutils/pull/196 <https://github.com/ros2/rcutils/pull/196>`_ for more details.
fr: Depuis Foxy, tous les messages de journalisation à tous les niveaux de gravité sont enregistrés par défaut dans stderr. Cela garantit que les messages de journalisation sortent immédiatement et alignent le système de journalisation ROS 2 sur la plupart des autres systèmes de journalisation. Il est possible de changer le flux en stdout lors de l'exécution via la variable d'environnement RCUTILS_LOGGING_USE_STDOUT, mais tous les messages de journalisation iront toujours dans le même flux. Voir `https://github.com/ros2/rcutils/pull/196 <https://github.com/ros2/rcutils/pull/196>`_ pour plus de détails.

source: launch_ros
fr: lancement_ros

source: Node name and namespace parameters changed
fr: Nom du nœud et paramètres d'espace de noms modifiés

source: The ``Node`` action parameters related to naming have been changed:
fr: Les paramètres d'action ``Node`` liés au nommage ont été modifiés :

source: ``node_name`` has been renamed to ``name``
fr: ``node_name`` a été renommé en ``name``

source: ``node_namespace`` has been renamed to ``namespace``
fr: ``node_namespace`` a été renommé en ``namespace``

source: ``node_executable`` has been renamed to ``executable``
fr: ``node_executable`` a été renommé en ``executable``

source: ``exec_name`` has been added for naming the process associated with the node. Previously, users would have used the ``name`` keyword argument.
fr: ``exec_name`` a été ajouté pour nommer le processus associé au nœud. Auparavant, les utilisateurs auraient utilisé l'argument de mot-clé ``name``.

source: The old parameters have been deprecated.
fr: Les anciens paramètres sont obsolètes.

source: These changes were made to make the launch frontend more idiomatic. For example, instead of
fr: Ces modifications ont été apportées pour rendre l'interface de lancement plus idiomatique. Par exemple, au lieu de

source: we can now write
fr: nous pouvons maintenant écrire

source: This change also applies to ``ComposableNodeContainer``, ``ComposableNode``, and ``LifecycleNode``. For examples, see the `relevant changes to the demos. <https://github.com/ros2/demos/pull/431>`_
fr: Cette modification s'applique également à ``ComposableNodeContainer``, ``ComposableNode`` et ``LifecycleNode``. Pour des exemples, voir les `modifications pertinentes apportées aux démos. <https://github.com/ros2/demos/pull/431>`_

source: `Related pull request in launch_ros. <https://github.com/ros2/launch_ros/pull/122>`_
fr: `Requête d'extraction associée dans launch_ros. <https://github.com/ros2/launch_ros/pull/122>`_

source: rclcpp
fr: RCLCP

source: Change in Advanced Subscription Callback Signature
fr: Modification de la signature de rappel d'abonnement avancé

source: With the pull request `https://github.com/ros2/rclcpp/pull/1047 <https://github.com/ros2/rclcpp/pull/1047>`_ the signature of callbacks which receive the message info with the message has changed. Previously it used the ``rmw`` type ``rmw_message_info_t``, but now uses the ``rclcpp`` type ``rclcpp::MessageInfo``. The required changes are straightforward, and can be seen demonstrated in these pull requests:
fr: Avec la pull request `https://github.com/ros2/rclcpp/pull/1047 <https://github.com/ros2/rclcpp/pull/1047>`_ la signature des rappels qui reçoivent les informations de message avec le message a changé. Auparavant, il utilisait le type ``rmw`` ``rmw_message_info_t``, mais utilise maintenant le type ``rclcpp`` ``rclcpp::MessageInfo``. Les modifications requises sont simples et peuvent être démontrées dans ces demandes d'extraction :

source: Change in Serialized Message Callback Signature
fr: Modification de la signature de rappel de message sérialisé
