Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Releases/Release-Dashing-Diademata.po
Languages: fr

source: Changes Due to Declare Parameter Change
fr: Modifications dues à la déclaration de modification de paramètre

source: For details about the actual behavior change, see `Declaring Parameters`_ above.
fr: Pour plus de détails sur le changement de comportement réel, voir `Déclaration des paramètres`_ ci-dessus.

source: There are several new API calls in the ``rclcpp::Node``'s interface:
fr: Il y a plusieurs nouveaux appels d'API dans l'interface ``rclcpp::Node`` :

source: Methods that declare parameters given a name, optional default value, optional descriptor, and return the value actually set:
fr: Méthodes qui déclarent des paramètres avec un nom, une valeur par défaut facultative, un descripteur facultatif et renvoient la valeur réellement définie :

source: A method to undeclare parameters and to check if a parameter has been declared:
fr: Une méthode pour annuler la déclaration des paramètres et vérifier si un paramètre a été déclaré :

source: Some convenience methods that did not previously exist:
fr: Quelques méthodes de commodité qui n'existaient pas auparavant :

source: A new method to set the callback which is called anytime a parameter will be changed, giving you the opportunity to reject it:
fr: Une nouvelle méthode pour définir le rappel qui est appelé à chaque fois qu'un paramètre sera modifié, vous donnant la possibilité de le rejeter :

source: There were also several deprecated methods:
fr: Il y avait aussi plusieurs méthodes obsolètes :

source: Memory Strategy
fr: Stratégie de mémoire

source: The interface ``rclcpp::memory_strategy::MemoryStrategy`` was using the typedef ``WeakNodeVector`` in various method signatures. As of Dashing the typedef has been been changed to ``WeakNodeList`` and with it the type of the parameter in various methods. Any custom memory strategy needs to be updated to match the modified interface.
fr: L'interface ``rclcpp::memory_strategy::MemoryStrategy`` utilisait le typedef ``WeakNodeVector`` dans diverses signatures de méthode. Depuis Dashing, le typedef a été changé en ``WeakNodeList`` et avec lui le type du paramètre dans diverses méthodes. Toute stratégie de mémoire personnalisée doit être mise à jour pour correspondre à l'interface modifiée.

source: The relevant API change can be found in `ros2/rclcpp#741 <https://github.com/ros2/rclcpp/pull/741>`__.
fr: Le changement d'API pertinent peut être trouvé dans `ros2/rclcpp#741 <https://github.com/ros2/rclcpp/pull/741>`__.

source: The correct way to implement composition in Dashing is by utilizing the ``rclcpp_components`` package.
fr: La bonne façon d'implémenter la composition dans Dashing est d'utiliser le package ``rclcpp_components``.

source: The following changes must be made to nodes in order to correctly implement runtime composition:
fr: Les modifications suivantes doivent être apportées aux nœuds afin d'implémenter correctement la composition d'exécution :

source: The Node must have a constructor that takes ``rclcpp::NodeOptions``:
fr: Le Node doit avoir un constructeur qui prend ``rclcpp::NodeOptions`` :

source: C++ registration macros (if present) need to be updated to use the ``rclcpp_components`` equivalent. If not present, registration macros must be added in one translation unit.
fr: Les macros d'enregistrement C++ (si présentes) doivent être mises à jour pour utiliser l'équivalent ``rclcpp_components``. Si elles ne sont pas présentes, les macros d'enregistrement doivent être ajoutées dans une unité de traduction.

source: CMake registration macros (if present) need to be updated. If not present, registration macros must be added to the project's CMake.
fr: Les macros d'enregistrement CMake (le cas échéant) doivent être mises à jour. Si elles ne sont pas présentes, les macros d'enregistrement doivent être ajoutées au CMake du projet.

source: For more information on composition, see `the tutorial <https://index.ros.org/doc/ros2/Tutorials/Composition/>`__
fr: Pour plus d'informations sur la composition, consultez `le tutoriel <https://index.ros.org/doc/ros2/Tutorials/Composition/>`__

source: Changes to Creating Publishers, Subscriptions, and QoS Profiles
fr: Modifications apportées à la création d'éditeurs, d'abonnements et de profils QoS

source: Prior to Dashing, you could optionally provide a ``QoSProfile`` object when creating a publisher or subscription. In an effort to encourage users to specify a history depth for message queues, we now **require** that a depth value or ``QoSProfile`` object is given when creating publishers or subscriptions.
fr: Avant Dashing, vous pouviez éventuellement fournir un objet ``QoSProfile`` lors de la création d'un éditeur ou d'un abonnement. Afin d'encourager les utilisateurs à spécifier une profondeur d'historique pour les files d'attente de messages, nous **exigeons** désormais qu'une valeur de profondeur ou un objet ``QoSProfile`` soit donné lors de la création d'éditeurs ou d'abonnements.

source: To create a publisher, previously you would have written:
fr: Pour créer un éditeur, auparavant vous auriez écrit :

source: In Dashing, prefer the following API that provides a depth value or ``QoSProfile`` object as a third positional argument:
fr: Dans Dashing, préférez l'API suivante qui fournit une valeur de profondeur ou un objet ``QoSProfile`` comme troisième argument positionnel :

source: Likewise for subscriptions, previously you would have written:
fr: De même pour les abonnements, auparavant vous auriez écrit :

source: In Dashing:
fr: En Fringant :

source: To ease the transition, users who do not use the new API will see deprecation warnings.
fr: Pour faciliter la transition, les utilisateurs qui n'utilisent pas la nouvelle API verront des avertissements d'obsolescence.

source: Furthermore, we also require that when constructing ``QoSProfile`` objects that a history policy and/or depth is set. If a history policy of ``KEEP_LAST`` is provided, then a depth argument is also required. For example, these calls are valid:
fr: De plus, nous exigeons également que lors de la construction des objets ``QoSProfile``, une politique d'historique et/ou une profondeur soient définies. Si une politique d'historique de ``KEEP_LAST`` est fournie, un argument de profondeur est également requis. Par exemple, ces appels sont valides :

source: And these calls will cause a deprecation warning:
fr: Et ces appels provoqueront un avertissement d'obsolescence :

source: See the issue and pull request related to introducing this change for more details:
fr: Consultez le problème et la demande d'extraction liés à l'introduction de ce changement pour plus de détails :

source: For details about the actual behavior change, see `Declaring Parameters`_ above. The changes are analogous to the ones in ``rclcpp``.
fr: Pour plus de détails sur le changement de comportement réel, voir `Déclaration des paramètres`_ ci-dessus. Les changements sont analogues à ceux de ``rclcpp``.

source: These are the new API methods available in ``rclpy.node.Node`` interface:
fr: Voici les nouvelles méthodes API disponibles dans l'interface ``rclpy.node.Node`` :

source: To declare parameters given a name, an optional default value (supported by ``rcl_interfaces.msg.ParameterValue``) and an optional descriptor, returning the value actually set:
fr: Pour déclarer des paramètres donnés un nom, une valeur par défaut optionnelle (supportée par ``rcl_interfaces.msg.ParameterValue``) et un descripteur optionnel, renvoyant la valeur réellement définie :

source: To undeclare previously declared parameters and to check if a parameter has been declared beforehand:
fr: Pour annuler la déclaration de paramètres précédemment déclarés et vérifier si un paramètre a été déclaré au préalable :

source: To get and set parameter descriptors:
fr: Pour obtenir et définir des descripteurs de paramètres :

source: A convenience method to get parameters that may not have been declared:
fr: Une méthode pratique pour obtenir des paramètres qui n'ont peut-être pas été déclarés :

source: Other changes
fr: Autres changements

source: ``rclpy.parameter.Parameter`` can now guess its type without explicitly setting it (as long as it's one of the supported ones by ``rcl_interfaces.msg.ParameterValue``). For example, this code:
fr: ``rclpy.parameter.Parameter`` peut maintenant deviner son type sans le définir explicitement (tant qu'il est l'un de ceux pris en charge par ``rcl_interfaces.msg.ParameterValue``). Par exemple, ce code :

source: Is equivalent to this code:
fr: Est équivalent à ce code :

source: This change does not break existing API.
fr: Cette modification n'interrompt pas l'API existante.

source: rosidl
fr: rose

source: Until Crystal each message generator package registered itself using the ``ament_cmake`` extension point ``rosidl_generate_interfaces`` and was passed a set of ``.msg`` / ``.srv`` / ``.action`` files. As of Dashing the message generation pipeline is based on ``.idl`` files instead.
fr: Jusqu'à Crystal, chaque package générateur de messages s'enregistrait en utilisant le point d'extension ``ament_cmake`` ``rosidl_generate_interfaces`` et recevait un ensemble de fichiers ``.msg`` / ``.srv`` / ``.action``. Depuis Dashing, le pipeline de génération de messages est basé sur les fichiers ``.idl`` à la place.

source: Any message generator package needs to change and register itself using the new extension point ``rosidl_generate_idl_interfaces`` which passes only ``.idl`` files instead. The message generators for the commonly supported languages C, C++, and Python as well as the typesupport packages for introspection, Fast RTPS, Connext and OpenSplice have already been updated (see `ros2/rosidl#334 <https://github.com/ros2/rosidl/pull/334/files>`__). The CMake code calling ``rosidl_generate_interfaces()`` can either pass ``.idl`` files directly or pass ``.msg`` / ``.srv`` / ``.action`` which will then internally be converted into ``.idl`` files before being passed to each message generator.
fr: Tout paquet de générateur de message doit changer et s'enregistrer en utilisant le nouveau point d'extension ``rosidl_generate_idl_interfaces`` qui ne transmet que les fichiers ``.idl`` à la place. Les générateurs de messages pour les langages couramment pris en charge C, C++ et Python ainsi que les packages de support de type pour l'introspection, Fast RTPS, Connext et OpenSplice ont déjà été mis à jour (voir `ros2/rosidl#334 <https://github.com/ ros2/rosidl/pull/334/files>`__). Le code CMake appelant ``rosidl_generate_interfaces()`` peut soit passer directement les fichiers ``.idl``, soit passer ``.msg`` / ``.srv`` / ``.action`` qui sera ensuite converti en interne dans les fichiers ``.idl`` avant d'être transmis à chaque générateur de messages.

source: The format of ``.msg`` / ``.srv`` / ``.action`` files is not being evolved in the future. The mapping between ``.msg`` / ``.srv`` / ``.action`` files and ``.idl`` files is described in `this design article <https://design.ros2.org/articles/legacy_interface_definition.html>`__. A `second design article <https://design.ros2.org/articles/idl_interface_definition.html>`__ describes the supported features in ``.idl`` files. In order to leverage any of the new features existing interfaces need to be converted (e.g. using the command line tools ``msg2idl`` / ``srv2idl`` / ``action2idl``).
fr: Le format des fichiers ``.msg`` / ``.srv`` / ``.action`` n'évoluera pas à l'avenir. Le mappage entre les fichiers ``.msg`` / ``.srv`` / ``.action`` et les fichiers ``.idl`` est décrit dans `cet article de conception <https://design.ros2.org/ articles/legacy_interface_definition.html>`__. Un `deuxième article de conception <https://design.ros2.org/articles/idl_interface_definition.html>`__ décrit les fonctionnalités prises en charge dans les fichiers ``.idl``. Afin de tirer parti des nouvelles fonctionnalités, les interfaces existantes doivent être converties (par exemple, en utilisant les outils de ligne de commande ``msg2idl`` / ``srv2idl`` / ``action2idl``).

source: To distinguish same type names, but with different namespaces, the introspection structs now contain a namespace field that replaces the package name (see `ros2/rosidl#335 <https://github.com/ros2/rosidl/pull/355/files>`_).
fr: Pour distinguer les mêmes noms de type, mais avec des espaces de noms différents, les structures d'introspection contiennent désormais un champ d'espace de noms qui remplace le nom du package (voir `ros2/rosidl#335 <https://github.com/ros2/rosidl/pull/355/files >`_).

source: Mapping of char in .msg files
fr: Mappage de caractères dans les fichiers .msg

source: In `ROS 1 <https://wiki.ros.org/msg#Fields>`__ ``char`` has been deprecated for a long time and is being mapped to ``uint8``. In ROS 2 until Crystal ``char`` was mapped to a single character (``char`` in C / C++, ``str`` with length 1 in Python) in an effort to provide a more natural mapping. As of Dashing the ROS 1 semantic has been restored and ``char`` maps to ``uint8`` again.
fr: Dans `ROS 1 <https://wiki.ros.org/msg#Fields>`__ ``char`` est obsolète depuis longtemps et est mappé sur ``uint8``. Dans ROS 2 jusqu'à Crystal, ``char`` était mappé sur un seul caractère (``char`` en C / C++, ``str`` de longueur 1 en Python) dans le but de fournir un mappage plus naturel. Depuis Dashing, la sémantique ROS 1 a été restaurée et ``char`` est à nouveau mappé sur ``uint8``.

source: The C++ data structures generated for messages, services and actions provide setter methods for each field. Until Crystal each setter returned a pointer to the data structure itself to enable the named parameter idiom. As of Dashing these setters `return a reference <https://github.com/ros2/rosidl/pull/353>`__ instead since that seems to be the more common signature as well as it clarifies that the returned value can't be a ``nullptr``.
fr: Les structures de données C++ générées pour les messages, les services et les actions fournissent des méthodes de définition pour chaque champ. Jusqu'à Crystal, chaque setter renvoyait un pointeur vers la structure de données elle-même pour activer l'idiome du paramètre nommé. À partir de Dashing, ces setters `renvoyent une référence <https://github.com/ros2/rosidl/pull/353>`__ à la place, car cela semble être la signature la plus courante et précise que la valeur renvoyée ne peut pas être un ``nullptr``.

source: Until Crystal an array (fixed size) or sequence (dynamic size, optionally with an upper boundary) field in a message was stored as a ``list`` in Python. As of Dashing the Python type for arrays / sequences of numeric values has been changed:
fr: Jusqu'à Crystal, un tableau (taille fixe) ou un champ de séquence (taille dynamique, éventuellement avec une limite supérieure) dans un message était stocké sous forme de ``liste`` en Python. Depuis Dashing, le type Python pour les tableaux/séquences de valeurs numériques a été modifié :

source: an array of numeric values is stored as a ``numpy.ndarray`` (the ``dtype`` is chosen to match the type of the numeric value)
fr: un tableau de valeurs numériques est stocké sous la forme d'un ``numpy.ndarray`` (le ``dtype`` est choisi pour correspondre au type de la valeur numérique)

source: a sequence of numeric values is stored as an ``array.array`` (the ``typename`` is chosen to match the type of the numeric value)
fr: une séquence de valeurs numériques est stockée sous la forme d'un ``array.array`` (le ``typename`` est choisi pour correspondre au type de la valeur numérique)

source: As before an array / sequence of non-numeric types is still represented as a ``list`` in Python.
fr: Comme auparavant, un tableau/séquence de types non numériques est toujours représenté sous la forme d'une ``liste`` en Python.

source: This change brings a number of benefits:
fr: Ce changement apporte plusieurs avantages :

source: The new data structures ensure that each item in the array / sequence complies with the value range restrictions of the numeric type.
fr: Les nouvelles structures de données garantissent que chaque élément du tableau/séquence est conforme aux restrictions de plage de valeurs du type numérique.

source: The numeric values can be stored more efficiently in memory which avoid the overhead of Python objects for each item.
fr: Les valeurs numériques peuvent être stockées plus efficacement en mémoire, ce qui évite la surcharge d'objets Python pour chaque élément.

source: The memory layout of both data structures allows to read and write all items of the array / sequence in a single operation which makes the conversion from and to Python significantly faster / more efficient.
fr: La disposition de la mémoire des deux structures de données permet de lire et d'écrire tous les éléments du tableau/de la séquence en une seule opération, ce qui rend la conversion de et vers Python beaucoup plus rapide/plus efficace.

source: launch
fr: lancement

source: The ``launch_testing`` package caught up with the ``launch`` package redesign done in Bouncy Bolson. The legacy Python API, already moved into the ``launch.legacy`` submodule, has thus been deprecated and removed.
fr: Le paquet ``launch_testing`` a rattrapé la refonte du paquet ``launch`` faite dans Bouncy Bolson. L'ancienne API Python, déjà déplacée dans le sous-module ``launch.legacy``, a donc été dépréciée et supprimée.

source: See ``launch`` `examples <https://github.com/ros2/launch/tree/dashing/launch/examples>`__ and `documentation <https://github.com/ros2/launch/tree/dashing/launch/doc>`__ for reference on how to use its new API.
fr: Voir ``launch`` `exemples <https://github.com/ros2/launch/tree/dashing/launch/examples>`__ et `documentation <https://github.com/ros2/launch/tree/dashing /launch/doc>`__ pour référence sur la façon d'utiliser sa nouvelle API.

source: See `demos tests <https://github.com/ros2/demos>`__ for reference on how to use the new ``launch_testing`` API.
fr: Voir `demos tests <https://github.com/ros2/demos>`__ pour savoir comment utiliser la nouvelle API ``launch_testing``.

source: Changes since the `Crystal Clemmys <Release-Crystal-Clemmys>` release:
fr: Changements depuis la version `Crystal Clemmys <Release-Crystal-Clemmys>` :

source: New API in ``rmw``, a fini function for ``rmw_context_t``:
fr: Nouvelle API dans ``rmw``, une fonction fini pour ``rmw_context_t`` :

source: Modification of ``rmw``, now passes ``rmw_context_t`` to ``rmw_create_wait_set``:
fr: Modification de ``rmw``, passe maintenant ``rmw_context_t`` à ``rmw_create_wait_set`` :

source: New APIs in ``rmw`` for preallocating space for published and subscribed messages:
fr: Nouvelles API dans ``rmw`` pour préallouer de l'espace pour les messages publiés et abonnés :

source: Modification of ``rmw``, now passes ``rmw_publisher_allocation_t`` or ``rmw_subscription_allocation_t`` to ``rmw_publish`` and ``rmw_take``, respectively. Note that this argument can be ``NULL`` or ``nullptr``, which keeps existing Crystal behavior.
fr: Modification de ``rmw``, passe maintenant ``rmw_publisher_allocation_t`` ou ``rmw_subscription_allocation_t`` à ``rmw_publish`` et ``rmw_take``, respectivement. Notez que cet argument peut être ``NULL`` ou ``nullptr``, ce qui conserve le comportement existant de Crystal.

source: `rmw_publish <https://github.com/ros2/rmw/blob/dc7b2f49f1f961d6cf2c173adc54736451be8938/rmw/include/rmw/rmw.h#L310>`_
fr: `rmw_publier <https://github.com/ros2/rmw/blob/dc7b2f49f1f961d6cf2c173adc54736451be8938/rmw/include/rmw/rmw.h#L310>`_

source: Type names returned by ``rmw_get_*_names_and_types*`` functions should have a fully-qualified namespace. For example, instead of ``rcl_interfaces/Parameter`` and ``rcl_interfaces/GetParameters``, the returned type names should be ``rcl_interface/msg/Parameter`` and ``rcl_interfaces/srv/GetParameters``.
fr: Les noms de type renvoyés par les fonctions ``rmw_get_*_names_and_types*`` doivent avoir un espace de noms complet. Par exemple, au lieu de ``rcl_interfaces/Parameter`` et ``rcl_interfaces/GetParameters``, les noms de type retournés devraient être ``rcl_interface/msg/Parameter`` et ``rcl_interfaces/srv/GetParameters``.

source: Changes to ``rclcpp_action::Client`` signatures:
fr: Modifications apportées aux signatures ``rclcpp_action::Client`` :

source: The signature of `rclcpp_action::Client::async_send_goal <https://github.com/ros2/rclcpp/blob/ef41059a751702274667e2164182c062b47c453d/rclcpp_action/include/rclcpp_action/client.hpp#L343>`_ has changed. Now users can optionally provide callback functions for the **goal response** and the **result** using the new `SendGoalOptions <https://github.com/ros2/rclcpp/blob/ef41059a751702274667e2164182c062b47c453d/rclcpp_action/include/rclcpp_action/client.hpp#L276>`_ struct. The goal response callback is called when an action server accepts or rejects the goal and the result callback is called when the result for the goal is received. Optional callbacks were also added to `rclcpp_action::Client::async_cancel_goal <https://github.com/ros2/rclcpp/blob/ef41059a751702274667e2164182c062b47c453d/rclcpp_action/include/rclcpp_action/client.hpp#L432-L434>`_ and `rclcpp_action::Client::async_get_result <https://github.com/ros2/rclcpp/blob/ef41059a751702274667e2164182c062b47c453d/rclcpp_action/include/rclcpp_action/client.hpp#L399-L401>`_.
fr: La signature de `rclcpp_action::Client::async_send_goal <https://github.com/ros2/rclcpp/blob/ef41059a751702274667e2164182c062b47c453d/rclcpp_action/include/rclcpp_action/client.hpp#L343>`_ a changé. Désormais, les utilisateurs peuvent éventuellement fournir des fonctions de rappel pour la **réponse de l'objectif** et le **résultat** à l'aide des nouvelles `SendGoalOptions <https://github.com/ros2/rclcpp/blob/ef41059a751702274667e2164182c062b47c453d/rclcpp_action/include/rclcpp_action/ client.hpp#L276>`_ structure. Le rappel de réponse d'objectif est appelé lorsqu'un serveur d'action accepte ou rejette l'objectif et le rappel de résultat est appelé lorsque le résultat de l'objectif est reçu. Des rappels facultatifs ont également été ajoutés à `rclcpp_action::Client::async_cancel_goal <https://github.com/ros2/rclcpp/blob/ef41059a751702274667e2164182c062b47c453d/rclcpp_action/include/rclcpp_action/client.hpp#L432-L434>`clpp_action/client.hpp#L432-L434>`_ et `r ::Client::async_get_result <https://github.com/ros2/rclcpp/blob/ef41059a751702274667e2164182c062b47c453d/rclcpp_action/include/rclcpp_action/client.hpp#L399-L401>`_.

source: Changes to goal transition names:
fr: Modifications apportées aux noms de transition d'objectif :

source: The names of goal state transitions have been refactored to reflect the design documention. This affects ``rcl_action``, ``rclcpp_action``, and ``rclpy``. Here is a list of the event name changes (*Old name -> New name*):
fr: Les noms des transitions d'état d'objectif ont été refactorisés pour refléter la documentation de conception. Cela affecte ``rcl_action``, ``rclcpp_action`` et ``rclpy``. Voici une liste des changements de nom d'événement (*Ancien nom -> Nouveau nom*) :

source: GOAL_EVENT_SET_SUCCEEDED -> GOAL_EVENT_SUCCEED
fr: OBJECTIF_EVENT_SET_SUCCEED -> OBJECTIF_EVENT_SUCCEED

source: Changes to ``CancelGoal.srv``:
fr: Modifications apportées à ``CancelGoal.srv`` :

source: A ``return_code`` field was added to the response message of the ``CancelGoal`` service. This is to better communicate a reason for a failed service call. See the `pull request <https://github.com/ros2/rcl_interfaces/pull/76>`_ and connected issue for details.
fr: Un champ ``return_code`` a été ajouté au message de réponse du service ``CancelGoal``. Il s'agit de mieux communiquer la raison d'un appel de service ayant échoué. Voir la `demande d'extraction <https://github.com/ros2/rcl_interfaces/pull/76>`_ et le problème connexe pour plus de détails.

source: rviz
fr: voir
