Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Releases/Release-Bouncy-Bolson.po
Languages: fr

source: Bouncy Bolson (``bouncy``)
fr: Bouncy Bolson (``rebondissant``)

source: Table of Contents
fr: Table des matières

source: *Bouncy Bolson* is the second release of ROS 2.
fr: *Bouncy Bolson* est la deuxième version de ROS 2.

source: Supported Platforms
fr: Plates-formes prises en charge

source: This version of ROS 2 is supported on four platforms (see `REP 2000 <https://www.ros.org/reps/rep-2000.html#bouncy-bolson-june-2018-june-2019>`__ for full details):
fr: Cette version de ROS 2 est prise en charge sur quatre plateformes (voir `REP 2000 <https://www.ros.org/reps/rep-2000.html#bouncy-bolson-june-2018-june-2019>`__ pour détails):

source: Ubuntu 18.04 (Bionic)
fr: Ubuntu 18.04 (Bionique)

source: Debian packages for amd64 as well as arm64
fr: Paquets Debian pour amd64 ainsi que arm64

source: Ubuntu 16.04 (Xenial)
fr: Ubuntu 16.04 (Xénial)

source: no Debian packages but building from source is supported
fr: pas de packages Debian mais la construction à partir des sources est prise en charge

source: Windows 10 with Visual Studio 2017
fr: Windows 10 avec Visual Studio 2017

source: Binary packages as well as instructions for how to compile from source are provided (see `install instructions <../../Installation>` as well as `documentation <https://docs.ros2.org/bouncy/>`__).
fr: Des packages binaires ainsi que des instructions sur la façon de compiler à partir des sources sont fournis (voir `instructions d'installation <../../Installation>` ainsi que `documentation <https://docs.ros2.org/bouncy/>`__ ).

source: Features
fr: Caractéristiques

source: New features in this ROS 2 release
fr: Nouvelles fonctionnalités de cette version de ROS 2

source: `New launch system <../Tutorials/Intermediate/Launch/Launch-system>` featuring a much more capable and flexible Python API.
fr: `Nouveau système de lancement <../Tutorials/Intermediate/Launch/Launch-system>` avec une API Python beaucoup plus performante et flexible.

source: Parameters can be passed as `command line arguments <../How-To-Guides/Node-arguments>` to C++ executables.
fr: Les paramètres peuvent être passés comme `arguments de ligne de commande <../How-To-Guides/Node-arguments>` aux exécutables C++.

source: Static remapping via `command line arguments <../How-To-Guides/Node-arguments>`.
fr: Remappage statique via `arguments de ligne de commande <../How-To-Guides/Node-arguments>`.

source: Various improvements to the Python client library.
fr: Diverses améliorations de la bibliothèque cliente Python.

source: Support for publishing and subscribing to serialized data. This is the foundation for the upcoming work towards a native rosbag implementation.
fr: Prise en charge de la publication et de l'abonnement aux données sérialisées. C'est la base des travaux à venir vers une implémentation native de rosbag.

source: More `command line tools <../../Concepts/About-Command-Line-Tools>`\ , e.g. for working with parameters and lifecycle states.
fr: Plus d'outils de ligne de commande <../../Concepts/About-Command-Line-Tools>`\ , par ex. pour travailler avec les paramètres et les états du cycle de vie.

source: Binary packages / fat archives support three RMW implementations by default (without the need to build from source):
fr: Les packages binaires / archives grasses prennent en charge trois implémentations RMW par défaut (sans qu'il soit nécessaire de compiler à partir des sources) :

source: eProsima's Fast RTPS (default)
fr: Fast RTPS d'eProsima (par défaut)

source: RTI's Connext
fr: RTI Connect

source: ADLINK's OpenSplice
fr: OpenSplice d'ADLINK

source: For an overview of all features available, including those from earlier releases, please see the `Features <../../The-ROS2-Project/Features>` page.
fr: Pour un aperçu de toutes les fonctionnalités disponibles, y compris celles des versions précédentes, veuillez consulter la page `Features <../../The-ROS2-Project/Features>`.

source: Changes since the Ardent release
fr: Changements depuis la sortie d'Ardent

source: Changes since the `Ardent Apalone <Release-Ardent-Apalone>` release:
fr: Changements depuis la version `Ardent Apalone <Release-Ardent-Apalone>` :

source: The Python package ``launch`` has been redesigned. The previous Python API has been moved into a submodule ``launch.legacy``. You can update existing launch files to continue to use the legacy API if a transition to the new Python API is not desired.
fr: Le package Python ``launch`` a été repensé. L'API Python précédente a été déplacée dans un sous-module ``launch.legacy``. Vous pouvez mettre à jour les fichiers de lancement existants pour continuer à utiliser l'ancienne API si une transition vers la nouvelle API Python n'est pas souhaitée.

source: The ROS topic names containing namespaces are mapped to DDS topics including their namespaces. DDS partitions are not being used anymore for this.
fr: Les noms de rubrique ROS contenant des espaces de noms sont mappés aux rubriques DDS, y compris leurs espaces de noms. Les partitions DDS ne sont plus utilisées pour cela.

source: The recommended build tool is now ``colcon`` instead of ``ament_tools``. This switch has no `implications <https://design.ros2.org/articles/build_tool.html#implications>`__ for the code in each ROS 2 package. The install instructions have been updated and the `read-the-docs page <https://colcon.readthedocs.io/en/main/migration/ament_tools.html>`__ describes how to map an existing ``ament_tools`` call to ``colcon``.
fr: L'outil de construction recommandé est maintenant ``colcon`` au lieu de ``ament_tools``. Ce commutateur n'a aucune `implication <https://design.ros2.org/articles/build_tool.html#implications>`__ pour le code de chaque package ROS 2. Les instructions d'installation ont été mises à jour et la page `read-the-docs <https://colcon.readthedocs.io/en/main/migration/ament_tools.html>`__ décrit comment mapper un appel ``ament_tools`` existant à ``colcon``.

source: The argument order of `this rclcpp::Node::create_subscription() signature <https://docs.ros2.org/bouncy/api/rclcpp/classrclcpp_1_1_node.html#a283fb006c46470cf43a4ae5ef4a16ccd>`__ has been modified.
fr: L'ordre des arguments de `cette signature rclcpp::Node::create_subscription() <https://docs.ros2.org/bouncy/api/rclcpp/classrclcpp_1_1_node.html#a283fb006c46470cf43a4ae5ef4a16ccd>`__ a été modifié.

source: Known Issues
fr: Problèmes connus

source: New-style launch files `may hang on shutdown <https://github.com/ros2/launch/issues/89>`__ for some combinations of platform and RMW implementation.
fr: Les fichiers de lancement de nouveau style `peuvent se bloquer à l'arrêt <https://github.com/ros2/launch/issues/89>`__ pour certaines combinaisons de plate-forme et d'implémentation RMW.

source: Static remapping of namespaces `not working correctly <https://github.com/ros2/rcl/issues/262>`__ when addressed to a particular node.
fr: Le remappage statique des espaces de noms `ne fonctionne pas correctement <https://github.com/ros2/rcl/issues/262>`__ lorsqu'il est adressé à un nœud particulier.

source: `Opensplice error messages may be printed <https://github.com/ros2/rmw_opensplice/issues/237>`__ when using ``ros2 param`` and ``ros2 lifecycle`` command-line tools.
fr: `Les messages d'erreur Opensplice peuvent être imprimés <https://github.com/ros2/rmw_opensplice/issues/237>`__ lors de l'utilisation des outils de ligne de commande ``ros2 param`` et ``ros2 lifecycle``.
