Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Releases/Release-Humble-Hawksbill.po
Languages: fr

source: The deprecated ``use_tf_static`` parameter has been removed from ``robot_state_publisher``. This means that static transforms are unconditionally published to the ``/tf_static`` topic, and that the static transforms are published in a ``transient_local`` Quality of Service. This was the default behavior, and the behavior which the ``tf2_ros::TransformListener`` class expected before, so most code will not have to be changed. Any code that was relying on ``robot_state_publisher`` to periodically publish static transforms to ``/tf`` will have to be updated to subscribe to ``/tf_static`` as a ``transient_local`` subscription instead.
fr: Le paramètre obsolète ``use_tf_static`` a été supprimé de ``robot_state_publisher``. Cela signifie que les transformations statiques sont publiées inconditionnellement dans le sujet ``/tf_static``, et que les transformations statiques sont publiées dans une qualité de service ``transient_local``. C'était le comportement par défaut, et le comportement que la classe ``tf2_ros::TransformListener`` attendait auparavant, donc la plupart du code n'aura pas à être modifié. Tout code qui s'appuyait sur ``robot_state_publisher`` pour publier périodiquement des transformations statiques sur ``/tf`` devra être mis à jour pour s'abonner à ``/tf_static`` en tant qu'abonnement ``transient_local`` à la place.

source: Deprecation of ``rosidl_target_interfaces()``
fr: Dépréciation de ``rosidl_target_interfaces()``

source: The CMake function ``rosidl_target_interfaces()`` has been deprecated, and now issues a CMake warning when called. Users wanting to use messages/services/actions in the same ROS package that generated them should instead call ``rosidl_get_typesupport_target()`` and then ``target_link_libraries()`` to make their targets depend on the returned typesupport target. See https://github.com/ros2/rosidl/pull/606 for more details, and https://github.com/ros2/demos/pull/529 for an example of using the new function.
fr: La fonction CMake ``rosidl_target_interfaces()`` est obsolète et émet désormais un avertissement CMake lorsqu'elle est appelée. Les utilisateurs souhaitant utiliser des messages/services/actions dans le même package ROS qui les a générés doivent plutôt appeler ``rosidl_get_typesupport_target()`` puis ``target_link_libraries()`` pour que leurs cibles dépendent de la cible typesupport renvoyée. Voir https://github.com/ros2/rosidl/pull/606 pour plus de détails, et https://github.com/ros2/demos/pull/529 pour un exemple d'utilisation de la nouvelle fonction.

source: `improved the efficiency of 3-bytes pixel formats <https://github.com/ros2/rviz/pull/743>`__
fr: `amélioré l'efficacité des formats de pixels de 3 octets <https://github.com/ros2/rviz/pull/743>`__

source: `changed the way inertias are computed to use ignition math rather than Ogre's math libraries <https://github.com/ros2/rviz/pull/751>`__.
fr: `a changé la façon dont les inerties sont calculées pour utiliser les mathématiques d'allumage plutôt que les bibliothèques mathématiques d'Ogre <https://github.com/ros2/rviz/pull/751>`__.

source: geometry2
fr: géométrie2

source: Deprecation of TF2Error::NO_ERROR, etc
fr: Abandon de TF2Error::NO_ERROR, etc.

source: The ``tf2`` library uses an enumeration called ``TF2Error`` to return errors. Unfortunately, one of the enumerators in there is called ``NO_ERROR``, which conflicts with a macro on Windows. To remedy this, a new set of enumerators in ``TF2Error`` were created, each with a ``TF2`` prefix. The previous enumerators are still available, but are now deprecated and will print a deprecation warning if used. All code that uses the ``TF2Error`` enumerator should be updated to use the new ``TF2`` prefixed errors. See https://github.com/ros2/geometry2/pull/349 for more details.
fr: La bibliothèque ``tf2`` utilise une énumération appelée ``TF2Error`` pour renvoyer les erreurs. Malheureusement, l'un des énumérateurs s'appelle ``NO_ERROR``, ce qui entre en conflit avec une macro sous Windows. Pour remédier à cela, un nouvel ensemble d'énumérateurs dans ``TF2Error`` a été créé, chacun avec un préfixe ``TF2``. Les énumérateurs précédents sont toujours disponibles, mais sont désormais obsolètes et imprimeront un avertissement d'obsolescence s'ils sont utilisés. Tout code qui utilise l'énumérateur ``TF2Error`` doit être mis à jour pour utiliser les nouvelles erreurs préfixées ``TF2``. Voir https://github.com/ros2/geometry2/pull/349 pour plus de détails.

source: More intuitive command-line arguments for static_transform_publisher
fr: Arguments de ligne de commande plus intuitifs pour static_transform_publisher

source: The ``static_transform_publisher`` program used to take arguments like: ``ros2 run tf2_ros static_transform_publisher 0 0 0 0 0 0 1 foo bar``. The first three numbers are the translation x, y, and z, the next 4 are the quaternion x, y, z, and w, and the last two arguments are the parent and child frame IDs. While this worked, it had a couple of problems:
fr: Le programme ``static_transform_publisher`` prenait des arguments comme : ``ros2 run tf2_ros static_transform_publisher 0 0 0 0 0 0 1 foo bar``. Les trois premiers nombres sont la traduction x, y et z, les 4 suivants sont le quaternion x, y, z et w, et les deux derniers arguments sont les ID de cadre parent et enfant. Bien que cela fonctionnait, il y avait quelques problèmes:

source: The user had to specify *all* of the arguments, even if only setting one number
fr: L'utilisateur devait spécifier *tous* les arguments, même s'il ne définissait qu'un seul nombre

source: Reading the command-line to figure out what it was publishing was tricky
fr: Lire la ligne de commande pour comprendre ce qu'elle publiait était délicat

source: To fix both of these issues, the command-line handling has been changed to use flags instead, and all flags except for ``--frame-id`` and ``--child-frame-id`` are optional. Thus, the above command-line can be simplified to: ``ros2 run tf2_ros static_transform_publisher --frame-id foo --child-frame-id bar`` To change just the translation x, the command-line would be: ``ros2 run tf2_ros static_transform_publisher --x 1.5 --frame-id foo --child-frame-id bar``.
fr: Pour résoudre ces deux problèmes, la gestion de la ligne de commande a été modifiée pour utiliser des drapeaux à la place, et tous les drapeaux sauf ``--frame-id`` et ``--child-frame-id`` sont facultatifs. Ainsi, la ligne de commande ci-dessus peut être simplifiée en : ``ros2 run tf2_ros static_transform_publisher --frame-id foo --child-frame-id bar`` Pour modifier uniquement la traduction x, la ligne de commande serait : `` ros2 exécutez tf2_ros static_transform_publisher --x 1.5 --frame-id foo --child-frame-id bar``.

source: The old-style arguments are still allowed in this release, but are deprecated and will print a warning. They will be removed in future releases. See https://github.com/ros2/geometry2/pull/392 for more details.
fr: Les arguments de style ancien sont toujours autorisés dans cette version, mais sont obsolètes et afficheront un avertissement. Ils seront supprimés dans les prochaines versions. Voir https://github.com/ros2/geometry2/pull/392 pour plus de détails.

source: Transform listener spin thread no longer executes node callbacks
fr: Le thread de rotation de l'écouteur de transformation n'exécute plus les rappels de nœud

source: ``tf2_ros::TransformListener`` no longer spins on the provided node object. Instead, it creates a callback group to execute callbacks on the entities it creates internally. This means if you have set the parameter ``spin_thread=true`` when creating a transform listener, you can no longer depend on your own callbacks to be executed. You must call a ``spin`` function on your node (e.g. ``rclcpp::spin``), or add your node to your own executor.
fr: ``tf2_ros::TransformListener`` ne tourne plus sur l'objet nœud fourni. Au lieu de cela, il crée un groupe de rappel pour exécuter des rappels sur les entités qu'il crée en interne. Cela signifie que si vous avez défini le paramètre ``spin_thread=true`` lors de la création d'un écouteur de transformation, vous ne pouvez plus dépendre de l'exécution de vos propres rappels. Vous devez appeler une fonction ``spin`` sur votre nœud (par exemple ``rclcpp::spin``), ou ajouter votre nœud à votre propre exécuteur.

source: Related pull request: `geometry2#442 <https://github.com/ros2/geometry2/pull/442>`_
fr: Requête d'extraction associée : `geometry2#442 <https://github.com/ros2/geometry2/pull/442>`_

source: New playback and recording controls
fr: Nouvelles commandes de lecture et d'enregistrement

source: Several pull requests have been added to enhance the user's control over playback of bags. Pull request `931 <https://github.com/ros2/rosbag2/pull/931>`_ adds the ability to specify a time stamp to begin playing from. Due to pull request `789 <https://github.com/ros2/rosbag2/pull/789>`_ it is now possible to delay the start of playback by a specified interval.
fr: Plusieurs demandes d'extraction ont été ajoutées pour améliorer le contrôle de l'utilisateur sur la lecture des sacs. Pull request `931 <https://github.com/ros2/rosbag2/pull/931>`_ ajoute la possibilité de spécifier un horodatage à partir duquel commencer à jouer. En raison de la demande d'extraction `789 <https://github.com/ros2/rosbag2/pull/789>`_, il est désormais possible de retarder le début de la lecture d'un intervalle spécifié.

source: Relatedly, ``rosbag2`` has gained new ways for users to control playback as it is happening. Pull request `847 <https://github.com/ros2/rosbag2/pull/847>`_ adds keyboard controls for pausing, resuming, and playing the next message during playback from a terminal. It is also possible to start playback paused thanks to pull requests `905 <https://github.com/ros2/rosbag2/pull/905>`_ and `904 <https://github.com/ros2/rosbag2/pull/904>`_, which makes it easy for the user to initiate playback and then step through messages, such as when debugging a pipeline. Pull request `836 <https://github.com/ros2/rosbag2/pull/836>`_ adds an interface for seeking within bags, allowing the user to move around within a bag during playback.
fr: De même, ``rosbag2`` a gagné de nouvelles façons pour les utilisateurs de contrôler la lecture en cours. Pull request `847 <https://github.com/ros2/rosbag2/pull/847>`_ ajoute des commandes au clavier pour mettre en pause, reprendre et lire le message suivant pendant la lecture à partir d'un terminal. Il est également possible de démarrer la lecture en pause grâce aux pull requests `905 <https://github.com/ros2/rosbag2/pull/905>`_ et `904 <https://github.com/ros2/rosbag2/pull /904>`_, ce qui permet à l'utilisateur de lancer facilement la lecture, puis de parcourir les messages, par exemple lors du débogage d'un pipeline. Pull request `836 <https://github.com/ros2/rosbag2/pull/836>`_ ajoute une interface pour rechercher dans les sacs, permettant à l'utilisateur de se déplacer dans un sac pendant la lecture.

source: Finally, a new snapshot mode has been added to recording in pull request `851 <https://github.com/ros2/rosbag2/pull/851>`_. This mode, useful for incident recording, allows recording to begin filling up buffers, but not begin writing data to disc until a service is called.
fr: Enfin, un nouveau mode snapshot a été ajouté à l'enregistrement dans la pull request `851 <https://github.com/ros2/rosbag2/pull/851>`_. Ce mode, utile pour l'enregistrement d'incidents, permet à l'enregistrement de commencer à remplir les tampons, mais pas de commencer à écrire des données sur le disque tant qu'un service n'est pas appelé.

source: Burst-mode playback
fr: Lecture en mode rafale

source: While the playback of data from a bag in real-time is the most well-known use case for bag files, there are situations where you want the data in the bag as fast as possible. With pull request `977 <https://github.com/ros2/rosbag2/pull/977>`_, ``rosbag2`` has gained the ability to "burst" data from the bag. In burst mode, the data is played back as fast as possible. This is useful in applications such as machine learning.
fr: Bien que la lecture des données d'un sac en temps réel soit le cas d'utilisation le plus connu pour les fichiers de sac, il existe des situations où vous souhaitez que les données du sac soient aussi rapides que possible. Avec la pull request `977 <https://github.com/ros2/rosbag2/pull/977>`_, ``rosbag2`` a acquis la capacité de "faire éclater" les données du sac. En mode rafale, les données sont lues aussi rapidement que possible. Ceci est utile dans des applications telles que l'apprentissage automatique.

source: Zero-Copy playback
fr: Lecture sans copie

source: By default, if loaned message can be used, playback messages are published as loaned message. This can help to reduce the number of data copies, so there is a greater benefit for sending big data. Pull request `981 <https://github.com/ros2/rosbag2/pull/981>`_ adds ``--disable-loan-message`` option for playback.
fr: Par défaut, si un message prêté peut être utilisé, les messages de lecture sont publiés en tant que message prêté. Cela peut aider à réduire le nombre de copies de données, il y a donc un plus grand avantage pour l'envoi de données volumineuses. Pull request `981 <https://github.com/ros2/rosbag2/pull/981>`_ ajoute l'option ``--disable-loan-message`` pour la lecture.

source: Wait for an acknowledgment
fr: Attendre un accusé de réception

source: This new option will wait until all published messages are acknowledged by all subscribers or until the timeout elapses in millisecond before play is terminated. Especially for the case of sending message with big size in a short time. This option is valid only if the publisher's QOS profile is RELIABLE. Pull request `951 <https://github.com/ros2/rosbag2/pull/951>`_ adds ``--wait-for-all-acked`` option for playback.
fr: Cette nouvelle option attendra que tous les messages publiés soient reconnus par tous les abonnés ou que le délai d'attente se soit écoulé en millisecondes avant la fin de la lecture. Surtout pour le cas de l'envoi d'un message de grande taille en peu de temps. Cette option n'est valide que si le profil QOS de l'éditeur est FIABLE. Pull request `951 <https://github.com/ros2/rosbag2/pull/951>`_ ajoute l'option ``--wait-for-all-acked`` pour la lecture.

source: Bag editing
fr: Édition de sac

source: ``rosbag2`` is taking steps towards enabling the editing of bags, such as removing all messages for one topic or merging multiple bags into a single bag. Pull request `921 <https://github.com/ros2/rosbag2/pull/921>`_ adds bag rewriting and the ``ros2 bag convert`` verb.
fr: ``rosbag2`` prend des mesures pour permettre la modification des sacs, comme la suppression de tous les messages pour un sujet ou la fusion de plusieurs sacs en un seul sac. Pull request `921 <https://github.com/ros2/rosbag2/pull/921>`_ ajoute la réécriture de sac et le verbe ``ros2 bag convert``.

source: Other changes
fr: Autres changements

source: Pull request `925 <https://github.com/ros2/rosbag2/pull/925>`_ makes ``rosbag2`` ignore "leaf topics" (topics without a publisher) when recording. These topics will no longer be automatically added to the bag.
fr: La requête d'extraction `925 <https://github.com/ros2/rosbag2/pull/925>`_ fait en sorte que ``rosbag2`` ignore les "sujets feuilles" (sujets sans éditeur) lors de l'enregistrement. Ces sujets ne seront plus automatiquement ajoutés au panier.

source: Known Issues
fr: Problèmes connus

source: When `installing ROS 2 on an Ubuntu 22.04 Jammy host <../../humble/Installation/Ubuntu-Install-Debians.html>`__ it is important to update your system before installing ROS 2 packages. It is *particularly* important to make sure that ``systemd`` and ``udev`` are updated to the latest available version otherwise installing ``ros-humble-desktop``, which depends on ``libudev1``, could cause the removal of system critical packages. Details can be found in `ros2/ros2#1272 <https://github.com/ros2/ros2/issues/1272>`_ and `Launchpad #1974196 <https://bugs.launchpad.net/ubuntu/+source/systemd/+bug/1974196>`_
fr: Lors de l'`installation de ROS 2 sur un hôte Ubuntu 22.04 Jammy <../../humble/Installation/Ubuntu-Install-Debians.html>`__, il est important de mettre à jour votre système avant d'installer les packages ROS 2. Il est *particulièrement* important de s'assurer que ``systemd`` et ``udev`` sont mis à jour vers la dernière version disponible, sinon l'installation de ``ros-humble-desktop``, qui dépend de ``libudev1``, pourrait entraîner la suppression des packages critiques du système. Les détails peuvent être trouvés dans `ros2/ros2#1272 <https://github.com/ros2/ros2/issues/1272>`_ et `Launchpad #1974196 <https://bugs.launchpad.net/ubuntu/+source /systemd/+bug/1974196>`_

source: When ROS 2 apt repositories are available, ROS 1 packages in Ubuntu are not installable. See the :doc:`ros1_bridge on Ubuntu Jammy <../How-To-Guides/Using-ros1_bridge-Jammy-upstream>` document for more information.
fr: Lorsque les référentiels ROS 2 apt sont disponibles, les packages ROS 1 dans Ubuntu ne peuvent pas être installés. Consultez le document :doc:`ros1_bridge on Ubuntu Jammy <../How-To-Guides/Using-ros1_bridge-Jammy-upstream>` pour plus d'informations.

source: Some major Linux distributions have started patching Python to install packages to ``/usr/local``, which is breaking some parts of ``ament_package`` and builds with ``colcon``. In particular, using Ubuntu Jammy with ``setuptools`` installed from pip will manifest this misbehavior, and is therefore not recommended. There is currently a `proposed solution <https://github.com/colcon/colcon-core/pull/512>`_ which requires further testing before widespread release.
fr: Certaines distributions Linux majeures ont commencé à patcher Python pour installer des packages dans ``/usr/local``, ce qui casse certaines parties de ``ament_package`` et construit avec ``colcon``. En particulier, l'utilisation d'Ubuntu Jammy avec ``setuptools`` installé à partir de pip manifestera ce mauvais comportement et n'est donc pas recommandé. Il existe actuellement une `solution proposée <https://github.com/colcon/colcon-core/pull/512>`_ qui nécessite des tests supplémentaires avant une diffusion généralisée.

source: ROS 2 bags that are split by size or duration are not played correctly. Only the last bag recorded is played. It is recommended to avoid splitting bags by size or duration. Details can be found in `ros2/rosbag2#966 <https://github.com/ros2/rosbag2/issues/966>`__.
fr: Les sacs ROS 2 divisés par taille ou durée ne sont pas lus correctement. Seul le dernier sac enregistré est joué. Il est recommandé d'éviter de diviser les sacs par taille ou durée. Les détails peuvent être trouvés dans `ros2/rosbag2#966 <https://github.com/ros2/rosbag2/issues/966>`__.

source: Release Timeline
fr: Calendrier de publication

source: Preliminary testing and stabilization of ROS Base [1]_ packages, and API and feature freeze for RMW provider packages.
fr: Tests préliminaires et stabilisation des packages ROS Base [1]_, et API et gel des fonctionnalités pour les packages du fournisseur RMW.

source: Mon. April 4, 2022 - Freeze
fr: Lun. 4 avril 2022 - Gel

source: API and feature freeze for ROS Base [1]_ packages in Rolling Ridley. Only bug fix releases should be made after this point. New packages can be released independently.
fr: API et gel des fonctionnalités pour les packages ROS Base [1]_ dans Rolling Ridley. Seules les versions de correctifs de bogues doivent être effectuées après ce point. De nouveaux packages peuvent être publiés indépendamment.

source: Branch from Rolling Ridley. ``rosdistro`` is reopened for Rolling PRs for ROS Base [1]_ packages. Humble development shifts from ``ros-rolling-*`` packages to ``ros-humble-*`` packages.
fr: Succursale de Rolling Ridley. ``rosdistro`` est rouvert pour Rolling PRs pour les packages ROS Base [1]_. Le développement humble passe des packages ``ros-rolling-*`` aux packages ``ros-humble-*``.

source: Updated releases of ROS Desktop [2]_ packages available. Call for general testing.
fr: Versions mises à jour des packages ROS Desktop [2]_ disponibles. Appel pour des tests généraux.

source: Mon. May 16, 2022 - Release Candidate
fr: Lun. 16 mai 2022 - Candidat à la libération

source: Release Candidate packages are built. Updated releases of ROS Desktop [2]_ packages available.
fr: Les packages Release Candidate sont créés. Versions mises à jour des packages ROS Desktop [2]_ disponibles.

source: Thu. May 19, 2022 - Distro Freeze
fr: Jeu. 19 mai 2022 - Distro Freeze

source: Freeze rosdistro. No PRs for Humble on the ``rosdistro`` repo will be merged (reopens after the release announcement).
fr: Geler rosdistro. Aucun PR pour Humble sur le repo ``rosdistro`` ne sera fusionné (réouverture après l'annonce de la sortie).

source: Mon. May 23, 2022 - General Availability
fr: Lun. 23 mai 2022 - Disponibilité générale

source: Release announcement. ``rosdistro`` is reopened for Humble PRs.
fr: Annonce de sortie. ``rosdistro`` est rouvert pour les Humble PRs.

source: The ``ros_base`` variant is described in `REP 2001 (ros-base) <https://www.ros.org/reps/rep-2001.html#ros-base>`_.
fr: La variante ``ros_base`` est décrite dans `REP 2001 (ros-base) <https://www.ros.org/reps/rep-2001.html#ros-base>`_.

source: The ``desktop`` variant is described in `REP 2001 (desktop-variants) <https://www.ros.org/reps/rep-2001.html#desktop-variants>`_.
fr: La variante ``desktop`` est décrite dans `REP 2001 (desktop-variants) <https://www.ros.org/reps/rep-2001.html#desktop-variants>`_.
