Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Releases/Release-Galactic-Geochelone.po
Languages: fr

source: Galactic Geochelone (``galactic``)
fr: Géochelone Galactique (``galactique``)

source: Table of Contents
fr: Table des matières

source: *Galactic Geochelone* is the seventh release of ROS 2. What follows is highlights of the important changes and features in Galactic Geochelone since the last release. For a list of all of the changes since Foxy, see the `long form changelog <Galactic-Geochelone-Complete-Changelog>`.
fr: * Galactic Geochelone * est la septième version de ROS 2. Ce qui suit présente les points saillants des changements et fonctionnalités importants de Galactic Geochelone depuis la dernière version. Pour une liste de toutes les modifications depuis Foxy, consultez le `long form changelog <Galactic-Geochelone-Complete-Changelog>`.

source: Supported Platforms
fr: Plates-formes prises en charge

source: Galactic Geochelone is primarily supported on the following platforms:
fr: Galactic Geochelone est principalement pris en charge sur les plates-formes suivantes :

source: Tier 1 platforms:
fr: Plateformes de niveau 1 :

source: Ubuntu 20.04 (Focal): ``amd64`` and ``arm64``
fr: Ubuntu 20.04 (Focal) : ``amd64`` et ``arm64``

source: Tier 2 platforms:
fr: Plateformes de niveau 2 :

source: Tier 3 platforms:
fr: Plateformes de niveau 3 :

source: Debian Bullseye (11): ``amd64``, ``arm64`` and ``arm32``
fr: Debian Bullseye (11) : ``amd64``, ``arm64`` et ``arm32``

source: OpenEmbedded Thud (2.6) / webOS OSE: ``arm32`` and ``arm64``
fr: OpenEmbedded Thud (2.6) / webOS OSE : ``arm32`` et ``arm64``

source: For more information about RMW implementations, compiler / interpreter versions, and system dependency versions see `REP 2000 <https://www.ros.org/reps/rep-2000.html>`__.
fr: Pour plus d'informations sur les implémentations RMW, les versions du compilateur/interpréteur et les versions des dépendances système, consultez `REP 2000 <https://www.ros.org/reps/rep-2000.html>`__.

source: `Install Galactic Geochelone <../../../galactic/Installation.html>`__
fr: `Installer Galactic Geochelone <../../../galactic/Installation.html>`__

source: New features in this ROS 2 release
fr: Nouvelles fonctionnalités de cette version de ROS 2

source: Ability to specify per-logger log levels
fr: Possibilité de spécifier des niveaux de journalisation par enregistreur

source: It is now possible to specify different logging levels for different loggers on the command line:
fr: Il est désormais possible de spécifier différents niveaux de journalisation pour différents loggers sur la ligne de commande :

source: The above command sets a global log level of WARN, but sets the log level of the talker node messages to DEBUG. The ``--log-level`` command-line option can be passed an arbitrary number of times to set different log levels for each logger.
fr: La commande ci-dessus définit un niveau de journalisation global de WARN, mais définit le niveau de journalisation des messages du nœud locuteur sur DEBUG. L'option de ligne de commande ``--log-level`` peut être passée un nombre arbitraire de fois pour définir différents niveaux de journalisation pour chaque enregistreur.

source: Ability to configure logging directory through environment variables
fr: Possibilité de configurer le répertoire de journalisation via des variables d'environnement

source: It is now possible to configure the logging directory through two environment variables: ``ROS_LOG_DIR`` and ``ROS_HOME``. The logic is as follows:
fr: Il est désormais possible de configurer le répertoire de journalisation via deux variables d'environnement : ``ROS_LOG_DIR`` et ``ROS_HOME``. La logique est la suivante:

source: Use ``$ROS_LOG_DIR`` if ``ROS_LOG_DIR`` is set and not empty.
fr: Utilisez ``$ROS_LOG_DIR`` si ``ROS_LOG_DIR`` est défini et non vide.

source: Otherwise, use ``$ROS_HOME/log``, using ``~/.ros`` for ``ROS_HOME`` if not set or if empty.
fr: Sinon, utilisez ``$ROS_HOME/log``, en utilisant ``~/.ros`` pour ``ROS_HOME`` s'il n'est pas défini ou s'il est vide.

source: Thus the default value stays the same: ``~/.ros/log``.
fr: Ainsi la valeur par défaut reste la même : ``~/.ros/log``.

source: Related PRs: `ros2/rcl_logging#53 <https://github.com/ros2/rcl_logging/pull/53>`_ and `ros2/launch#460 <https://github.com/ros2/launch/pull/460>`_.
fr: PR associés : `ros2/rcl_logging#53 <https://github.com/ros2/rcl_logging/pull/53>`_ et `ros2/launch#460 <https://github.com/ros2/launch/pull/ 460>`_.

source: For example:
fr: Par exemple:

source: Will place all logs in ``/tmp/foo``.
fr: Placera tous les journaux dans ``/tmp/foo``.

source: Will place all logs in ``/path/to/home/log``.
fr: Placera tous les journaux dans ``/path/to/home/log``.

source: Ability to invoke ``rosidl`` pipeline outside CMake
fr: Possibilité d'invoquer le pipeline ``rosidl`` en dehors de CMake

source: It is now straightforward to invoke the ``rosidl`` interface generation pipeline outside CMake. Source code generators and interface definition translators are accessible through a unified command line interface.
fr: Il est maintenant simple d'invoquer le pipeline de génération d'interface ``rosidl`` en dehors de CMake. Les générateurs de code source et les traducteurs de définition d'interface sont accessibles via une interface de ligne de commande unifiée.

source: For example, given a ``Demo`` message in some ``demo`` package like:
fr: Par exemple, étant donné un message ``Demo`` dans un package ``demo`` comme :

source: it is easy to generate C, C++, and Python support source code:
fr: il est facile de générer du code source compatible C, C++ et Python :

source: Generated source code will be put in the ``gen`` directory.
fr: Le code source généré sera placé dans le répertoire ``gen``.

source: One may also translate the message definition to a different format for a third-party code generation tool to consume:
fr: On peut également traduire la définition du message dans un format différent pour qu'un outil de génération de code tiers l'utilise :

source: The translated message definition will be put in the ``gen`` directory.
fr: La définition du message traduit sera placée dans le répertoire ``gen``.

source: Note that these tools generate sources but do not build it -- that responsibility is still on the caller. This is a first step towards enabling ``rosidl`` interface generation in build systems other than CMake. See the `design document <https://github.com/ros2/design/pull/310>`_ for further reference and next steps.
fr: Notez que ces outils génèrent des sources mais ne les construisent pas - cette responsabilité incombe toujours à l'appelant. Il s'agit d'un premier pas vers l'activation de la génération d'interface ``rosidl`` dans des systèmes de construction autres que CMake. Voir le `document de conception <https://github.com/ros2/design/pull/310>`_ pour plus de référence et les prochaines étapes.

source: Externally configure QoS at start-up
fr: Configurer la QoS en externe au démarrage

source: It is now possible to externally configure the QoS settings for a node at start-up time. QoS settings are **not** configurable during runtime; they are only configurable at start-up. Node authors must opt-in to enable changing QoS settings at start-up. If the feature is enabled on a node, then QoS settings can be set with ROS parameters when a node first starts.
fr: Il est désormais possible de configurer en externe les paramètres QoS d'un nœud au démarrage. Les paramètres QoS ne sont **pas** configurables pendant l'exécution ; ils ne sont configurables qu'au démarrage. Les auteurs de nœuds doivent s'inscrire pour activer la modification des paramètres QoS au démarrage. Si la fonction est activée sur un nœud, les paramètres QoS peuvent être définis avec les paramètres ROS lors du premier démarrage d'un nœud.

source: `Demos in C++ and Python can be found here. <https://github.com/ros2/demos/tree/a66f0e894841a5d751bce6ded4983acb780448cf/quality_of_service_demo#qos-overrides>`_
fr: `Des démos en C++ et Python peuvent être trouvées ici. <https://github.com/ros2/demos/tree/a66f0e894841a5d751bce6ded4983acb780448cf/quality_of_service_demo#qos-overrides>`_

source: See the `design document for more details <http://design.ros2.org/articles/qos_configurability.html>`_.
fr: Voir le `document de conception pour plus de détails <http://design.ros2.org/articles/qos_configurability.html>`_.

source: Note, user code handling parameter changes with registered callbacks should avoid rejecting updates for unknown parameters. It was considered bad practice prior to Galactic, but with externally configurable QoS enabled it will result in a hard failure.
fr: Notez que le code utilisateur gérant les modifications de paramètres avec des rappels enregistrés doit éviter de rejeter les mises à jour pour des paramètres inconnus. C'était considéré comme une mauvaise pratique avant Galactic, mais si la QoS configurable en externe est activée, cela entraînera une panne matérielle.

source: Related PRs: `ros2/rclcpp#1408 <https://github.com/ros2/rclcpp/pull/1408>`_ and `ros2/rclpy#635 <https://github.com/ros2/rclpy/pull/635>`_
fr: PR associés : `ros2/rclcpp#1408 <https://github.com/ros2/rclcpp/pull/1408>`_ et `ros2/rclpy#635 <https://github.com/ros2/rclpy/pull/ 635>`_

source: Python point_cloud2 utilities available
fr: Utilitaires Python point_cloud2 disponibles

source: Several utilities for interacting with `PointCloud2 messages <https://github.com/ros2/common_interfaces/blob/galactic/sensor_msgs/msg/PointCloud2.msg>`__ in Python were `ported to ROS 2 <https://github.com/ros2/common_interfaces/pull/128>`__. These utilities allow one to get a list of points from a PointCloud2 message (``read_points`` and ``read_points_list``), and to create a PointCloud2 message from a list of points (``create_cloud`` and ``create_cloud_xyz32``).
fr: Plusieurs utilitaires permettant d'interagir avec les `messages PointCloud2 <https://github.com/ros2/common_interfaces/blob/galactic/sensor_msgs/msg/PointCloud2.msg>`__ en Python ont été `portés sur ROS 2 <https://github. com/ros2/common_interfaces/pull/128>`__. Ces utilitaires permettent d'obtenir une liste de points à partir d'un message PointCloud2 (``read_points`` et ``read_points_list``), et de créer un message PointCloud2 à partir d'une liste de points (``create_cloud`` et ``create_cloud_xyz32` `).

source: An example of creating PointCloud 2 message, then reading it back:
fr: Un exemple de création d'un message PointCloud 2, puis de sa relecture :

source: RViz2 Time Panel
fr: Panneau de temps RViz2

source: The Rviz2 Time Panel, which shows the current Wall and ROS time, along with the elapsed Wall and ROS time, has been `ported to RViz2 <https://github.com/ros2/rviz/pull/599>`__. To enable the Time Panel, click on Panels -> Add New Panel, and select "Time". A panel that looks like the following will appear:
fr: Le panneau de temps Rviz2, qui affiche l'heure actuelle du mur et du ROS, ainsi que le temps écoulé du mur et du ROS, a été `porté sur RViz2 <https://github.com/ros2/rviz/pull/599>`__. Pour activer le panneau de temps, cliquez sur Panneaux -> Ajouter un nouveau panneau, et sélectionnez "Heure". Un panneau qui ressemble à ce qui suit apparaîtra :

source: ros2 topic echo can print serialized data
fr: ros2 topic echo peut imprimer des données sérialisées

source: When debugging middleware issues, it can be useful to see the raw serialized data that the RMW is sending. The `--raw command-line flag <https://github.com/ros2/ros2cli/pull/470>`__ was added to ``ros2 topic echo`` to show this data. To see this in action, run the following commands.
fr: Lors du débogage de problèmes de middleware, il peut être utile de voir les données brutes sérialisées que le RMW envoie. L'indicateur de ligne de commande `--raw <https://github.com/ros2/ros2cli/pull/470>`__ a été ajouté à ``ros2 topic echo`` pour afficher ces données. Pour voir cela en action, exécutez les commandes suivantes.

source: Get the YAML representation of messages
fr: Obtenir la représentation YAML des messages

source: It is now possible to get a YAML representation of all messages in C++ using the `to_yaml <https://github.com/ros2/rosidl/issues/523>`__ function. An example of code that prints out the YAML representation:
fr: Il est maintenant possible d'obtenir une représentation YAML de tous les messages en C++ en utilisant la fonction `to_yaml <https://github.com/ros2/rosidl/issues/523>`__. Un exemple de code qui imprime la représentation YAML :

source: Ability to load parameter files at runtime through the ros2 command
fr: Possibilité de charger des fichiers de paramètres lors de l'exécution via la commande ros2

source: ROS 2 has long had the ability to specify parameter values at startup (through command-line arguments or a YAML file), and to dump current parameters out to a file (through ``ros2 param dump``). Galactic adds the ability to `load parameter values at runtime <https://github.com/ros2/ros2cli/pull/590>`__ from a YAML file using the ``ros2 param load`` verb. For example:
fr: ROS 2 a depuis longtemps la possibilité de spécifier des valeurs de paramètres au démarrage (via des arguments de ligne de commande ou un fichier YAML) et de vider les paramètres actuels dans un fichier (via ``ros2 param dump``). Galactic ajoute la possibilité de `charger les valeurs des paramètres au moment de l'exécution <https://github.com/ros2/ros2cli/pull/590>`__ à partir d'un fichier YAML à l'aide du verbe ``ros2 param load``. Par exemple:

source: Tools to check for QoS incompatibilities
fr: Outils pour vérifier les incompatibilités QoS

source: Built on top of new QoS compatibility check APIs, ``ros2doctor`` and ``rqt_graph`` can now detect and report QoS incompatibilities between publishers and subscriptions.
fr: Construits sur de nouvelles API de vérification de compatibilité QoS, ``ros2doctor`` et ``rqt_graph`` peuvent désormais détecter et signaler les incompatibilités QoS entre les éditeurs et les abonnements.

source: Given a publisher and a subscription with `incompatible QoS settings <../../Concepts/About-Quality-of-Service-Settings>`:
fr: Étant donné un éditeur et un abonnement avec des `paramètres QoS incompatibles <../../Concepts/About-Quality-of-Service-Settings>` :

source: ``ros2doctor`` reports:
fr: ``ros2doctor`` rapporte :

source: while ``rqt_graph`` shows:
fr: tandis que ``rqt_graph`` affiche :

source: Related PRs: `ros2/ros2cli#621 <https://github.com/ros2/ros2cli/pull/621>`_, `ros-visualization/rqt_graph#61 <https://github.com/ros-visualization/rqt_graph/pull/61>`_
fr: PR associés : `ros2/ros2cli#621 <https://github.com/ros2/ros2cli/pull/621>`_, `ros-visualization/rqt_graph#61 <https://github.com/ros-visualization/ rqt_graph/pull/61>`_

source: Use launch substitutions in parameter files
fr: Utiliser des substitutions de lancement dans les fichiers de paramètres

source: Just like ``rosparam`` tags in ROS 1 ``roslaunch``, ``launch_ros`` can now evaluate substitutions in parameter files.
fr: Tout comme les balises ``rosparam`` dans ROS 1 ``roslaunch``, ``launch_ros`` peut désormais évaluer les substitutions dans les fichiers de paramètres.

source: For example, given some ``parameter_file_with_substitutions.yaml`` like the following:
fr: Par exemple, étant donné certains ``parameter_file_with_substitutions.yaml`` comme suit :

source: Set ``allow_substs`` to ``True`` to get substitutions evaluated upon ``Node`` launch:
fr: Définissez ``allow_substs`` sur ``True`` pour que les substitutions soient évaluées lors du lancement de ``Node`` :

source: XML launch files also support this.
fr: Les fichiers de lancement XML le prennent également en charge.

source: Related PR: `ros2/launch_ros#168 <https://github.com/ros2/launch_ros/pull/168>`_
fr: PR associé : `ros2/launch_ros#168 <https://github.com/ros2/launch_ros/pull/168>`_

source: Support for unique network flows
fr: Prise en charge des flux réseau uniques

source: Applications may now require UDP/TCP and IP-based RMW implementations to provide unique *network flows* (i.e. unique `Differentiated Services Code Points <https://tools.ietf.org/html/rfc2474>`_ and/or unique `IPv6 Flow Labels <https://tools.ietf.org/html/rfc6437>`_ and/or unique ports in IP packet headers) for publishers and subscriptions, enabling QoS specifications for these IP streams in network architectures that support such a feature, like 5G networks.
fr: Les applications peuvent désormais nécessiter des implémentations UDP/TCP et RMW basées sur IP pour fournir des *flux réseau* uniques (c'est-à-dire des `Differentiated Services Code Points <https://tools.ietf.org/html/rfc2474>`_ et/ou uniques ` Étiquettes de flux IPv6 <https://tools.ietf.org/html/rfc6437>`_ et/ou ports uniques dans les en-têtes de paquets IP) pour les éditeurs et les abonnements, permettant des spécifications QoS pour ces flux IP dans les architectures réseau qui prennent en charge une telle fonctionnalité , comme les réseaux 5G.

source: To see this in action, you may run these C++ examples (to be found in the `ros2/examples <https://github.com/ros2/examples>`__ repository):
fr: Pour voir cela en action, vous pouvez exécuter ces exemples C++ (qui se trouvent dans le dépôt `ros2/examples <https://github.com/ros2/examples>`__):

source: See the `Unique Network Flows design document <https://github.com/ros2/design/pull/304>`_ for further reference.
fr: Voir le `document de conception Unique Network Flows <https://github.com/ros2/design/pull/304>`_ pour plus de références.

source: Rosbag2 New Features
fr: Nouvelles fonctionnalités de Rosbag2

source: Split recording by time
fr: Diviser l'enregistrement par le temps

source: In Foxy, you could only split bags as they were recording by the size of the bag, now you can also split by the elapsed time. The following command will split bagfiles into 100-second chunks.
fr: Dans Foxy, vous ne pouviez diviser les sacs qu'au fur et à mesure qu'ils enregistraient par la taille du sac, maintenant vous pouvez également diviser par le temps écoulé. La commande suivante divisera les bagfiles en morceaux de 100 secondes.

source: ros2 bag list
fr: liste de sacs ros2

source: This new command lists installed plugins of various types that rosbag2 uses.
fr: Cette nouvelle commande répertorie les plugins installés de différents types utilisés par rosbag2.

source: Compression implementation is a plugin
fr: L'implémentation de la compression est un plugin

source: In Foxy, rosbag2 compression was hardcoded with a Zstd library implementation. This has been rearchitected so that compression implementations are a plugin, and can be swapped out without modifying the core rosbag2 codebase. The default plugin that ships with ``ros-galactic-rosbag2`` is still the Zstd plugin - but now more can be released and used, and by selectively installing packages Zstd could be excluded from an installation.
fr: Dans Foxy, la compression rosbag2 était codée en dur avec une implémentation de bibliothèque Zstd. Cela a été repensé pour que les implémentations de compression soient un plug-in et puissent être remplacées sans modifier la base de code rosbag2 principale. Le plugin par défaut fourni avec ``ros-galactic-rosbag2`` est toujours le plugin Zstd - mais maintenant, d'autres peuvent être publiés et utilisés, et en installant sélectivement des packages, Zstd pourrait être exclu d'une installation.

source: Compress per-message
fr: Compresser par message

source: In Foxy, you could automatically compress each rosbag file as it was split (per-file compression), but now you can also specify per-message compression.
fr: Dans Foxy, vous pouvez compresser automatiquement chaque fichier rosbag lorsqu'il a été divisé (compression par fichier), mais vous pouvez désormais également spécifier une compression par message.

source: Rosbag2 Python API
fr: API Python Rosbag2

source: A new package ``rosbag2_py`` has been released in Galactic, which provides a Python API. This package is a ``pybind11`` binding around the C++ API. As of the initial Galactic release, it does not yet expose all functionality available via the ``rosbag2_cpp`` API, but it is the sole connection for the ``ros2 bag`` CLI tool, so a good deal of functionality is available.
fr: Un nouveau package ``rosbag2_py`` a été publié dans Galactic, qui fournit une API Python. Ce paquet est une liaison ``pybind11`` autour de l'API C++. Depuis la version initiale de Galactic, il n'expose pas encore toutes les fonctionnalités disponibles via l'API ``rosbag2_cpp``, mais c'est la seule connexion pour l'outil CLI ``ros2 bag``, donc de nombreuses fonctionnalités sont disponibles.

source: performance testing package and performance improvements
fr: package de test de performances et améliorations des performances

source: A thorough performance analysis project was performed on rosbag2 since the Foxy release. The full initial report is available at https://github.com/ros2/rosbag2/blob/galactic/rosbag2_performance/rosbag2_performance_benchmarking/docs/rosbag2_performance_improvements.pdf . The package ``rosbag2_performance_benchmarking`` provides tools to run performance analyses, especially on recording, which helps us maintain and improve the performance of rosbag2.
fr: Un projet approfondi d'analyse des performances a été réalisé sur rosbag2 depuis la sortie de Foxy. Le rapport initial complet est disponible sur https://github.com/ros2/rosbag2/blob/galactic/rosbag2_performance/rosbag2_performance_benchmarking/docs/rosbag2_performance_improvements.pdf . Le package ``rosbag2_performance_benchmarking`` fournit des outils pour exécuter des analyses de performances, en particulier sur l'enregistrement, ce qui nous aide à maintenir et à améliorer les performances de rosbag2.

source: Following this report, key work was done do improve the performance to a much more usable state for actual robot workflows. To highlight a key metric - in a high bandwidth stress test (200Mbps), the Foxy release dropped up to 70% of messages, whereas the Galactic version was approximately 100% retention. Please see the linked report for more details.
fr: Suite à ce rapport, un travail clé a été effectué pour améliorer les performances à un état beaucoup plus utilisable pour les flux de travail réels des robots. Pour mettre en évidence une métrique clé - dans un test de résistance à bande passante élevée (200 Mbps), la version Foxy a laissé tomber jusqu'à 70% des messages, alors que la version Galactic était d'environ 100% de rétention. Veuillez consulter le rapport lié pour plus de détails.

source: ``--regex`` and ``--exclude`` options for topic selection
fr: Options ``--regex`` et ``--exclude`` pour la sélection de sujet

source: The new recording options ``--regex`` and ``--exclude`` allow for fine-tuning the topics recorded in a bag, without having to explicitly list all topics. These options may be used together or separately, and in conjunction with ``--all``
fr: Les nouvelles options d'enregistrement ``--regex`` et ``--exclude`` permettent d'affiner les sujets enregistrés dans un sac, sans avoir à lister explicitement tous les sujets. Ces options peuvent être utilisées ensemble ou séparément, et en conjonction avec ``--all``

source: The following command will record only topics with "scan" in the name.
fr: La commande suivante n'enregistrera que les sujets avec "scan" dans le nom.

source: The following command will record all topics except for ones in ``/my_namespace/``
fr: La commande suivante enregistrera tous les sujets sauf ceux dans ``/my_namespace/``

source: ``ros2 bag reindex``
fr: ``réindexation du sac ros2``
