Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Releases/Release-Ardent-Apalone.po
Languages: fr

source: Ardent Apalone (``ardent``)
fr: Apalone ardent (``ardent``)

source: Table of Contents
fr: Table des matières

source: Welcome to the first non-beta release of ROS 2 software named *Ardent Apalone*!
fr: Bienvenue dans la première version non bêta du logiciel ROS 2 nommée *Ardent Apalone* !

source: Supported Platforms
fr: Plates-formes prises en charge

source: This version of ROS 2 is supported on three platforms:
fr: Cette version de ROS 2 est prise en charge sur trois plates-formes :

source: Ubuntu 16.04 (Xenial)
fr: Ubuntu 16.04 (Xénial)

source: Binary packages as well as instructions for how to compile from source are provided for all 3 platforms (see `install instructions <../../Installation>` as well as `documentation <https://docs.ros2.org/ardent/>`__).
fr: Des packages binaires ainsi que des instructions sur la façon de compiler à partir des sources sont fournis pour les 3 plates-formes (voir `instructions d'installation <../../Installation>` ainsi que `documentation <https://docs.ros2.org/ardent />`__).

source: Features
fr: Caractéristiques

source: New features in this ROS 2 release
fr: Nouvelles fonctionnalités de cette version de ROS 2

source: Distributed discovery, publish / subscribe, request / response communication
fr: Découverte distribuée, publication/abonnement, demande/réponse communication

source: Provided by a C API
fr: Fourni par une API C

source: Implemented using different vendors:
fr: Mis en œuvre à l'aide de différents fournisseurs :

source: eProsima's Fast RTPS as well as ADLINK's OpenSplice (from binary and source)
fr: Fast RTPS d'eProsima ainsi que OpenSplice d'ADLINK (à partir du binaire et de la source)

source: RTI's Connext (only from source)
fr: RTI Connext (uniquement depuis la source)

source: Numerous quality of service settings for handling non-ideal networks
fr: Nombreux paramètres de qualité de service pour gérer les réseaux non idéaux

source: DDS Security support (with Connext and Fast RTPS)
fr: Prise en charge de la sécurité DDS (avec Connext et Fast RTPS)

source: C++ and Python 3 client libraries
fr: Bibliothèques clientes C++ et Python 3

source: Sharing common code in C to unify the implementation
fr: Partage de code commun en C pour unifier l'implémentation

source: Execution model separated from the nodes, composable nodes
fr: Modèle d'exécution séparé des nœuds, nœuds composables

source: Node-specific parameters (only in C++ atm)
fr: Paramètres spécifiques au nœud (uniquement en C++ atm)

source: Life cycle (only in C++ atm)
fr: Cycle de vie (uniquement en C++ atm)

source: Optionally intra-process communication using the same API (only in C++)
fr: Eventuellement communication intra-processus utilisant la même API (uniquement en C++)

source: Message definitions (with bounded arrays and strings as well as default values)
fr: Définitions de message (avec des tableaux et des chaînes délimités ainsi que des valeurs par défaut)

source: Command line tools (e.g. ``ros2 run``)
fr: Outils de ligne de commande (par exemple, ``ros2 run``)

source: ``rviz`` with a few display types (the Windows version will likely follow in a few weeks)
fr: ``rviz`` avec quelques types d'affichage (la version Windows suivra probablement dans quelques semaines)

source: File system-based resource index (querying information without recursive crawling)
fr: Index de ressources basé sur le système de fichiers (interrogation d'informations sans analyse récursive)

source: Realtime safe code paths for pub / sub (with compatible DDS implementations only)
fr: Chemins de code sécurisés en temps réel pour pub/sub (uniquement avec les implémentations DDS compatibles)

source: Bridge between ROS 1 and ROS 2
fr: Pont entre ROS 1 et ROS 2

source: HSR demo `see Beta 3 <Beta3-Overview>`
fr: Démo HSR `voir Beta 3 <Beta3-Overview>`

source: Turtlebot demo `see Beta 2 <Beta2-Overview>`
fr: Démo Turtlebot `voir Beta 2 <Beta2-Overview>`

source: For a more detailed description please see the `Features <../../The-ROS2-Project/Features>` page.
fr: Pour une description plus détaillée, veuillez consulter la page `Features <../../The-ROS2-Project/Features>`.

source: Changes since Beta 3 release
fr: Modifications depuis la version bêta 3

source: Improvements since the Beta 3 release:
fr: Améliorations depuis la version bêta 3 :

source: ``rviz``
fr: ``viz''

source: Different initialization options for message data structures in C++ (see `design doc <https://design.ros2.org/articles/generated_interfaces_cpp.html#constructors>`__)
fr: Différentes options d'initialisation pour les structures de données de message en C++ (voir `design doc <https://design.ros2.org/articles/generated_interfaces_cpp.html#constructors>`__)

source: Logging API improvements, now also used in the demos
fr: Améliorations de l'API de journalisation, désormais également utilisées dans les démos

source: Time support in C++ with different clocks
fr: Prise en charge du temps en C++ avec différentes horloges

source: wait-for-service support in the Python client library
fr: prise en charge de l'attente de service dans la bibliothèque cliente Python

source: Draft implementation of `REP 149 <https://www.ros.org/reps/rep-0149.html>`__ specifying format 3 of the package manifest files
fr: Projet d'implémentation de `REP 149 <https://www.ros.org/reps/rep-0149.html>`__ spécifiant le format 3 des fichiers manifestes du package

source: Known Issues
fr: Problèmes connus

source: Fast RTPS performance with larger data like the image demo
fr: Performances RTPS rapides avec des données plus volumineuses comme la démo d'image

source: Using Connext it is currently not allowed for two topics with the same base name but different namespaces to have a different type (see `issue <https://github.com/ros2/rmw_connext/issues/234>`__).
fr: En utilisant Connext, il n'est actuellement pas autorisé que deux sujets avec le même nom de base mais des espaces de noms différents aient un type différent (voir `issue <https://github.com/ros2/rmw_connext/issues/234>`__).

source: Listing of node names (e.g. using ``ros2 node list``) does not work across some rmw implementations.
fr: La liste des noms de nœuds (par exemple, en utilisant ``ros2 node list``) ne fonctionne pas dans certaines implémentations rmw.

source: On Windows Python launch files might hang when trying to abort using ``Ctrl-C`` (see `issue <https://github.com/ros2/launch/issues/64>`__). In order to continue using the shell which is blocked by the hanging command you might want to end the hanging Python process using the process monitor.
fr: Sous Windows, les fichiers de lancement Python peuvent se bloquer lors d'une tentative d'abandon à l'aide de ``Ctrl-C`` (voir `issue <https://github.com/ros2/launch/issues/64>`__). Afin de continuer à utiliser le shell qui est bloqué par la commande de suspension, vous souhaiterez peut-être mettre fin au processus Python de suspension à l'aide du moniteur de processus.
