Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Releases/Release-Foxy-Fitzroy.po
Languages: fr

source: The pull request `ros2/rclcpp#1081 <https://github.com/ros2/rclcpp/pull/1081>`_ introduces a new signature of the callbacks for retrieving ROS messages in serialized form. The previously used C-Struct `rcl_serialized_message_t <https://github.com/ros2/rmw/blob/foxy/rmw/include/rmw/serialized_message.h>`_ is being superseded by a C++ data type `rclcpp::SerializedMessage <https://github.com/ros2/rclcpp/blob/foxy/rclcpp/include/rclcpp/serialized_message.hpp>`_.
fr: La pull request `ros2/rclcpp#1081 <https://github.com/ros2/rclcpp/pull/1081>`_ introduit une nouvelle signature des rappels pour récupérer les messages ROS sous forme sérialisée. Le C-Struct `rcl_serialized_message_t <https://github.com/ros2/rmw/blob/foxy/rmw/include/rmw/serialized_message.h>`_ précédemment utilisé est remplacé par un type de données C++ `rclcpp ::SerializedMessage <https://github.com/ros2/rclcpp/blob/foxy/rclcpp/include/rclcpp/serialized_message.hpp>`_.

source: The example nodes in ``demo_nodes_cpp``, namely ``talker_serialized_message`` as well as ``listener_serialized_message`` reflect these changes.
fr: Les exemples de nœuds dans ``demo_nodes_cpp``, à savoir ``talker_serialized_message`` ainsi que ``listener_serialized_message`` reflètent ces changements.

source: Breaking change in Node Interface getters' signature
fr: Changement radical dans la signature des getters de l'interface de nœud

source: With pull request `ros2/rclcpp#1069 <https://github.com/ros2/rclcpp/pull/1069>`_, the signature of node interface getters has been modified to return shared ownership of node interfaces (i.e. an ``std::shared_ptr``) instead of a non-owning raw pointer. Required changes in downstream packages that relied on the previous signature are simple and straightforward: use the ``std::shared_ptr::get()`` method.
fr: Avec la demande d'extraction `ros2/rclcpp#1069 <https://github.com/ros2/rclcpp/pull/1069>`_, la signature des getters d'interface de nœud a été modifiée pour retourner la propriété partagée des interfaces de nœud (c'est-à-dire un `` std::shared_ptr``) au lieu d'un pointeur brut non propriétaire. Les modifications requises dans les packages en aval qui s'appuyaient sur la signature précédente sont simples et directes : utilisez la méthode ``std::shared_ptr::get()``.

source: Deprecate set_on_parameters_set_callback
fr: Obsolète set_on_parameters_set_callback

source: Instead, use the ``rclcpp::Node`` methods ``add_on_set_parameters_callback`` and ``remove_on_set_parameters_callback`` for adding and removing functions that are called when parameters are set.
fr: À la place, utilisez les méthodes ``rclcpp::Node`` ``add_on_set_parameters_callback`` et ``remove_on_set_parameters_callback`` pour ajouter et supprimer des fonctions qui sont appelées lorsque les paramètres sont définis.

source: Related pull request: https://github.com/ros2/rclcpp/pull/1123
fr: Demande d'extraction associée : https://github.com/ros2/rclcpp/pull/1123

source: Breaking change in Publisher getter signature
fr: Changement de rupture dans la signature du getter de l'éditeur

source: With pull request `ros2/rclcpp#1119 <https://github.com/ros2/rclcpp/pull/1119>`_, the signature of publisher handle getter has been modified to return shared ownership of the underlying rcl structure (i.e. an ``std::shared_ptr``) instead of a non-owning raw pointer. This was necessary to fix a segfault in certain circumstances. Required changes in downstream packages that relied on the previous signature are simple and straightforward: use the ``std::shared_ptr::get()`` method.
fr: Avec la demande d'extraction `ros2/rclcpp#1119 <https://github.com/ros2/rclcpp/pull/1119>`_, la signature du getter de l'éditeur a été modifiée pour retourner la propriété partagée de la structure rcl sous-jacente (c'est-à-dire un ``std::shared_ptr``) au lieu d'un pointeur brut non propriétaire. Cela était nécessaire pour corriger une erreur de segmentation dans certaines circonstances. Les modifications requises dans les packages en aval qui s'appuyaient sur la signature précédente sont simples et directes : utilisez la méthode ``std::shared_ptr::get()``.

source: Deprecate ClientGoalHandle::async_result()
fr: Obsolète ClientGoalHandle::async_result()

source: Using this API, it is possible to run into a race condition causing an exception to be thrown. Instead, prefer to use ``Client::async_get_result()``, which is safer.
fr: À l'aide de cette API, il est possible de se heurter à une condition de concurrence entraînant la levée d'une exception. Préférez plutôt utiliser ``Client::async_get_result()``, qui est plus sûr.

source: See `ros2/rclcpp#1120 <https://github.com/ros2/rclcpp/pull/1120>`_ and the connected issue for more info.
fr: Voir `ros2/rclcpp#1120 <https://github.com/ros2/rclcpp/pull/1120>`_ et le problème connexe pour plus d'informations.

source: Support for multiple on parameter set callbacks
fr: Prise en charge de plusieurs rappels de jeu de paramètres

source: Use the ``Node`` methods ``add_on_set_parameters_callback`` and ``remove_on_set_parameters_callback`` for adding and removing functions that are called when parameters are set.
fr: Utilisez les méthodes ``Node`` ``add_on_set_parameters_callback`` et ``remove_on_set_parameters_callback`` pour ajouter et supprimer des fonctions qui sont appelées lorsque les paramètres sont définis.

source: The method ``set_parameters_callback`` has been deprecated.
fr: La méthode ``set_parameters_callback`` est obsolète.

source: Related pull requests: https://github.com/ros2/rclpy/pull/457, https://github.com/ros2/rclpy/pull/504
fr: Demandes d'extraction associées : https://github.com/ros2/rclpy/pull/457, https://github.com/ros2/rclpy/pull/504

source: Connext 5.1 locator kinds compatibility mode
fr: Mode de compatibilité des types de localisateur Connext 5.1

source: Up to and including ``Eloquent``, ``rmw_connext_cpp`` was setting ``dds.transport.use_510_compatible_locator_kinds`` property to ``true``. This property is not being forced anymore, and shared transport communication between ``Foxy`` and previous releases will stop working. Logs similar to:
fr: Jusqu'à ``Eloquent`` inclus, ``rmw_connext_cpp`` définissait la propriété ``dds.transport.use_510_compatible_locator_kinds`` sur ``true``. Cette propriété n'est plus forcée et la communication de transport partagé entre ``Foxy`` et les versions précédentes cessera de fonctionner. Journaux similaires à :

source: will be observed when this incompatibility happens.
fr: sera observé lorsque cette incompatibilité se produit.

source: If compatibility is needed, it can be set up in an external QoS profiles files containing:
fr: Si la compatibilité est nécessaire, elle peut être configurée dans un fichier de profils QoS externe contenant :

source: Remember to set the ``NDDS_QOS_PROFILES`` environment variable to the QoS profiles file path. For more information, see ``How to Change Transport Settings in 5.2.0 Applications for Compatibility with 5.1.0`` section of `Transport_Compatibility <https://community.rti.com/static/documentation/connext-dds/5.2.0/doc/manuals/connext_dds/html_files/RTI_ConnextDDS_CoreLibraries_ReleaseNotes/Content/ReleaseNotes/Transport_Compatibility.htm>`_.
fr: N'oubliez pas de définir la variable d'environnement ``NDDS_QOS_PROFILES`` sur le chemin du fichier des profils QoS. Pour plus d'informations, consultez la section ``How to Change Transport Settings in 5.2.0 Applications for Compatibility with 5.1.0`` of `Transport_Compatibility <https://community.rti.com/static/documentation/connext-dds/5.2. 0/doc/manuals/connext_dds/html_files/RTI_ConnextDDS_CoreLibraries_ReleaseNotes/Content/ReleaseNotes/Transport_Compatibility.htm>`_.

source: rviz
fr: voir

source: Tools timestamp messages using ROS time
fr: Outils d'horodatage des messages à l'aide de l'heure ROS

source: '2D Pose Estimate', '2D Nav Goal', and 'Publish Point' tools now timestamp their messages using ROS time instead of system time, in order for the ``use_sim_time`` parameter to have an effect on them.
fr: Les outils '2D Pose Estimate', '2D Nav Goal' et 'Publish Point' horodatent désormais leurs messages en utilisant l'heure ROS au lieu de l'heure système, afin que le paramètre ``use_sim_time`` ait un effet sur eux.

source: Related pull request: https://github.com/ros2/rviz/pull/519
fr: Demande d'extraction associée : https://github.com/ros2/rviz/pull/519

source: Deprecation of messages
fr: Abandon des messages

source: Although discouraged for a long time we have officially deprecated the following messages in ``std_msgs``. There are copies in `example_interfaces <https://index.ros.org/p/example_interfaces>`_
fr: Bien que découragés depuis longtemps, nous avons officiellement déprécié les messages suivants dans ``std_msgs``. Il y a des copies dans `example_interfaces <https://index.ros.org/p/example_interfaces>`_

source: ``std_msgs/msg/Int32``
fr: Plâtré de qualité supérieure / marché secondaire / sans torsion

source: ``std_msgs/msg/Int32MultiArray``
fr: Plâtre de versement / marché secondaire / ne pas montrer

source: ``std_msgs/msg/String``
fr: ``std_msgs/msg/chaîne``

source: ``std_msgs/msg/UInt32``
fr: Plâtré de qualité supérieure / marché secondaire / sans torsion

source: ``std_msgs/msg/UInt32MultiArray``
fr: Plâtre de versement / marché secondaire / ne pas montrer

source: Security features
fr: Fonctions de sécurité

source: Use of security enclaves
fr: Utilisation d'enclaves de sécurité

source: As of Foxy, domain participants are no longer mapped directly to ROS nodes. As a result, ROS 2 security features (which are specific to domain participants) are also no longer mapped directly to ROS nodes. Instead, Foxy introduces the concept of a security "enclave", where an "enclave" is a process or group of processes that will share the same identity and access control rules.
fr: Depuis Foxy, les participants du domaine ne sont plus mappés directement sur les nœuds ROS. Par conséquent, les fonctionnalités de sécurité ROS 2 (qui sont spécifiques aux participants du domaine) ne sont plus directement mappées sur les nœuds ROS. Au lieu de cela, Foxy introduit le concept d'une "enclave" de sécurité, où une "enclave" est un processus ou un groupe de processus qui partageront les mêmes règles d'identité et de contrôle d'accès.

source: This means that security artifacts are **not** retrieved based on the node name anymore but based on the Security enclave name. A node enclave name can be set by using the ROS argument ``--enclave``, e.g. ``ros2 run demo_nodes_py talker --ros-args --enclave /my_enclave``
fr: Cela signifie que les artefacts de sécurité ne sont **plus** récupérés en fonction du nom du nœud, mais en fonction du nom de l'enclave de sécurité. Un nom d'enclave de nœud peut être défini en utilisant l'argument ROS ``--enclave``, par ex. ``ros2 run demo_nodes_py talker --ros-args --enclave /my_enclave``

source: Related design document: https://github.com/ros2/design/pull/274
fr: Document de conception connexe : https://github.com/ros2/design/pull/274

source: Note that permissions files are limited by the underlying transport packet size, so grouping many permissions under the same enclave will **not** work if the resulting permissions file exceed 64kB. Related issue `[ros2/sros2#228] <https://github.com/ros2/sros2/issues/228>`_
fr: Notez que les fichiers d'autorisations sont limités par la taille du paquet de transport sous-jacent, donc le regroupement de plusieurs autorisations sous la même enclave ne fonctionnera **pas** si le fichier d'autorisations résultant dépasse 64 Ko. Problème connexe `[ros2/sros2#228] <https://github.com/ros2/sros2/issues/228>`_

source: Renaming of the environment variables
fr: Renommage des variables d'environnement

source: Environment variables renaming
fr: Renommage des variables d'environnement

source: Name in Eloquent
fr: Nom en éloquent

source: Name in Foxy
fr: Nom en Foxy

source: Known Issues
fr: Problèmes connus

source: `[ros2/ros2#922] <https://github.com/ros2/ros2/issues/922>`_ Services' performance is flaky for ``rclcpp`` nodes using eProsima Fast-RTPS or ADLINK CycloneDDS as RMW implementation. Specifically, service clients sometimes do not receive the response from servers.
fr: `[ros2/ros2#922] <https://github.com/ros2/ros2/issues/922>`_ Les performances des services sont instables pour les nœuds ``rclcpp`` utilisant eProsima Fast-RTPS ou ADLINK CycloneDDS comme implémentation RMW . Plus précisément, les clients de service ne reçoivent parfois pas la réponse des serveurs.

source: `[ros2/rclcpp#1212] <https://github.com/ros2/rclcpp/issues/1212>`_ Ready reentrant Waitable objects can attempt to execute multiple times.
fr: `[ros2/rclcpp#1212] <https://github.com/ros2/rclcpp/issues/1212>`_ Les objets Waitable réentrants prêts peuvent tenter de s'exécuter plusieurs fois.

source: Timeline before the release
fr: Chronologie avant la sortie

source: A few milestones leading up to the release:
fr: Quelques étapes menant à la sortie :

source: The dates below reflect an extension by roughly two weeks due to the coronavirus pandemic.
fr: Les dates ci-dessous reflètent une prolongation d'environ deux semaines en raison de la pandémie de coronavirus.

source: Wed. April 22nd, 2020
fr: Épouser. 22 avril 2020

source: API and feature freeze for ``ros_core`` [1]_ packages. Note that this includes ``rmw``, which is a recursive dependency of ``ros_core``. Only bug fix releases should be made after this point. New packages can be released independently.
fr: Gel de l'API et des fonctionnalités pour les packages ``ros_core`` [1]_. Notez que cela inclut ``rmw``, qui est une dépendance récursive de ``ros_core``. Seules les versions de correctifs de bogues doivent être effectuées après ce point. De nouveaux packages peuvent être publiés indépendamment.

source: Updated releases of ``desktop`` [2]_ packages available. Testing of the new features.
fr: Versions mises à jour des packages ``desktop`` [2]_ disponibles. Test des nouvelles fonctionnalités.

source: Wed. May 27th, 2020 (release candidate)
fr: Épouser. 27 mai 2020 (release candidate)

source: Updated releases of ``desktop`` [2]_ packages available.
fr: Versions mises à jour des packages ``desktop`` [2]_ disponibles.

source: Wed. June 3rd, 2020
fr: Épouser. 3 juin 2020

source: Freeze rosdistro. No PRs for Foxy on the `rosdistro` repo will be merged (reopens after the release announcement).
fr: Geler rosdistro. Aucun PR pour Foxy sur le repo `rosdistro` ne sera fusionné (réouverture après l'annonce de la sortie).

source: The ``ros_core`` variant described in the `variants <https://github.com/ros2/variants>`_ repository.
fr: La variante ``ros_core`` décrite dans le référentiel `variants <https://github.com/ros2/variants>`_.

source: The ``desktop`` variant described in the `variants <https://github.com/ros2/variants>`_ repository.
fr: La variante ``desktop`` décrite dans le référentiel `variants <https://github.com/ros2/variants>`_.
