Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Releases/Release-Galactic-Geochelone.po
Languages: fr

source: ROS 2 bags are represented by a directory, instead of a single file. This directory contains a ``metadata.yaml`` file, and one or more bag files. When the ``metadata.yaml`` file is lost or missing, ``ros2 bag reindex $bag_dir`` will attempt to reconstruct it by reading all the bag files in the directory.
fr: Les sacs ROS 2 sont représentés par un répertoire, au lieu d'un fichier unique. Ce répertoire contient un fichier ``metadata.yaml`` et un ou plusieurs fichiers bag. Lorsque le fichier ``metadata.yaml`` est perdu ou manquant, ``ros2 bag reindex $bag_dir`` tentera de le reconstruire en lisant tous les fichiers du sac dans le répertoire.

source: Playback time control
fr: Contrôle du temps de lecture

source: New controls have been added for rosbag2 playback - pause & resume, change rate, and play-next. As of the Galactic release, these controls are exposed only as services on the rosbag2 player node. Development is in progress to expose them to keyboard controls as well in ``ros2 bag play``, but until then a user application with buttons or keyboard controls may be trivially implemented to call these services.
fr: De nouvelles commandes ont été ajoutées pour la lecture de rosbag2 - pause et reprise, changement de vitesse et lecture suivante. Depuis la version Galactic, ces contrôles sont exposés uniquement en tant que services sur le nœud du lecteur rosbag2. Le développement est en cours pour les exposer également aux commandes du clavier dans ``ros2 bag play``, mais jusque-là, une application utilisateur avec des boutons ou des commandes au clavier peut être implémentée de manière triviale pour appeler ces services.

source: Playback publishes /clock
fr: La lecture publie /horloge

source: Rosbag2 can also dictate "simulation time" by publishing to the ``/clock`` topic during playback. The following commands will publish the clock message at a regular interval.
fr: Rosbag2 peut également dicter le "temps de simulation" en publiant dans le sujet ``/clock`` pendant la lecture. Les commandes suivantes publieront le message d'horloge à intervalle régulier.

source: Changes since the Foxy release
fr: Changements depuis la sortie de Foxy

source: Default RMW changed to Eclipse Cyclone DDS
fr: RMW par défaut remplacé par Eclipse Cyclone DDS

source: During the Galactic development process, the ROS 2 Technical Steering Committee `voted <https://discourse.ros.org/t/ros-2-galactic-default-middleware-announced/18064>`__ to change the default ROS middleware (RMW) to `Eclipse Cyclone DDS <https://github.com/eclipse-cyclonedds/cyclonedds>`__ project of `Eclipse Foundation <https://www.eclipse.org>`__. Without any configuration changes, users will get Eclipse Cyclone DDS by default. Fast DDS and Connext are still Tier-1 supported RMW vendors, and users can opt-in to use one of these RMWs at their discretion by using the ``RMW_IMPLEMENTATION`` environment variable. See the `Working with multiple RMW implementations guide <../../How-To-Guides/Working-with-multiple-RMW-implementations>` for more information.
fr: Au cours du processus de développement de Galactic, le comité directeur technique de ROS 2 a voté <https://discourse.ros.org/t/ros-2-galactic-default-middleware-announced/18064>`__ pour modifier le middleware ROS par défaut ( RMW) au projet `Eclipse Cyclone DDS <https://github.com/eclipse-cyclonedds/cyclonedds>`__ de la `Fondation Eclipse <https://www.eclipse.org>`__. Sans aucun changement de configuration, les utilisateurs obtiendront Eclipse Cyclone DDS par défaut. Fast DDS et Connext sont toujours des fournisseurs de RMW pris en charge au niveau 1, et les utilisateurs peuvent choisir d'utiliser l'un de ces RMW à leur discrétion en utilisant la variable d'environnement ``RMW_IMPLEMENTATION``. Consultez le `Guide de travail avec plusieurs implémentations RMW <../../How-To-Guides/Working-with-multiple-RMW-implementations>` pour plus d'informations.

source: Connext RMW changed to rmw_connextdds
fr: Connect RMW remplacé par rmw connext dds

source: A new RMW for Connext called `rmw_connextdds <https://github.com/ros2/rmw_connextdds>`_ was merged for Galactic. This RMW has better performance and fixes many of the issues with the older RMW ``rmw_connext_cpp``.
fr: Un nouveau RMW pour Connext appelé `rmw_connextdds <https://github.com/ros2/rmw_connextdds>`_ a été fusionné pour Galactic. Ce RMW a de meilleures performances et résout de nombreux problèmes avec l'ancien RMW ``rmw_connext_cpp``.

source: Large improvements in testing and overall quality
fr: De grandes améliorations dans les tests et la qualité globale

source: Galactic contains many changes that fix race conditions, plug memory leaks, and fix user reported problems. Besides these changes, there was a concerted effort during Galactic development to improve overall quality of the system by implementing `REP 2004 <https://www.ros.org/reps/rep-2004.html>`__. The ``rclcpp`` package and all of its dependencies (which include most of the ROS 2 non-Python core packages) were brought up to `Quality Level 1 <https://www.ros.org/reps/rep-2004.html#quality-level-1>`__ by:
fr: Galactic contient de nombreuses modifications qui corrigent les conditions de concurrence, colmatent les fuites de mémoire et corrigent les problèmes signalés par les utilisateurs. Outre ces changements, il y a eu un effort concerté pendant le développement de Galactic pour améliorer la qualité globale du système en mettant en œuvre `REP 2004 <https://www.ros.org/reps/rep-2004.html>`__. Le package ``rclcpp`` et toutes ses dépendances (qui incluent la plupart des packages de base ROS 2 non-Python) ont été portés au `niveau de qualité 1 <https://www.ros.org/reps/rep-2004 .html#quality-level-1>`__ par :

source: Having a version policy (QL1 requirement 1)
fr: Avoir une politique de version (exigence QL1 1)

source: Having a documented change control process (QL1 requirement 2)
fr: Avoir un processus documenté de contrôle des changements (exigence QL1 2)

source: Documenting all features and public APIs (QL1 requirement 3)
fr: Documenter toutes les fonctionnalités et les API publiques (exigence QL1 3)

source: Adding many additional tests (QL1 requirement 4):
fr: Ajout de nombreux tests supplémentaires (NQ1 exigence 4) :

source: System tests for all features
fr: Tests système pour toutes les fonctionnalités

source: Unit tests for all public APIs
fr: Tests unitaires pour toutes les API publiques

source: Nightly performance tests
fr: Tests de performances nocturnes

source: Code coverage at 95%
fr: Couverture du code à 95 %

source: Having all runtime dependencies of packages be at least as high as the package (QL1 requirement 5)
fr: Avoir toutes les dépendances d'exécution des packages au moins aussi élevées que le package (exigence QL1 5)

source: Supporting all of the REP-2000 platforms (QL1 requirement 6)
fr: Prise en charge de toutes les plates-formes REP-2000 (exigence QL1 6)

source: Having a vulnerability disclosure policy (QL1 requirement 7)
fr: Avoir une politique de divulgation des vulnérabilités (exigence QL1 7)

source: New API for checking QoS profile compatibility
fr: Nouvelle API pour vérifier la compatibilité du profil QoS

source: ``rmw_qos_profile_check_compatible`` is a new function for checking the compatibility of two QoS profiles.
fr: ``rmw_qos_profile_check_compatible`` est une nouvelle fonction permettant de vérifier la compatibilité de deux profils QoS.

source: RMW vendors should implement this API for QoS debugging and introspection features in tools such as ``rqt_graph`` to work correctly.
fr: Les fournisseurs RMW doivent implémenter cette API pour que les fonctionnalités de débogage et d'introspection QoS dans des outils tels que ``rqt_graph`` fonctionnent correctement.

source: Related PR: `ros2/rmw#299 <https://github.com/ros2/rmw/pull/299>`_
fr: PR associé : `ros2/rmw#299 <https://github.com/ros2/rmw/pull/299>`_

source: ament_cmake
fr: current_cmake

source: ``ament_install_python_package()`` now installs a Python egg
fr: ``ament_install_python_package()`` installe maintenant un oeuf Python

source: By installing a flat Python egg, Python packages installed using ``ament_install_python_package()`` can be discovered using modules such as ``pkg_resources`` and ```importlib.metadata``. Also, additional metadata can be provided in a ``setup.cfg`` file (including entry points).
fr: En installant un œuf Python plat, les packages Python installés à l'aide de ``ament_install_python_package()`` peuvent être découverts à l'aide de modules tels que ``pkg_resources`` et ```importlib.metadata``. De plus, des métadonnées supplémentaires peuvent être fournies dans un fichier ``setup.cfg`` (y compris les points d'entrée).

source: Related PR: `ament/ament_cmake#326 <https://github.com/ament/ament_cmake/pull/326>`_
fr: Relations publiques associées : `ament/ament_cmake#326 <https://github.com/ament/ament_cmake/pull/326>`_

source: ``ament_target_dependencies()`` handles SYSTEM dependencies
fr: ``ament_target_dependencies()`` gère les dépendances SYSTEM

source: Some package dependencies can now be marked as SYSTEM dependencies, helping to cope with warnings in external code. Typically, SYSTEM dependencies are also excluded from dependency calculations -- use them with care.
fr: Certaines dépendances de package peuvent désormais être marquées comme dépendances SYSTEM, ce qui permet de gérer les avertissements dans le code externe. En règle générale, les dépendances SYSTEM sont également exclues des calculs de dépendance - utilisez-les avec précaution.

source: Related PR: `ament/ament_cmake#297 <https://github.com/ament/ament_cmake/pull/297>`_
fr: Relations publiques associées : `ament/ament_cmake#297 <https://github.com/ament/ament_cmake/pull/297>`_

source: Changes include, but are not limited to, a number of stability improvements, new plugins, interface changes, costmap filters. See `Migration Guides <https://navigation.ros.org/migration/Foxy.html>`_ for full list
fr: Les changements incluent, mais ne sont pas limités à, un certain nombre d'améliorations de la stabilité, de nouveaux plugins, des changements d'interface, des filtres de carte des coûts. Voir `Guides de migration <https://navigation.ros.org/migration/Foxy.html>`_ pour la liste complète

source: tf2_ros Python split out of tf2_ros
fr: tf2_ros Python séparé de tf2_ros

source: The Python code that used to live in tf2_ros has been moved into its own package named tf2_ros_py. Any existing Python code that depends on tf2_ros will continue to work, but the package.xml of those packages should be amended to ``exec_depend`` on tf2_ros_py.
fr: Le code Python qui vivait dans tf2_ros a été déplacé dans son propre package nommé tf2_ros_py. Tout code Python existant qui dépend de tf2_ros continuera à fonctionner, mais le package.xml de ces packages doit être modifié en ``exec_depend`` sur tf2_ros_py.

source: tf2_ros Python TransformListener uses global namespace
fr: tf2_ros Python TransformListener utilise l'espace de noms global

source: The Python ``TransformListener`` now subscribes to ``/tf`` and ``/tf_static`` in the global namespace. Previously, it was susbcribing in the node's namespace. This means that the node's namespace will no longer have an effect on the ``/tf`` and ``/tf_static`` subscriptions.
fr: Le Python ``TransformListener`` s'abonne maintenant à ``/tf`` et ``/tf_static`` dans l'espace de noms global. Auparavant, il s'inscrivait dans l'espace de noms du nœud. Cela signifie que l'espace de noms du nœud n'aura plus d'effet sur les abonnements ``/tf`` et ``/tf_static``.

source: will subscribe to ``/tf`` and ``/tf_static``, as ``ros2 topic list`` will show.
fr: s'abonnera à ``/tf`` et ``/tf_static``, comme le montrera ``ros2 topic list``.

source: Related PR: `ros2/geometry2#390 <https://github.com/ros2/geometry2/pull/390>`_
fr: Relations publiques associées : `ros2/geometry2#390 <https://github.com/ros2/geometry2/pull/390>`_

source: rclcpp
fr: RCLCP

source: Change in spin_until_future_complete template parameters
fr: Modification des paramètres du modèle spin_until_future_complete

source: The first template parameter of ``Executor::spin_until_future_complete`` was the future result type ``ResultT``, and the method only accepted a ``std::shared_future<ResultT>``. In order to accept other types of futures (e.g.: ``std::future``), that parameter was changed to the future type itself.
fr: Le premier paramètre de modèle de ``Executor::spin_until_future_complete`` était le type de résultat futur ``ResultT``, et la méthode n'acceptait qu'un ``std::shared_future<ResultT>``. Afin d'accepter d'autres types de contrats à terme (par exemple : ``std::future``), ce paramètre a été remplacé par le type de contrat à terme lui-même.

source: In places where a ``spin_until_future_complete`` call was relying on template argument deduction, no change is needed. If not, this is an example diff:
fr: Aux endroits où un appel ``spin_until_future_complete`` s'appuyait sur la déduction d'arguments de modèle, aucun changement n'est nécessaire. Sinon, voici un exemple de diff :

source: For more details, see `ros2/rclcpp#1160 <https://github.com/ros2/rclcpp/pull/1160>`_. For an example of the needed changes in user code, see `ros-visualization/interactive_markers#72 <https://github.com/ros-visualization/interactive_markers/pull/72>`_.
fr: Pour plus de détails, voir `ros2/rclcpp#1160 <https://github.com/ros2/rclcpp/pull/1160>`_. Pour un exemple des changements nécessaires dans le code utilisateur, voir `ros-visualization/interactive_markers#72 <https://github.com/ros-visualization/interactive_markers/pull/72>`_.

source: Change in default ``/clock`` subscription QoS profile
fr: Modification du profil QoS d'abonnement ``/clock`` par défaut

source: The default was changed from a reliable communication with history depth 10 to a best effort communication with history depth 1. See `ros2/rclcpp#1312 <https://github.com/ros2/rclcpp/pull/1312>`_.
fr: La valeur par défaut est passée d'une communication fiable avec une profondeur d'historique de 10 à une communication au mieux avec une profondeur d'historique de 1. Voir `ros2/rclcpp#1312 <https://github.com/ros2/rclcpp/pull/1312>`_.

source: Waitable API
fr: API d'attente

source: Waitable API was modified to avoid issues with the ``MultiThreadedExecutor``. This only affects users implementing a custom waitable. See `ros2/rclcpp#1241 <https://github.com/ros2/rclcpp/pull/1241>`_ for more details.
fr: L'API Waitable a été modifiée pour éviter les problèmes avec le ``MultiThreadedExecutor``. Cela n'affecte que les utilisateurs implémentant un waitable personnalisé. Voir `ros2/rclcpp#1241 <https://github.com/ros2/rclcpp/pull/1241>`_ pour plus de détails.

source: Change in ``rclcpp``'s logging macros
fr: Modification des macros de journalisation de ``rclcpp``

source: Previously, the logging macros were vulnerable to a `format string attack <https://owasp.org/www-community/attacks/Format_string_attack>`_, where the format string is evaluated and can potentially execute code, read the stack, or cause a segmentation fault in the running program. To address this security issue, the logging macro now accepts only string literals for it's format string argument.
fr: Auparavant, les macros de journalisation étaient vulnérables à une `attaque par chaîne de format <https://owasp.org/www-community/attacks/Format_string_attack>`_, où la chaîne de format est évaluée et peut potentiellement exécuter du code, lire la pile ou provoquer une erreur de segmentation dans le programme en cours d'exécution. Pour résoudre ce problème de sécurité, la macro de journalisation accepte désormais uniquement les littéraux de chaîne pour son argument de chaîne de format.

source: If you previously had code like:
fr: Si vous aviez auparavant un code comme:

source: you should now replace it with:
fr: vous devez maintenant le remplacer par :

source: or:
fr: ou:

source: This change removes some convenience from the logging macros, as ``std::string``\s are no longer accepted as the format argument.
fr: Cette modification supprime certaines fonctionnalités des macros de journalisation, car ``std::string``\s ne sont plus acceptés comme argument de format.

source: If you previously had code with no format arguments like:
fr: Si vous aviez précédemment du code sans arguments de format comme :

source: If you are using a ``std::string`` as a format string with format arguments, converting that string to a ``char *`` and using it as the format string will yield a format security warning. That's because the compiler has no way at compile to introspect into the ``std::string`` to verify the arguments. To avoid the security warning, we recommend you build the string manually and pass it in with no format arguments like the previous example.
fr: Si vous utilisez un ``std::string`` comme chaîne de format avec des arguments de format, convertir cette chaîne en ``char *`` et l'utiliser comme chaîne de format produira un avertissement de sécurité de format. C'est parce que le compilateur n'a aucun moyen à la compilation d'introspecter le ``std::string`` pour vérifier les arguments. Pour éviter l'avertissement de sécurité, nous vous recommandons de créer la chaîne manuellement et de la transmettre sans argument de format comme dans l'exemple précédent.

source: ``std::stringstream`` types are still accepted as arguments to the stream logging macros. See `ros2/rclcpp#1442 <https://github.com/ros2/rclcpp/pull/1442>`_ for more details.
fr: Les types ``std::stringstream`` sont toujours acceptés comme arguments des macros de journalisation de flux. Voir `ros2/rclcpp#1442 <https://github.com/ros2/rclcpp/pull/1442>`_ pour plus de détails.

source: Parameter types are now static by default
fr: Les types de paramètres sont désormais statiques par défaut

source: Previously, the type of a parameter could be changed when a parameter was set. For example, if a parameter was declared as an integer, a later call to set the parameter could change that type to a string. This behavior could lead to bugs, and is rarely what the user wants. As of Galactic parameter types are static by default, and attempts to change the type will fail. If the previous dynamic behavior is desired, there is an mechanism to opt it in (see the code below).
fr: Auparavant, le type d'un paramètre pouvait être modifié lorsqu'un paramètre était défini. Par exemple, si un paramètre a été déclaré comme un entier, un appel ultérieur pour définir le paramètre pourrait changer ce type en une chaîne. Ce comportement peut entraîner des bogues et correspond rarement à ce que l'utilisateur souhaite. À partir de Galactic, les types de paramètres sont statiques par défaut et les tentatives de modification de type échoueront. Si le comportement dynamique précédent est souhaité, il existe un mécanisme pour l'activer (voir le code ci-dessous).

source: For more details see https://github.com/ros2/rclcpp/blob/galactic/rclcpp/doc/notes_on_statically_typed_parameters.md.
fr: Pour plus de détails, voir https://github.com/ros2/rclcpp/blob/galactic/rclcpp/doc/notes_on_statically_typed_parameters.md.

source: ``qos_check_compatible`` is a new function for checking the compatibility of two QoS profiles.
fr: ``qos_check_compatible`` est une nouvelle fonction permettant de vérifier la compatibilité de deux profils QoS.

source: Related PR: `ros2/rclcpp#1554 <https://github.com/ros2/rclcpp/pull/1554>`_
fr: PR associé : `ros2/rclcpp#1554 <https://github.com/ros2/rclcpp/pull/1554>`_

source: Removal of deprecated Node.set_parameters_callback
fr: Suppression de Node.set_parameters_callback obsolète

source: The method ``Node.set_parameters_callback`` was `deprecated in ROS Foxy <https://github.com/ros2/rclpy/pull/504>`_ and has been `removed in ROS Galactic <https://github.com/ros2/rclpy/pull/633>`_. Use ``Node.add_on_set_parameters_callback()`` instead. Here is some example code using it.
fr: La méthode ``Node.set_parameters_callback`` était `obsolète dans ROS Foxy <https://github.com/ros2/rclpy/pull/504>`_ et a été `supprimée dans ROS Galactic <https://github.com /ros2/rclpy/pull/633>`_. Utilisez ``Node.add_on_set_parameters_callback()`` à la place. Voici un exemple de code l'utilisant.

source: Run this command to see the parameter callback in action.
fr: Exécutez cette commande pour voir le rappel de paramètre en action.

source: In Foxy and earlier a call to set a parameter could change its type. As of Galactic parameter types are static and cannot be changed by default. If the previous behavior is desired, then set ``dynamic_typing`` to true in the parameter descriptor. Here is an example.
fr: Dans Foxy et les versions antérieures, un appel pour définir un paramètre pouvait changer son type. À partir de Galactic, les types de paramètres sont statiques et ne peuvent pas être modifiés par défaut. Si le comportement précédent est souhaité, définissez ``dynamic_typing`` sur true dans le descripteur de paramètre. Voici un exemple.

source: Run these commands to see how statically and dynamically typed parameters are different.
fr: Exécutez ces commandes pour voir en quoi les paramètres typés statiquement et dynamiquement sont différents.

source: ``rclpy.qos.qos_check_compatible`` is `a new function <https://github.com/ros2/rclpy/pull/708>`_ for checking the compatibility of two QoS profiles. If the profiles are compatible, then a publisher and subscriber using them will be able to talk to each other.
fr: ``rclpy.qos.qos_check_compatible`` est `une nouvelle fonction <https://github.com/ros2/rclpy/pull/708>`_ pour vérifier la compatibilité de deux profils QoS. Si les profils sont compatibles, un éditeur et un abonné les utilisant pourront se parler.

source: Action client goal response callback signature changed
fr: La signature de rappel de réponse à l'objectif du client d'action a été modifiée

source: The goal response callback should now take a shared pointer to a goal handle, instead of a future.
fr: Le rappel de réponse d'objectif doit désormais prendre un pointeur partagé vers un descripteur d'objectif, au lieu d'un futur.

source: For `example <https://github.com/ros2/examples/pull/291>`_, old signature:
fr: Par `example <https://github.com/ros2/examples/pull/291>`_, ancienne signature :

source: New signature:
fr: Nouvelle signature :

source: Related PR: `ros2/rclcpp#1311 <https://github.com/ros2/rclcpp/pull/1311>`_
fr: PR associé : `ros2/rclcpp#1311 <https://github.com/ros2/rclcpp/pull/1311>`_

source: API break in function that gets an element from an array
fr: Rupture d'API dans la fonction qui obtient un élément d'un tableau

source: The signature of the function was changed because it was semantically different to all the other functions used to get an element from an array or sequence. This only affects authors of rmw implementations using the introspection typesupport.
fr: La signature de la fonction a été modifiée car elle était sémantiquement différente de toutes les autres fonctions utilisées pour obtenir un élément d'un tableau ou d'une séquence. Cela n'affecte que les auteurs d'implémentations rmw utilisant le support de type d'introspection.

source: For further details, see `ros2/rosidl#531 <https://github.com/ros2/rosidl/pull/531>`_.
fr: Pour plus de détails, voir `ros2/rosidl#531 <https://github.com/ros2/rosidl/pull/531>`_.

source: rcl_lifecycle and rclcpp_lifecycle
fr: rcl_lifecycle et rclcpp_lifecycle

source: RCL's lifecycle state machine gets new init API
fr: La machine d'état du cycle de vie de RCL reçoit une nouvelle API d'initialisation
