Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Releases/Release-Dashing-Diademata.po
Languages: fr

source: Plugins should use fully qualified type names otherwise a warning will be logged. For `example <https://github.com/ros2/rviz/blob/dfceae319d49546f1e4ad39689853c18fef0001e/rviz_default_plugins/plugins_description.xml#L13>`_, use the type ``sensor_msgs/msg/Image`` instead of ``sensor_msgs/Image``. See `PR introducing this change <https://github.com/ros2/rviz/pull/387>`_ for more details.
fr: Les plugins doivent utiliser des noms de type complets, sinon un avertissement sera enregistré. Par `exemple <https://github.com/ros2/rviz/blob/dfceae319d49546f1e4ad39689853c18fef0001e/rviz_default_plugins/plugins_description.xml#L13>`_, utilisez le type ``sensor_msgs/msg/Image`` au lieu de ``sensor_msgs/Image ``. Voir `PR présentant ce changement <https://github.com/ros2/rviz/pull/387>`_ pour plus de détails.

source: Known Issues
fr: Problèmes connus

source: `[ros2/rclcpp#715] <https://github.com/ros2/rclcpp/issues/715>`_ There is an inconsistency in the way that parameter YAML files are loaded between standalone ROS 2 nodes and composed ROS 2 nodes. Currently available workarounds are noted in an `issue comment <https://github.com/ros2/rclcpp/issues/715#issuecomment-497392626>`_
fr: `[ros2/rclcpp#715] <https://github.com/ros2/rclcpp/issues/715>`_ Il existe une incohérence dans la manière dont les fichiers YAML de paramètres sont chargés entre les nœuds ROS 2 autonomes et les nœuds ROS 2 composés . Les solutions de contournement actuellement disponibles sont notées dans un `commentaire de problème <https://github.com/ros2/rclcpp/issues/715#issuecomment-497392626>`_

source: `[ros2/rclpy#360] <https://github.com/ros2/rclpy/issues/360>`_ rclpy nodes ignore ``ctrl-c`` when using OpenSplice on Windows.
fr: `[ros2/rclpy#360] <https://github.com/ros2/rclpy/issues/360>`_ les nœuds rclpy ignorent ``ctrl-c`` lors de l'utilisation d'OpenSplice sous Windows.

source: `[ros2/rosidl_typesupport_opensplice#30] <https://github.com/ros2/rosidl_typesupport_opensplice/issues/30>`_ There is a bug preventing nesting a message inside of a service or action definition with the same name when using OpenSplice.
fr: `[ros2/rosidl_typesupport_opensplice#30] <https://github.com/ros2/rosidl_typesupport_opensplice/issues/30>`_ Un bogue empêche l'imbrication d'un message dans une définition de service ou d'action portant le même nom lors de l'utilisation d'OpenSplice.

source: `[ros2/rclcpp#781] <https://github.com/ros2/rclcpp/pull/781>`_ Calling ``get_parameter``/``list_parameter`` from within ``on_set_parameter_callback`` causes a deadlock on Dashing. This is fixed for Eloquent, but is an ABI break so has not been backported to Dashing.
fr: `[ros2/rclcpp#781] <https://github.com/ros2/rclcpp/pull/781>`_ Appeler ``get_parameter``/``list_parameter`` depuis ``on_set_parameter_callback`` provoque un blocage sur Fringant. Ceci est corrigé pour Eloquent, mais il s'agit d'une rupture ABI et n'a donc pas été rétroporté vers Dashing.

source: `[ros2/rclcpp#912] <https://github.com/ros2/rclcpp/issues/912>`_ Inter-process communication forces a message copy when intra-process communication takes place between an ``std::unique_ptr`` publisher and a single ``std::unique_ptr`` subscription (published ``std::unique_ptr`` is internally being promoted to an ``std::shared_ptr``).
fr: `[ros2/rclcpp#912] <https://github.com/ros2/rclcpp/issues/912>`_ La communication inter-processus force une copie de message lorsqu'une communication intra-processus a lieu entre un ``std::unique_ptr `` éditeur et un seul abonnement ``std::unique_ptr`` (le ``std::unique_ptr`` publié est promu en interne vers un ``std::shared_ptr``).

source: `[ros2/rosbag2#125] <https://github.com/ros2/rosbag2/issues/125>`_ Topics with unreliable QOS are not recorded.
fr: `[ros2/rosbag2#125] <https://github.com/ros2/rosbag2/issues/125>`_ Les sujets avec un QOS non fiable ne sont pas enregistrés.

source: `[ros2/rclcpp#715] <https://github.com/ros2/rclcpp/issues/715>`_ Composable nodes cannot receive parameters via remapping. Supplying parameters to composable nodes can be accomplished using the methods described in `[this comment] <https://github.com/ros2/rclcpp/issues/715#issuecomment-497392626>`_.
fr: `[ros2/rclcpp#715] <https://github.com/ros2/rclcpp/issues/715>`_ Les nœuds composables ne peuvent pas recevoir de paramètres via le remappage. La fourniture de paramètres aux nœuds composables peut être effectuée à l'aide des méthodes décrites dans `[ce commentaire] <https://github.com/ros2/rclcpp/issues/715#issuecomment-497392626>`_.

source: `[ros2/rclcpp#893] <https://github.com/ros2/rclcpp/issues/893>`_ ``rclcpp::Context`` is not destroyed because of a reference cycle with ``rclcpp::GraphListener``. This causes a memory leak. A fix has not been backported because of the risk of breaking ABI.
fr: `[ros2/rclcpp#893] <https://github.com/ros2/rclcpp/issues/893>`_ ``rclcpp::Context`` n'est pas détruit à cause d'un cycle de référence avec ``rclcpp::GraphListener ``. Cela provoque une fuite de mémoire. Un correctif n'a pas été rétroporté en raison du risque de casser l'ABI.

source: Timeline before the release
fr: Chronologie avant la sortie

source: A few milestones leading up to the release:
fr: Quelques étapes menant à la sortie :

source: First releases of core packages available. Testing can happen from now on (some features might not have landed yet).
fr: Premières versions des packages de base disponibles. Les tests peuvent avoir lieu à partir de maintenant (certaines fonctionnalités n'ont peut-être pas encore été ajoutées).

source: Thu. May 2nd
fr: avec. peut et

source: API freeze for core packages
fr: Gel de l'API pour les packages de base

source: Mon. May 6th (beta)
fr: Lun. 6 mai (bêta)

source: Updated releases of core packages available. Additional testing of the latest features.
fr: Versions mises à jour des packages de base disponibles. Tests supplémentaires des dernières fonctionnalités.

source: Thu. May 16th
fr: Jeu. 16 mai

source: Feature freeze. Only bug fix releases should be made after this point. New packages can be released independently.
fr: Gel des fonctionnalités. Seules les versions de correctifs de bogues doivent être effectuées après ce point. De nouveaux packages peuvent être publiés indépendamment.

source: Mon. May 20th (release candidate)
fr: Lun. 20 mai (release candidate)

source: Updated releases of core packages available.
fr: Versions mises à jour des packages de base disponibles.

source: Wed. May 29th
fr: Épouser. 29 mai

source: Freeze rosdistro. No PRs for Dashing on the `rosdistro` repo will be merged (reopens after the release announcement).
fr: Geler rosdistro. Aucun PR pour Dashing sur le repo `rosdistro` ne sera fusionné (réouverture après l'annonce de la sortie).
