Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Releases/Release-Humble-Hawksbill.po
Languages: fr

source: Table of Contents
fr: Table des matières

source: *Humble Hawksbill* is the eighth release of ROS 2. What follows is highlights of the important changes and features in Humble Hawksbill since the last release. For a list of all of the changes since Galactic, see the `long form changelog <Humble-Hawksbill-Complete-Changelog>`.
fr: *Humble Hawksbill* est la huitième version de ROS 2. Ce qui suit présente les points saillants des modifications et fonctionnalités importantes apportées à Humble Hawksbill depuis la dernière version. Pour une liste de tous les changements depuis Galactic, consultez le `long form changelog <Humble-Hawksbill-Complete-Changelog>`.

source: Supported Platforms
fr: Plates-formes prises en charge

source: Humble Hawksbill is primarily supported on the following platforms:
fr: Humble Hawksbill est principalement pris en charge sur les plates-formes suivantes :

source: Tier 1 platforms:
fr: Plateformes de niveau 1 :

source: Ubuntu 22.04 (Jammy): ``amd64`` and ``arm64``
fr: Ubuntu 22.04 (Jammy) : ``amd64`` et ``arm64``

source: Tier 2 platforms:
fr: Plateformes de niveau 2 :

source: Tier 3 platforms:
fr: Plateformes de niveau 3 :

source: For more information about RMW implementations, compiler / interpreter versions, and system dependency versions see `REP 2000 <https://www.ros.org/reps/rep-2000.html>`__.
fr: Pour plus d'informations sur les implémentations RMW, les versions du compilateur/interpréteur et les versions des dépendances système, consultez `REP 2000 <https://www.ros.org/reps/rep-2000.html>`__.

source: `Install Humble Hawksbill <../../humble/Installation.html>`__
fr: `Installer Humble Hawksbill <../../humble/Installation.html>`__

source: New features in this ROS 2 release
fr: Nouvelles fonctionnalités de cette version de ROS 2

source: Changes in Patch Release 1 (2022-11-23)
fr: Changements dans la version 1 du correctif (2022-11-23)

source: ``now`` as keyword for ``builtin_interfaces.msg.Time`` and ``auto`` for ``std_msgs.msg.Header``
fr: ``now`` comme mot clé pour ``builtin_interfaces.msg.Time`` et ``auto`` pour ``std_msgs.msg.Header``

source: ``ros2 topic pub`` now allows to set a ``builtin_interfaces.msg.Time`` message to the current time via the ``now`` keyword. Similarly, a ``std_msg.msg.Header`` message will be automatically generated when passed the keyword ``auto``. This behavior matches that of ROS 1's ``rostopic`` (http://wiki.ros.org/ROS/YAMLCommandLine#Headers.2Ftimestamps)
fr: ``ros2 topic pub`` permet maintenant de définir un message ``builtin_interfaces.msg.Time`` à l'heure actuelle via le mot-clé ``now``. De même, un message ``std_msg.msg.Header`` sera généré automatiquement lors du passage du mot-clé ``auto``. Ce comportement correspond à celui de ``rostopic`` de ROS 1 (http://wiki.ros.org/ROS/YAMLCommandLine#Headers.2Ftimestamps)

source: Related PR: `ros2/ros2cli#751 <https://github.com/ros2/ros2cli/pull/751>`_
fr: PR associé : `ros2/ros2cli#751 <https://github.com/ros2/ros2cli/pull/751>`_

source: Changes since the Galactic release
fr: Changements depuis la sortie de Galactic

source: Generating a C/C++ header with version info
fr: Génération d'un en-tête C/C++ avec les informations de version

source: A new CMake function to generate a header with the package version info was added to the ``ament_cmake_gen_version_h`` in `ament/ament_cmake#377 <https://github.com/ament/ament_cmake/pull/377>`__. Here's the simplest use case:
fr: Une nouvelle fonction CMake pour générer un en-tête avec les informations de version du package a été ajoutée à ``ament_cmake_gen_version_h`` dans `ament/ament_cmake#377 <https://github.com/ament/ament_cmake/pull/377>`__. Voici le cas d'utilisation le plus simple :

source: It will generate a header with version info from the ``package.xml`` and make it available to targets that link against the ``my_lib`` library.
fr: Il générera un en-tête avec les informations de version du ``package.xml`` et le rendra disponible pour les cibles liées à la bibliothèque ``my_lib``.

source: How to include the header:
fr: Comment inclure l'en-tête :

source: Where the header is installed to:
fr: Où l'en-tête est installé pour :

source: launch
fr: lancement

source: Scoping environment variables in group actions
fr: Étendue des variables d'environnement dans les actions de groupe

source: Similar to launch configurations, now by default, the state of environment variables are scoped to group actions.
fr: Semblable aux configurations de lancement, désormais par défaut, l'état des variables d'environnement est limité aux actions de groupe.

source: For example, in the following launch files the executed processe will echo the value ``1`` (before Humble it would echo ``2``):
fr: Par exemple, dans les fichiers de lancement suivants, le processus exécuté renverra la valeur ``1`` (avant Humble, il renverrait ``2``):

source: If you would like disable scoping for launch configurations and and environment variables you can set the ``scoped`` argument (or attribute) to false.
fr: Si vous souhaitez désactiver la portée pour les configurations de lancement et les variables d'environnement, vous pouvez définir l'argument (ou l'attribut) ``scoped`` sur false.

source: Related PR: `ros2/launch#601 <https://github.com/ros2/launch/pull/601>`_
fr: Relations publiques associées : `ros2/launch#601 <https://github.com/ros2/launch/pull/601>`_

source: We've added a new package, ``launch_pytest``, that acts as an alternative to ``launch_testing``. ``launch_pytest`` is a simple pytest plugin that provides pytest fixtures to manage the lifetime of a launch service.
fr: Nous avons ajouté un nouveau paquet, ``launch_pytest``, qui agit comme une alternative à ``launch_testing``. ``launch_pytest`` est un plugin pytest simple qui fournit des montages pytest pour gérer la durée de vie d'un service de lancement.

source: Check out the `package README for details and examples. <https://github.com/ros2/launch/tree/humble/launch_pytest>`_
fr: Consultez le `package README pour plus de détails et des exemples. <https://github.com/ros2/launch/tree/humble/launch_pytest>`_

source: Related PR: `ros2/launch#528 <https://github.com/ros2/launch/pull/528>`_
fr: Relations publiques associées : `ros2/launch#528 <https://github.com/ros2/launch/pull/528>`_

source: Allow matching target actions with a callable
fr: Autoriser les actions cibles correspondantes avec un callable

source: Event handlers that take a target action object to match can now also take a callable instead to do the matching.
fr: Les gestionnaires d'événements qui prennent un objet d'action cible pour correspondre peuvent désormais également prendre un callable à la place pour faire la correspondance.

source: Related PR: `ros2/launch#540 <https://github.com/ros2/launch/pull/540>`_
fr: Relations publiques associées : `ros2/launch#540 <https://github.com/ros2/launch/pull/540>`_

source: Access to math module when evaluating Python expressions
fr: Accès au module mathématique lors de l'évaluation d'expressions Python

source: Inside ``PythonExpression`` substitutions (``eval``) we can now use symbols from Python's math module. For example,
fr: Dans les substitutions ``PythonExpression`` (``eval``), nous pouvons maintenant utiliser des symboles du module mathématique de Python. Par exemple,

source: Related PR: `ros2/launch#557 <https://github.com/ros2/launch/pull/557>`_
fr: Relations publiques associées : `ros2/launch#557 <https://github.com/ros2/launch/pull/557>`_

source: Boolean substitutions
fr: Substitutions booléennes

source: New substitutions ``NotSubstitution``, ``AndSubstitution``, and ``OrSubstitution`` provide a convenient way to perform logical operations, for example
fr: Les nouvelles substitutions ``NotSubstitution``, ``AndSubstitution`` et ``OrSubstitution`` offrent un moyen pratique d'effectuer des opérations logiques, par exemple

source: Related PR: `ros2/launch#598 <https://github.com/ros2/launch/pull/598>`_
fr: Relations publiques associées : `ros2/launch#598 <https://github.com/ros2/launch/pull/598>`_

source: New actions
fr: Nouvelles actions

source: ``AppendEnvironmentVariable`` appends a value to an existing environment variable.
fr: ``Append Environment Variable`` ajoute une valeur à une variable d'environnement existante.

source: Related PR: `ros2/launch#543 <https://github.com/ros2/launch/pull/543>`_
fr: Relations publiques associées : `ros2/launch#543 <https://github.com/ros2/launch/pull/543>`_

source: ``ResetLaunchConfigurations`` resets any configuration applied to the launch configuration.
fr: ``ResetLaunchConfigurations`` réinitialise toute configuration appliquée à la configuration de lancement.

source: Related PR: `ros2/launch#515 <https://github.com/ros2/launch/pull/515>`_
fr: Relations publiques associées : `ros2/launch#515 <https://github.com/ros2/launch/pull/515>`_

source: launch_ros
fr: lancement_ros

source: Passing ROS arguments to node actions
fr: Passer des arguments ROS aux actions de nœud

source: It is now possible to provide `ROS-specific node arguments <../../How-To-Guides/Node-arguments>` directly, without needing to use ``args`` with a leading ``--ros-args`` flag:
fr: Il est maintenant possible de fournir des `arguments de nœud spécifiques à ROS <../../How-To-Guides/Node-arguments>` directement, sans avoir besoin d'utiliser ``args`` avec un ``--ros- drapeau args`` :

source: The corresponding parameter for the ``Node`` action in Python launch files is ``ros_arguments``:
fr: Le paramètre correspondant pour l'action ``Node`` dans les fichiers de lancement Python est ``ros_arguments`` :

source: Related PRs: `ros2/launch_ros#249 <https://github.com/ros2/launch_ros/pull/249>`_ and `ros2/launch_ros#253 <https://github.com/ros2/launch_ros/pull/253>`_.
fr: Relations publiques associées : `ros2/launch_ros#249 <https://github.com/ros2/launch_ros/pull/249>`_ et `ros2/launch_ros#253 <https://github.com/ros2/launch_ros/pull/ 253>`_.

source: Frontend support for composable nodes
fr: Prise en charge frontale des nœuds composables

source: We can now start node containers and load components into them from frontend launch files, for example:
fr: Nous pouvons maintenant démarrer des conteneurs de nœuds et y charger des composants à partir de fichiers de lancement frontaux, par exemple :

source: Related PR: `ros2/launch_ros#235 <https://github.com/ros2/launch_ros/pull/235>`_
fr: PR associé : `ros2/launch_ros#235 <https://github.com/ros2/launch_ros/pull/235>`_

source: Parameter substitution
fr: Substitution de paramètres

source: The new ``ParameterSubstitution`` lets you substitute the value of a parameter set previously in launch with the ``SetParameter`` action. For example,
fr: Le nouveau ``ParameterSubstitution`` vous permet de substituer la valeur d'un paramètre défini précédemment au lancement avec l'action ``SetParameter``. Par exemple,

source: Related PR: `ros2/launch_ros#297 <https://github.com/ros2/launch_ros/pull/297>`_
fr: PR associé : `ros2/launch_ros#297 <https://github.com/ros2/launch_ros/pull/297>`_

source: ``RosTimer`` acts like the launch ``TimerAction``, but uses a ROS clock (so it can use simulation time, for example).
fr: ``RosTimer`` agit comme le lancement ``TimerAction``, mais utilise une horloge ROS (il peut donc utiliser le temps de simulation, par exemple).

source: Related PRs: `ros2/launch_ros#244 <https://github.com/ros2/launch_ros/pull/244>`_ and `ros2/launch_ros#264 <https://github.com/ros2/launch_ros/pull/264>`_
fr: PR associés : `ros2/launch_ros#244 <https://github.com/ros2/launch_ros/pull/244>`_ et `ros2/launch_ros#264 <https://github.com/ros2/launch_ros/pull/ 264>`_

source: ``SetParametersFromFile`` passes a ROS parameters file to all nodes in a launch file (including node components).
fr: ``SetParametersFromFile`` transmet un fichier de paramètres ROS à tous les nœuds d'un fichier de lancement (y compris les composants de nœud).

source: Related PRs: `ros2/launch_ros#260 <https://github.com/ros2/launch_ros/pull/260>`_ and `ros2/launch_ros#281 <https://github.com/ros2/launch_ros/pull/281>`_
fr: Relations publiques associées : `ros2/launch_ros#260 <https://github.com/ros2/launch_ros/pull/260>`_ et `ros2/launch_ros#281 <https://github.com/ros2/launch_ros/pull/ 281>`_

source: SROS2 Security enclaves now support Certificate Revocation Lists
fr: Les enclaves de sécurité SROS2 prennent désormais en charge les listes de révocation de certificats

source: Certificate Revocation Lists (CRLs) are a concept where particular certificates can be revoked before their expiration. As of Humble, it is now possible to put a CRL in an SROS2 security enclave and have it be honored. See `the SROS2 tutorials <https://github.com/ros2/sros2/blob/humble/SROS2_Linux.md#certificate-revocation-lists>`__ for an example of how to use it.
fr: Les listes de révocation de certificats (CRL) sont un concept dans lequel des certificats particuliers peuvent être révoqués avant leur expiration. Depuis Humble, il est désormais possible de mettre une CRL dans une enclave de sécurité SROS2 et de la faire honorer. Voir `les tutoriels SROS2 <https://github.com/ros2/sros2/blob/humble/SROS2_Linux.md#certificate-revocation-lists>`__ pour un exemple d'utilisation.

source: Content Filtered Topics
fr: Sujets filtrés par contenu

source: Content Filtered Topics supports a more sophisticated subscription that indicates the subscriber does not want to necessarily see all values of each instance published under the Topic. Content Filtered Topics can be used to request content-based subscriptions when underlying RMW implementation supports this feature.
fr: Les sujets à contenu filtré prennent en charge un abonnement plus sophistiqué qui indique que l'abonné ne souhaite pas nécessairement voir toutes les valeurs de chaque instance publiée sous le sujet. Les rubriques à contenu filtré peuvent être utilisées pour demander des abonnements basés sur le contenu lorsque l'implémentation RMW sous-jacente prend en charge cette fonctionnalité.

source: RMW Content Filtered Topics support
fr: Prise en charge des sujets filtrés par contenu RMW

source: supported
fr: prise en charge

source: not supported
fr: non supporté

source: To learn more, see the `content_filtering <https://github.com/ros2/examples/blob/humble/rclcpp/topics/minimal_subscriber/content_filtering.cpp>`_ examples.
fr: Pour en savoir plus, consultez les exemples de `content_filtering <https://github.com/ros2/examples/blob/humble/rclcpp/topics/minimal_subscriber/content_filtering.cpp>`_.

source: Related design PR: `ros2/design#282 <https://github.com/ros2/design/pull/282>`_.
fr: PR de conception connexe : `ros2/design#282 <https://github.com/ros2/design/pull/282>`_.

source: ros2cli
fr: Votre gagne-pain

source: ``ros2 launch`` has a ``--launch-prefix`` argument
fr: ``ros2 launch`` a un argument ``--launch-prefix``

source: This allows passing a prefix to all executables in a launch file, which is useful in many debugging situations. See the associated `pull request <https://github.com/ros2/launch_ros/pull/254>`__, as well as the :ref:`tutorial <launch-prefix-example>` for more information.
fr: Cela permet de passer un préfixe à tous les exécutables d'un fichier de lancement, ce qui est utile dans de nombreuses situations de débogage. Voir la `demande d'extraction associée <https://github.com/ros2/launch_ros/pull/254>`__, ainsi que le :ref:`tutoriel <launch-prefix-example>` pour plus d'informations.

source: Relatedly, the ``--launch-prefix-filter`` command-line option was added to selectively add the prefix from ``--launch-prefix`` to executables. See the `pull request <https://github.com/ros2/launch_ros/pull/261>`__ for more information.
fr: De même, l'option de ligne de commande ``--launch-prefix-filter`` a été ajoutée pour ajouter sélectivement le préfixe de ``--launch-prefix`` aux exécutables. Voir la `demande d'extraction <https://github.com/ros2/launch_ros/pull/261>`__ pour plus d'informations.

source: ``ros2 topic echo`` has a ``--flow-style`` argument
fr: ``ros2 topic echo`` a un argument ``--flow-style``

source: This allows the user to force ``flow style`` for the YAML representation of data on a topic. Without this option, the output from ``ros2 topic echo /tf_static`` could look something like:
fr: Cela permet à l'utilisateur de forcer le ``style de flux`` pour la représentation YAML des données sur un sujet. Sans cette option, la sortie de ``ros2 topic echo /tf_static`` pourrait ressembler à :

source: With this option, the output would look something like:
fr: Avec cette option, la sortie ressemblerait à :

source: See the `PyYAML documentation <https://pyyaml.docsforge.com/master/documentation/#dictionaries-without-nested-collections-are-not-dumped-correctly>`__ for more information.
fr: Voir la `documentation PyYAML <https://pyyaml.docsforge.com/master/documentation/#dictionaries-without-nested-collections-are-not-dumped-correctly>`__ pour plus d'informations.

source: ``ros2 topic echo`` can filter data based on message contents
fr: ``ros2 topic echo`` peut filtrer les données en fonction du contenu du message

source: This allows the user to only print out data on a topic that matches a certain Python expression. For instance, using the following argument will only print out string messages that start with 'foo':
fr: Cela permet à l'utilisateur d'imprimer uniquement des données sur un sujet qui correspond à une certaine expression Python. Par exemple, l'utilisation de l'argument suivant n'affichera que les messages de chaîne commençant par "foo" :

source: See the `pull request <https://github.com/ros2/ros2cli/pull/654>`__ for more information.
fr: Voir la `demande d'extraction <https://github.com/ros2/ros2cli/pull/654>`__ pour plus d'informations.

source: rviz2
fr: Réviser

source: Apply textures to arbitrary triangle lists
fr: Appliquer des textures à des listes de triangles arbitraires

source: We've added `the ability to apply textures defined via URI to arbitrary triangle lists using UV Coordinates <https://github.com/ros2/rviz/pull/719>`__. Now we can create a gradient pull from a texture map instead of the default grayscale. This will enable complex coloring of markers. To use this, you should use the ``visualization_msgs/Marker.msg`` and fill the ``texture_resource``, ``texture``, ``uv_coordinates`` and ``mesh_file`` fields. You can find more information `here <https://github.com/ros2/common_interfaces/pull/153>`__.
fr: Nous avons ajouté `la possibilité d'appliquer des textures définies via l'URI à des listes de triangles arbitraires à l'aide de coordonnées UV <https://github.com/ros2/rviz/pull/719>`__. Nous pouvons maintenant créer un dégradé à partir d'une carte de texture au lieu de l'échelle de gris par défaut. Cela permettra une coloration complexe des marqueurs. Pour l'utiliser, vous devez utiliser le ``visualization_msgs/Marker.msg`` et remplir les champs ``texture_resource``, ``texture``, ``uv_coordinates`` et ``mesh_file``. Vous pouvez trouver plus d'informations `ici <https://github.com/ros2/common_interfaces/pull/153>`__.

source: Visualization of mass properties (including inertia)
fr: Visualisation des propriétés de masse (y compris l'inertie)

source: We also added the ability to visualize inertias. To do this, you select enable 'Inertia' in the 'Mass Properties' under the robot model:
fr: Nous avons également ajouté la possibilité de visualiser les inerties. Pour ce faire, vous sélectionnez activer 'Inertia' dans les 'Mass Properties' sous le modèle de robot :

source: You can see an image of an inertia below.
fr: Vous pouvez voir une image d'une inertie ci-dessous.

source: Visualize YUV images in RViz
fr: Visualisez les images YUV dans RViz

source: It is now possible to directly visualize YUV images inside of RViz, rather than having to convert to RGB first. See `ros2/rviz#701 <https://github.com/ros2/rviz/pull/701>`__ for details.
fr: Il est maintenant possible de visualiser directement les images YUV à l'intérieur de RViz, plutôt que de devoir d'abord convertir en RVB. Voir `ros2/rviz#701 <https://github.com/ros2/rviz/pull/701>`__ pour plus de détails.

source: Allow rendering of objects > 100 meters
fr: Autoriser le rendu d'objets > 100 mètres

source: By default, RViz only renders objects that are within 100 meters of a camera. A new configuration property called "Far Plane Distance" in the rviz camera plugin allows that rendering distance to be configured.
fr: Par défaut, RViz n'affiche que les objets situés à moins de 100 mètres d'une caméra. Une nouvelle propriété de configuration appelée "Far Plane Distance" dans le plug-in de caméra rviz permet de configurer cette distance de rendu.

source: See `ros2/rviz#849 <https://github.com/ros2/rviz/pull/849>`__ for more information.
fr: Voir `ros2/rviz#849 <https://github.com/ros2/rviz/pull/849>`__ pour plus d'informations.

source: common_interfaces
fr: interfaces_communes

source: Support Textures and Embedded Meshes for Marker Messages
fr: Prise en charge des textures et des maillages intégrés pour les messages de marqueur

source: These two additions will improve the ability to both visualize data in new ways with standard messages and, simultaneously, enable the ability to track this data in rosbag.
fr: Ces deux ajouts amélioreront la capacité de visualiser les données de nouvelles façons avec des messages standard et, simultanément, permettront de suivre ces données dans rosbag.

source: **Textures** bring the addition of three new fields to markers:
fr: Les **textures** apportent l'ajout de trois nouveaux champs aux marqueurs :

source: RViz will fully support texture rendering through the embedded format.
fr: RViz prendra entièrement en charge le rendu de texture via le format intégré.

source: To those familiar with ``mesh_resource``, ``resource_retriever`` should be familiar. This will allow the programmer to choose where they want to load data from, either a local file or a networked file. In the interest of being able to record all data in a rosbag, the ability to embed the texture image is included.
fr: Pour ceux qui connaissent ``mesh_resource``, ``resource_retriever`` devrait être familier. Cela permettra au programmeur de choisir d'où il souhaite charger les données, soit un fichier local, soit un fichier en réseau. Afin de pouvoir enregistrer toutes les données dans un rosbag, la possibilité d'intégrer l'image de texture est incluse.

source: **Meshes** were modified in a similar way to add the ability to embed a raw Mesh file for the purpose of recording and are modified in a similar way. The Meshfile message has two fields:
fr: **Les maillages** ont été modifiés de la même manière pour ajouter la possibilité d'intégrer un fichier de maillage brut à des fins d'enregistrement et sont modifiés de la même manière. Le message Meshfile comporte deux champs :

source: The embedded ``Meshfile`` message is not yet supported in implementation.
fr: Le message intégré ``Meshfile`` n'est pas encore pris en charge dans l'implémentation.

source: Related PRs: `ros2/common_interfaces#153 <https://github.com/ros2/common_interfaces/pull/153>`_ `ros2/rviz#719 <https://github.com/ros2/rviz/pull/719>`_
fr: PR associés : `ros2/common_interfaces#153 <https://github.com/ros2/common_interfaces/pull/153>`_ `ros2/rviz#719 <https://github.com/ros2/rviz/pull/719 >`_

source: Added ``PRISM`` type to SolidPrimitive
fr: Ajout du type ``PRISM`` à SolidPrimitive
