Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Releases/Release-Galactic-Geochelone.po
Languages: fr

source: The lifecycle state machine in rcl_lifecycle was modified to expect a newly introduced options struct, combining general configurations for the state machine. The option struct allows to indicate whether the state machine shall be initialized with default values, whether its attached services are active and which allocator to be used.
fr: La machine d'état du cycle de vie dans rcl_lifecycle a été modifiée pour attendre une structure d'options nouvellement introduite, combinant des configurations générales pour la machine d'état. La structure d'option permet d'indiquer si la machine d'état doit être initialisée avec des valeurs par défaut, si ses services attachés sont actifs et quel allocateur utiliser.

source: RCL's lifecycle state machine stores allocator instance
fr: La machine d'état du cycle de vie de RCL stocke l'instance d'allocateur

source: The options struct (discussed above) entails an instance of the allocator being used for initializing the state machine. This options struct and there the embodied allocator are being stored within the lifecycle state machine. As a direct consequence, the ``rcl_lifecycle_fini function`` no longer expects an allocator in its fini function but rather uses the allocator set in the options struct for deallocating its internal data structures.
fr: La structure d'options (discutée ci-dessus) implique qu'une instance de l'allocateur est utilisée pour initialiser la machine d'état. Cette structure d'options et l'allocateur incorporé sont stockés dans la machine d'état du cycle de vie. En conséquence directe, la ``fonction rcl_lifecycle_fini`` n'attend plus d'allocateur dans sa fonction fini mais utilise plutôt l'allocateur défini dans la structure d'options pour désallouer ses structures de données internes.

source: RCLCPP's lifecycle node exposes option to not instantiate services
fr: Le nœud de cycle de vie du RCLCPP expose l'option de ne pas instancier les services

source: In order to use rclcpp's lifecycle nodes without exposing its internal services such as ``change_state``, ``get_state`` et. al., the constructor of a lifecycle node has a newly introduced parameter indicating whether or not the services shall be available. This boolean flag is set to true by default, not requiring any changes to existing API if not wished.
fr: Afin d'utiliser les nœuds du cycle de vie de rclcpp sans exposer ses services internes tels que ``change_state``, ``get_state`` et. Al., le constructeur d'un nœud de cycle de vie a un paramètre nouvellement introduit indiquant si les services doivent être disponibles ou non. Cet indicateur booléen est défini sur vrai par défaut, ne nécessitant aucune modification de l'API existante si cela n'est pas souhaité.

source: Related PRs: `ros2/rcl#882 <https://github.com/ros2/rcl/pull/882>`_ and `ros2/rclcpp#1507 <https://github.com/ros2/rclcpp/pull/1507>`_
fr: PR associés : `ros2/rcl#882 <https://github.com/ros2/rcl/pull/882>`_ et `ros2/rclcpp#1507 <https://github.com/ros2/rclcpp/pull/ 1507>`_

source: Recording - Split by time
fr: Enregistrement - Fractionné par le temps

source: Known Issues
fr: Problèmes connus

source: ros2cli
fr: Votre gagne-pain

source: Daemon slows down CLI on Windows
fr: Daemon ralentit la CLI sous Windows

source: As a workaround, CLI commands may be used without a daemon e.g.:
fr: Pour contourner ce problème, les commandes CLI peuvent être utilisées sans démon, par exemple :

source: Issue is tracked by `ros2/ros2cli#637 <https://github.com/ros2/ros2cli/issues/637>`_.
fr: Le problème est suivi par `ros2/ros2cli#637 <https://github.com/ros2/ros2cli/issues/637>`_.

source: rqt
fr: ryat

source: Some rqt_bag icons are missing
fr: Certaines icônes rqt_bag sont manquantes

source: The icons to "Zoom In", "Zoom Out", "Zoom Home", and "Toggle Thumbnails" are missing in ``rqt_bag``. The issue is tracked in `ros-visualization/rqt_bag#102 <https://github.com/ros-visualization/rqt_bag/issues/102>`_
fr: Les icônes "Zoom In", "Zoom Out", "Zoom Home" et "Toggle Thumbnails" manquent dans ``rqt_bag``. Le problème est suivi dans `ros-visualization/rqt_bag#102 <https://github.com/ros-visualization/rqt_bag/issues/102>`_

source: Most rqt utilities don't work standalone on Windows
fr: La plupart des utilitaires rqt ne fonctionnent pas de manière autonome sous Windows

source: Launching the rqt utilities "standalone" on Windows (like ``ros2 run rqt_graph rqt_graph``) generally doesn't work. The workaround is to launch the rqt container process (``rqt``), and then insert the plugins to be used.
fr: Lancer les utilitaires rqt "standalone" sous Windows (comme ``ros2 run rqt_graph rqt_graph``) ne fonctionne généralement pas. La solution consiste à lancer le processus de conteneur rqt (``rqt``), puis à insérer les plugins à utiliser.

source: rviz2
fr: Réviser

source: RViz2 panel close buttons are blank
fr: Les boutons de fermeture du panneau RViz2 sont vides

source: The upper right-hand corner of every RViz2 panel should contain an "X" to allow one to close the panel. Those buttons are there, but the "X" inside of them is missing on all platforms. The issue is being tracked in `ros2/rviz2#692 <https://github.com/ros2/rviz/issues/692>`__.
fr: Le coin supérieur droit de chaque panneau RViz2 doit contenir un "X" pour permettre de fermer le panneau. Ces boutons sont là, mais le "X" à l'intérieur d'eux manque sur toutes les plateformes. Le problème est suivi dans `ros2/rviz2#692 <https://github.com/ros2/rviz/issues/692>`__.

source: Timeline before the release
fr: Chronologie avant la sortie

source: Preliminary testing and stabilization of ROS Core [1]_ packages.
fr: Tests préliminaires et stabilisation des packages ROS Core [1]_.

source: Mon. April 5, 2021 - Freeze
fr: Lun. 5 avril 2021 - Gel

source: API and feature freeze for ROS Core [1]_ packages in Rolling Ridley. Note that this includes ``rmw``, which is a recursive dependency of ``ros_core``. Only bug fix releases should be made after this point. New packages can be released independently.
fr: API et gel des fonctionnalités pour les packages ROS Core [1]_ dans Rolling Ridley. Notez que cela inclut ``rmw``, qui est une dépendance récursive de ``ros_core``. Seules les versions de correctifs de bogues doivent être effectuées après ce point. De nouveaux packages peuvent être publiés indépendamment.

source: Branch from Rolling Ridley. ``rosdistro`` is reopened for Rolling PRs for ROS Core [1]_ packages. Galactic development shifts from ``ros-rolling-*`` packages to ``ros-galactic-*`` packages.
fr: Succursale de Rolling Ridley. ``rosdistro`` est rouvert pour Rolling PRs pour les packages ROS Core [1]_. Le développement galactique passe des packages ``ros-rolling-*`` aux packages ``ros-galactic-*``.

source: Updated releases of ROS Desktop [2]_ packages available. Call for general testing.
fr: Versions mises à jour des packages ROS Desktop [2]_ disponibles. Appel pour des tests généraux.

source: Release Candidate packages are built.
fr: Les packages Release Candidate sont créés.

source: Updated releases of ROS Desktop [2]_ packages available.
fr: Versions mises à jour des packages ROS Desktop [2]_ disponibles.

source: Thu. May 20, 2021 - Distro Freeze
fr: Jeu. 20 mai 2021 - Distro Freeze

source: Freeze rosdistro. No PRs for Galactic on the ``rosdistro`` repo will be merged (reopens after the release announcement).
fr: Geler rosdistro. Aucun PR pour Galactic sur le repo ``rosdistro`` ne sera fusionné (réouverture après l'annonce de la sortie).

source: Sun. May 23, 2021 - General Availability
fr: Soleil. 23 mai 2021 - Disponibilité générale

source: Release announcement.
fr: Annonce de sortie.

source: ``rosdistro`` is reopened for Galactic PRs.
fr: ``rosdistro`` est rouvert pour les relations publiques galactiques.

source: The ``ros_core`` variant is described in `REP 2001 (ros-core) <https://www.ros.org/reps/rep-2001.html#ros-core>`_.
fr: La variante ``ros_core`` est décrite dans `REP 2001 (ros-core) <https://www.ros.org/reps/rep-2001.html#ros-core>`_.

source: The ``desktop`` variant is described in `REP 2001 (desktop-variants) <https://www.ros.org/reps/rep-2001.html#desktop-variants>`_.
fr: La variante ``desktop`` est décrite dans `REP 2001 (desktop-variants) <https://www.ros.org/reps/rep-2001.html#desktop-variants>`_.
