Repository: ROS-French-Users-Group/ros2_documentation
Catalog: source/locales/*/LC_MESSAGES/Releases/Release-Rolling-Ridley.po
Languages: fr

source: Rolling Ridley (``rolling``)
fr: Rouler Ridley (``rouler``)

source: Table of Contents
fr: Table des matières

source: *Rolling Ridley* is a rolling development release of ROS 2.
fr: *Rolling Ridley* est une version de développement continu de ROS 2.

source: Rolling Ridley is continuously updated and is subject to in-place updates which will at times include breaking changes. It is used for ROS 2 development and by maintainers who want their packages released and ready for the next stable distribution. We recommend that most users of ROS 2 use the latest `stable distribution <latest_release>`.
fr: Rolling Ridley est continuellement mis à jour et fait l'objet de mises à jour sur place qui incluront parfois des changements de rupture. Il est utilisé pour le développement de ROS 2 et par les responsables qui souhaitent que leurs packages soient publiés et prêts pour la prochaine distribution stable. Nous recommandons à la plupart des utilisateurs de ROS 2 d'utiliser la dernière `distribution stable <latest_release>`.

source: For more information see `REP-2002 <https://www.ros.org/reps/rep-2002.html>`_
fr: Pour plus d'informations, voir `REP-2002 <https://www.ros.org/reps/rep-2002.html>`_

source: Currently Supported Platforms
fr: Plates-formes actuellement prises en charge

source: Rolling Ridley is currently supported on the following platforms:
fr: Rolling Ridley est actuellement pris en charge sur les plates-formes suivantes :

source: Tier 1 platforms:
fr: Plateformes de niveau 1 :

source: Ubuntu 22.04 (Jammy): ``amd64`` and ``arm64``
fr: Ubuntu 22.04 (Jammy) : ``amd64`` et ``arm64``

source: Tier 3 platforms:
fr: Plateformes de niveau 3 :

source: Debian Buster (10): ``amd64``, ``arm64`` and ``arm32``
fr: Debian Buster (10) : ``amd64``, ``arm64`` et ``arm32``

source: OpenEmbedded Thud (2.6) / webOS OSE: ``arm32`` and ``x86``
fr: OpenEmbedded Thud (2.6) / webOS OSE : ``arm32`` et ``x86``

source: `Install Rolling Ridley <../../Installation>`
fr: `Installer Rolling Ridley <../../Installation>`

source: New features and changes in this release
fr: Nouvelles fonctionnalités et modifications de cette version

source: Rolling Ridley is an ongoing development distribution. Changes between the current stable release and the upcoming one can be found on the page for the `upcoming release <upcoming-release>`.
fr: Rolling Ridley est une distribution en développement continu. Les changements entre la version stable actuelle et la prochaine peuvent être trouvés sur la page de la `version à venir <upcoming-release>`.
